{
    "creator": "FE Online",
    "title": "GST anti-profiteering fund: Here’s what Modi government is planning to do with it",
    "link": "https://www.financialexpress.com/economy/gst-anti-profiteering-fund-heres-what-government-is-planning-to-do-with-it/1207464/",
    "pubDate": "Fri, 15 Jun 2018 14:29:59 +05:30",
    "dc:creator": "FE Online",
    "content": "Centre and the 'concerned state' will equally share the amount deposited by erring businesses in the consumer welfare fund set up as part of the GST anti-profiteering rules, as per a Finance Ministry notification. ",
    "contentSnippet": "Centre and the 'concerned state' will equally share the amount deposited by erring businesses in the consumer welfare fund set up as part of the GST anti-profiteering rules, as per a Finance Ministry notification.",
    "guid": "https://www.financialexpress.com/?p=1207464",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-15T08:59:59.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "gst",
            "anti-profiteering",
            "fund",
            "here’s",
            "what",
            "modi",
            "government",
            "is",
            "planning",
            "to",
            "do",
            "with",
            "it"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "GST anti-profiteering fund: Here’s what Modi government is planning to do with it",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1206075\" src=\"https://images.financialexpress.com/2018/06/GST-3.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/GST-3.jpg 660w, https://images.financialexpress.com/2018/06/GST-3-300x200.jpg 300w, https://images.financialexpress.com/2018/06/GST-3-620x413.jpg 620w, https://images.financialexpress.com/2018/06/GST-3-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Centre and the ‘concerned state’ will equally share the amount deposited by erring businesses. (Image: PTI)</figure>\n\t\t\t</section></div><span>\n</span><p>Centre and the ‘concerned state’ will equally share the amount deposited by erring businesses in the consumer welfare fund set up as part of the GST anti-profiteering rules, as per a Finance Ministry notification. Following the rollout of GST in July last year, the government set up a national anti-profiteering authority to penalise businesses for failure to pass on tax benefits to consumers. In case the customer is not identifiable, the money has to be deposited in the consumer welfare fund.</p><span>\n</span><p>The ministry has amended Central GST rules stating that 50 per cent of the amount is to be deposited in the consumer welfare fund constituted by the Centre and the remaining to the fund set up by the ‘concerned state’.<br>As per the amendment, the ‘concerned state’ would mean the state where the anti-profiteering authority has passed its order against the business.</p><span>\n</span><p>So far, CGST rules did not clearly state on the splitting of the amount collected from erring businesses and consequently deposited in the fund. As per the structure of the anti-profiteering mechanism, complaints of local nature are first sent to the state-level screening committee while those of national level are marked for the Standing Committee.</p><span>\n</span><p>If the complaints have merit, the respective committees would refer the cases for further investigation to the Directorate General of Anti-Profiteering.&nbsp; The Directorate would generally take about three months to complete the investigation and send the report to the anti-profiteering authority.</p><span>\n</span><p>If the authority finds that a company has not passed on GST benefits, it will either direct the entity to pass on the benefits to consumers or if the beneficiary cannot be identified will ask the company to transfer the amount to the consumer welfare fund within a specified timeline.</p><span>\n</span><p>The authority also has the power to cancel registration of any entity or business if it fails to pass on to consumers the benefit of lower taxes under the GST regime, but it would probably be the last step against any violator. According to the anti-profiteering rules, the authority will suggest return of the undue profit earned from not passing on the benefits to consumers along with an 18 per cent interest as also impose penalty. In case the consumer is not identifiable, the penal amount would have to be deposited to the consumer welfare fund</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "concerned",
        "set",
        "Here",
        "anti",
        "erring"
    ],
    "verbs": [
        "state",
        "fund",
        "set",
        "part",
        "Finance",
        "will",
        "amount",
        "share",
        "Centre"
    ],
    "nouns": [
        "state",
        "consumer",
        "fund",
        "set",
        "part",
        "Finance",
        "will",
        "Ministry",
        "notification",
        "amount",
        "share",
        "planning",
        "Centre",
        "Here",
        "government",
        "welfare",
        "anti"
    ]
}