{
    "creator": "PTI",
    "title": "Vodafone India, Idea Cellular name circle heads for merged entity",
    "link": "https://www.financialexpress.com/industry/vodafone-india-idea-cellular-name-circle-heads-for-merged-entity/1199047/",
    "pubDate": "Fri, 08 Jun 2018 20:06:50 +05:30",
    "dc:creator": "PTI",
    "content": "Vodafone India and Idea Cellular have announced appointment of nine executives each from their teams as circle heads for the merged entity, which is proposed to operate as Vodafone Idea Limited, industry sources said.",
    "contentSnippet": "Vodafone India and Idea Cellular have announced appointment of nine executives each from their teams as circle heads for the merged entity, which is proposed to operate as Vodafone Idea Limited, industry sources said.",
    "guid": "https://www.financialexpress.com/?p=1199047",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-08T14:36:50.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "vodafone",
            "india",
            "idea",
            "cellular",
            "name",
            "circle",
            "heads",
            "for",
            "merged",
            "entity"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Vodafone India, Idea Cellular name circle heads for merged entity",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1199053\" src=\"https://images.financialexpress.com/2018/06/cats-550.jpg\" alt=\"Vodafone India,&nbsp;Idea Cellular,&nbsp;Jammu and Kashmir,&nbsp;Kumar Mangalam Birla,&nbsp;Idea,&nbsp;Aditya Birla Group\" srcset=\"https://images.financialexpress.com/2018/06/cats-550.jpg 660w, https://images.financialexpress.com/2018/06/cats-550-300x200.jpg 300w, https://images.financialexpress.com/2018/06/cats-550-620x413.jpg 620w, https://images.financialexpress.com/2018/06/cats-550-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The announcement is learnt to have been made by Kumar Mangalam Birla, the non-executive chairman of the proposed entity, in an internal communication to employees. (IE)</figure>\n\t\t\t</section></div><span>\n</span><p>Vodafone India and Idea Cellular have announced appointment of nine executives each from their teams as circle heads for the merged entity, which is proposed to operate as Vodafone Idea Limited, industry sources said. The announcement is learnt to have been made by Kumar Mangalam Birla, the non-executive chairman of the proposed entity, in an internal communication to employees. According to the source, from Idea team members — Rajendra Chaurasia will head Maharashtra and Goa circle, Sunil Tolani – Mumbai, Sanjay David- Odisha, Puneet Krishnan – Andhra Pradesh and Telangana.</p><span>\n</span><p>Kerala circle will be headed MD Prasad, Madhya Pradesh and Chhattisgarh by Rajesh Naik, Bihar and Jharkhand by Monishi Ghosh. Jammu and Kashmir, Punjab and Himachal Pradesh will be headed by Sudhir Pradhan, and Haryana by Sanjeev Govil, present Karnataka circle head at Idea.</p><span>\n</span><p>Vodafone India executive Arvinder Singh is proposed to take charge of Delhi cirlce , Abhijeet Kishore for Gujarat, Murali S for Tamil Nadu and Chennai, Arvind Nevatia for Karnataka, Shivan Bhargava for Kolkata and rest of Bengal, Nidhi Lauria for Assam and North East, Amit Bedi to continue as Rajasthan circle head.</p><span>\n</span><p>Vodafone’s Nipun Sharma is proposed to take charge of UP East and Ashish Chandra of UP West. Email query sent to Idea and Vodafone elicited no reply. According to the source, the designate Circle Business Leaders will coordinate with the chief operating officer designate and the Circle Head designates to plan appropriately the details and timing of their induction in the circles, where they are proposed to be appointed post merger.</p><span>\n</span><p>The Department of Telecom on Monday approved raising the foreign direct investment limit in the company to 100 per cent, putting its merger deal with Vodafone in the last leg of regulatory clearance. Vodafone will own 45.1 per cent in the combined entity, while Aditya Birla Group will have 26 per cent and Idea shareholders 28.9 per cent. The merged entity will be known as ‘Vodafone Idea Ltd’.</p><span>\n</span><p>It will be the country’s largest telecom operator with around 430 million subscribers from Day 1. Both the companies have already announced top leadership team who will run the merged entity. Kumar Mangalam Birla as the non-executive Chairman and Balesh Sharma as the new CEO of proposed firm Vodafone Idea Limited. Idea Cellular’s CFO Akshaya Moondra will head the financial operations of the new entity as its CFO.</p><span>\n</span><p>Ambrish Jain (currently the deputy MD at Idea Cellular) is set to become the new COO. The Aditya Birla Group intends to nominate Himanshu Kapania (currently Idea Cellular MD) as non-executive Board member of the merged entity with a significant assignment in the group post-merger.</p><span>\n</span><p>Sunil Sood (Vodafone India CEO) will join the Vodafone Group AMAP (Africa, Middle East and Asia Pacific) Leadership team and also help governance through Board memberships, Idea filing said. Manish Dawar, who was recently roped in as the CFO of Vodafone India, will get the overall responsibility for integration planning, governance and execution at the merged entity.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "Cellular",
        "merged",
        "announced",
        "nine",
        "Limited"
    ],
    "verbs": [
        "name",
        "circle",
        "operate"
    ]
}