{
    "title": "New MSP at RS 29/kg for sugar mills still not enough for cane arrears",
    "link": "https://www.business-standard.com/article/economy-policy/new-msp-at-rs-29-kg-for-sugar-mills-still-not-enough-for-cane-arrears-118060701569_1.html",
    "pubDate": "Fri, 08 Jun 2018 07:16:00 +0530",
    "content": "The current year is expected to end with a closing stock of 10 mt, even if mills export a million tonnes. The estimate for a year later is a possible sugar surplus of 17-18 mt",
    "contentSnippet": "The current year is expected to end with a closing stock of 10 mt, even if mills export a million tonnes. The estimate for a year later is a possible sugar surplus of 17-18 mt",
    "guid": "https://www.business-standard.com/article/economy-policy/new-msp-at-rs-29-kg-for-sugar-mills-still-not-enough-for-cane-arrears-118060701569_1.html",
    "isoDate": "2018-06-08T01:46:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "new",
            "msp",
            "at",
            "rs",
            "29kg",
            "for",
            "sugar",
            "mills",
            "still",
            "not",
            "enough",
            "for",
            "cane",
            "arrears"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "New MSP at RS 29/kg for sugar mills still not enough for cane arrears",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\t\n\t\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/sugar\" target=\"_blank\">Sugar </a>prices at the wholesale markets here crossed Rs 29 a kg after Wednesday's decision by the Union government to fix this as the legal minimum sale price (MSP) for mills.</p>\n\t<p>\n\t\tSugar-S closed at Rs 30.17 a kg, while Sugar-M at Rs 31.25 (ex-mill) in Navi Mumbai, up 13 per cent from their November 19 low, after which, reports of incentive packages to be announced pushed prices up.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\tThe Centre issued four notifications on Thursday. The new <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/msp\" target=\"_blank\">MSP </a>is to also apply to importers. It also notified mill-wise stock limits for June, similar to the earlier release mechanism, totalling 2.1 million tonnes.</p>\n\t<p>\n\t\tIndustry officials wanted a far higher MSP, as the all-India production cost is estimated around Rs 35 a kg, about 21 per cent more.</p>\n\t<p>\n\t\tThe price is also 23.5 per cent lower than the Rangarajan committee formula, based on the centrally-set <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/fair-and-remunerative-price\" target=\"_blank\">Fair and Remunerative Price </a>(FRP) for sugarcane payable by mills to <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/farmers\" target=\"_blank\">farmers.</a></p>\n\t<p>\n\t\t“Even after considering all incentives and market condition, huge arrears could remain unpaid (to cane growers), said Abinash Verma, director-general, Indian <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/sugar\" target=\"_blank\">Sugar </a>Mills Association (Isma).</p>\n\t<p>\n\t\t“The government could have increased the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/msp\" target=\"_blank\">MSP </a>for mills to Rs 35 a kg. In a surplus <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/sugar\" target=\"_blank\">sugar </a>scenario, prices would have remained capped for consumers.”</p>\n\t<p>\n\t\tCane payment arreas from mills to <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/farmers\" target=\"_blank\">farmers </a>are estimated at Rs 225-230 billion. Traders say the industry is carping. “Mills were selling sugar at Rs 23.5-24 a kg and today they sold at Rs 29.</p>\n\t<p>\n\t\tAt the industry level  this works out to a Rs 140 billion bonanza, without any extra subsidy,” said Praful Vithalani, chairman, All India Sugar Trade Association.</p>\n\t<p>\n\t\tIsma had written to the government that according to the Rangarajan formula, which proposes linking of the sugar price with cost of production, based on the cane FRP, the price should be Rs 35.8 a kg.</p>\n\t<p>\n\t\tIt says even considering a buffer stock of three million tonnes (mt) which government has announced (costing it Rs.11.75 billion) and a Rs 15.4 bn subsidy for exporting sugar, mills are not covering their cost, as the impact of these two subsidies will be around Rs 1 a kg.</p>\n\t<p>\n\t\tSources explain that under the buffer stock scheme, the government will give cost of carry to mills, which will be 12 per cent interest cost and 1.5 per cent as cost of insurance.</p>\n\t<p>\n\t\tWhat is key is to fix the sugar price on which the interest and insurance cost will be calculated.</p>\n\t<p>\n\t\tAs announced, the three mt buffer would be only a tenth of the 31.2 mt in estimated production. It will be some relief, though, as mills would have themselves had to pay that cost of storage, since market conditions are not conducive for selling more sugar.</p>\n\t<p>\n\t\tThe government had a month before announced a Rs 55 a tonne subsidy for export of sugar; the subsidy was to go directly to farmers, to clear some of their payment arrears from mills.</p>\n\t<p>\n\t\tThe total subsidy was estimated by the government at Rs 15.4 bn if the two mt as announced was actually exported.</p>\n\t<p>\n\t\tHowever, a month after, export has not taken place. For two reasons. The first is that the export subsidy was linked to compliance with earlier government orders.</p>\n\t<p>\n\t\tA tricky condition for the mills -- in February and March 2018, 30-40 per cent of these were not able to comply with the stock limits at the time and sold more to generate cash.</p>\n\t<p>\n\t\tThis means more than a third of mills are not eligible for the subsidy and, hence, are not considering export. At the time, the industry had said the subsidy conditions should not apply retrospectively.</p>\n\t<p>\n\t\tThe second reason is that there is a surplus in the international market, which has kept the price subdued, at Rs 18.5 a kg. The cane subsidy of Rs 55 a tonne announced earlier translates to Rs 7.7 a kg and the buffer stock subsidy will add a few rupees more.</p>\n\t<p>\n\t\tHowever, say mills, they still make a loss of Rs 4-5 a kg in  export at the current international price and cost of production of Rs 35 a kg. A normal monsoon this season and the past year’s bumper sowing is expected to result in a repeat of high production in sugar season 2018-19 (it begins October 1).</p>\n\t<p>\n\t\tThe current year is expected to end with a closing stock of 10 mt, even if mills export a million tonnes. The estimate for a year later is a possible sugar surplus of 17-18 mt.</p>\n\t<p>\n\t\tBy not fixing a higher <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/msp\" target=\"_blank\">MSP </a>for mills, “the government has actually not done a big favour to farmers, as they will still have to be prepared for  high cane payment arrears”, said an industry observer.</p>\n\t<p>\n\t\tAlso, Wednesday's  announcement from the central government was that a mechanism would be put in place to keep retail prices of sugar “fully under control\".</p>\n\t<p>\n\t\tAs mentioned earlier, the government on Thursday notified a 2.1 mt combined stock limit for June. But, contrary to earlier expectation, the old release mechanism has also been notified, where mills’ quota for maximum sugar sale has been fixed (totalling 2.1 mt).</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "current",
        "possible",
        "New",
        "29",
        "million",
        "enough",
        "expected",
        "closing",
        "stock",
        "10",
        "even",
        "later",
        "surplus",
        "17",
        "18"
    ],
    "nouns": [
        "current",
        "possible",
        "29",
        "kg",
        "sugar",
        "mills",
        "million",
        "enough",
        "cane",
        "arrears",
        "year",
        "export",
        "end",
        "closing",
        "stock",
        "10",
        "mt",
        "even",
        "estimate",
        "surplus",
        "17",
        "18"
    ],
    "verbs": [
        "sugar",
        "cane",
        "export",
        "end",
        "stock",
        "even",
        "estimate"
    ]
}