{
    "title": "Chemicals, pharma push Indian exports to 6-month high of $28 bn in May",
    "link": "https://www.business-standard.com/article/economy-policy/chemicals-pharma-push-indian-exports-to-6-month-high-of-28-bn-in-may-118061500951_1.html",
    "pubDate": "Fri, 15 Jun 2018 21:15:00 +0530",
    "content": "Imports too rose by 14.85% to $43.48 bn during May, which widened the trade deficit to a four-month high of $14.62 bn according to the data released by the commerce ministry",
    "contentSnippet": "Imports too rose by 14.85% to $43.48 bn during May, which widened the trade deficit to a four-month high of $14.62 bn according to the data released by the commerce ministry",
    "guid": "https://www.business-standard.com/article/economy-policy/chemicals-pharma-push-indian-exports-to-6-month-high-of-28-bn-in-may-118061500951_1.html",
    "isoDate": "2018-06-15T15:45:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "chemicals",
            "pharma",
            "push",
            "indian",
            "exports",
            "to",
            "6-month",
            "high",
            "of",
            "28",
            "bn",
            "in",
            "may"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Chemicals, pharma push Indian exports to 6-month high of $28 bn in May",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tIndia's exports grew 20.18 per cent to $28.86 billion in May -- the highest in six months, even though the trade deficit widened to a four-month high of $14.62 billion.</p>\n<p>\n\tImports too rose by 14.85 per cent to $43.48 billion during the month, according to the data released by the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/commerce-ministry\" target=\"_blank\">commerce ministry.</a>\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe previous high growth of exports was recorded at 30.55 per cent in November 2017.</p>\n<p>\n\tSimilarly, in January this year, the trade deficit was at $16.28 billion.</p>\n<p>\n\tExporting sectors, which helped to push the shipments in May include petroleum products, chemicals, pharmaceuticals and engineering.</p>\n<p>\n\tHowever, exports of cashew, iron ore, textiles, gems and jewellery, handicrafts and carpet registered negative growth.</p>\n<p>\n\tGold imports during the month under review dipped by 29.85 per cent to $3.48 billion as against $4.96 billion in the same period last year.</p>\n<p>\n\tDuring April-May 2018-19, exports grew by 12.58 per cent to $54.77 billion, while imports were up by 9.72 per cent to $83.11 billion. Trade deficit widened to $28.34 billion in the two months of this fiscal as compared to $27.09 billion during the same period previous fiscal.</p>\n<p>\n\tCommerce and Industry Minister <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/suresh-prabhu\" target=\"_blank\">Suresh Prabhu </a>said that in May, exports grew by 20.18 per cent.</p>\n\n<p>\n\tAlso, in 2017-18, exports of goods and services put together rose by 12.78 per cent, which is highest in about 6-7 years.</p>\n<p>\n\t\"Exports have increased significantly in 2017-18 despite the fact that we are facing a lot of challenges particularly this year,\" the minister told reporters here.</p>\n<p>\n\tHe said that issues such as delay in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gst\" target=\"_blank\">GST </a>refund is more or less sorted out and \"2018-19 fiscal should be better than 2017-18\".</p>\n<p>\n\tPayment of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gst\" target=\"_blank\">GST </a>will help exporters deal with the issue of working capital, he added.</p>\n<p>\n\tPrabhu said the ministry is working with all the concerned ministries to promote shipments.</p>\n<p>\n\t\"We are working on a strategy to involve all the concerned ministries. They have decided to fix targets for themselves for export,\" he said, adding that in May exports have increased in volume terms.</p>\n\n<p>\n\tWhen asked about the credit issues being faced by the gems and jewellery sector after Nirav Modi bank fraud, he said: \"bank finance is one of the challenges for this sector so we have raised this issue with the finance ministry. We told (them) that they should take export as a priority sector lending because that will address many of the issues\".</p>\n<p>\n\tOil imports were up 49.46 per cent to $11.5 billion on back of a surge in international crude prices.</p>\n<p>\n\tMeanwhile, an official statement said that the Department of Commerce will soon open 10 offices in Indian missions abroad for accelerating export promotion activities.</p>\n<p>\n\tThis was informed by the minister during a review of the sectoral export promotion plans prepared by ministries and departments here today.</p>\n<p>\n\tA conference of heads of Indian missions has been scheduled in June end, in which trade promotion measures will be discussed.</p>\n\n<p>\n\tThe minister stressed on the branding of Indian products and export credit as important focus areas for export promotion.</p>\n<p>\n\tHe also suggested that each ministry and department should set targets for increasing exports of their product and product groups in 2018-2019.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=commerce+minister\" target=\"_blank\">Commerce Minister </a>emphasised that exports are a national priority and an integrated approach is required to promote exports as a joint mission.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Indian",
        "high",
        "according",
        "28",
        "rose",
        "14",
        "85",
        "43",
        "48",
        "four",
        "62"
    ],
    "nouns": [
        "Indian",
        "high",
        "month",
        "pharma",
        "push",
        "28",
        "May",
        "rose",
        "14",
        "trade",
        "deficit",
        "four",
        "data",
        "commerce",
        "ministry"
    ],
    "verbs": [
        "push",
        "trade"
    ]
}