{
    "creator": "Reuters",
    "title": "Dow, S&P 500 set record high closes ahead of holiday",
    "link": "https://www.financialexpress.com/market/world-markets/dow-sp-500-set-record-high-closes-ahead-of-holiday/455436/",
    "pubDate": "Fri, 25 Nov 2016 05:04:51 +05:30",
    "dc:creator": "Reuters",
    "content": "The Dow and the S&#038;P 500 eked out record high closes on Wednesday ahead of the Thanksgiving holiday, helped by gains in industrial stocks, though losses in technology shares limited the advance and weighed on the Nasdaq.",
    "contentSnippet": "The Dow and the S&P 500 eked out record high closes on Wednesday ahead of the Thanksgiving holiday, helped by gains in industrial stocks, though losses in technology shares limited the advance and weighed on the Nasdaq.",
    "guid": "http://www.financialexpress.com/?p=455436",
    "categories": [
        "Market",
        "World Markets Markets Do Not Use"
    ],
    "isoDate": "2016-11-24T23:34:51.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "dow",
            "sp",
            "500",
            "set",
            "record",
            "high",
            "closes",
            "ahead",
            "of",
            "holiday"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Dow, S&P 500 set record high closes ahead of holiday",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-309435\" src=\"https://images.financialexpress.com/2016/07/sl-5.jpg\" alt=\"Standard &amp; Poors\" srcset=\"https://images.financialexpress.com/2016/07/sl-5.jpg 660w, https://images.financialexpress.com/2016/07/sl-5-300x200.jpg 300w, https://images.financialexpress.com/2016/07/sl-5-620x413.jpg 620w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The S&amp;P industrial index, up 0.8 percent on the day, has risen 7 percent since the Nov. 8 U.S. election. The Dow transportation average jumped 1 percent. (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>The Dow and the S&amp;P 500 eked out record high closes on Wednesday ahead of the Thanksgiving holiday, helped by gains in industrial stocks, though losses in technology shares limited the advance and weighed on the Nasdaq.</p><span>\n</span><p>Caterpillar rose 2.7 percent and hit the highest in about two years, while Deere jumped 11 percent to a record high close after the farm equipment maker reported a much smaller-than-expected decline in profit.</p><span>\n</span><p>Industrial stocks also were given a boost by a report that showed a strong jump in orders for durable goods in October due to demand for machinery and other equipment.</p><span>\n</span><p>The S&amp;P industrial index, up 0.8 percent on the day, has risen 7 percent since the Nov. 8 U.S. election. The Dow transportation average jumped 1 percent.</p><span>\n</span><p>Bets that President-elect Donald Trump’s plans to boost infrastructure spending, ease regulations and reduce taxes have lifted industrials as well as financials and other sectors since the vote.</p><span>\n</span><p>Stocks had little reaction to minutes from the latest Federal Reserve meeting, which showed policymakers appeared confident on the eve of the U.S. election on Nov. 8 that the economy was strengthening enough to warrant interest rate increases soon.</p><span>\n</span><span>\n\t\t</span><span>\n\t</span><span>\n</span><p>Expectations among investors remained high that the Fed will raise rates in December.</p><span>\n</span><p>“It’s fully factored in,” said John Traynor, executive vice president and chief information officer of People’s United Wealth Management in Bridgeport, Connecticut.</p><span>\n</span><p>“What you’re seeing right now is a lot of portfolio repositioning. Those are people who had a portfolio built for a slower-growth environment and are now moving to position themselves for a different administration and a different environment,” he said.</p><span>\n</span><p>Volume was lighter than usual, with many market participants heading out early ahead of the U.S. Thanksgiving Day holiday on Thursday. The U.S. stock market will be closed on Thursday and will close early on Friday.</p><span>\n</span><p>The Dow Jones industrial average rose 59.31 points, or 0.31 percent, to end at 19,083.18, while the S&amp;P 500 gained 1.78 points, or 0.08 percent, to 2,204.72 and the Nasdaq Composite dropped 5.67 points, or 0.11 percent, to 5,380.68.</p><span>\n</span><p>The Dow closed above 19,000 for the first time on Tuesday and all three major indexes along with the small-cap Russell 2000 ended at record highs for a second straight day.</p><span>\n</span><p>The S&amp;P 500 technology index fell 0.5 percent on Wednesday, with HP Inc falling 6.8 percent to $14.87, a day after it reported disappointing results.</p><span>\n</span><p>Traynor and others said a pullback in stocks could be in order soon given the recent sharp run higher.</p><span>\n</span><p>“We’re advising clients the market is ahead of itself so be prepared for a pullback,” he said.</p><span>\n</span><p>Eli Lilly fell 10.5 percent to $68 after the company said it would stop developing its Alzheimer’s drug following a trial failure.</p><span>\n</span><p>Biogen, which is developing a similar drug, fell 3.8 percent.</p><span>\n</span><p>Juno Therapeutics sank 24.5 percent after it reported that two patients died during a trial of its leukemia drug.</p><span>\n</span><p>Still, the S&amp;P health care index reversed early losses to end up 0.4 percent.</p><span>\n</span><p>About 6.5 billion shares changed hands on U.S. exchanges, compared with the 8.1 billion daily average for the past 20 trading days, according to Thomson Reuters data.</p><span>\n</span><p>Advancing issues outnumbered declining ones on the NYSE by a 1.02-to-1 ratio; on Nasdaq, a 1.43-to-1 ratio favored advancers.</p><span>\n</span><p>The S&amp;P 500 posted 66 new 52-week highs and three new lows; the Nasdaq Composite recorded 321 new highs and 21 new lows.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "500",
        "high",
        "ahead",
        "industrial",
        "set",
        "limited",
        "advance"
    ],
    "nouns": [
        "S",
        "P",
        "500",
        "record",
        "high",
        "holiday",
        "Wednesday",
        "set",
        "stocks",
        "Thanksgiving",
        "technology",
        "losses",
        "limited",
        "advance",
        "Nasdaq"
    ],
    "verbs": [
        "set",
        "record",
        "holiday",
        "advance"
    ]
}