{
    "title": "RBI's rate hike upsets Modi's election year budget maths",
    "link": "https://timesofindia.indiatimes.com/business/india-business/rbis-rate-hike-upsets-modis-election-year-budget-maths/articleshow/64507984.cms",
    "pubDate": "Fri, 08 Jun 2018 10:53:47 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/rbis-rate-hike-upsets-modis-election-year-budget-maths/articleshow/64507984.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64507984.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/rbis-rate-hike-upsets-modis-election-year-budget-maths/articleshow/64507984.cms",
    "isoDate": "2018-06-08T10:53:47.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.2222222222222222,
        "tokens": [
            "rbi's",
            "rate",
            "hike",
            "upsets",
            "modi's",
            "election",
            "year",
            "budget",
            "maths"
        ],
        "words": [
            "upsets"
        ],
        "positive": [],
        "negative": [
            "upsets"
        ]
    },
    "article": {
        "title": "RBI's rate hike upsets Modi's election year budget maths",
        "content": "<div class=\"Normal\"><span>NEW DELHI: Reserve Bank of India's (RBI) first interest rate rise since Prime Minister </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Narendra-Modi\">Narendra Modi</a><p> came to power could not have come at a worse time for a government grappling with spending constraints, voter discontent in the rural heartlands and rising oil prices.\n\n</p><p>The rate increase, the first in more than four years, is likely to be followed by one or two more this year, economists predict, pushing up overall borrowing costs for the government and companies alike.\n</p><span>Higher interest rates are likely to make it tougher for the government to borrow from the market and hurt a recent pick-up in the economy, while dampening revenue collection and burning a bigger hole in the government’s </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/fiscal-deficit\">fiscal deficit</a><span> than the budgeted target of 3.3 per cent of </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/gross-domestic-product\">gross domestic product</a><p> (GDP).\n</p><p>For Modi that represents a double whammy, as he looks to step up spending to woo disgruntled voters ahead of a general election next year without spooking skittish foreign investors. The fiscal maths are getting challenging on rising fuel prices, a weakening rupee and subdued investments.\n</p><span>“This could be the worst year for us, as </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/budget\">budget</a><p> calculations are under stress,” a senior finance ministry official, who declined to be named, told Reuters, adding there was a worry of at least one more rate hike by December.\n</p><p>“The rising crude oil prices are already giving sleepless nights as the government may have to cut tax on fuel products sooner rather than later,” the official added.\n</p><p>India’s economy grew at 7.7 per cent in the first three months of the year, the fastest pace in nearly two years. That would be an impressive clip for most countries, but more is needed to create enough new jobs for the 10 lakh young people entering the country’s workforce each month.\n</p><span>\n</span><strong>FEELING THE PRESSURE<br></strong><p>The government’s spending plans have already been threatened by setbacks to flagship reforms.\n</p><span>An estimated Rs 8,000 crore to Rs 10,000 crore </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Air-India\">Air India</a><p> privatisation plan flopped when the stake it was selling in the flag carrier failed to attract a single bid by last week’s deadline, putting at risk its Rs 80,000 crore divestment target.\n</p><p>Meanwhile, the sovereign 10-year bond yield has risen by 60 basis points since start of the fiscal year in April, and is near a three-year high due to a lack of investors. Similarly top-rated corporates, including National Bank for Agriculture and Rural Development, Small Industries Development Bank of India and National Housing Bank, have deferred their bond issuance plans due to a lack of buyers.\n</p><p>To top this, foreign holders have sold a net $4.3 billion of Indian debt so far this year as investors have grown wary of emerging economies facing twin fiscal and current account deficits and higher inflation that could pose overheating risks.\n</p><p>The stock market has held up so far, but some analysts caution that concerns over a loosening of fiscal discipline ahead of the election could trigger equity outflows as well.\n</p><span>The RBI raised its key </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/repo-rate\">repo rate</a><p> on Wednesday by 25 basis points to 6.25 per cent - the first change since a cut of the same size in August last year - as higher oil prices, a sharp fall in the rupee and potential stronger consumer spending threatened to spur inflation beyond its 4 per cent medium term target.\n</p><p>“The rate hike will push up the government’s interest financing cost and add to the fiscal deficit pressure on one hand,” said Soumya Kanti Ghosh, chief economist at State Bank of India. “And on the other hand, the nascent recovery in growth on the back of consumption demand will also slow down as retail lending rates will go up sooner than later.”\n</p><span>\n</span><strong>MODI’S ELECTION BUGLE<br></strong><span>After a setback at a by-election in India’s most populous state last week showed Modi’s waning popularity in the countryside, where most Indians still live, the government has stepped up its so-called populist spending to please the voters.\n</span><br><span>\n</span><br><span>Already the government has unveiled a support package for sugar farmers to put a floor under prices that could cost about Rs 4,000 crore outside the budget.\n</span><br><span>\n</span><br><span>Further measures, including loan waivers to farmers by regional governments, higher minimum purchase prices for grains, fuel subsidies to prevent pump prices from rising sharply and higher than budgeted rural wage payouts could blow a big hole in the fiscal deficit.\n</span><br><span>\n</span><br><span>That could set up the RBI for a face-off with the government and also prompt further rate increases after it warned in its monetary policy statement that moving away from the fiscal deficit roadmap could push up inflation risks.\n</span><br><span>\n</span><p>“India’s combined fiscal deficit is already quite high and since this is an election year, both state and central governments are coming up with populist spending steps which will push up the fiscal deficit and add to inflation pressures,” said A Prasanna, chief economist at ICICI Securities Primary Dealership. “This increases the probability of further rate hikes.”\n</p><span>\n</span></div>"
    },
    "adjectives": [
        "10",
        "left",
        "top",
        "right"
    ],
    "nouns": [
        "india",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo",
        "maths",
        "RBI",
        "rate",
        "hike",
        "election",
        "year",
        "budget"
    ],
    "verbs": [
        "border",
        "align",
        "style",
        "top",
        "right",
        "rate",
        "hike",
        "budget"
    ]
}