{
    "title": "Why Infosys staff should be thankful to this former employee",
    "link": "https://timesofindia.indiatimes.com/business/india-business/why-infosys-staff-should-be-thankful-to-this-former-employee/articleshow/64503107.cms",
    "pubDate": "Fri, 08 Jun 2018 04:52:17 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/why-infosys-staff-should-be-thankful-to-this-former-employee/articleshow/64503107.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64503107.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/why-infosys-staff-should-be-thankful-to-this-former-employee/articleshow/64503107.cms",
    "isoDate": "2018-06-08T04:52:17.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.2,
        "tokens": [
            "why",
            "infosys",
            "staff",
            "should",
            "be",
            "thankful",
            "to",
            "this",
            "former",
            "employee"
        ],
        "words": [
            "thankful"
        ],
        "positive": [
            "thankful"
        ],
        "negative": []
    },
    "article": {
        "title": "Why Infosys staff should be thankful to this former employee",
        "content": "<div class=\"Normal\"><span>BENGALURU: Infosys’s employees benefits and welfare trust – which the company uses to reward employees, often handsomely – holds 1 per cent of the company’s shares, or about Rs 2,472 crore. Much of the money for this trust around the time it was established in the 1990s came from a significant donation from one man – </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/V-A-Sastry\">V A Sastry</a><p>. \n\n</p><span>Sastry was the first non-founder on the </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Nandan-Nilekani\">Infosys</a><p> board, and when he decided to leave the company in 1996, he donated half of the 2 per cent shareholding he then had in Infosys to the trust. He says he was simply returning a favour that founder N R Narayana Murthy had done him when he joined the company in 1990. “I was to join in April or May that year. Murthy told me that if I joined before April, I would be eligible for bonus shares the company was issuing,” Sastry recollects. “So I merely donated the extra shares I received because of that advice,” he says modestly. \n</p><p>Sastry, now 75, grew up in a small village about 200 km from Warangal in the then united Andhra Pradesh. He went on to do electrical engineering at the regional engineering college (REC) in Warangal, a Master’s in Indian Institute of Science (IISc), Bangalore, and a PhD from Canada. He worked for the Electronics Corporation of India and then at Tata Consulting Engineers, where he led a team that conceived, designed and built a computer simulator to train operators to run a 500mw thermal power plant. “500mw was very high for that time, and very critical, so we couldn’t have operators directly running them. We needed to first train them on a simulator, and the simulator we built needed to have panels that would be identical to the original,” says Sastry.\n</p><p>The team did an excellent job of that, and Sastry soon received an offer from a company called Macmet, which was into things like boiler cleaning, to create a simulator business. Sastry joined the company and helped build simulators for chemical plants, power distribution and flights.\n</p><span>In 1989, Macmet wanted to showcase its products at the CBIT exhibition in Hannover. But they did not see a point in taking a full stall, it was too expensive. That was when Sastry ran into Murthy and </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Nandan-Nilekani\">Nandan Nilekani</a><p>. Infosys too was looking at having a stall in CBIT and was in a similar dilemma.\n</p><p>The two decided to share a single stall and in the course of planning for the event, and the event itself, Sastry closely worked with Murthy and Nilekani.\n</p><p>The relationship developed, and at one point, Sastry suggested to them that they acquire Macmet’s simulator division. They eventually got back to him, but with a different offer. “Nandan said they had given the matter serious thought. He said `we are not interested in buying the company, but we are interested in buying you’,” Sastry says.\n</p><p>Given Sastry’s age and experience, Murthy offered him the position of board director, with responsibility for quality and productivity. He was the 141st employee.\n</p><p>When he was offered 2 per cent of the shares, Sastry recollects he spent several sleepless nights. It was being given at face value, but it still meant shelling out Rs 1.6 lakh. It was a big sum then even for him. “One day I happened to run into an uncle of my wife’s on a flight. He was then the MD of NGEF. He was always a man of few words, and everybody valued those words. I sought his advice on the share offer. And he told me `Do it’,” says Sastry.\n</p><p>So Sastry did it. He had only Rs 1 lakh to give immediately, so he borrowed the rest from a friend. And it proved one of the best bets he ever made. He still holds about 0.05 per cent of Infosys’ shares – that’s about Rs 125 crore. The rest of the 1 per cent he offloaded at different times, partly to diversify his portfolio and partly to spend on his charitable activities, which today include a teacher motivation initiative in rural government schools, and digitalization of government schools around Indiranagar, the locality in Bengaluru where he stays. \n</p><p>Sastry’s success story, however, did not end with his Infosys stint. The work that he did at Infosys earned the company an ISO 9001, the first Indian software company to obtain that from a foreign agency, BVQI. “We got it perfect the very first time, and I remember Murthy opened a champagne bottle that day.”\n</p><span>\n</span><br><span>Word of his eye for perfection got around. Many smaller companies sought his advice. By then Infosys had moved to Electronics City, and Sastry one day spent four hours to commute to his home, stuck between trucks spewing fumes. That was the last straw. In 1996, he decided to leave Infosys to provide consulting services, and started a company with a friend Prakash Muthalik, who then worked with HP. \n</span><br><span>\n</span><br><span>That company flourished, as did another that Sastry and Muthalik started two years later called RelQ in the software testing space. RelQ was acquired in 2006 by EDS for $40 million. “A little before that, Cognizant had offered us $19 million, but after a due diligence, they lowered it to $13 million, and pointed out several issues that they were unhappy about. We corrected those issues, and then EDS came up with this big offer,” Sastry laughs.\n</span><br><span>\n</span><br><span>At 75, Sastry continues his consulting business. And he has just completed writing a book, titled Unfiltered Me, that brings together the many anecdotes from his life. “I’m hoping my grandchildren will learn about how our generation lived, riding on bullock carts and more,” he says.\n</span><br><span>\n</span><br><span>He still closely tracks Infosys, and continues to be in touch with the founders. In June 2014, soon after Vishal Sikka was appointed CEO, Sastry told The Economic Times: “The only thing I wish to happen is for Sikka to move to Bangalore and start living here. Because unless he lives here and starts working from here, it could become a little bit of challenge. No matter how many times he comes, he will always be a visitor.” That today sounds prophetic.\n</span><br><span>\n</span></div>"
    },
    "adjectives": [
        "10",
        "left",
        "top",
        "right",
        "thankful",
        "former"
    ],
    "nouns": [
        "india",
        "staff",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo",
        "Why",
        "why",
        "former",
        "employee"
    ],
    "verbs": [
        "staff",
        "border",
        "align",
        "style",
        "top",
        "right"
    ]
}