{
    "creator": "PTI",
    "title": "Expedite setting of Patanjali mega food park: Harsimrat Badal to UP government",
    "link": "https://www.financialexpress.com/industry/expedite-setting-of-patanjali-mega-food-park-harsimrat-badal-to-up-government/1198910/",
    "pubDate": "Fri, 08 Jun 2018 18:28:37 +05:30",
    "dc:creator": "PTI",
    "content": "Food Processing Minister Harsimrat Kaur Badal today said she has written to the Uttar Pradesh government for expediting the process for Baba Ramdev's Patanjali Ayurved to set up the proposed Rs 6,000-crore mega food park. ",
    "contentSnippet": "Food Processing Minister Harsimrat Kaur Badal today said she has written to the Uttar Pradesh government for expediting the process for Baba Ramdev's Patanjali Ayurved to set up the proposed Rs 6,000-crore mega food park.",
    "guid": "https://www.financialexpress.com/?p=1198910",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-08T12:58:37.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "expedite",
            "setting",
            "of",
            "patanjali",
            "mega",
            "food",
            "park",
            "harsimrat",
            "badal",
            "to",
            "up",
            "government"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Expedite setting of Patanjali mega food park: Harsimrat Badal to UP government",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1198979\" src=\"https://images.financialexpress.com/2018/06/cats-533.jpg\" alt=\"Patanjali mega food park,&nbsp;Harsimrat Badal,&nbsp;UP government,&nbsp;Patanjali,&nbsp;FutureAgritech Summit, yogi adityanath,&nbsp;ICRIER\" srcset=\"https://images.financialexpress.com/2018/06/cats-533.jpg 660w, https://images.financialexpress.com/2018/06/cats-533-300x200.jpg 300w, https://images.financialexpress.com/2018/06/cats-533-620x413.jpg 620w, https://images.financialexpress.com/2018/06/cats-533-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Addressing the event, Badal informed that 15 mega food parks have become operational out of 42 sanctioned. (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>Food Processing Minister Harsimrat Kaur Badal today said she has written to the Uttar Pradesh government for expediting the process for Baba Ramdev’s Patanjali Ayurved to set up the proposed Rs 6,000-crore mega food park. “I have written to the Uttar Pradesh Chief Minister to sort out all the issues and expedite the process for setting up of this proposed food park,” she said when asked about the controversy over Patanjali’s good park. She was speaking on the sidelines of Yes Bank’s second FutureAgritech Summit.</p><span>\n</span><p>Badal said the Patanjali has proposed to develop this food park on land provided by the UP government. As per the mega food park policy, land has to be sub-leased for units being set up in the park, she said, adding that the state has to give permission for the same.</p><span>\n</span><p>Badal said Patanjali has been given time till June to fulfill all the conditions so that the company gets the final approval from the Centre to set up food park. When asked whether other companies are facing similar problems in putting up mega food parks, she said: “I personally review the progress of the project on quarterly basis. We coordinate with other ministries and state governments to expedite the process”.</p><span>\n</span><p>Earlier this week, Patanjali had stated that it was pulling out of the mega food processing project along the Yamuna Expressway in Uttar Pradesh, citing non-cooperation from the state government and delay in clearances for transfer of land. However, the company later said that it was reviewing the decision to pull out of the project after getting assurance from the state government.</p><span>\n</span><p>Uttar Pradesh Chief Minister Yogi Adityanath had directed officials to expedite the process for Baba Ramdev’s Patanjali Ayurved to set up its food park. The Haridwar-based company had proposed to invest up to Rs 6,000 crore to set up a plant over 425 acres of land along the Yamuna Expressway through its step-down firm Patanjali Food and Herbal Park.</p><span>\n</span><p>Addressing the event, Badal informed that 15 mega food parks have become operational out of 42 sanctioned. She said food processing would play a pivotal role in achieving the target of doubling farmers income by 2022. The minister stressed on the need to increase the processing level from current 10 per cent in order to reduce wastage of perishable food items, which is estimated at staggering Rs 1 lakh crore annually.</p><span>\n</span><p>“We have to make farmers into agro-processors,” the minister added. Stating that India is a leading producer of many crops despite low yields, Badal said India has the capacity to be global food factory if productivity gets increased and post-harvesting wastage reduced.</p><span>\n</span><p>Speaking at the event, Ashok Gulati, Infosys Chair Professor for Agriculture, ICRIER, said the agriculture sector is in “stress situation”. The average growth of agriculture and allied sectors in the last four years has declined to 2.5 per cent from 5.2 per cent in the previous four years, he added.</p><span>\n</span><p>Farmers are growing more but not getting right price for their produce, Gulati said, while emphasising on the need to make the whole system demand driven. “Effective application of technology is vital to transform the food and agriculture sector, thereby improving yield, productivity, market access and income,” YES Bank MD and CEO Rana Kapoor said.</p><span>\n</span><p>The bank has launched an agritech accelerator which will focus on scaling up 4-5 innovative farm-to-fork agritech solutions which also have a social impact, through a mix of mentorship, grants, access to funding and commercialization partnerships, he added.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "set",
        "UP",
        "written"
    ],
    "nouns": [
        "government",
        "Minister",
        "today",
        "setting",
        "set",
        "food",
        "Food",
        "park",
        "Processing",
        "process",
        "crore",
        "Baba"
    ],
    "verbs": [
        "Minister",
        "Expedite",
        "set",
        "park",
        "UP",
        "process"
    ]
}