{
    "title": "Rise in May exports expected; labour-intensive field may continue to suffer",
    "link": "https://www.business-standard.com/article/economy-policy/may-exports-figures-expected-labour-intensive-sectors-may-again-suffer-118061500301_1.html",
    "pubDate": "Fri, 15 Jun 2018 12:10:00 +0530",
    "content": "After a dip of 0.66% in March, exports had risen by 5.71% in April mainly due to engineering and pharma shipments",
    "contentSnippet": "After a dip of 0.66% in March, exports had risen by 5.71% in April mainly due to engineering and pharma shipments",
    "guid": "https://www.business-standard.com/article/economy-policy/may-exports-figures-expected-labour-intensive-sectors-may-again-suffer-118061500301_1.html",
    "isoDate": "2018-06-15T06:40:00.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.09090909090909091,
        "tokens": [
            "rise",
            "in",
            "may",
            "exports",
            "expected",
            "labour-intensive",
            "field",
            "may",
            "continue",
            "to",
            "suffer"
        ],
        "words": [
            "suffer",
            "rise"
        ],
        "positive": [
            "rise"
        ],
        "negative": [
            "suffer"
        ]
    },
    "article": {
        "title": "Rise in May exports expected; labour-intensive field may continue to suffer",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tIndia's exports in May - figures for which are set to be released later today - are expected to show growth based on global factors but may not be able to bring out labour-intensive sectors out of their current contraction.</p>\n<p>\n\tSpurred by double-digit growth in shipment of engineering goods and pharma products, exports rose by 5.71 per cent at $25.91 billion in April. This was a recovery since exports had dipped 0.66 per cent in March.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tHowever, major labour-intensive sectors - gems and jewellery, leather and ready-made garments may continue to see decline which may affect the job scenario. \"These sectors are still facing the problem of liquidity as banks and lending agencies have continuously been tightening their lending norms and flow of GST refund has also slowed down,\" said Ganesh Kr Gupta, President of the Federation of Indian Exports Organization.</p>\n<p>\n\tAmong labour-intensive sectors, ready-made garments export has continued to drop since October 2017. With only a $ 1.49 billion worth of outbound shipments made, exports in the sector fell by a significant 22.76 per cent in April, higher than the 17.78 per cent fall in March. “At present, the Industry is going through a tough period with its competitiveness greatly eroded. This is reflected in the unprecedented month on month decline in the apparel exports every month after October 2017,” H K L Magu, Chairman, Apparel Export Promotion Council said.</p>\n<p>\n\tGupta added that the overall cushion provided by the petroleum sector to exports in recent months is also not available as refinery product exports itself had declined by 4.5 per cent in April. This happened despite the rise in global crude prices notwithstanding. However, the rate of contraction reduced from 13.22 per cent in March and 27.44 per cent rise in February. This happened as major oil refineries were closed at the same time due to maintenance and other issues, which may be expected to affect May figures as well.</p>\n<p>\n\tA long-term solid growth trend is expected however from the Non-oil, non-<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gems-and-jewellery-sector\" target=\"_blank\">gems and jewellery sector.</a> These are taken as a signal of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/industrial-production\" target=\"_blank\">industrial production </a>in the country witnessed a growth of 11.73 per cent in April against 4.60 per cent rise in the previous month.</p>\n<p>\n\tThis was primarily due to engineering and pharma goods, both of which are expected to strengthen exports given global demand. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=engineering+goods+exports\" target=\"_blank\">Engineering goods exports </a>rose by 17.63 per cent in April to ship out $ 7.18 billion worth of exports, up from the 2.62 per cent rise in March. <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/pharma-exports\" target=\"_blank\">Pharma exports </a>also rose 13.56 per cent to $ 1.46 billion in April, bettering on its 8.40 per cent growth in the previous month.</p>\n<p>\n\tHowever, of the 30 major product groups, 16 recorded growth in April down from 18 a month back. However, the rate of contraction has reduced from 13.22 per cent in March and 27.44 per cent rise in February.</p>\n<p>\n\tThe current account deficit is set to more than triple to $ 46-49 billion or about 1.8 per cent of GDP in FY2018 from $15 billion in FY2017, according to credit ratings firm <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/icra\" target=\"_blank\">ICRA.</a> \"Assuming an average price for the Indian <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/crude-oil\" target=\"_blank\">crude oil </a>basket of $70/barrel, we expect the net petroleum, crude and products import bill to surge to $93 billion in FY2019 from $70 billion in FY2018. This is likely to push up the current account deficit to $65-70 billion or 2.4 per cent of GDP in FY2019. While a current account deficit of around 2.5 per cent of GDP is not alarming, and India's foreign exchange reserves are high, the level and direction of capital inflows as well as the outlook for <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/crude-oil\" target=\"_blank\">crude oil </a>prices would crucially influence sentiment toward the Rupee.\" Aditi Nayar, Principal Economist at <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/icra\" target=\"_blank\">ICRA </a>said.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "risen",
        "expected",
        "intensive",
        "After",
        "66",
        "71",
        "due"
    ],
    "verbs": [
        "continue",
        "March",
        "Rise",
        "labour",
        "field",
        "suffer",
        "dip"
    ],
    "nouns": [
        "March",
        "Rise",
        "May",
        "may",
        "labour",
        "intensive",
        "dip",
        "April",
        "due",
        "engineering",
        "pharma",
        "field"
    ]
}