{
    "creator": "Bloomberg",
    "title": "US Fed, European Central Bank, Bank of Japan’s policy meets next week; what to expect",
    "link": "https://www.financialexpress.com/economy/us-fed-european-central-bank-bank-of-japans-policy-meets-next-week-what-to-expect/1198366/",
    "pubDate": "Fri, 08 Jun 2018 12:12:08 +05:30",
    "dc:creator": "Bloomberg",
    "content": "Three meetings within 36 hours of each other are set to conclude with the Fed raising interest rates, the European Central Bank potentially fleshing out its plan to cease buying bonds, and the Bank of Japan maintaining its massive stimulus program.",
    "contentSnippet": "Three meetings within 36 hours of each other are set to conclude with the Fed raising interest rates, the European Central Bank potentially fleshing out its plan to cease buying bonds, and the Bank of Japan maintaining its massive stimulus program.",
    "guid": "https://www.financialexpress.com/?p=1198366",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-08T06:42:08.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "us",
            "fed",
            "european",
            "central",
            "bank",
            "bank",
            "of",
            "japan’s",
            "policy",
            "meets",
            "next",
            "week",
            "what",
            "to",
            "expect"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "US Fed, European Central Bank, Bank of Japan’s policy meets next week; what to expect",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1198394\" src=\"https://images.financialexpress.com/2018/06/Us-Federal-Reserve-Reuters-1.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/Us-Federal-Reserve-Reuters-1.jpg 660w, https://images.financialexpress.com/2018/06/Us-Federal-Reserve-Reuters-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/Us-Federal-Reserve-Reuters-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/Us-Federal-Reserve-Reuters-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The world’s three most powerful central banks convene next week, with the U.S. Federal Reserve setting the pace in a retreat from the era of easy money. (Image: Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p><span>The world’s three most powerful central banks convene next week, with the U.S. Federal Reserve setting the pace in a retreat from the era of easy money. Three meetings within 36 hours of each other are set to conclude with the Fed raising interest rates, the European Central Bank potentially fleshing out its plan to cease buying bonds, and the Bank of Japan maintaining its massive stimulus program.</span></p><span>\n</span><p><span>Fed Chairman Jerome Powell’s relative hawkishness presents investors with reasons to buy the dollar as central banks for almost half the global economy, and three-quarters of the official currency reserves, diverge in their monetary policies. It also threatens to intensify pressure on emerging markets, which are already unnerved by the withdrawal of U.S. stimulus and increasingly calling on the Fed to slow down.</span></p><span>\n</span><p><span>“The Fed will likely remain on a trajectory that few other central banks can keep up with even with a time lag,” said Stephen Jen, chief executive officer at hedge fund Eurizon SLJ Capital in London. “Inflation in the U.S. will likely continue to drift higher, forcing the Fed to do what it needs to do.” While the U.S. central bank is in the lead, the ECB’s pending pivot after more than three years of quantitative easing reflects mounting optimism that the world economy remains on track for a solid expansion in 2018 after a wobble in the first quarter shook investors.</span></p><span>\n</span><p><span>Economists at JPMorgan Chase &amp; Co. estimate developed markets rebounded to grow 2.5 percent in this quarter from 1.6 percent in the prior three months. Such confidence comes despite trade war-mongering by U.S. President Donald Trump, the rise of a populist government in Italy, the costliest oil in more than three years and palpitations in emerging markets from Turkey to Argentina — factors which all pose a challenge to growth.</span></p><span>\n</span><p><span>The Fed is the most upbeat as it readies to raise rates for the second time in 2018 on Wednesday. Officials could even update their projections to show them leaning further toward four hikes for the year as a whole, up from the three they flagged in March. With a $1.5 trillion tax cut coming on stream, economists surveyed by Bloomberg predict a 2.8 percent expansion this year, keeping unemployment around a 20 year low sub-4 percent and setting up a modest overshoot of the Fed’s 2 percent inflation target.</span></p><span>\n</span><p><span>In tightening again, the Fed would be declaring that its focus is on managing the domestic economy regardless of fallout elsewhere. Emerging markets are at risk from higher U.S. rates forcing up the dollar and prompting investors to shift money elsewhere. India and Indonesia pull the trigger on rate hikes ECB unflinching on QE debate despite Italian turmoil Kuroda’s Peter Pan days are over at Bank of Japan. Turkey and India this week followed Argentina, Indonesia and Mexico in lifting rates to protect their economies, while Brazil again intervened to defend the real. Reserve Bank of India Governor Urjit Patel and Bank Indonesia Governor Perry Warjiyo both called on the Fed to be mindful of its actions.</span></p><span>\n</span><p><span>“The Fed has, by statute, to care about U.S. inflation and U.S. employment,” said Seth Carpenter, chief U.S. economist at UBS Group AG in New York and a former adviser to the Fed. What happens in financial markets matters insofar as it affects the U.S. economy and that threshold hasn’t been crossed, he said. At the same time, ECB President Mario Draghi is finally on the cusp of exiting from the institution’s crisis-fighting mode. His chief economist, Peter Praet, signaled that policy makers will hold their first formal discussion on ending their bond-buying program when they meet on Thursday.</span></p><span>\n</span><p><span>While the ECB could still delay a final decision until July, there are reasons to act now. Inflation jumped to its fastest pace in more than a year in May — driven mainly by resurgent energy but with signs of an improvement in underlying prices — and the economic expansion remains intact despite a slowdown from last year’s decade high. Casting a pall is the emergence of the populist government in Italy, with its promises of hefty spending increases and ambivalence toward euro membership. But the ECB appears unfazed and keen not to be viewed as a prisoner of politics.</span></p><span>\n</span><p><span>The asset-purchase program started in 2015 to reinvigorate the 19-nation economy is scheduled to run at least until September, by when holdings will total 2.6 trillion euros ($3.1 trillion). Market expectations are that the pace of buying — currently 30 billion euros a month — will be tapered to zero by the end of this year.</span></p><span>\n</span><p><span>Tightening isn’t on the agenda yet for the BOJ, which turned to asset-purchases years before the Fed and ECB to address entrenched deflationary forces in Japan. Even with the addition of yield-curve control to Governor Haruhiko Kuroda’s tool kit in 2016, the BOJ is still buying vast quantities of Japanese government bonds and its balance sheet is set to soon surpass the value of the nation’s annual economic output.</span></p><span>\n</span><p><span>Since the last BOJ meeting in April, disappointing data has made it clear that Japan is a long way off from its 2 percent inflation target. The core consumer price index slipped to 0.7 percent, wage growth fell back to trend and gross domestic product ended the longest expansionary streak in almost three decades. JPMorgan Chase and Bank of America are among those banks which pushed back forecasts for tightening by the BOJ, which begins a two-day meeting in Tokyo next Thursday.</span></p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "set",
        "Central",
        "Three",
        "next",
        "massive",
        "European",
        "36",
        "raising"
    ],
    "verbs": [
        "plan",
        "conclude",
        "set",
        "Bank",
        "interest",
        "program",
        "Japan",
        "expect",
        "cease"
    ],
    "nouns": [
        "plan",
        "set",
        "Central",
        "Bank",
        "Three",
        "interest",
        "program",
        "week",
        "US",
        "Fed",
        "European",
        "Japan",
        "policy",
        "hours",
        "raising",
        "rates",
        "cease",
        "buying",
        "stimulus"
    ]
}