{
    "title": "Rice exports to decline by 10% on restrictions from importing countries",
    "link": "https://www.business-standard.com/article/economy-policy/rice-exports-to-decline-by-10-on-restrictions-from-importing-countries-118061500820_1.html",
    "pubDate": "Fri, 15 Jun 2018 23:21:00 +0530",
    "content": "Bangladesh imposes 18% import duty, EU introduces stringent quality norms; a part of decline to compensate through export to China",
    "contentSnippet": "Bangladesh imposes 18% import duty, EU introduces stringent quality norms; a part of decline to compensate through export to China",
    "guid": "https://www.business-standard.com/article/economy-policy/rice-exports-to-decline-by-10-on-restrictions-from-importing-countries-118061500820_1.html",
    "isoDate": "2018-06-15T17:51:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "rice",
            "exports",
            "to",
            "decline",
            "by",
            "10",
            "on",
            "restrictions",
            "from",
            "importing",
            "countries"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Rice exports to decline by 10% on restrictions from importing countries",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tAfter a bumpy ride last year, India's rice exports are likely to decline this year by up to 10 per cent this year due to restrictions imposed by importing countries.</p>\n<p>\n\tWhile Bangladesh has imposed 28 per cent import duty on rice to restrict its exports largely from India, the European Union also made its quality norms stringent with introduction of new pesticides limit. With this, non-basmati rice export to Bangladesh and basmati rice shipment to the European Union is set to decline.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe restrictions from importing countries assume significance as Bangladesh contributes over 18 per cent India's 8.5 million tonnes of non-basmati rice exports, the European Union shares nearly 10 per cent of India's basmati rice exports annually. A part of this decline, however, is likely to offset with the beginning of direct import from China, possibly in the second half of the current financial year.</p>\n<p>\n\t\"Overall rice exports from India are set to decline this year due to stringent quality norms introduced by the European Union. For immediate future, therefore, India may lose its entire 400,000 tonnes of European Union markets in the immediate term. The scenario, however, would improve with growers to reduce pesticides use in basmati rice in the long term. Also, Indian exporters would lose the entire Bangladesh market in the immediate term,” said Gurnam Arora, Joint Managing Director, Kohinoor Foods, one of India’s largest basmati rice exporters which sells its aromatic rice under Kohinoor brand.</p>\n<p>\n\tData compiled by the Agricultural and Processed Food Products Export Development Authority (Apeda) showed a bumpy ride of both basmati and non-basmati rice exports during the last financial year. India emerged as a large supplier of rice to the South East Asian (SEA) countries due to a devastating flood in this region last year.</p>\n<p>\n\tConsequently, India's both non-basmati rice exports jumped by a staggering 28 per cent to 8.65 million tonnes for the financial year 2017-18 compared to 6.77 million tonnes in the previous financial year. India’s basmati rice exports, however, stagnated at around 4 million tonnes in three years.</p>\n<p>\n\tIn value terms, however, non-basmati rice exports from India jumped by a staggering 41 per cent to $3564.39 million for FY17-18 versus $2531.47 million in the previous financial year.</p>\n<p>\n\t“A part of the decline in non-basmati rice export would get compensated through shipment to China for which Apeda has started registering exporters,” said a senior official with a large rice exporting company.</p>\n<p>\n\tA study from India Rating (Ind-Ra) believes India’s export price is likely to remain competitive in the international market and the recent decline in India’s rice export prices could attract buying from African countries, as Indian rice has become more competitive while a decline in rupee is cushioning exporters’ margins.</p>\n<p>\n\tIndian rice prices softened as rice exports from India declined in April 2018, due to a decline in the exports of basmati rice to Saudi Arabia and non-basmati rice to Bangladesh along with a subdued demand from African countries. Ind-Ra believes imports by Bangladesh are likely to reduce in 2018-2019, as its domestic output rebounds due to a crop recovery and expansion in area sown because of high prices in 2017. As a result, India’s exports could reduce by 0.5 million tonnes to 1 million tonnes.</p>\n<p>\n\tIn May 2017, Chinese authority had identified 14 rice exporters from India to be considered for its shipment to China. But registration of interested exporters started recently.</p>\n<p>\n\tMeanwhile, according to the third advance estimate for 2017 - 2018, India is set to achieve a record rice production of 111.5 million tonnes against the target of 108.5 million tonnes this year breaching its previous record of 109.7 million tonnes for 2016-2017.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "10",
        "18",
        "stringent",
        "quality"
    ],
    "verbs": [
        "export",
        "compensate",
        "Rice",
        "decline",
        "import",
        "part"
    ],
    "nouns": [
        "export",
        "10",
        "Bangladesh",
        "Rice",
        "decline",
        "importing",
        "import",
        "18",
        "duty",
        "quality",
        "part",
        "China",
        "EU"
    ]
}