{
    "creator": "Rishi Ranjan Kala",
    "title": "Call drop situation worsens in April",
    "link": "https://www.financialexpress.com/economy/call-drop-situation-worsens-in-april/1206932/",
    "pubDate": "Fri, 15 Jun 2018 04:04:01 +05:30",
    "dc:creator": "Rishi Ranjan Kala",
    "content": "The call drop situation deteriorated in April 2018 after two consecutive months – February and March – of good performance by telecom operators, the latest Trai data show. ",
    "contentSnippet": "The call drop situation deteriorated in April 2018 after two consecutive months – February and March – of good performance by telecom operators, the latest Trai data show.",
    "guid": "https://www.financialexpress.com/?p=1206932",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-14T22:34:01.000Z",
    "sentiment": {
        "score": -4,
        "comparative": -0.6666666666666666,
        "tokens": [
            "call",
            "drop",
            "situation",
            "worsens",
            "in",
            "april"
        ],
        "words": [
            "worsens",
            "drop"
        ],
        "positive": [],
        "negative": [
            "worsens",
            "drop"
        ]
    },
    "article": {
        "title": "Call drop situation worsens in April",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1206944\" src=\"https://images.financialexpress.com/2018/06/51.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/51.jpg 660w, https://images.financialexpress.com/2018/06/51-300x200.jpg 300w, https://images.financialexpress.com/2018/06/51-620x413.jpg 620w, https://images.financialexpress.com/2018/06/51-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Call drop situation worsens in April</figure>\n\t\t\t</section></div><span>\n</span><p>The call drop situation deteriorated in April 2018 after two consecutive months – February and March – of good performance by telecom operators, the latest Trai data show. During April, the call drop rate rose to 0.55% against 0.52% in March, which was the lowest in more than two years.</p><span>\n</span><p>Between April 2017 and November 2017, the call drop rate was in range of 0.68% to 0.75%. The situation was poor in Delhi, Mumbai, Uttar Pradesh and Bihar, while it was considered bad in the Andhra Pradesh, Telangana, Chennai and Tamil Nadu circles.</p><span>\n</span><p>During December 2017 to March 2018, operators ramped up their networks, installing more base transreceiver stations (BTSs), which brought the rate down from 0.71% in November 2017 to 0.52% in March 2018.</p><span>\n</span><p>Last week, the worsening call drop situation prompted telecom secretary Aruna Sundararajan to issue a warning to telecom operators. At an event in Bengaluru on June 7, Sundararajan said call drops were an important matter for the government and the ministry would take strong measures to ensure that the situation is under control.</p><span>\n</span><p>Individually, Vodafone India’s performance was the best, with its call drop rate being flat at 0.47% between February and April 2018, while the same for Bharti Airtel worsened to 0.63% in April from 0.60% in March. Idea Cellular managed to bring down its rate to 0.55% in April from 0.56% in March. Trai does not provide call drop rate for Reliance Jio.</p><span>\n</span><p>The rate is still below Trai’s quality of service (QoS) norms. The call drop rate should not exceed 2% for 90% of telecom towers of an operator in a circle area for at least 90% of days. Similarly, in the worst case or during busy hour, it must not exceed the 3% benchmark for 97% of towers in a circle for 90% of days.</p><span>\n</span><p>Analysts attribute the rise in call drops to growing demand for data, which is leading to high concurrent usage. For instance, around 400 people are using a single BTS in India against 200-300 in other countries. Also, data consumption has grown by six times, while voice usage has more than doubled. With data prices declining by around 95% in last two years to as low as `3-5 per GB, a multi-fold growth in video consumption is being witnessed.India’s data consumption is among the highest globally at around 1.3 billion GB per month, which is clogging networks, resulting in call drops and disruptions. It has more than 4.6 lakh telecom towers and around 18 lakh BTSs, while the optical fibre coverage is around 14 lakh kms.</p><span>\n</span><p>“With a mobile broadband base of around 395 million, which is growing every month, the present infrastructure is clearly not enough to sustain this rising demand and hence operators are investing in networks. Network expansion is the guiding theme for the next 12-18 months at least,” a top executive with a leading telecom operator said.</p><span>\n</span><p>Between July 2015 and February 2018, operators added around 6.66 lakh BTSs. This was in addition to 6.67 lakh BTS cells being optimised between July 2016 to December 2017.</p><span>\n</span><p>The situation is expected to get better as operators, including Bharti Airtel and Reliance Jio, have assured the government that they would be investing more than Rs 74,000 crore during FY19 in network expansion.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "consecutive",
        "two",
        "good",
        "latest"
    ],
    "verbs": [
        "March",
        "Call",
        "call",
        "drop",
        "show"
    ],
    "nouns": [
        "data",
        "March",
        "Call",
        "call",
        "drop",
        "April",
        "two",
        "February",
        "good",
        "performance",
        "latest",
        "show",
        "telecom",
        "situation"
    ]
}