{
    "title": "Nokia dials the IPL helpline, looks to establish a new identity",
    "link": "https://www.business-standard.com/article/ipl/nokia-dials-the-ipl-helpline-looks-to-establish-a-new-identity-118050400045_1.html",
    "pubDate": "Fri, 04 May 2018 07:05:00 +0530",
    "content": "With KKR's team sponsorship, Nokia has entered the IPL limelight, says brand consultant Harish Bijoor, which he says the brand has used well",
    "contentSnippet": "With KKR's team sponsorship, Nokia has entered the IPL limelight, says brand consultant Harish Bijoor, which he says the brand has used well",
    "guid": "https://www.business-standard.com/article/ipl/nokia-dials-the-ipl-helpline-looks-to-establish-a-new-identity-118050400045_1.html",
    "isoDate": "2018-05-04T01:35:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "nokia",
            "dials",
            "the",
            "ipl",
            "helpline",
            "looks",
            "to",
            "establish",
            "a",
            "new",
            "identity"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Nokia dials the IPL helpline, looks to establish a new identity",
        "content": "<div><span>\n\t\tMixing up cricket and Bollywood is a tried and tested formula for winning mass currency in the Indian market; Chinese mobile handset makers have done it with aplomb (Oppo, Vivo) as have the swarm of new start-up brands (from food to furniture to grocery delivery). Now </span><a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=nokia\" target=\"_blank\">Nokia </a><span>that has a recall hugely disproportionate to its present-day market shares is looking to play the same game, hoping that the mass frenzy and excitement whipped up by the T20 carnival will rub off on its brand too.</span><p>\n\t\tNokia’s re-entry into the Indian market is just over a year old. In a hyper-competitive market with over 200 brands, it has managed to regain three per cent share of the smartphones market within a year according to Counterpoint Research. And in feature phones, it is at fourth place with 7.3 per cent market share, after Jio, Samsung and iTel.\n\n\n</p><span>\n</span><!-- INPAGE_BANNER --><p>\n\t\tWhile the first year was about re-establishing the business, 2018 is all about going full-throttle on the promotional front. According to Ajey Mehta, country head and vice-president of HMD in India, the year is about expanding its business and reaching the masses with the message that <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=nokia\" target=\"_blank\">Nokia </a>is back in a new avatar. And that is where its re-entry into the Indian Premier League (IPL) comes into play.</p><p>\n\t\tNokia’s journey is going to get harder from here on, say experts. When it was the undisputed leader of the Indian market with 85 per cent market share it was early days for mobile telephony in the country and its identity was clearly marked out. Everyone knew what <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=nokia\" target=\"_blank\">Nokia </a>was and what it did for them, but now, given the market clutter and the big change in customer expectations, Nokia needs to define its unique identity. The brand has to separate itself from the rest of the market as well as its past, say experts.</p><p>\n\t\tNokia used to be the sponsor for <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=kolkata+knight+riders\" target=\"_blank\">Kolkata Knight Riders </a>(KKR) team till 2013. The name and product were both an instant recall for Indian consumers till 2007-08 when Apple flipped the mobile market around. Since then the brand and the market have moved a long way and hence a comeback is fraught with challenges. In fact the past year and more has seen more brands lighting up under the pressure of increased competition than coming back.</p><p>\n\t\tMehta is aware of challenges he says and adds, “In 2018, our aim is to expand our business by scaling up distribution, reach and widening our portfolio.” He acknowledges that Nokia cannot ride the Indian mass market alone. “Increasing scale will require collaboration with partners and platforms to increase visibility and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ipl\" target=\"_blank\">IPL </a>will gives us both. Also many of our new launches were lined up and coming up around the same time”, Mehta says.</p><p>\n\t\tThe magnetic pull of the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ipl\" target=\"_blank\">IPL </a>is revealed in the latest set of numbers released by TAM Sports. “Between the first match on April 7 to the thirty-first one on May 1, 117 brands across 58 categories have advertised on Star Sports 1 this year, as against 73 brands across 32 categories in the previous edition of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ipl\" target=\"_blank\">IPL </a>on Sony MAX. There is an 81 per cent rise in the count of categories and 60 per cent rise in brands advertising during IPL 11 compared to IPL 10,” the data showed.</p><p>\n\t\tWhile re-associating with IPL was on the cards, HMD wanted to move cautiously. Like its global chief marketing officer, Pekka Rentala says, the firm is focused on sustainable growth that requires cautious moves rather than knee-jerk reactions that may later prove costly. Thus before taking a final call, it evaluated many teams and zeroed in on KKR.</p><p>\n\t\t“It’s a team that has experience and high youth coefficient. The brand has the perseverance and passion to win. After evaluating all the factors we realised that <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=nokia+and+kkr\" target=\"_blank\">Nokia and KKR </a>has many similarities. Their tagline, korbo, lorbo, jitbo re, (we will fight to win) fits Nokia’s ideology”, says Mehta. The association has not come cheap however. While Mehta refused to share figures, industry sources say, a team sponsorship comes with a price tag of Rs 15-25 crore a year.</p><p>\n\t\tWith KKR’s team sponsorship, Nokia has entered the IPL limelight, says brand consultant Harish Bijoor, which he says the brand has used well. However, it is not easy even for a brand that had attained an iconic stature in the market, to regain its past glory. IPL may offer a wide audience and reach into the consumer market, but it serves only one purpose well and that is creating awareness.</p><p>\n\t\tHMD says it is pushing the two levers—product and distribution—simultaneously to push forward its branding efforts. The firm has had four successful feature phone launches since June 2017 and has managed to find a place in the top five feature phone brands in the market. It has also launched nine smartphone models and operates in a wide price band, from Rs 5,000 to Rs 49,999. It has also roped in over 500 exclusive distributors that cater to over 100,000 retail stores. Cricket, star power and high visibility and access, the brand clearly wants to corner every access route into the mind of the Indian consumer. Are customers willing to give it a second chance?</p></div>"
    },
    "adjectives": [
        "new",
        "used"
    ],
    "nouns": [
        "identity",
        "consultant",
        "brand",
        "team",
        "sponsorship",
        "limelight"
    ],
    "verbs": [
        "establish",
        "brand",
        "team"
    ]
}