{
    "title": "20 states sign MoU with govt to implement National Health Insurance scheme",
    "link": "https://www.business-standard.com/article/economy-policy/20-states-sign-mou-with-govt-to-implement-national-health-insurance-scheme-118061500041_1.html",
    "pubDate": "Fri, 15 Jun 2018 01:16:00 +0530",
    "content": "The NITI Aayog has estimated that the new health insurance scheme will cost around Rs 60 billion in the first year",
    "contentSnippet": "The NITI Aayog has estimated that the new health insurance scheme will cost around Rs 60 billion in the first year",
    "guid": "https://www.business-standard.com/article/economy-policy/20-states-sign-mou-with-govt-to-implement-national-health-insurance-scheme-118061500041_1.html",
    "isoDate": "2018-06-14T19:46:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "20",
            "states",
            "sign",
            "mou",
            "with",
            "govt",
            "to",
            "implement",
            "national",
            "health",
            "insurance",
            "scheme"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "20 states sign MoU with govt to implement National Health Insurance scheme",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tTwenty states have signed memorandums of understanding with the Centre to implement the National Health Protection Scheme (NHPS).</p>\n<p>\n\tWest Bengal, Kerala, Tamil Nadu and Delhi are some of the states that have not signed up yet. West Bengal had shown interest but had not sent any formal request, it was revealed at the health ministers’ conclave on the NHPS.</p>\n<p>\n\tTwelve states have decided to take the insurance route for payments to hospitals. These include Uttarakhand, Haryana, Nagaland, Tripura and Meghalaya.<br></p>\n<p>\n\tGujarat, Kerala, Himachal Pradesh and Tamil Nadu have decided to adopt the hybrid model where a part of the payment will be made through insurance and the rest through trusts.</p>\n<p>\n\tThe CEO of the Pradhan Mantri Rashtriya Swasthya Suraksha Yojana said Gujarat would disburse payments through insurance for claims up to Rs 50,000 and through trust for claims over that amount.<br></p>\n<p>\n\tAmong the states that are adopting this scheme, Uttar Pradesh, Haryana and Bihar do not have their own health insurance schemes and constitute 30-40 per cent of the total beneficiaries. Telangana, Andhra Pradesh and Rajasthan have their own schemes but are going with the NHPS.<br></p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/markets/from-amazon-to-westbridge-pe-firms-bet-on-insurance-due-to-stable-rules-118061301519_1.html\" target=\"_blank\">From Amazon to Westbridge, PE firms bet on insurance due to stable rules</a></strong></p>\n<p>\n\tA pilot project in Haryana has revealed that Socio-economic Caste Census (SECC) data was successful in tracing 80 per cent families in target villages.</p>\n<p>\n\tHospital providers were represented at the meeting by Apollo Hospitals Executive Chairman Preetha Reddy. This is despite the hospitals federation not being happy with rates prescribed by the government.</p>\n<p>\n\tThe NHPS will cost the exchequer Rs 120 billion. The Union government has said it will provide 60 per cent of the funds, and the state governments are expected to pool in the remaining 40 per cent.</p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/pf/you-may-have-to-pay-extra-for-health-insurance-covering-treatment-abroad-118061301491_1.html\" target=\"_blank\">You may have to pay extra for health insurance covering treatment abroad</a></strong></p>\n<p>\n\tThe NITI Aayog has estimated that the new health insurance scheme will cost around Rs 60 billion in the first year.</p>\n<p>\n\tThe calculation is based on the assumption that the premium per family will be between Rs 1,000 and Rs 1,200.</p>\n<p>\n\tThe government came up with the NHPS after it found that the Rashtriya Swasthya Bima Yojna had become redundant with many states already having schemes providing higher insurance. Under the RSBY, cover up to Rs 30,000 was provided. The health ministry’s proposal to raise the cover of Rs 100,000 did not work out as many states are allowing higher claims.<br></p>\n<p>\n\tIt is expected that the NHPS will be formally inaugurated on August 15.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "first",
        "new",
        "20",
        "billion",
        "sign",
        "National",
        "60"
    ],
    "nouns": [
        "year",
        "implement",
        "will",
        "first",
        "scheme",
        "Insurance",
        "insurance",
        "20",
        "Health",
        "health",
        "billion",
        "sign",
        "National",
        "cost",
        "60"
    ],
    "verbs": [
        "implement",
        "will",
        "scheme",
        "sign",
        "cost"
    ]
}