{
    "creator": "Rouhan Sharma",
    "title": "Jaigarh capacity will be doubled, says BVJK Sharma, Joint MD, CEO of JSW Infrastructure",
    "link": "https://www.financialexpress.com/industry/jaigarh-capacity-will-be-doubled-says-bvjk-sharma-joint-md-ceo-of-jsw-infrastructure/1200785/",
    "pubDate": "Mon, 11 Jun 2018 01:01:19 +05:30",
    "dc:creator": "Rouhan Sharma",
    "content": "JSW Infrastructure is planning a port city around its flagship Jaigarh port in Maharashtra even as it aims to increase the company’s overall cargo capacity to 200 million tonnes from the 75 million tonnes at present.",
    "contentSnippet": "JSW Infrastructure is planning a port city around its flagship Jaigarh port in Maharashtra even as it aims to increase the company’s overall cargo capacity to 200 million tonnes from the 75 million tonnes at present.",
    "guid": "https://www.financialexpress.com/?p=1200785",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-10T19:31:19.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "jaigarh",
            "capacity",
            "will",
            "be",
            "doubled",
            "says",
            "bvjk",
            "sharma",
            "joint",
            "md",
            "ceo",
            "of",
            "jsw",
            "infrastructure"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Jaigarh capacity will be doubled, says BVJK Sharma, Joint MD, CEO of JSW Infrastructure",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1200791\" src=\"https://images.financialexpress.com/2018/06/bvjk-1.jpg\" alt=\"JSW Steel,&nbsp;Competition Commission of India,&nbsp;MIEL,&nbsp;AION,&nbsp;Monnet Ispat and Energy, news on JSW steel, latest news on jsw steel\" srcset=\"https://images.financialexpress.com/2018/06/bvjk-1.jpg 660w, https://images.financialexpress.com/2018/06/bvjk-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/bvjk-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/bvjk-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Captain BVJK Sharma, Joint MD &amp; CEO.</figure>\n\t\t\t</section></div><span>\n</span><p>JSW Infrastructure is planning a port city around its flagship Jaigarh port in Maharashtra even as it aims to increase the company’s overall cargo capacity to 200 million tonnes from the 75 million tonnes at present. Captain BVJK Sharma, Joint MD &amp; CEO, outlines the company’s agenda to Rouhan Sharma.</p><span>\n</span><p><strong>Give us an update on your current operations and growth outlook.</strong></p><span>\n</span><p>We have three operating terminals, one each at Jaigarh and Dharamtar in Maharashtra and one in Goa. Our total capacity is about 75 million tonnes. At Jaigarh, we intend to take it from 40 MT to 80 MT. Goa has potential to be upped to 15 MT. At Dharamtar, we can do 40-45 MT. At the Paradip port, about 50 MT capacity is coming up. At Ennore, we would start after rail connectivity is established by next March. Overall, we want to reach 200 MT capacity and put it to use by March, 2021, probably. Our profitability should have touched Rs 2,400 crore by then.</p><span>\n</span><p>What about connectivity to your flagship Jaigarh port?</p><span>\n</span><p>Jaigarh is now connected via road. Rail and inland waterway connectivity is being built. A pipeline is already in place. We are creating capacities to host the largest ships in the world in each category of cargo. Through the pipeline route, we have potential to pump iron ore slurry, as also LPG and LNG. We will have rail-road and pipeline on the land-side and on the sea-side, we have created 30-MT capacity to receive the largest ships, including Valemax, that would bring economy of scale to users. For the container business, we are in talks with the main shipping liners.</p><span>\n</span><p><strong>What plans do you have for Jaigarh beyond capacity expansion?</strong></p><span>\n</span><p>We are in discussions with the Maharashtra Maritime Board (MMB) and the Maharashtra Industrial Development Corporation (MIDC) to develop a port city based on a cluster model. Agricultural produce such as vegetables, fruits, and cashewnuts could be brought to the city, standardised and accredited for quality. We will create good packaging and connect the producers to international buyers. There is need for such an enterprise at Jaigarh.</p><span>\n</span><p>For instance, its hinterland is known for mangoes, which take more than two weeks to reach Mumbai from where they are exported, and this is a perishable product. So, we are looking at vegetable processing, food processing, leather processing, and fish processing.</p><span>\n</span><p><strong>What connectivity infrastructure do you need to be able to handle such volumes?</strong></p><span>\n</span><p>We are working on a dry port concept, a little beyond Kolhapur and at other places to see if we can aggregate cargo at other locations and take it to Jaigarh. Road connectivity is already in place from Jaigarh to Nevali. We are asking the government to also look at Ratnagiri-Kolhapur. Our Jaigarh-Digni railway line should be ready by March, 2020. We expect the commissioning of the line to take volumes at the port to the next level.</p><span>\n</span><p><strong>Could you talk a little more about the land you need for the port city?</strong></p><span>\n</span><p>I’m told MIDC has received more than 120 applications for the land. They will decide on how best the site should be used. For us, even 100 acres would be enough. The land is available, having already been identified. But we have to wait until the process is completed.</p><span>\n</span><p><strong>What impact would the recent relaxation in Cabotage by the government have on EXIM and empty containers?</strong></p><span>\n</span><p>The repositioning cost of containers should come down. For us, Jaigarh can be a feeder because from our port, it could go to Mundra and get transshipped onto a larger vessel. The Jaigarh port needs some transshipment cargo as well as EXIM cargo.</p><span>\n</span><p>It would start with feedering because the main container liners need a threshold volume if they are to call. Port-based industries will have to come up, as also good rail connectivity. Gradually, I expect the arithmetic to change with the relaxation in Cabotage.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "present",
        "overall",
        "Joint",
        "million",
        "even",
        "doubled",
        "200",
        "port",
        "75"
    ],
    "nouns": [
        "will",
        "company",
        "increase",
        "present",
        "overall",
        "city",
        "Joint",
        "capacity",
        "planning",
        "million",
        "Infrastructure",
        "cargo",
        "even",
        "port",
        "Maharashtra",
        "CEO",
        "MD",
        "flagship"
    ],
    "verbs": [
        "will",
        "company",
        "increase",
        "present",
        "Joint",
        "even",
        "port"
    ]
}