{
    "title": "India has a $210 bn bad debt problem and offshore investors smell a chance",
    "link": "https://www.business-standard.com/article/finance/india-has-a-210-bn-bad-debt-problem-and-offshore-investors-smell-a-chance-118060400150_1.html",
    "pubDate": "Mon, 04 Jun 2018 10:44:00 +0530",
    "content": "Foreign investors see the fledgling market as big opportunity",
    "contentSnippet": "Foreign investors see the fledgling market as big opportunity",
    "guid": "https://www.business-standard.com/article/finance/india-has-a-210-bn-bad-debt-problem-and-offshore-investors-smell-a-chance-118060400150_1.html",
    "isoDate": "2018-06-04T05:14:00.000Z",
    "sentiment": {
        "score": -5,
        "comparative": -0.35714285714285715,
        "tokens": [
            "india",
            "has",
            "a",
            "210",
            "bn",
            "bad",
            "debt",
            "problem",
            "and",
            "offshore",
            "investors",
            "smell",
            "a",
            "chance"
        ],
        "words": [
            "chance",
            "problem",
            "debt",
            "bad"
        ],
        "positive": [
            "chance"
        ],
        "negative": [
            "problem",
            "debt",
            "bad"
        ]
    },
    "article": {
        "title": "India has a $210 bn bad debt problem and offshore investors smell a chance",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tIndia’s two-year-old bankruptcy law, which gives creditors more power to restructure troubled companies, is luring more and more <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=offshore+investors\" target=\"_blank\">offshore investors </a>from as far as Canada to buy the nation’s bad debt.</p>\n<p>\n\tCaisse de dépôt et placement du Québec, a Canadian pension fund manager, has made $600 million available to Edelweiss Group for investment in local distressed assets, according to R.K. Bansal, an adviser for Edelweiss Asset Reconstruction Co. Hong Kong-based SSG Capital Management Ltd. sees more opportunities in such assets, and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=foreign+funds\" target=\"_blank\">foreign funds </a>including Oaktree Capital Group LLC and Varde Partners are also keen to participate in the fledgling market.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tIndia’s banking sector is coping with about $210 billion of soured or problem loans, a legacy of a borrowing spree following the global financial crisis and an economic slowdown after that. The <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=insolvency+and+bankruptcy+code\" target=\"_blank\">Insolvency and Bankruptcy Code </a>introduced in 2016 has given rise to opportunities for funds to acquire borrowers’ distressed assets. High potential profits on those deals attract funds: SC Lowy Financial HK Ltd. expects annualized returns of about 15 percent, according to Chief Investment Officer Soo Cheon Lee.<br></p><p>\n\t\t“The change now is that there is more bad debt available to buy as many more names are in restructuring,” said Pallavi Gopinath Aney, a principal in the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=finance\" target=\"_blank\">finance </a>and projects team at Baker McKenzie Wong &amp; Leow in Singapore. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=foreign+funds\" target=\"_blank\">Foreign funds </a>see significant value in problem assets and “are willing to bring in management and expertise to run the distressed companies,” she said.</p><p>\n\t\t\tSSG Capital Management, which oversees more than $4 billion, has deployed a “significant amount of capital” in India, said the fund’s Chief Investment Officer Edwin Wong without elaborating. Its outlook on the nation remains positive, he said.</p>\n\t\t<p>\n\t\t\tSales of distressed assets from <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=banks\" target=\"_blank\">banks </a>to third-party investors jumped in the year ended March 31, according to Jamie Tadelis, co-head of sales at SC Lowy Financial in Hong Kong. “We have seen an increase in <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=fund+managers\" target=\"_blank\">fund managers </a>pivoting their efforts from other jurisdictions towards India,” he said.</p>\n\t\t<p>\n\t\t\tThe Hong Kong-based loan and bond trading firm sees India as its main market for distressed debt in Asia, SC Lowy’s Lee said in an interview in March. As a foreign financial firm, it is easier to do business in India than in China, where local partnerships are usually required, Lee said.</p>\n\t\t<p>\n\t\t\tThe introduction of the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=bankruptcy+law\" target=\"_blank\">bankruptcy law </a>has brought the benefit of debt resolutions with deadlines for foreign funds, said Aney at Baker McKenzie Wong &amp; Leow.</p>\n\t\t<p>\n\t\t\t<strong>Modi’s Goal</strong></p><p>\n\t\t\t\tIndia’s lenders are seeking to resolve about 40 of the largest troubled accounts with an outstanding debt of more than 4 trillion rupees ($60 billion) this year, in line with Prime Minister Narendra Modi’s push to get rid of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=bad+loans\" target=\"_blank\">bad loans.</a></p>\n\t\t\t<p>\n\t\t\t\tThe bad debt resolutions are already starting to spark mergers and acquisitions.</p>\n\t\t\t<p>\n\t\t\t\tTata Steel Ltd. last month said it had completed the acquisition of a controlling stake in Bhushan Steel Ltd. after debt resolution under India’s insolvency law. Local bankruptcy courts are also working on other troubled firms such as Bhushan Power &amp; Steel Ltd. and Essar Steel Ltd.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "chance",
        "Foreign",
        "bad",
        "offshore",
        "fledgling",
        "big"
    ],
    "nouns": [
        "problem",
        "India",
        "chance",
        "market",
        "smell",
        "bad",
        "debt",
        "fledgling",
        "opportunity"
    ],
    "verbs": [
        "chance",
        "market",
        "smell"
    ]
}