{
    "creator": "IANS",
    "title": "India has overcome Congress legacy, can no more use it as excuse, says NITI Aayog Vice Chairman Rajiv Kumar",
    "link": "https://www.financialexpress.com/economy/india-has-overcome-congress-legacy-can-no-more-use-it-as-excuse-says-niti-aayog-vice-chairman-rajiv-kumar/1210499/",
    "pubDate": "Mon, 18 Jun 2018 14:57:01 +05:30",
    "dc:creator": "IANS",
    "content": "Even as the ruling BJP and its senior leaders have repeatedly attacked the Congress for leaving behind a legacy of \"governance failure\", \"policy paralysis\" and \"economy in shambles\", the Central government can no more use this as an excuse and will have to take ownership of not only its accomplishments but also its failures from now on, NITI Aayog Vice Chairman Rajiv Kumar said.",
    "contentSnippet": "Even as the ruling BJP and its senior leaders have repeatedly attacked the Congress for leaving behind a legacy of \"governance failure\", \"policy paralysis\" and \"economy in shambles\", the Central government can no more use this as an excuse and will have to take ownership of not only its accomplishments but also its failures from now on, NITI Aayog Vice Chairman Rajiv Kumar said.",
    "guid": "https://www.financialexpress.com/?p=1210499",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-18T09:27:01.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.10526315789473684,
        "tokens": [
            "india",
            "has",
            "overcome",
            "congress",
            "legacy",
            "can",
            "no",
            "more",
            "use",
            "it",
            "as",
            "excuse",
            "says",
            "niti",
            "aayog",
            "vice",
            "chairman",
            "rajiv",
            "kumar"
        ],
        "words": [
            "excuse",
            "no"
        ],
        "positive": [],
        "negative": [
            "excuse",
            "no"
        ]
    },
    "article": {
        "title": "India has overcome Congress legacy, can no more use it as excuse, says NITI Aayog Vice Chairman Rajiv Kumar",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1210512\" src=\"https://images.financialexpress.com/2018/06/cats-1148.jpg\" alt=\"NITI Aayog,&nbsp;Rajiv Kumar,&nbsp;BJP,&nbsp;RERA,&nbsp;Benami Act,&nbsp;GST,&nbsp;Insolvency and Bankruptcy Code,&nbsp;Narendra Modi, arun jaitley,&nbsp;PNB scam, nirav modi\" srcset=\"https://images.financialexpress.com/2018/06/cats-1148.jpg 660w, https://images.financialexpress.com/2018/06/cats-1148-300x200.jpg 300w, https://images.financialexpress.com/2018/06/cats-1148-620x413.jpg 620w, https://images.financialexpress.com/2018/06/cats-1148-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> “Now the economy has come out of those inheritance issues. No more should they be used as an excuse for anything. Whatever happens now is the government’s own (doing) completely,” Kumar told IANS in an interview. ” (IE)</figure>\n\t\t\t</section></div><span>\n</span><p>Even as the ruling <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/bharatiya-janata-party/\">BJP</a> and its senior leaders have repeatedly attacked the <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/congress/\">Congress</a> for leaving behind a legacy of “governance failure”, “policy paralysis” and “economy in shambles”, the Central government can no more use this as an excuse and will have to take ownership of not only its accomplishments but also its failures from now on, NITI Aayog Vice Chairman Rajiv Kumar said. He said while it was necessary to look at the last four years of the <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/narendra-modi/\">Narendra Modi</a> government in the context of the legacy it inherited from the UPA regime in 2014, the economy has now overcome those issues and henceforth, the government should be judged on its own merit.</p><span>\n</span><p>“Now the economy has come out of those inheritance issues. No more should they be used as an excuse for anything. Whatever happens now is the government’s own (doing) completely,” Kumar told IANS in an interview. “After all the government has done so much despite all of it (legacy issues). It took huge structural reforms like demonetisation, GST, Insolvency and Bankruptcy Code, Benami Act, RERA and recapitalisation of banks to overcome those legacy issues. I think we have finally overcome those and henceforth, the government should be judged on its own merit,” he added.</p><span>\n</span><p>Kumar’s remarks hold significance since the Bharatiya Janata Party (BJP) and its senior leaders, including Prime Minister Narendra Modi and Union Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/arun-jaitley/\">Arun Jaitley</a> have repeatedly ripped into the Congress for leaving behind an “economy in a shambles” which the government was still bringing on track.</p><span>\n</span><p>Be it the crisis relating to non-performing assets, the Nirav Modi-linked PNB scam, the sorry state of the banking sector, the slow GDP growth rate, the fiscal deficit situation and even the rising oil prices, the BJP leaders have used every opportunity to blame it all on the legacy it inherited from the erstwhile UPA government.</p><span>\n</span><p>Even the NITI Aayog Vice Chairman has often talked about the legacy inherited by the current government and how it has affected its performance. “For a government which had inherited the most terrible economic situation and inherited a situation where there was a complete paralysis in governance and decision making, and also a situation where world economy was also not very good… given the legacy, given the world economy and given the breakdown of governance, I think this government has done very well,” Kumar said.</p><span>\n</span><p>He added that when the BJP took over in 2014, the inflation had crossed the 9 per cent mark and growth rate had slumped to below six per cent. “What (then Finance Miniser P.) Chidambaram had done was to allow the fiscal deficit to run from 2.8 at one time to as far as 6.4 per cent. From there to come to a situation where we have now achieved a growth rate of 6.7 per cent last year and 7.7 percent in the last quarter with inflation at 3.8 per cent, I think that’s just remarkable,” he said.</p><span>\n</span><p>The fiscal deficit for 2017-18 was 3.5 per cent and the government has set the target of bringing it down to 3.3 per cent in the current fiscal. The noted economist added the economy was much more balanced than it was before and had been pulled out of a crisis — a “crisis of complete private sector investment having been stopped because of the NPAs and the twin-balance sheet” problem.</p><span>\n</span><p>“Not only has this government maintained the macro-economic balance and brought back growth on its track but along with it, it has made the economy far more cleaner and much more formalised, while also doing a lot to improve inclusion,” he said.</p><span>\n</span><p>Asked if there are any areas where the government could have performed better, Kumar responded: “One clear role which the government has recognised is farmer’s income. I think this focus has now been brought into the budget. The agriculture sector remains a backward sector and it requires a lot of reforms.”</p><span>\n</span><p>He added that performance in export sector was a cause of concern while the water sector, which was turning into a crisis situation, was another area which needed attention along with the quality of education. “These are chronic issues. They take time to be figured out. But the credit should be given to the government that they have recognised these problems and is not trying to hide them or brush them under the carpet. Also they are trying new approaches to improve the performance like ranking states on education quality, water conservation, health,” Kumar said.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "senior",
        "no",
        "Even",
        "ruling",
        "behind",
        "Central"
    ],
    "nouns": [
        "governance",
        "government",
        "will",
        "senior",
        "India",
        "Congress",
        "no",
        "legacy",
        "use",
        "excuse",
        "Vice",
        "Chairman",
        "Even",
        "ruling",
        "leaders",
        "leaving",
        "behind",
        "failure",
        "policy",
        "paralysis",
        "economy",
        "shambles",
        "Central",
        "ownership"
    ],
    "verbs": [
        "will",
        "overcome",
        "use",
        "excuse",
        "Chairman",
        "Even"
    ]
}