{
    "creator": "PTI",
    "title": "Coming years challenging for banks, need to look beyond NPAs, says State Bank of India",
    "link": "https://www.financialexpress.com/industry/banking-finance/coming-years-challenging-for-banks-need-to-look-beyond-npas-says-state-bank-of-india/1202131/",
    "pubDate": "Mon, 11 Jun 2018 21:55:10 +05:30",
    "dc:creator": "PTI",
    "content": "Terming the year gone by \"an exceptional year\" in many ways, SBI said the future strategy of the bank has to be clearly articulated and executed. ",
    "contentSnippet": "Terming the year gone by \"an exceptional year\" in many ways, SBI said the future strategy of the bank has to be clearly articulated and executed.",
    "guid": "https://www.financialexpress.com/?p=1202131",
    "categories": [
        "Banking & Finance",
        "Industry"
    ],
    "isoDate": "2018-06-11T16:25:10.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "coming",
            "years",
            "challenging",
            "for",
            "banks",
            "need",
            "to",
            "look",
            "beyond",
            "npas",
            "says",
            "state",
            "bank",
            "of",
            "india"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Coming years challenging for banks, need to look beyond NPAs, says State Bank of India",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1202135\" src=\"https://images.financialexpress.com/2018/06/SBI-620x413.jpg\" alt=\"SBI, state bank of india, NPA, bank structure, CRWA \" srcset=\"https://images.financialexpress.com/2018/06/SBI-620x413.jpg 620w, https://images.financialexpress.com/2018/06/SBI-620x413-300x200.jpg 300w, https://images.financialexpress.com/2018/06/SBI-620x413-401x267.jpg 401w\" sizes=\"(max-width: 620px) 100vw, 620px\"> The coming years will be very challenging for banks which will have to look beyond the bad loan resolution and address pressing issues such as frauds, cyber security and governance, SBI has said.</figure>\n\t\t\t</section></div><span>\n</span><p>The coming years will be very challenging for banks which will have to look beyond the bad loan resolution and address pressing issues such as frauds, cyber security and governance, SBI has said. The operating environment has become increasingly complex, the state-owned bank said in its Annual Report 2017-18. Resolution of stressed assets has progressed satisfactorily and the final outcome will take some more time to reflect in the profit and loss (P&amp;L), it said, adding that this delay is mainly because new laws take some time to mature in practice, . “The coming years will be very challenging for the banking system as a whole,” said the country’s largest lender.</p><span>\n</span><p>“The structural transformation of banks must move beyond the non-performing asset (NPA) resolution and address other pressing issues, such as frauds, customer retention and servicing , human resource, cyber security and governance,” it added. Of all the 21 public sector banks (PSBs), 19 have registered a staggering loss of Rs 87,300 crore in 2017-18, topped by scam-hit Punjab National Bank (PNB) which posted a net loss of nearly Rs 12,283 crore during the year. Indian Bank and Vijaya Bank were the only two PSBs which made profits. SBI said the policy initiatives over the last four years have gathered momentum with far reaching structural transformation in all sectors and banks are unlikely to remain untouched by these changes.</p><span>\n</span><p>With capital infusion in PSBs, it will be up to them how they grab the opportunity and deploy technology to address some of these pressing issues, the SBI report said. As on March 31, 2018, the gross NPAs of SBI increased to Rs 2,23,427 crore (10.91 per cent of the gross advances), from Rs 1,77,866 crore (9.11 per cent) by end-March 2017. The net NPAs or bad loans grew to Rs 1,10,855 crore (5.73 per cent) from Rs 96,978 crore (5.19 per cent). The largest lender of the country suffered a net loss of Rs 6,547.45 crore in 2017-18, as against a net profit of Rs 10,484.1 crore in the preceding fiscal.</p><span>\n</span><p>“The year 2017-18 was a difficult year as far as net profits are concerned. The main contributing factors being increase in loan loss provisions, mark to market losses on government securities and provisions and payments to employees,” Chairman Rajnish Kumar said in the report. The banking environment remained eventful in 2017-18 as asset quality, resolution of stressed assets and muted credit growth in fist half continued as major challenges for most banks. “Higher NPAs impacted interest income adversely and led to elevated provisions, thus putting pressure on the profitability of banks. Further, some PSBs have been put under the Prompt Corrective Action (PCA) framework of <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a>, which puts restrictions on key areas viz. dividend payment, branch expansion..,” the report said.</p><span>\n</span><p>The external environment has also become more uncertain, despite a positive outlook on growth, it said, adding that trade wars have become more acute and the situation will continue in 2018 in the same direction. So, the banks across the world have revisited their foreign business strategy in line with growing risks, it said. “Such cautions prevails among Indian banks as well. The government has advised banks to rationalise their foreign branches. However, this does not constitute a blanket withdrawal but a more realistic strategy in line with changing trade patterns of the country. This rationalisation in foreign business will therefore continue,” SBI said.</p><span>\n</span><p>Terming the year gone by “an exceptional year” in many ways, SBI said the future strategy of the bank has to be clearly articulated and executed. It said that in the next two years the bank will adopt a strategy that will achieve a healthy credit growth of 10-12 per cent by 2020. The lender plans to take a two-pronged strategy of portfolio reordering to reduce its Credit Risk Weighted Assets (CRWA) to total advances ratio and internal reorganisation of the corporate banking. “Revamping of corporate credit structure and system within the bank will proceed on such lines that will widen the universe of clients and focus on new segments.</p><span>\n</span><p>The Corporate Accounts Group (CAG) will focus on high priority and quality individual &amp; group relationships and the concept of Group relationship coordinators will be introduced.” Besides, the credit risk management function will also be strengthened by on-boarding sector specialists and improving due diligence. “Drawing lessons from the experiences in the banking industry during the last year, the Bank has further strengthened the overall internal audit and control process. Human Resource (HR) issues need a fresh look as usage of advanced digital technology such as Artificial Intelligence (AI) and big data increases within the bank,” SBI said.</p><span>\n</span><p>Also, given the pace of retirements in the next five years, it is important to put in place a robust plan of succession. “Potential leaders will be identified and mentored through customised training programmes to create a strong leadership pipeline. Some of these works are already in progress and concrete action plan will be implemented in the next two years,” said the report. As per the report, the Chairman and Managing Director Rajnish Kumar, who was elevated to the post from October 7, 2017, drew a gross salary of Rs 14,25,594.10 by March 31, 2018 as the new chairman. Ex-chairperson, Arundhati Bhattacharya, took home a gross salary of Rs 14,69,975.81. She retired from the post on October 6, 2017.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "Coming",
        "challenging",
        "gone",
        "exceptional",
        "future",
        "articulated",
        "executed"
    ],
    "nouns": [
        "banks",
        "Bank",
        "bank",
        "India",
        "Coming",
        "years",
        "year",
        "need",
        "look",
        "State",
        "ways",
        "future",
        "strategy"
    ],
    "verbs": [
        "Bank",
        "bank",
        "need",
        "look",
        "State"
    ]
}