{
    "creator": "PTI",
    "title": "Wait! Did Arun Jaitley just say he will not cut taxes on petrol, diesel prices?",
    "link": "https://www.financialexpress.com/market/commodities/no-immediate-relief-from-high-petrol-diesel-prices-arun-jaitley-says-pay-taxes-honestly/1210478/",
    "pubDate": "Mon, 18 Jun 2018 14:48:56 +05:30",
    "dc:creator": "PTI",
    "content": "Union Minister Arun Jaitley today urged citizens to pay their due share of taxes \"honestly\" to reduce dependence on oil as a revenue source, and virtually ruled out any cut in excise duty on petrol and diesel saying it could prove to be counter-productive.",
    "contentSnippet": "Union Minister Arun Jaitley today urged citizens to pay their due share of taxes \"honestly\" to reduce dependence on oil as a revenue source, and virtually ruled out any cut in excise duty on petrol and diesel saying it could prove to be counter-productive.",
    "guid": "https://www.financialexpress.com/?p=1210478",
    "categories": [
        "Commodities",
        "Market"
    ],
    "isoDate": "2018-06-18T09:18:56.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.06666666666666667,
        "tokens": [
            "wait",
            "did",
            "arun",
            "jaitley",
            "just",
            "say",
            "he",
            "will",
            "not",
            "cut",
            "taxes",
            "on",
            "petrol",
            "diesel",
            "prices?"
        ],
        "words": [
            "cut"
        ],
        "positive": [
            "cut"
        ],
        "negative": []
    },
    "article": {
        "title": "Wait! Did Arun Jaitley just say he will not cut taxes on petrol, diesel prices?",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"wp-image-1210506 size-full\" src=\"https://images.financialexpress.com/2018/06/Arun-Jaitley-PTI.jpg\" alt=\"Without naming Chidambaram, Arun Jaitley noted that the &quot;distinguished predecessor&quot; had &quot;never endeavoured to do so himself.&quot;\" srcset=\"https://images.financialexpress.com/2018/06/Arun-Jaitley-PTI.jpg 660w, https://images.financialexpress.com/2018/06/Arun-Jaitley-PTI-300x200.jpg 300w, https://images.financialexpress.com/2018/06/Arun-Jaitley-PTI-620x413.jpg 620w, https://images.financialexpress.com/2018/06/Arun-Jaitley-PTI-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> In an apparent dig at senior Congress leader P Chidambaram’s remark that tax on oil should be cut by Rs 25 per litre, Arun Jaitley retorted “this is a ‘trap’ suggestion”. (Image: PTI)</figure>\n\t\t\t</section></div><span>\n</span><p>Union Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/arun-jaitley/\">Arun Jaitley</a> today urged citizens to pay their due share of taxes “honestly” to reduce dependence on oil as a revenue source, and virtually ruled out any cut in excise duty on petrol and diesel saying it could prove to be counter-productive. While salaried class pay their due share of taxes, Jaitley said “most other sections” have to improve their tax payment record, which is keeping India “far from being a tax-compliant society”.</p><span>\n</span><p>“My earnest appeal, therefore, to political leaders and opinion makers …would be that evasion in the non-oil tax category must be stopped and, if people pay their taxes honestly, the high dependence on oil products for taxation eventually comes down. In the medium and long run, upsetting the fiscal maths can prove counter-productive,” Jaitley said.</p><span>\n</span><p>In a facebook post titled ‘The Economy and the Markets Reward Structural Reforms and Fiscal Prudence’, Jaitley said in last four years, central government’s tax-GDP ratio has improved from 10 per cent to 11.5 per cent. Almost half of this, 0.72 per cent of GDP, accounts for an increase in non-oil tax-GDP ratio. The level of non-oil taxes to GDP at 9.8 per cent in 2017-18 is the highest since 2007-08 – a year in which our revenue position was boosted by buoyant international environment, he said.</p><span>\n</span><p>“This government has established a very strong reputation for fiscal prudence and macro-economically responsible behaviour. We know what happened during the Taper Tantrum of 2013. Fiscal indiscipline can lead to borrowing more and obviously increase the cost of debt. “Reliefs to consumers can only be given by a fiscally responsible and a financially sound central government, and the states which are earning extra due to abnormal increase in oil prices,” Jaitley said.</p><span>\n</span><p>In an apparent dig at senior <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/congress/\">Congress</a> leader <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/p-chidambaram/\">P Chidambaram</a>’s remark that tax on oil should be cut by Rs 25 per litre, Jaitley retorted “this is a ‘trap’ suggestion”. Without naming Chidambaram, Jaitley noted that the “distinguished predecessor” had “never endeavoured to do so himself.” “It is intended to push India into an unmanageable debt – something which the UPA government left as its legacy. We must remember that the economy and the markets reward structural reforms, fiscal prudence, and macro-economic stability.</p><span>\n</span><p>“They punish fiscal indiscipline and irresponsibility. The transformation from UPA’s “policy paralysis” to the NDA’s “fastest growing economy” conclusively demonstrates this. The government is aspiring to improve the tax-GDP ratio,” Jaitley said.<br>Chidambaram had last week claimed that it was possible for the centre to cut tax by up to Rs 25 per litre on petrol prices but the Modi-government will not do so. As per government estimates, every rupee cut in excise duty on petrol and diesel will result in a revenue loss of about Rs 13,000 crore.</p><span>\n</span><p>The price of Indian basket of crude surged from USD 66 a barrel in April to around USD 74 currently. Jaitley said despite higher compliances in new system, as far as the non-oil taxes are concerned, India is still far from being a tax complaint society.&nbsp; “Salaried employees is one category of tax compliant assessees. Most other sections still have to improve their track record. The effort for next few years has to be to replicate the last four years and improve India’s tax to GDP ratio by another 1.5 per cent.</p><span>\n</span><p>“The increase must come from the non-oil segment since there is scope for improvement,” he said. These additions, Jaitley said, have to come by more and more people performing their patriotic duty of paying the non-oil taxes to the State.<br>“The tragedy of the honest tax payer is that he not only pays his own share of taxes but also has to compensate for the evader,” he said.</p><span>\n</span><p>Jaitley said the central government collects taxes in the form of income tax, its own share of GST and the customs duty. 42 per cent of the central government taxes are shared with the states.&nbsp; State governments collect their 50 per cent from GST besides their local taxes. These are independent of taxes on petroleum products. The states charge ad valorem taxes on oil. If oil prices go up, states earn more, he said.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "counter",
        "productive",
        "Union",
        "ruled",
        "just",
        "cut",
        "due"
    ],
    "nouns": [
        "will",
        "say",
        "saying",
        "counter",
        "Minister",
        "diesel",
        "today",
        "share",
        "Union",
        "revenue",
        "cut",
        "petrol",
        "due",
        "dependence",
        "Wait",
        "pay",
        "oil",
        "source",
        "excise",
        "duty"
    ],
    "verbs": [
        "will",
        "say",
        "counter",
        "Minister",
        "share",
        "prove",
        "Wait",
        "cut",
        "pay",
        "reduce",
        "oil",
        "source",
        "excise"
    ]
}