{
    "title": "Jan Dhan Yojana success: Put women at forefront for better, stronger ‘banking for all’",
    "link": "https://www.financialexpress.com/economy/jan-dhan-yojana-success-put-women-at-forefront-for-better-stronger-banking-for-all/1210684/",
    "pubDate": "Mon, 18 Jun 2018 17:01:58 +05:30",
    "content": "Pradhan Mantri Jan Dhan Yojana (PMJDY) was initiated as a national mission for financial inclusion in India, encompassing an integrated approach to bring about the comprehensive financial inclusion of all the households in the country. ",
    "contentSnippet": "Pradhan Mantri Jan Dhan Yojana (PMJDY) was initiated as a national mission for financial inclusion in India, encompassing an integrated approach to bring about the comprehensive financial inclusion of all the households in the country.",
    "guid": "https://www.financialexpress.com/?p=1210684",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-18T11:31:58.000Z",
    "sentiment": {
        "score": 7,
        "comparative": 0.5,
        "tokens": [
            "jan",
            "dhan",
            "yojana",
            "success",
            "put",
            "women",
            "at",
            "forefront",
            "for",
            "better",
            "stronger",
            "‘banking",
            "for",
            "all’"
        ],
        "words": [
            "stronger",
            "better",
            "forefront",
            "success"
        ],
        "positive": [
            "stronger",
            "better",
            "forefront",
            "success"
        ],
        "negative": []
    },
    "article": {
        "title": "Jan Dhan Yojana success: Put women at forefront for better, stronger ‘banking for all’",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1210716\" src=\"https://images.financialexpress.com/2018/06/jan-dhan-women-pti.jpg\" alt=\"Jan Dhan Yojana success: Put women at forefront for better, stronger 'banking for all'\" srcset=\"https://images.financialexpress.com/2018/06/jan-dhan-women-pti.jpg 660w, https://images.financialexpress.com/2018/06/jan-dhan-women-pti-300x200.jpg 300w, https://images.financialexpress.com/2018/06/jan-dhan-women-pti-620x413.jpg 620w, https://images.financialexpress.com/2018/06/jan-dhan-women-pti-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The PMJDY enabled the citizens with universal access to banking facilities with at least one basic banking account for every household. (Image: PTI)</figure>\n\t\t\t</section></div><span>\n</span><p><strong>Kalpesh J Mehta</strong></p><span>\n</span><p>The objective of Pradhan Mantra Jan Dhan Yojana (PMJDY) was to bring Indian citizens under the financial inclusion program. Currently, the mission is progressing with the aim to be a part of transformation&nbsp;which has been promised to all. While the future of the banking sector is growing increasingly digital, it ensures that these innovations are used to expand the connect with a larger number of people who were either not covered or fully covered.</p><span>\n</span><p>Rural India has always been India’s biggest strength, with 60% of the population. A combination of policy or regulatory initiative has brought forth disruption in the payments landscape. There are a collective set of mandates, which has been initiated and these have made headway in the recent years, moving the field of financial inclusion forward, which include: priority sector lending, branch opening, credit expansion, Pradhan Mantri Jan-Dhan Yojana (PMJDY), Mudra Scheme (for small loans), small finance banks, payment banks, etc. Alternately, the market-based approach holds promise to break the cycle of financial distress. For instance, “Base of Pyramid (BoP) Sourcing”, as a market approach, has been contemplated as a strong solution to poverty and growth in the economy, through an increase in money cycle and eventually capital available for expansion.</p><span>\n</span><p>The progress report of PMJDY claims 316 million beneficiaries. As informed by banks, as on 28.2.2018, 31.20 crore accounts have been opened under Pradhan Mantri Jan-Dhan Yojana (PMJDY), and of these, 25.18 crore (81%) Jan Dhan accounts are operative.</p><span>\n</span><p>The PMJDY enabled the citizens with universal access to banking facilities with at least one basic banking account for every household, financial literacy, access to credit, insurance and pension facility. With Rs 30,000 to be provided as life insurance cover for all the first time bank account holders. It not only paved the way for financial access, but also channelize all the government benefits (from Center / State / Local Body) to the beneficiary’s accounts.</p><span>\n</span><p>The Direct Benefit Transfer (DBT) has helped remove multiple layers of intermediaries for a smooth flow of benefits with least leakages and pilferages. Overall it improved the financial access significantly. The last mile access, was a major challenge to ensure that benefits, such as subsidies reach the citizens at the appropriate time. Unprecedented penetration of mobile phones provided the opportunity for the last mile and last man delivery of benefits eliminating multiple mid-channel layers and empower citizens directly using technology.</p><span>\n</span><p>Pradhan Mantri Jan Dhan Yojana (PMJDY) was initiated as a national mission for financial inclusion in India, encompassing an integrated approach to bring about the comprehensive financial inclusion of all the households in the country. The Jan Dhan Aadhaar Mobile (JAM) Number Trinity referred to as a “game-changing reform” has become the zest of the season. An attempt and considerable progress have been made.</p><span>\n</span><p>However, we need to comprehend that in a vastly populated country like India, for such considerable reforms to take place, it takes time and push. The first phase was successful, but in order to ensure there is sustained momentum and progress to include everybody in the realm of formal financial arena and to include the underserved and unserved, there has to be an extensive effort. This will require improvement in both physical and digital connectivity and enhanced technology.</p><span>\n</span><p>While awareness in the financial literacy has a key role to play, simultaneously strengthening infrastructure and removing gender disparity by empowering more women at the forefront will have a strong role in making the progress and paving the way forward for better and stronger implementation, of ‘Banking- financial services’, for all.</p><span>\n</span><p><strong><em>Kalpesh J Mehta is a Partner at Deloitte India. Views expressed are the author’s own.</em></strong></p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "comprehensive",
        "integrated",
        "financial",
        "better",
        "national",
        "encompassing"
    ],
    "nouns": [
        "India",
        "comprehensive",
        "country",
        "inclusion",
        "banking",
        "approach",
        "Jan",
        "success",
        "Put",
        "forefront",
        "better",
        "national",
        "mission"
    ],
    "verbs": [
        "bring",
        "approach",
        "Put",
        "better"
    ]
}