{
    "title": "How much do you need for retirement?",
    "link": "https://timesofindia.indiatimes.com/business/india-business/how-much-do-you-need-for-retirement/articleshow/64632481.cms",
    "pubDate": "Mon, 18 Jun 2018 09:07:24 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/how-much-do-you-need-for-retirement/articleshow/64632481.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64632481.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/how-much-do-you-need-for-retirement/articleshow/64632481.cms",
    "isoDate": "2018-06-18T09:07:24.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "how",
            "much",
            "do",
            "you",
            "need",
            "for",
            "retirement?"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "How much do you need for retirement?",
        "content": "<div class=\"Normal\"><p>NEW DELHI: When a US-based financial portal recently suggested that one should have saved twice his annual salary by the age of 35, it got mocked on social media.\n\n</p><p>“I think what you meant to say was, by 35 you should have debt twice your annual salary.”\n</p><p>“I’ve done the math, and I can retire about 10 years after I die, if nothing else happens.”\n</p><p>“When did my mom start writing articles...”\n</p><span>The sarcastic responses to the article evoked much mirth, but missed the key point: If the figure seems unattainable, the problem could lie more with one’s savings and spending patterns rather than the target itself. We reached out to financial planners to understand how much Indians need to save at various ages to ensure a comfortable </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/retirement\">retirement</a><p>.\n</p><p>First, a caveat: the exercise to determine final retirement corpus —and the ideal savings at various life-stages—will have to be tailor-made for each individual, taking various expenses, dependents’ needs, goals and other requirements into account. “Even post-retirement goals will vary—some may decide to lead a frugal life while others will have international travel plans, for instance. So while thumb rules can be seen as guide posts, they cannot be treated as gospel,” says certified financial planner Gaurav Mashruwala.\n</p><p>It will also vary as per the individual’s financial discipline. “For instance, a 25-year old who allocates 5% of her income towards retirement since her first job and continues to do so will not have to hike her savings as a percentage of income for retirement significantly later,” says financial planner Suresh Sadagopan, Founder, Ladder7 Financial Advisories. This is because a decent corpus would have been built over time with the power of compounding kicking in. “But another person who has not made much effort to save for retirement will need to start saving aggressively in the forties,” he adds.\n</p><span>\n</span><strong>The young and restless</strong><span>The pleasure Twitterati derived out of ridiculing the </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/retirement-savings\">retirement savings</a><p> piece seems to reinforce the unflattering perception about millennials—those born after the year 1980 and broadly, youngsters—as a generation bred on a diet of consumerism with little appetite for savings. Given that many in this generation maintain an expensive lifestyle dotted with gadgets, eating out, rent, education loan EMIs and sundry living expenses, retirement planning is generally not high on their agenda. Even for the prudent ones, retirement, understandably, seems years away and imminent goals like buying a house or a car or saving for a lavish wedding are likely to command a larger share of savings in the initial working years.\n</p><p>So, realistically speaking, how much should the younger lot allocate towards their retirement goals? “You should start with saving a particular portion of your salary rather than targeting a figure of say double your salary at a particular age,” says Sadagopan. “A good ballpark figure for a 25-year old individual is 5%. They should look to save at least 5% of their income specifically for retirement.” The period for which your savings stay invested is more important than the actual amount saved. “The key is to start early, even if it means saving and investing small amounts,” says Amar Pandit, Founder, HappynessFactory. Even small amounts can add huge value to your final retirement corpus thanks to the power of compounding.\n</p><span>\n</span><strong>The middle years</strong><p>This is the age when responsibilities start piling up, putting tremendous pressure on finances. Those between 35-45 years of age may be relatively better at withstanding peer pressure to maintain an expensive lifestyle, but there are other needs and goals that make demands on ₹ the income, pushing retirement down the priority list. “You can start with saving 20% of the income, and gradually increase savings to 40-50%, based on your overall financial situation,” says Pandit. Sadagopan feels that those around 35 years of age you should look to allocate at least 10% of their income towards retirement. “From 5% at the age of 25, the savings rate should go up to 10% by the time a person turns 35. You should maintain this retirement savings level till the age of 50,” he says. This does not include the mandatory contribution of the employee and employer to the provident fund.\n</p><span>Why only 10% despite the increments that are bound to inflate the income at this stage? The answer lies in the multitude of responsibilities that corner a huge share of the savings – home loan and car loan EMIs, tax liability, children’s school fees, investment for their higher education, parents’ medical expenses and so on. Moreover, there will be expenses related to vacations, life and health insurance premiums and so on. “Assuming the potential for savings is 30% of income, the balance after retirement corpus would go towards funding these goals. Allocating more than 10% of the income towards retirement will be difficult at this stage due to the number of goals that need attention,” says Sadagopan, explaining the rationale behind the modest savings rate (See graphic).\n</span><br><span>\n</span><br><span>\n</span><div class=\"image\" data-msid=\"64632591\"><img src=\"https://timesofindia.indiatimes.com/img/64632591/Master.jpg\" alt=\"Retirement graph\"></div><span> \n</span><br><span>\n</span><br><span>Creating buckets of various goals and starting dedicated SIPs in large cap or diversified equity funds for each would be the ideal approach towards navigating the maze during this lifestage. Do remember, however, that every individual’s retirement plan would be different. “Every individual has unique goals and needs. Hence even the investment plan needs to be customised accordingly, rather than be based on a benchmark,” says Pandit. However, one rule is applicable for everyone: Once you start with a plan, stick to it. Abandoning it midway will set your retirement planning back by several years.\n</span><br><span>\n</span><br><span>\n</span><strong>Retirement on the radar</strong><span>\n</span><br><span>\n</span><p>Closer to retirement, it is reasonable to expect responsibilities related to children’s education to be out of the way, leaving more for retirement savings. However, again, this would vary from person to person. “Many individuals who entered parenthood in their late 30s or early 40s are likely to shoulder children’s education responsibilities closer to retirement or even after that,” says Sadagopan. He recommends a retirement savings rate of at least 15% once you cross 50 years. This rate should be adhered to until retirement. “This should ensure a decent retirement corpus to see a couple off in reasonable comfort in their retirement years,” he adds.\n</p><span>\n</span></div>"
    },
    "adjectives": [
        "10",
        "left",
        "top",
        "right"
    ],
    "nouns": [
        "india",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo",
        "retirement",
        "need"
    ],
    "verbs": [
        "border",
        "align",
        "style",
        "top",
        "right",
        "need"
    ]
}