{
    "creator": "Bloomberg",
    "title": "Brokerages seek tax easing, easier customer ID rules for offshore funds to trade in Gujarat’s Gift City",
    "link": "https://www.financialexpress.com/market/brokerages-seek-tax-easing-easier-customer-id-rules-for-offshore-funds-to-trade-in-gujarats-gift-city/1210091/",
    "pubDate": "Mon, 18 Jun 2018 10:05:29 +05:30",
    "dc:creator": "Bloomberg",
    "content": "Brokerages representing offshore investors are asking for more concessions to trade in India’s nascent international financial hub in Gujarat, according to people with knowledge of the matter. ",
    "contentSnippet": "Brokerages representing offshore investors are asking for more concessions to trade in India’s nascent international financial hub in Gujarat, according to people with knowledge of the matter.",
    "guid": "https://www.financialexpress.com/?p=1210091",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-18T04:35:29.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.125,
        "tokens": [
            "brokerages",
            "seek",
            "tax",
            "easing",
            "easier",
            "customer",
            "id",
            "rules",
            "for",
            "offshore",
            "funds",
            "to",
            "trade",
            "in gujarat’s",
            "gift",
            "city"
        ],
        "words": [
            "gift"
        ],
        "positive": [
            "gift"
        ],
        "negative": []
    },
    "article": {
        "title": "Brokerages seek tax easing, easier customer ID rules for offshore funds to trade in Gujarat’s Gift City",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><span>\n</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-688062\" src=\"https://images.financialexpress.com/2017/05/FE-GIFT1.jpg\" alt=\"Gujarat, Gujarat International Finance Tec-CIty, GIFT City, Banking, Insurance, Capital market services\" srcset=\"https://images.financialexpress.com/2017/05/FE-GIFT1.jpg 660w, https://images.financialexpress.com/2017/05/FE-GIFT1-300x200.jpg 300w, https://images.financialexpress.com/2017/05/FE-GIFT1-620x413.jpg 620w, https://images.financialexpress.com/2017/05/FE-GIFT1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Brokerages representing offshore investors are asking for more concessions to trade in India’s Gift City. (Image: Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>Brokerages representing offshore investors are asking for more concessions to trade in India’s nascent international financial hub in Gujarat, according to people with knowledge of the matter. The brokers, who transact on behalf of overseas funds, are seeking the same exemption from local taxes enjoyed by foreign funds in the Gujarat bourse, said the people, who asked not to be identified as the discussions are private.</p><span>\n</span><p>They also want Indian authorities to have easier customer identification rules, the people said. The Futures Industry Association is expected to write to India’s securities regulator to voice the concerns of the brokerages and their clients, they said.</p><span>\n</span><p>The National Stock Exchange of India Ltd. is trying to woo foreign investors to trade at venues in Gujarat’s Gift City after a fight with Singapore Exchange Ltd. left traders scrambling to find new ways to manage their exposure Indian stocks. A months-long quarrel between the two exchanges over data and licensing rights escalated last month when NSE sued to stop SGX from launching derivatives based on Indian stocks.</p><span>\n</span><p>Finance firms setting up units in Gift City are exempt from paying capital gains and transaction taxes in line with a similar Chinese zone called Qianhai in Shenzhen. Foreign brokers, who have no physical presence in Gift but trade on behalf of offshore investors, also want the tax exemptions, the people said. “We expect the tax authorities to allow all classes of foreign investors as well as the foreign omnibus brokers to get the tax exemptions,” Ravi Varanasi, chief business development officer at NSE, said by phone.</p><span>\n</span><p><strong>Customer ID</strong></p><span>\n</span><p>Offshore funds also want simpler customer identification norms that can protect client confidentiality, the people said. Sebi’s proposed customer identification rules ask for passport, photos and other personal details to check the authenticity of the beneficial owners of a foreign fund. These rules are more revealing than other Asian markets like Singapore, Hong Kong and Dubai. Varanasi said the regulator may just accept the legal entity identifiers for the offshore investor and not ask for other identification documents.</p><span>\n</span><p>The Futures Industry Association is expected to write to the exchanges and the regulator based on feedback from their broker members, the people said. The association is also planning to meet the regulator and the government in August to sort out issues regarding taxation and id.</p><span>\n</span><p>A fight between Singapore Exchange and NSE over derivatives contracts broke into the open in February after NSE said it was axing licensing agreements with overseas bourses as part of a broader effort by Asian nations to keep control of capital while integrating into the global financial system. A spokesman for Sebi didn’t respond to an email seeking comment.</p><span>\n</span><p>An arbitrator deciding on a quarrel between the exchanges ordered them to extend their licensing agreement beyond August, and for at least two months after the end of arbitration, SGX said in a statement Saturday. SGX was ordered to refrain from offering new India equity derivatives products such as those announced on April 11. Hearings on evidence in the case are expected to start in early 2019, according to the statement.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "according",
        "offshore",
        "nascent",
        "international",
        "financial"
    ],
    "verbs": [
        "trade",
        "seek",
        "tax",
        "Gift",
        "people",
        "matter"
    ],
    "nouns": [
        "India",
        "trade",
        "seek",
        "tax",
        "easing",
        "customer",
        "ID",
        "funds",
        "Gujarat",
        "City",
        "asking",
        "international",
        "hub",
        "people",
        "matter",
        "Gift",
        "knowledge"
    ]
}