{
    "title": "Smiley Company looks to cash in on the ubiquity of its trademark emoji",
    "link": "https://www.business-standard.com/article/companies/smiley-company-looks-to-cash-in-on-the-ubiquity-of-its-trademark-emoji-118040901215_1.html",
    "pubDate": "Mon, 09 Apr 2018 21:59:00 +0530",
    "content": "Can Smiley Company rise above its generic status in the Indian market?",
    "contentSnippet": "Can Smiley Company rise above its generic status in the Indian market?",
    "guid": "https://www.business-standard.com/article/companies/smiley-company-looks-to-cash-in-on-the-ubiquity-of-its-trademark-emoji-118040901215_1.html",
    "isoDate": "2018-04-09T16:29:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "smiley",
            "company",
            "looks",
            "to",
            "cash",
            "in",
            "on",
            "the",
            "ubiquity",
            "of",
            "its",
            "trademark",
            "emoji"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Smiley Company looks to cash in on the ubiquity of its trademark emoji",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tWhen <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=pepsico\" target=\"_blank\">PepsiCo </a>launched its global campaign, ‘<em>jaisa mood, waisi Pepsi</em>’ (A <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=pepsi\" target=\"_blank\">Pepsi </a>for every mood) in India two years ago, it was the first time that the Smiley emoji made its transition (legally) from the phone screen to a product on a shop shelf and; from the sphere of personal communication into the brand lexicon in the country. Now as The <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=smiley+company\" target=\"_blank\">Smiley Company </a> brings its licensing business that spans the globe with a 100 <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=companies\" target=\"_blank\">companies </a>on its licensee list into India, the challenge will be turning the universally popular symbol of happiness into a valued brand?</p>\n<p>\n\tRun by the father-son duo Franklin, President and Nicolas Loufrani, CEO of The Smiley Company, the French firm has been in the business of branding happiness for close to 45 years. For the Indian market, it has teamed with Dream Theatre and the two plan to draw up a shortlist of Indianised licensing and merchandise (L&amp;M) applications for the brand, from food and beverage to consumer goods to daily-use accessories and objects. Fashion that forms the biggest component of its L&amp;M revenues globally will require a more cautious approach in India, the company says.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe company is determined not to adopt a one-size-fits-all approach. Globally, fashion/lifestyle accounts for the lion’s share of the Smiley Company’s revenues. But in India it may well be a different story. “We see FMCG (fast-moving consumer goods) driving volumes in India while fashion/lifestyle will be much higher in terms of value,” Nicholas Loufrani says. The reason: India is a price sensitive market and  products with a smaller ticket size sell faster.</p>\n<p>\n\tThe Indian L&amp;M market is still in its nascent stages. According to a report by ESP Properties on the growth and potential of entertainment marketing, India’s share in the global licensing market is 5-7 per cent, but expected to grow at 7.4 per cent, which is higher than the growth in USA, Canada and UK combined. The global industry is massively dominated by the US and Canada, which collectively account for 57.7 per cent of global sales.</p>\n<p>\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=smiley+company\" target=\"_blank\">Smiley Company </a>and Dream Theatre came together in 2017, but the brand has had a presence at retail outlets in India long before that. Through its global tie-up with gift store chain Archie’s, the smiley motif is commonly seen on badges, mugs, posters and much more. According to the partners, the present association is born out of the goal of expanding beyond the traditional categories and to co-create customised merchandise for the local market.</p>\n<p>\n\tLoufrani explains, “We think of ourselves as a lifestyle brand. We want to be present in different aspects of the consumers’ life. We are basically reaching out to people who see the bright side of life. Apart from our partnership with Archie’s we have also signed on an F&amp;B brand and will be exploring many other areas.”</p>\n<p>\n\tThe challenge however is that given that the Indian L&amp;M market is still to mature, can the brand encash the symbol’s generic status? Ambi Parameswaran, founder of Brand-Building.com, feels that the challenge will be to establish that it is in fact a brand. “Smileys have been so commonly used, that the symbol is rarely seen as a brand. It’s like the heart symbol for love.”</p>\n<p>\n\tLoufrani says that the Indian journey is being thought through very carefully. That is why he says, despite his affinity with the fashion industry the Smiley brand will keep a low profile in the sector in India to begin with. “We want to take it slow on the fashion front. We are a lifestyle brand and to be true to our DNA, we want to co-create something for the Indian consumers. We don’t want to just slap the smiley on a saree. The good thing I have seen is that Indians do wear their traditional clothes (<em>sarees, kurtas</em>, etc) pretty regularly and so I think we can definitely come up with something that is uniquely Smiley and Indian,” he adds.</p>\n<p>\n\tApart from fashion and stationery/accessories, the brand has a big presence in the licensed F&amp;B segment. It has an association with <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=mccain+foods\" target=\"_blank\">McCain Foods.</a> The snack foods company uses the smiley motif on its ready-to-fry potato snacks. Parameswaran says that Brand Smiley, unlike (other generic) brands like Thermos or Xerox, which had actual physical products which went on to define a category, is a generic expression of happiness.” He believes that the brand would do well to sign up with one  partner for a specific product first, and once that is established, expand to different categories. That way both the brand and the licensee will get more out the association, he explains</p>\n<p>\n\tThe Indian market presents another danger, that of piracy and copyright infringement. And when your brand has a 97 per cent recall, it becomes even easier to fall prey to piracy, Loufrani says, but adds: “Counterfeit is the ransom on success. So yes, duplicates and fakes exist. We work with partners to ensure that whatever is sold through organised retail is authentic. In case of unorganised retail, there is little that can be done. However, I also believe that the savvy consumer would rather pay more for the original than buy a fake. So we’re going to focus on the savvy Indian consumer.”</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "above",
        "Indian",
        "generic"
    ],
    "verbs": [
        "Company",
        "market",
        "cash",
        "trademark",
        "Can",
        "rise"
    ],
    "nouns": [
        "Company",
        "above",
        "market",
        "Indian",
        "Smiley",
        "cash",
        "trademark",
        "Can",
        "rise",
        "generic",
        "status",
        "ubiquity"
    ]
}