{
    "creator": "PTI",
    "title": "Peaceful North Korea can expand India’s Act East markets, says Industry observers",
    "link": "https://www.financialexpress.com/industry/peaceful-north-korea-can-expand-indias-act-east-markets-says-industry-observers/1201788/",
    "pubDate": "Mon, 11 Jun 2018 17:08:32 +05:30",
    "dc:creator": "PTI",
    "content": "A successful outcome of the Trump-Kim summit may benefit India as North Korea could become an emerging market for the country, according to industry observers here. ",
    "contentSnippet": "A successful outcome of the Trump-Kim summit may benefit India as North Korea could become an emerging market for the country, according to industry observers here.",
    "guid": "https://www.financialexpress.com/?p=1201788",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-11T11:38:32.000Z",
    "sentiment": {
        "score": 3,
        "comparative": 0.25,
        "tokens": [
            "peaceful",
            "north",
            "korea",
            "can",
            "expand",
            "india’s",
            "act",
            "east",
            "markets",
            "says",
            "industry",
            "observers"
        ],
        "words": [
            "expand",
            "peaceful"
        ],
        "positive": [
            "expand",
            "peaceful"
        ],
        "negative": []
    },
    "article": {
        "title": "Peaceful North Korea can expand India’s Act East markets, says Industry observers",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><p><img class=\"alignnone size-full wp-image-1201806\" src=\"https://images.financialexpress.com/2018/06/GENRAL_NEWS_FORMAT_NEW-1.jpg\" alt=\"\" width=\"660\" height=\"440\" srcset=\"https://images.financialexpress.com/2018/06/GENRAL_NEWS_FORMAT_NEW-1.jpg 660w, https://images.financialexpress.com/2018/06/GENRAL_NEWS_FORMAT_NEW-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/GENRAL_NEWS_FORMAT_NEW-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/GENRAL_NEWS_FORMAT_NEW-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"></p><span>\n</span><p>A successful outcome of the Trump-Kim summit may benefit India as North Korea could become an emerging market for the country, according to industry observers here. US President Donald Trump and North Korean leader Kim Jong-un will sit down for talks tomorrow for the first-ever summit between the two leaders that will kick-start a process that could see Pyongyang giving up its nuclear weapons.</p><span>\n</span><p>“India has stepped up its focus on East Asia as well as ASEAN and any addition of an emerging market like North Korea will be most beneficial for the country’s expanding export-oriented industries,” said a trade source. India’s Act East Policy, that was introduced by the Modi government, focusses on the extended neighbourhood in the Asia-Pacific region. While it would be good to be optimistic about the summit’s outcome, some apprehension still exists as both Trump and Kim are strong leaders with their own mind, the source said.</p><span>\n</span><p>Kim has taken a bold step to sit in the summit with Trump for the global peace, noted another diplomatic source, though it was still early to predict anything about tomorrow’s summit. Prime Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/narendra-modi/\">Narendra Modi</a>, aware of the historic summit, addressed the crucial Shangri La Dialogue in Singapore impressing on all for the peaceful, safe and secure region earlier this month.</p><span>\n</span><p>“But having come thus far, we are sure a lot of groundwork has been done by both sides – US officials as well as the North Koreans – and the host country Singapore,” it said. Though India is not directly involved in the summit but there is obvious Indian stake in such international events that works along its philosophy for a peaceful world, said one industry observer.</p><span>\n</span><p>India is the world’s fastest growing economy and a friendly country to all, the observer pointed out. India maintains strong diplomatic and economic relations with the US as well as Singapore, he pointed out, underlining that Singapore is a strong springboard and a platform for India’s Act East policy.</p><span>\n</span><p>The US is working on the summit for a denuclearised, safe and secure world with a keen interest to support economic development in North Korea. This means North Korea, subject to successful conclusion of the summit, would be part of the East Asian economies offering new opportunities, he said. Trump and Kim have traded insults, flaunted their military might and threatened each other with nuclear annihilation.</p><span>\n</span><p>Now things seem to have changed dramatically with the two leaders ready to meet. When they finally come face to face at a specially prepared hotel conference room on the island resort of Sentosa here on Tuesday, it will be the first time a North Korean leader has met a sitting US president. Trump hopes the landmark talks will kick-start a process that eventually sees Kim give up his nuclear weapons in an irreversible manner that can be verified internationally.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "North",
        "according",
        "Peaceful",
        "East",
        "successful",
        "emerging"
    ],
    "verbs": [
        "expand",
        "Act",
        "market",
        "Trump",
        "summit",
        "benefit",
        "become"
    ],
    "nouns": [
        "North",
        "may",
        "India",
        "Industry",
        "industry",
        "country",
        "A",
        "Korea",
        "Act",
        "East",
        "market",
        "outcome",
        "Trump",
        "summit",
        "benefit"
    ]
}