{
    "title": "Tilting power balance towards homebuyers in bankruptcy law is bold and fair",
    "link": "https://www.business-standard.com/article/economy-policy/tilting-power-balance-towards-homebuyers-in-bankruptcy-law-is-bold-and-fair-118061100103_1.html",
    "pubDate": "Mon, 11 Jun 2018 09:09:00 +0530",
    "content": "The change could end up increasing debt financing costs for Indian developers",
    "contentSnippet": "The change could end up increasing debt financing costs for Indian developers",
    "guid": "https://www.business-standard.com/article/economy-policy/tilting-power-balance-towards-homebuyers-in-bankruptcy-law-is-bold-and-fair-118061100103_1.html",
    "isoDate": "2018-06-11T03:39:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.08333333333333333,
        "tokens": [
            "tilting",
            "power",
            "balance",
            "towards",
            "homebuyers",
            "in",
            "bankruptcy",
            "law",
            "is",
            "bold",
            "and",
            "fair"
        ],
        "words": [
            "fair",
            "bold",
            "bankruptcy"
        ],
        "positive": [
            "fair",
            "bold"
        ],
        "negative": [
            "bankruptcy"
        ]
    },
    "article": {
        "title": "Tilting power balance towards homebuyers in bankruptcy law is bold and fair",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tFrom overburdened tribunals to some bizarre judgments and costly delays, India’s new <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=bankruptcy+code\" target=\"_blank\">bankruptcy code </a>has had its share of teething troubles.</p>\n<p>\n\tBut the law, which will decide the fate of $210 billion in bad loans, has also broken new ground. Take the most recent tweak, for instance. Hapless <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=homebuyers\" target=\"_blank\">homebuyers </a>left without apartments by debt-stressed builders will have their status raised to that of financial creditors. That’s highly unusual by global standards. It’s a bold innovation, worthy of emulation by other rapidly urbanizing economies.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe change could end up increasing debt financing costs for Indian developers. Banks may charge more for loans if their recovery rates in the event of insolvency are going to be lower. That would be the case if homebuyers’ cash advances are also treated as senior claims against developers’ assets.</p>\n<p>\n\tYet superior protection for <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=homebuyers\" target=\"_blank\">homebuyers </a>may also reduce overall financing costs. That’s because land acquisition is funded by builders’ equity and customer deposits. If buyers are routinely denied both the apartment promised to them and any hope of getting their money back, they won’t bite. That will raise equity financing costs for new projects to discouragingly high levels.</p>\n<p>\n\tA one-year-old <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=real+estate+law\" target=\"_blank\">real estate law </a>has tried to address the problem of diversion of customer funds from one development to another, but the legacy of broken pledges is a dampener. Just one township, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=jaypee\" target=\"_blank\">Jaypee </a>Infratech Ltd.’s Wish Town near New Delhi, has 25,000 stranded customers. The builder is facing bankruptcy. Liquidation is a possibility. Making buyers stand in line with operational creditors such as cement suppliers or architects won’t go down well with middle-class voters ahead of next year’s elections.</p>\n<p>\n\t<strong>Wish Town, No Place to Settle Down</strong></p>\n<p>\n\tAround 25,000 <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=homebuyers\" target=\"_blank\">homebuyers </a>are stranded in bankrupt <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=jaypee\" target=\"_blank\">Jaypee </a>Infratech's apartment project</p>\n<p>\n\tTreating <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=homebuyers+as+financial+creditors\" target=\"_blank\">homebuyers as financial creditors </a>is an “inelegant solution,” which will inflict collateral damage on the philosophical framework of India’s bankruptcy code, writes Umakanth Varottil, a law professor at the National University of Singapore. However, even philosophically, it’s unclear why buyers should be treated as operational lenders. The customer supplies no goods or services to the developer. She is a provider of capital – just like banks. And while banks give money and receive money in return, homeowners part with cash and get back apartments – a capital asset. This isn’t vendor financing.</p>\n<p>\n\tBesides, while thousands of disgruntled customers may find it difficult to act in a coordinated manner, when they do come together they may be among the more sensible participants on creditor committees. If nothing else, homebuyers have a strong self-interest in timely resolution. State-owned lenders, which hold 70 percent of the system’s assets, don’t care if things drag along. After all, it’s not their capital at risk, but taxpayers’.</p>\n<p>\n\t<strong>A Deluge of Distress</strong><br></p>\n<p>\n\tState-owned Indian lenders are at the top of the country's nonperforming asset league table</p>\n<p>\n\tCountries that have already substantially built their housing stock and have high levels of homeownership don’t need to worry about whether a few buyers are unlucky enough to get stuck with bankrupt developers. Newly urbanizing emerging economies are different. A severely underbuilt India needs millions of apartments, but launches fell 41 percent last year.</p>\n<p>\n\tBuyers need to be given the confidence to return to a market that has for too long cynically cheated them of their life savings. Tilting the balance of power a little toward them is both brave and fair.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Indian",
        "increasing",
        "bold",
        "fair"
    ],
    "verbs": [
        "power",
        "end",
        "change",
        "balance",
        "fair"
    ],
    "nouns": [
        "power",
        "financing",
        "bankruptcy",
        "end",
        "Indian",
        "change",
        "balance",
        "costs",
        "bold",
        "fair",
        "debt",
        "law"
    ]
}