{
    "creator": "PTI",
    "title": "Donald Trump accuses India of charging 100 per cent tariff on some imports",
    "link": "https://www.financialexpress.com/economy/donald-trump-accuses-india-of-charging-100-per-cent-tariff-on-some-imports/1201928/",
    "pubDate": "Mon, 11 Jun 2018 18:25:33 +05:30",
    "dc:creator": "PTI",
    "content": "President Donald Trump has taken a swipe at India along with the world&#8217;s other top economies and accused New Delhi of charging 100 per cent tariff on some of the US&#8217; goods, as he threatened to cut trade ties with countries who are robbing America. Trump made the remarks in Canada&#8217;s Quebec City where he [&#8230;]",
    "contentSnippet": "President Donald Trump has taken a swipe at India along with the world’s other top economies and accused New Delhi of charging 100 per cent tariff on some of the US’ goods, as he threatened to cut trade ties with countries who are robbing America. Trump made the remarks in Canada’s Quebec City where he […]",
    "guid": "https://www.financialexpress.com/?p=1201928",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-11T12:55:33.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.15384615384615385,
        "tokens": [
            "donald",
            "trump",
            "accuses",
            "india",
            "of",
            "charging",
            "100",
            "per",
            "cent",
            "tariff",
            "on",
            "some",
            "imports"
        ],
        "words": [
            "accuses"
        ],
        "positive": [],
        "negative": [
            "accuses"
        ]
    },
    "article": {
        "title": "Donald Trump accuses India of charging 100 per cent tariff on some imports",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1201952\" src=\"https://images.financialexpress.com/2018/06/trump-11.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/trump-11.jpg 660w, https://images.financialexpress.com/2018/06/trump-11-300x200.jpg 300w, https://images.financialexpress.com/2018/06/trump-11-620x413.jpg 620w, https://images.financialexpress.com/2018/06/trump-11-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Trump accuses India of charging 100 per cent tariff on some imports (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>President Donald Trump has taken a swipe at India along with the world’s other top economies and accused New Delhi of charging 100 per cent tariff on some of the US’ goods, as he threatened to cut trade ties with countries who are robbing America. Trump made the remarks in Canada’s Quebec City where he was attending the G7 summit that ended in farce after he abruptly rejected the text of a consensus statement and bitterly insulted the host. “We’re like the piggybank that everybody is robbing,” Trump said while addressing a press conference on Saturday.</p><span>\n</span><p>He also made a reference to India, indicating that his grievances on tariffs were not restricted to the developed economies alone. “This isn’t just G7. I mean, we have India, where some of the tariffs are 100 per cent. A hundred per cent. And we charge nothing. We can’t do that. And so we are talking to many countries,” Trump said.</p><span>\n</span><p>Trump has repeatedly raked up the issue of India imposing high import duty on the iconic Harley-Davidson motorcycles and threatened to increase the import tariff on “thousands and thousands” of Indian motorcycles to the US. “We’re talking to all countries. And it’s going to stop. Or we’ll stop trading with them. And that’s a very profitable answer, if we have to do it,” Trump warned before leaving Canada for Singapore where he is scheduled to hold a much-publicised summit with North Korean Leader Kim Jong Un tomorrow.</p><span>\n</span><p>His remarks came at a time when the India-US relationship has been on a positive trajectory for years. For example, bilateral trade expanded by USD 11 billion last year to more than USD 125 billion, a new record. Trump called for a tariff-free G-7. “That’s the way it should be. No tariffs, no barriers. That’s the way it should be,” he said. “And no subsidies. I even said no tariffs,” he said.</p><span>\n</span><p>Trump, who is pushing his ‘America First’ policy, said his ultimate goal was the elimination of all trade duties. “Ultimately that’s what you want,” he said. “You want a tariff free. You want no barriers. And you want no subsidies. Because you have some cases where countries are subsidizing industries and that’s not fair.”</p><span>\n</span><p>China and the US have averted a trade war by reaching an agreement last month under which Beijing has agreed to “significantly increase” its purchases of American goods and services to reduce USD 375 billion trade deficit with Washington. The top trading partners of the US are upset over the recent imposition of a 25 per cent tariff on import of steel and 15 per cent on aluminum.</p><span>\n</span><p>The US has said that the best way to solve trade disputes was by lowering tariff and non-tariff barriers by countries and allowing the free market to operate. Under President Trump, trade dispute between India and the US has increased, with his administration asking New Delhi to lower its trade barriers and open up its market. However, unlike countries like China, Mexico and Canada and those from Europe, India is not on top of the trade issues for the Trump administration.</p><span>\n</span><p>Trump said the US pays tremendous tariffs on dairy products from Canada, for instance, 270 per cent on some products. “We don’t want to pay anything. Why should we pay?,” he asked. Trump blamed the previous American leadership for this.</p><span>\n</span><p>“It’s got to change. It’s going to change. I mean, it’s not a question of ‘I hope it changes.’ It’s going to change, a hundred per cent. And tariffs are going to come way down because people cannot continue to do that,” he added.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "100",
        "taken",
        "world",
        "top",
        "New",
        "threatened",
        "cut",
        "made"
    ],
    "nouns": [
        "Trump",
        "accused",
        "India",
        "100",
        "cent",
        "tariff",
        "President",
        "world",
        "top",
        "Delhi",
        "US",
        "cut",
        "trade",
        "America",
        "Canada",
        "City",
        "Quebec",
        "swipe"
    ],
    "verbs": [
        "Trump",
        "tariff",
        "swipe",
        "top",
        "cut",
        "trade"
    ]
}