{
    "title": "IOB looks at profit in Q4 FY19, NCLT recoveries to help improve profile",
    "link": "https://www.business-standard.com/article/finance/iob-hopes-to-report-profit-in-q4-nclt-recoveries-to-help-improve-profile-118060400081_1.html",
    "pubDate": "Mon, 04 Jun 2018 23:30:00 +0530",
    "content": "Indian Overseas Bank is currently under the Reserve Bank of India's Prompt Corrective Action framework",
    "contentSnippet": "Indian Overseas Bank is currently under the Reserve Bank of India's Prompt Corrective Action framework",
    "guid": "https://www.business-standard.com/article/finance/iob-hopes-to-report-profit-in-q4-nclt-recoveries-to-help-improve-profile-118060400081_1.html",
    "isoDate": "2018-06-04T18:00:00.000Z",
    "sentiment": {
        "score": 6,
        "comparative": 0.46153846153846156,
        "tokens": [
            "iob",
            "looks",
            "at",
            "profit",
            "in",
            "q4",
            "fy19",
            "nclt",
            "recoveries",
            "to",
            "help",
            "improve",
            "profile"
        ],
        "words": [
            "improve",
            "help",
            "profit"
        ],
        "positive": [
            "improve",
            "help",
            "profit"
        ],
        "negative": []
    },
    "article": {
        "title": "IOB looks at profit in Q4 FY19, NCLT recoveries to help improve profile",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tPublic-sector lender <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=indian+overseas+bank\" target=\"_blank\">Indian Overseas Bank </a>(IOB) expects to report a cost-effective net profit during the last quarter of 2018-19, as against a loss of Rs 36.06 billion during the quarter ended March 2018.</p>\n<p>\n\tThe bank reported an operating profit of Rs 36.28 billion in 2017-18. The net loss rose to Rs 62.99 billion in 2017-18 from Rs 34.16 billion in 2016-17 due to increase in provision by Rs 29.37 billion.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe IOB's management is confident that it will be able to sustain the profitability because of the actions (especially on recoveries from bad loans) taken in the last two years, and to be taken in 2018-19. IOB at present is under the Reserve Bank of India’s <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=prompt+corrective+action\" target=\"_blank\">Prompt Corrective Action </a>(PCA) framework. The revised framework on Resolution of Stressed Assets by <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=rbi\" target=\"_blank\">RBI </a>(February 12,2018) was a shocker for banking sector as they had to re-classify some of the standard stressed loans as non-performing assets (NPAs).</p>\n<p>\n\tSubramaniakumar, CEO &amp; MD, IOB said, \"It was a good initiative, may be a little painful. This will strengthen the system as well as the market\".  \"We are working towards turning profitable (net profit) in the fourth quarter of the year and it will be sustained going forward,\" he said.</p>\n<p>\n\tChennai-based lender is expecting better recoveries on the back of the resolution of big ticket stressed accounts cases at National Company Law Tribunal (NCLT). IOB has around Rs 86 billion under the two list (<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=rbi\" target=\"_blank\">RBI </a>1 and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=rbi\" target=\"_blank\">RBI </a>2 lists). Even if 50 per cent of them get resolved, the NPA will come down by around Rs 40 billion.</p>\n<p>\n\tNearly 71 per cent is provided for these accounts and there will be a write back on this, which he feels will be a considerable amount, even after a small haircut, will add to bank's profit directly.<br></p>\n<p>\n\tIOB has a huge chunk of 100 per cent provided accounts, which are chronic NPAs of around Rs 110 billion. \"We are working on a cluster-based NPA approach and senior officer anchoring for OTS resolution. Even if I make around 10-20 per cent, that will write back to my profit and it will reduce my need for future provisioning,\" Subramaniakumar further added.</p>\n<p>\n\tRetail, Agriculture and MSME (RAM) constitutes a fair amount of 35-40 per cent of NPAs.<br></p>\n<p>\n\tOne-time settlement, resolution and settling of accounts are likely to bring down bank's NPA numbers, said IOB CEO &amp; MD Subramaniakumar.<br></p>\n<p>\n\tSubramaniakumar said while last year was used to identify the crisis, this fiscal bank would focus on recovery. The IOB expects, recovery to the tune of Rs 120-140 billion, while fresh slippages could be less than half. The emphasis would be on cash recovery and upgradation to avoid hair-cuts.</p>\n<p>\n\tRAM has helped the bank to rebalance the balance sheet. Two years back, risk weightage assets used to be 112 per cent and today it is only 89 per cent. Though the yield is less in RAM, the bank prefers to strengthen this portfolio since risk is low and will lead to stablility with other good income and growth in interest income.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Prompt",
        "Indian",
        "Corrective",
        "Overseas"
    ],
    "nouns": [
        "profit",
        "profile",
        "Prompt",
        "Indian",
        "India",
        "help",
        "Corrective",
        "Bank",
        "Reserve",
        "Action",
        "framework"
    ],
    "verbs": [
        "profit",
        "profile",
        "Prompt",
        "help",
        "improve",
        "Bank",
        "Reserve",
        "Action"
    ]
}