{
    "creator": "PTI",
    "title": "Government asks exporters to comply with global standards to tap international markets",
    "link": "https://www.financialexpress.com/economy/government-asks-exporters-to-comply-with-global-standards-to-tap-international-markets/1210417/",
    "pubDate": "Mon, 18 Jun 2018 13:47:26 +05:30",
    "dc:creator": "PTI",
    "content": "The government today said exporters, particularly from the food and agriculture sectors, should strictly comply with global norms for quality and standards, or else they might lose their export market share to other countries. ",
    "contentSnippet": "The government today said exporters, particularly from the food and agriculture sectors, should strictly comply with global norms for quality and standards, or else they might lose their export market share to other countries.",
    "guid": "https://www.financialexpress.com/?p=1210417",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-18T08:17:26.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "government",
            "asks",
            "exporters",
            "to",
            "comply",
            "with",
            "global",
            "standards",
            "to",
            "tap",
            "international",
            "markets"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Government asks exporters to comply with global standards to tap international markets",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img src=\"https://images.financialexpress.com/2018/06/export-2.jpg\" alt=\"exports, expertors, india export, global standards, international market, market\" class=\"size-full wp-image-1210433\" srcset=\"https://images.financialexpress.com/2018/06/export-2.jpg 660w, https://images.financialexpress.com/2018/06/export-2-300x200.jpg 300w, https://images.financialexpress.com/2018/06/export-2-620x413.jpg 620w, https://images.financialexpress.com/2018/06/export-2-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Commerce Secretary Rita Teaotia said it is critical to promote manufacturing, exports and enhancing participation of domestic industry into global value chains. </figure>\n\t\t\t</section></div><span>\n</span><p>The government today said exporters, particularly from the food and agriculture sectors, should strictly comply with global norms for quality and standards, or else they might lose their export market share to other countries. Emphasising on the importance of adopting best standards for goods and services, Commerce Secretary Rita Teaotia said it is critical to promote manufacturing, exports and enhancing participation of domestic industry into global value chains. </p><span>\n</span><p>She said in the food and agriculture sectors, Indian exporters are repetitively facing trade barriers on account of compliance issues. “Such situations are prevalent in discerning markets like the US, European Union and Japan and if Indian producers are unable to meet mandatory obligations for standards including the sanitary and phytosanitary (related with plants and animals) measures, we may lose our share of export market to other countries,” she said.</p><span>\n</span><p>Teaotia was speaking at the National Standards Conclave, organised by the commerce ministry and industry body CII. She said promulgation of sanitary and phytosanitary (SPS) measures are very important as India receives so many alerts from these countries. “We have initiated an inter-ministerial space where agriculture ministry, health ministry and agencies like Fssia, Export Inspection Council, Apeda and Mpeda are now working together to be able to respond more appropriately and efficiently to these alerts,” she added.</p><span>\n</span><p>She also informed that Indian National Strategy for Standardisation (INSS) will be released tomorrow and urged the industry to give feedback on the suggestions made in this report. INSS recommends wide range of policy directions such as standard settings, conformity assessment, accreditation, SPS and technical regulations as well as awareness building, training and education.</p><span>\n</span><p>“It recommends an implementation framework for realising these goals, identification of the responsible agencies and related activities taken by them and time frames for achieving these milestones..it has a finite time,” the secretary said. It has also suggested setting up of a high-level committee for regular reviews, monitoring and publication of results. She added that three areas are important from standards perspective – manufacturing, services and food and agro products.</p><span>\n</span><p>Global value chains, she said, are fast emerging as a key driver of standards, and participation in these requires uniform standards worldwide. “There is a need to assess the global standards, and working towards harmonisation and adopting global value standards are critical,” she said.</p><span>\n</span><p>Teaotia further said the government has advised all the line ministries to create and strengthen their technical wings for identifying specific standards and technical regulations needed. </p><span>\n</span><p>There is also a need to promote brand India for Indian products and make them globally acceptable. Talking about global standards in services, Teaotia said it is in nascent stage unlike in goods. “We will have to take lead in development of standards in this sector,” she added. </p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "quality",
        "international",
        "global"
    ],
    "nouns": [
        "market",
        "quality",
        "international",
        "export",
        "today",
        "Government",
        "government",
        "tap",
        "food",
        "agriculture",
        "share"
    ],
    "verbs": [
        "lose",
        "market",
        "comply",
        "export",
        "tap",
        "share"
    ]
}