{
    "title": "EPE: A fortnight later, low traffic on expressway due to safety woes",
    "link": "https://www.business-standard.com/article/economy-policy/epe-a-fortnight-later-low-traffic-on-expressway-due-to-safety-woes-118061100025_1.html",
    "pubDate": "Mon, 11 Jun 2018 07:01:00 +0530",
    "content": "Besides intermittent patches along 90% of the 135-km highway, the stretch has no street lights",
    "contentSnippet": "Besides intermittent patches along 90% of the 135-km highway, the stretch has no street lights",
    "guid": "https://www.business-standard.com/article/economy-policy/epe-a-fortnight-later-low-traffic-on-expressway-due-to-safety-woes-118061100025_1.html",
    "isoDate": "2018-06-11T01:31:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.08333333333333333,
        "tokens": [
            "epe",
            "a",
            "fortnight",
            "later",
            "low",
            "traffic",
            "on",
            "expressway",
            "due",
            "to",
            "safety",
            "woes"
        ],
        "words": [
            "safety"
        ],
        "positive": [
            "safety"
        ],
        "negative": []
    },
    "article": {
        "title": "EPE: A fortnight later, low traffic on expressway due to safety woes",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p><span> It is evening and a few trucks trundle into the spanking new <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=eastern+peripheral+expressway\" target=\"_blank\">Eastern Peripheral Expressway </a>(EPE), which was inaugurated by Prime Minister Narendra Modi about a fortnight ago. The 135-km highway, which connects Kundli to Palwal in Haryana via Ghaziabad in Uttar Pradesh, will allow the trucks to make the journey in about half the time than they used to. The trucks save on time and fuel, and since the new route bypasses Delhi, the capital breathes easier with fewer heavy vehicles entering the city and adding to its traffic congestion and toxic air pollution.</span> <span></span> <span> That, at least, is the ideal scenario. However, as of now, the expressway remains heavily under-used. This despite the fact that the EPE has cut down the travel time between Kundli and Palwal from four-five hours to about two hours, and the toll too is being waived for the first two months.</span> <span></span> <span> The reason for the EPE’s relatively low volume of traffic may lie in the lack of adequate safety measures, especially after sundown. A late evening reconnaissance by <em>Business Standard</em> showed that barring intermittent patches, the highway has no street lights. In fact, not more than 10 per cent of the total road length of the “word-class” expressway can boast of something as basic as street lights as yet.</span> <span></span> <span> The darkness does not seem to deter the locals, though. At night villagers blithely cross the highway as vehicles whizz past them at high speed. Moreover, passenger traffic coming on to the EPE via the slip roads flout the rules with impunity and chug along on the wrong side of the highway. </span></p><p>The violations go unchecked and the result is a recipe for potential disaster. <span></span> <span> The EPE has already had its share of accidents. In one incident on June 5, seven members of a family were killed and nine others injured when the driver of their pick-up van fell asleep at the wheel. Though this particular mishap was not due to the lack of safety infrastructure, it is more than evident that the EPE is a high-risk zone after dark.</span> <span></span> <span> On an average, the EPE now gets about 600 heavy and light commercial vehicles from the Palwal side between 8 am and 8 pm daily. “In the last one week, entry of as many as 350 trucks and 250 light commercial vehicles has been reported on the expressway,” an official assessing the traffic at the Palwal entry point told <em>Business Standard</em>.</span> <span></span> <span> According to S P Singh, senior fellow of the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=indian+foundation+of+transport+research+and+training\" target=\"_blank\">Indian Foundation of Transport Research and Training </a>(IFTRT), the volume of traffic on the EPE is lower than what was estimated as truckers are wary of the toll charges that will kick in shortly. The digital weigh-in facility at the expressway’s entry points is another damper. Once the weigh-in facility is operational, it will put a stop to the overloading of vehicles, which is not only a security hazard but also speeds up the wear and tear of the road surface. </span> <span></span> <span> The EPE is part of a 271-km Ring Road being constructed around Delhi. The other half of the project, the 136-km Western Peripheral Expressway, will connect Kundli to Palwal via Manesar in Haryana.</span> <span></span> <span> Constructed at a cost of Rs 110 billion, the project has been executed by Sadbhav Engineering, Jaiprakash Associates, Ashoka Buildcon, Oriental Structure, and Gayatri Projects. In 2016 the Delhi government had moved the Supreme Court to direct the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=union+government\" target=\"_blank\">Union government </a>to complete the two expressways in a time-bound manner. Subsequently, the construction was expedited and the EPE was commissioned on May 27 this year.</span> <span></span> <span> When complete, the two arms of the expressway are expected to decongest Delhi by diverting about 200,000 vehicles that enter the capital every day. However, unless the authorities address concerns regarding safety and under-utilisation, the laudable goals of the Eastern and Western Peripheral Expressways may never be fully realised.<span></span> </span></p><blockquote class=\"blockquoteBG styleQ1\"> <p> <strong>Poor Show</strong><span></span> </p> <ul> <li> EPE's relatively <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=low+traffic\" target=\"_blank\">low traffic </a>is due to lack of adequate safety meaures, especially after sundown</li> <li> Not more than 10% of the total road length of the expressway can boast of something as basic as street lights as yet</li> <li> At night, villagers blithely cross the highway as vehicles whizz past them at high speed</li> <li> On June 5, seven members of a family were killed and nine others injured when the driver of their pick-up van fell asleep at the wheel. Though it was not due to the lack of safety infrastructure, it is more than evident that the EPE is a high-risk zone after dark</li> <li> On an average, the EPE gets about 600 heavy and light commercial vehicles from the Palwal side between 8 am and 8 pm daily</li> </ul> </blockquote> </span>"
    },
    "adjectives": [
        "intermittent",
        "low",
        "stretch",
        "90",
        "later",
        "due",
        "135",
        "no"
    ],
    "nouns": [
        "expressway",
        "traffic",
        "fortnight",
        "low",
        "highway",
        "stretch",
        "street",
        "90",
        "A",
        "due",
        "safety",
        "km",
        "no"
    ],
    "verbs": [
        "traffic",
        "low",
        "stretch"
    ]
}