{
    "creator": "Associated Press",
    "title": "Trump-Kim high-stakes summit: Final preparations begin, Trump sees excitement in air! All you need to know",
    "link": "https://www.financialexpress.com/economy/trump-kim-high-stakes-summit-final-preparations-begin-trump-sees-excitement-in-air-all-you-need-to-know/1201006/",
    "pubDate": "Mon, 11 Jun 2018 08:52:45 +05:30",
    "dc:creator": "Associated Press",
    "content": "U.S. and North Korean officials are meeting Monday at the Ritz Carlton in this island city-state to negotiate before a sit-down meant to settle a standoff over Pyongyang's nuclear arsenal.",
    "contentSnippet": "U.S. and North Korean officials are meeting Monday at the Ritz Carlton in this island city-state to negotiate before a sit-down meant to settle a standoff over Pyongyang's nuclear arsenal.",
    "guid": "https://www.financialexpress.com/?p=1201006",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-11T03:22:45.000Z",
    "sentiment": {
        "score": 3,
        "comparative": 0.1875,
        "tokens": [
            "trump-kim",
            "high-stakes",
            "summit",
            "final",
            "preparations",
            "begin",
            "trump",
            "sees",
            "excitement",
            "in",
            "air",
            "all",
            "you",
            "need",
            "to",
            "know"
        ],
        "words": [
            "excitement"
        ],
        "positive": [
            "excitement"
        ],
        "negative": []
    },
    "article": {
        "title": "Trump-Kim high-stakes summit: Final preparations begin, Trump sees excitement in air! All you need to know",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"wp-image-1201012 size-full\" src=\"https://images.financialexpress.com/2018/06/Trump-Kim-Reuters.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/Trump-Kim-Reuters.jpg 660w, https://images.financialexpress.com/2018/06/Trump-Kim-Reuters-300x200.jpg 300w, https://images.financialexpress.com/2018/06/Trump-Kim-Reuters-620x413.jpg 620w, https://images.financialexpress.com/2018/06/Trump-Kim-Reuters-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Trump and Kim arrived in Singapore hours apart Sunday. (Image: Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>Final preparations are underway in Singapore for Tuesday’s historic summit between President Donald Trump and North Korean leader Kim Jong Un.&nbsp;U.S. and North Korean officials are meeting Monday at the Ritz Carlton in this island city-state to negotiate before a sit-down meant to settle a standoff over Pyongyang’s nuclear arsenal. It comes as officials are revealing more details about meeting _ the first between a U.S. president and North Korean leader.</p><span>\n</span><p>A U.S. official said Monday that after a handshake scheduled for 9 a.m. Tuesday, Trump and Kim will first meet one on one with translators in a session that could last up to two hours before they open the meeting to their respective advisers. The official was not authorized to speak publicly about internal deliberations and insisted on anonymity.&nbsp;The American president tweeted Monday morning: “Great to be in Singapore, excitement in the air!”</p><span>\n</span><p>Still, even as he turned his attention to the summit, Trump continued his blistering attacks on Canadian Prime Minister Justin Trudeau Monday, saying “Fair Trade is now to be called Fool Trade if it is not Reciprocal.” Again accusing the longtime U.S. ally of unfair trade practices, Trump added: “Then Justin acts hurt when called out!”</p><span>\n</span><p>Trump and Kim arrived in Singapore hours apart Sunday. Trump descended from Air Force One into the steamy Singapore night, greeting officials and declaring he felt “very good” before being whisked away to his hotel via a route lined with police and photo-snapping onlookers. Trump traveled to Singapore from Canada, where he attended a meeting with other world leaders.</p><span>\n</span><p>A jet carrying Kim landed hours earlier. After shaking hands with Singapore’s foreign minister, Kim sped through the streets in a limousine, two large North Korean flags fluttering on the hood, surrounded by other black vehicles with tinted windows and bound for the luxurious and closely guarded St. Regis Hotel. Kim smiled broadly Sunday evening as he met with Singapore Prime Minister Lee Hsien Loong.</p><span>\n</span><p>“The entire world is watching the historic summit between (North Korea) and the United States of America, and thanks to your sincere efforts … we were able to complete the preparations for the historic summit,” Kim told Lee through an interpreter.&nbsp;Trump is set to meet with Lee on Monday.</p><span>\n</span><p>Trump has said he hopes to make a legacy-defining deal for the North to give up its nuclear weapons, though he has recently sought to minimize expectations, saying more than one meeting may be necessary. The North has faced crippling diplomatic and economic sanctions as it has advanced development of its nuclear and ballistic missile programs.</p><span>\n</span><p>Experts believe the North is on the brink of being able to target the entire U.S. mainland with its nuclear-armed missiles, and while there’s deep skepticism that Kim will quickly give up those hard-won nukes, there’s also some hope that diplomacy can replace the animosity between the U.S. and the North.</p><span>\n</span><p>White House press secretary Sarah Huckabee Sanders said Sung Kim, the U.S. ambassador to the Philippines who has taken the lead on policy negotiations with the North, will hold a “working group” with a North Korean delegation to discuss final preparations for the meeting.</p><span>\n</span><p>The North Korean autocrat’s every move will be followed by 3,000 journalists who have converged on Singapore, and by gawkers around the world, up until he shakes hands with Trump on Tuesday. It’s a reflection of the intense global curiosity over Kim’s sudden turn to diplomacy in recent months after a slew of North Korean nuclear and missile tests last year raised serious fears of war.</p><span>\n</span><p>But it was only Monday morning in North Korea that the government news agency reported that Kim was in Singapore, had met with the prime minister and would meet Trump on Tuesday. One dispatch by the Korean Central News Agency said North Korea and the U.S. would exchange “wide-ranging and profound views” on establishing new relations, building a “permanent and durable peace-keeping mechanism,” achieving denuclearization and “other issues of mutual concern, as required by the changed era.”</p><span>\n</span><p>It’s Kim’s pursuit of nuclear weapons that gives his meeting with Trump such high stakes. The meeting was initially meant to rid North Korea of its nuclear weapons, but the talks have been portrayed by Trump in recent days more as a get-to-know-you session. Trump has also raised the possibility of further summits and an agreement ending the Korean War by replacing the armistice signed in 1953 with a peace treaty. China and South Korea would have to sign off on any legal treaty.</p><span>\n</span><p>It’s unclear what Trump and Kim might decide Tuesday.&nbsp;Pyongyang has said it is willing to deal away its entire nuclear arsenal if the United States provides it with reliable security assurances and other benefits. But many say this is highly unlikely, given how hard it has been for Kim to build his program and given that the weapons are seen as the major guarantee to his holding onto unchecked power.</p><span>\n</span><p>Any nuclear deal will hinge on North Korea’s willingness to allow unfettered outside inspections of the country’s warheads and nuclear fuel, much of which is likely kept in a vast complex of underground facilities. Past nuclear deals have crumbled over North Korea’s reluctance to open its doors to outsiders.</p><span>\n</span><p>Another possibility from the summit is a deal to end the Korean War, which North Korea has long demanded, presumably, in part, to get U.S. troops off the Korean Peninsula and, eventually, pave the way for a North Korean-led unified Korea.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "North",
        "high",
        "Korean",
        "Final",
        "All",
        "U",
        "down",
        "nuclear"
    ],
    "nouns": [
        "North",
        "city",
        "stakes",
        "state",
        "standoff",
        "Monday",
        "excitement",
        "need",
        "settle",
        "high",
        "Korean",
        "Trump",
        "summit",
        "know",
        "Final",
        "begin",
        "air",
        "U",
        "S",
        "meeting",
        "Ritz",
        "down",
        "arsenal",
        "island",
        "Pyongyang"
    ],
    "verbs": [
        "state",
        "need",
        "settle",
        "sit",
        "Trump",
        "summit",
        "know",
        "begin",
        "air",
        "negotiate",
        "down"
    ]
}