{
    "creator": "Bloomberg",
    "title": "Pakistan said to devalue Rupee for third time since December",
    "link": "https://www.financialexpress.com/economy/pakistan-said-to-devalue-rupee-for-third-time-since-december/1201905/",
    "pubDate": "Mon, 11 Jun 2018 18:07:05 +05:30",
    "dc:creator": "Bloomberg",
    "content": "Pakistan’s central bank devalued the rupee for a third time since December amid a worsening economy and speculation the country will need support from the International Monetary Fund. ",
    "contentSnippet": "Pakistan’s central bank devalued the rupee for a third time since December amid a worsening economy and speculation the country will need support from the International Monetary Fund.",
    "guid": "https://www.financialexpress.com/?p=1201905",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-11T12:37:05.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "pakistan",
            "said",
            "to",
            "devalue",
            "rupee",
            "for",
            "third",
            "time",
            "since",
            "december"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Pakistan said to devalue Rupee for third time since December",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1201931\" src=\"https://images.financialexpress.com/2018/06/cats-708.jpg\" alt=\"Pakistan,&nbsp;International Monetary Fund,&nbsp;Insight Securities Pvt,&nbsp;Topline Securities Pakistan Ltd,&nbsp;foreign exchange traders\" srcset=\"https://images.financialexpress.com/2018/06/cats-708.jpg 660w, https://images.financialexpress.com/2018/06/cats-708-300x200.jpg 300w, https://images.financialexpress.com/2018/06/cats-708-620x413.jpg 620w, https://images.financialexpress.com/2018/06/cats-708-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Pakistan’s central bank increased its target policy rate to 6.5 percent last month, the highest in almost three years, citing a deteriorating economic backdrop. (PTI)</figure>\n\t\t\t</section></div><span>\n</span><p>Pakistan’s central bank devalued the rupee for a third time since December amid a worsening economy and speculation the country will need support from the International Monetary Fund. The managed currency dropped as much as 5.1 percent to 121.5 per dollar in trade Monday, according to bank foreign-exchange traders who asked not to be identified as they are not authorized to speak to the media. The central bank couldn’t be immediately reached for a comment. The devaluation comes amid a global emerging-market selloff that has convinced Turkey, Indonesia and India to raise interest rates and Argentina to secure a $50 billion rescue program from the IMF to bolster investor confidence. Pakistan’s rupee was already Asia’s worst-performing currency against the dollar since the start of December before Monday’s move, data compiled by Bloomberg show.</p><span>\n</span><p>“It was becoming increasingly difficult to manage the local currency at the current level with dropping forex reserves,’’ said Zubair Ghulam Hussain, chief executive officer at Insight Securities Pvt. in Karachi. “The nation’s current-account deficit had become sizeable and foreign debt repayment obligation were also rising.”</p><span>\n</span><p>Analysts predict Pakistan’s economic growth will slow in 2018 for the first time in six years. The nation’s foreign-exchange reserves have dropped to the lowest in more than three years, the current-account deficit has widened, while external debt and liabilities as a percentage of gross domestic product climbed to the highest in almost six years in the first quarter.</p><span>\n</span><p>Pakistan’s central bank increased its target policy rate to 6.5 percent last month, the highest in almost three years, citing a deteriorating economic backdrop. “The balance of payments picture, despite an increase in exports and some deceleration in imports, has further deteriorated due to a sharp increase in international oil prices and limited financial inflows to date,” the central bank said in their statement.</p><span>\n</span><p>Former chief justice Nasir ul Mulk was sworn in as caretaker prime minister earlier this month with a mandate of running the government until a new administration is elected in a nationwide poll next month. Standard Chartered Bank cut its forecast for the rupee this month, predicting it will fall to 125 per dollar by year-end, and saying the IMF may request for the authorities to weaken it even more.</p><span>\n</span><p>“You want to give a signal to the IMF that Pakistan is doing its homework’’ ahead of a possible loan program, said Mohammed Sohail, chief executive officer at Topline Securities Pakistan Ltd. in Karachi. There’s “pressure on emerging-market currencies including Turkey, Indonesia and India so you have to adjust yours as well,’’ he said.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "worsening",
        "central",
        "Monetary",
        "devalued",
        "third",
        "International"
    ],
    "nouns": [
        "worsening",
        "bank",
        "central",
        "support",
        "Rupee",
        "rupee",
        "economy",
        "December",
        "Pakistan",
        "third",
        "time",
        "speculation",
        "country",
        "will",
        "need",
        "International",
        "Fund"
    ],
    "verbs": [
        "bank",
        "support",
        "devalue",
        "time",
        "will",
        "need",
        "Fund"
    ]
}