{
    "creator": "PTI",
    "title": "PNB scam: CBI seeks Red Corner Notice against Nirav Modi",
    "link": "https://www.financialexpress.com/industry/banking-finance/pnb-scam-cbi-seeks-red-corner-notice-against-nirav-modi/1201997/",
    "pubDate": "Mon, 11 Jun 2018 19:04:47 +05:30",
    "dc:creator": "PTI",
    "content": "The CBI has asked the Interpol to issue a Red Corner Notice against absconding billionaire jeweller Nirav Modi in the over USD 2 billion banking scam involving Punjab National Bank, officials said today. ",
    "contentSnippet": "The CBI has asked the Interpol to issue a Red Corner Notice against absconding billionaire jeweller Nirav Modi in the over USD 2 billion banking scam involving Punjab National Bank, officials said today.",
    "guid": "https://www.financialexpress.com/?p=1201997",
    "categories": [
        "Banking & Finance",
        "Industry"
    ],
    "isoDate": "2018-06-11T13:34:47.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.2,
        "tokens": [
            "pnb",
            "scam",
            "cbi",
            "seeks",
            "red",
            "corner",
            "notice",
            "against",
            "nirav",
            "modi"
        ],
        "words": [
            "scam"
        ],
        "positive": [],
        "negative": [
            "scam"
        ]
    },
    "article": {
        "title": "PNB scam: CBI seeks Red Corner Notice against Nirav Modi",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1202005\" src=\"https://images.financialexpress.com/2018/06/cats-716.jpg\" alt=\"Nirav Modi,&nbsp;PNB scam,&nbsp;Red Corner Notice for nirav modi,&nbsp;Narendra Modi, mehul&nbsp;Choksi,&nbsp;SWIFT\" srcset=\"https://images.financialexpress.com/2018/06/cats-716.jpg 660w, https://images.financialexpress.com/2018/06/cats-716-300x200.jpg 300w, https://images.financialexpress.com/2018/06/cats-716-620x413.jpg 620w, https://images.financialexpress.com/2018/06/cats-716-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Nirav Modi was last publicly seen in a Press Information Bureau group photograph of CEOs and top brass of Indian corporate sector with Prime Minister Narendra Modi at Davos, Switzerland. (Facebook)</figure>\n\t\t\t</section></div><span>\n</span><p>The CBI has asked the Interpol to issue a Red Corner Notice against absconding billionaire jeweller Nirav Modi in the over USD 2 billion banking scam involving Punjab National Bank, officials said today. The agency has written to the Interpol to issue the notice which would mean that the member countries of the Lyon-based international police cooperation agency can arrest and extradite Nirav Modi who fled the country in the first week of January, weeks before the bank filed a complaint with the CBI. Nirav Modi was last publicly seen in a Press Information Bureau group photograph of CEOs and top brass of Indian corporate sector with Prime Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/narendra-modi/\">Narendra Modi</a> at Davos, Switzerland.</p><span>\n</span><p>A week later, the CBI registered an FIR against him on the basis of complaint against him and his uncle Mehul Choksi. His brother and wife were also named as accused in the FIR. His wife Ami, a US citizen, brother Nishal a Belgian, and uncle Choksi, Gitanjali group’s promoter, had also fled the country in the first week of January. The case pertains to allegedly cheating the state-run Punjab National Bank (PNB) through fraudulent issuance of Letters of Undertakings (LoUs) and Foreign Letters of Credit (FLCs).</p><span>\n</span><p>The agency recently charge-sheeted both Nirav Modi and Choksi separately in the scam. It has now approached the Interpol for a Red Corner Notice aimed at bringing Nirav Modi back for facing trial in the cases against them, the sources said. The CBI, in its charge sheets filed on May 14, had alleged that Nirav Modi, through his companies, siphoned off funds to the tune of Rs 6,498.20 crore using fraudulent LoUs issued from PNB’s Brady House branch in Mumbai.</p><span>\n</span><p>Choksi allegedly swindled Rs 7080.86 crore, making it possibly the biggest banking scam in the country, it alleged. An additional loan default of over Rs 5,000 crore to Choksi’s companies is also a matter of probe under the CBI. It is alleged that Nirav Modi and Choksi through their companies availed credit from overseas branches of Indian banks using fraudulent guarantees of the PNB given through LoUs and letters of credit which were not repaid bringing the liability on the state-run bank, the officials said.</p><span>\n</span><p>An LoU is a guarantee given by an issuing bank to Indian banks having branches abroad to grant short-term credit to the applicant. The instructions for transferring the funds were allegedly issued by a bank employee, Gokulnath Shetty, using an international messaging system for banking called SWIFT platform and without making their subsequent entries in the PNB’s internal banking software, thus bypassing scrutiny in the bank, they said.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "National",
        "Red",
        "billion"
    ],
    "verbs": [
        "Bank",
        "Notice",
        "Corner",
        "issue",
        "scam"
    ]
}