{
    "creator": "PTI",
    "title": "Airlines, telecom, pharma, IT may see earnings pressure in FY19",
    "link": "https://www.financialexpress.com/industry/airlines-telecom-pharma-it-may-see-earnings-pressure-in-fy19/1211002/",
    "pubDate": "Mon, 18 Jun 2018 20:56:16 +05:30",
    "dc:creator": "PTI",
    "content": "Icra report pointed out that continuing the past two-year trend, corporate earnings improved on the back of benign commodity prices and improving consumption demand. This trend continued to an extent in FY18 as healthy volume growth helped offset the impact of rising commodity prices.\r\n",
    "contentSnippet": "Icra report pointed out that continuing the past two-year trend, corporate earnings improved on the back of benign commodity prices and improving consumption demand. This trend continued to an extent in FY18 as healthy volume growth helped offset the impact of rising commodity prices.",
    "guid": "https://www.financialexpress.com/?p=1211002",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-18T15:26:16.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.1,
        "tokens": [
            "airlines",
            "telecom",
            "pharma",
            "it",
            "may",
            "see",
            "earnings",
            "pressure",
            "in",
            "fy19"
        ],
        "words": [
            "pressure"
        ],
        "positive": [],
        "negative": [
            "pressure"
        ]
    },
    "article": {
        "title": "Airlines, telecom, pharma, IT may see earnings pressure in FY19",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignleft\"><figure><img class=\"size-full wp-image-1211009\" src=\"https://images.financialexpress.com/2018/06/icra-2.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/icra-2.jpg 660w, https://images.financialexpress.com/2018/06/icra-2-300x200.jpg 300w, https://images.financialexpress.com/2018/06/icra-2-620x413.jpg 620w, https://images.financialexpress.com/2018/06/icra-2-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> “We see stable outlook on majority of the corporate sector,” Icra said in its report.</figure>\n\t\t\t</section></div><span>\n</span><p>Although the credit outlook for corporate sector expected to be stable, several sectors like airlines, telecom, real estate, pharmaceuticals, IT and sugar may witness earnings pressure in FY19, a report said.</p><span>\n</span><p>“We see stable outlook on majority of the corporate sector,” Icra said in its report ‘Indian Corporate Sector, Credit Outlook for FY19’ here.</p><span>\n</span><p>However, going forward, rising commodity prices and rupee depreciation, coupled with rising inflation and interest rates could affect earnings and credit outlook of airlines,<br>automobile, consumer durables, FMCG, chemicals, paints etc. going forward, Icra group head – corporate sector ratings Subrata Ray said.</p><span>\n</span><p>So far, the Icra report pointed out that continuing the past two-year trend, corporate earnings improved on the back of benign commodity prices and improving consumption demand. This trend continued to an extent in FY18 as healthy volume growth helped offset the impact of rising commodity prices.</p><span>\n</span><p>Automobiles, FMCG, consumer durables and retail, have witnessed a pick-up in demand aided by low demonetisation base and improved consumer demand on back of the benefits of seventh pay commission, rural recovery and GST rate cuts.</p><span>\n</span><p>However, the sectors that could not benefit in FY18 and witnessed earnings contractions were telecom, pharmaceuticals, IT, airlines, tyres, and sugar industries, Icra said.</p><span>\n</span><p>On infrastructure, Ray pointed out, “We believe that pick-up in the affordable housing segments and infrastructure, primarily road and irrigation projects, are likely to support demand growth going forward in core sectors like cement and steel.”</p><span>\n</span><p>Cement production has been on an improving trend over the past few quarters, post demonetisation, GST implementation and disruption in availability of sand. Likewise, steel<br>consumption also grew by approximately 6 per cent during FY18 and is likely to grow between 5-6 per cent in FY19 aided by government’s infrastructure push, he added.</p><span>\n</span><p>However, companies in the oil exploration and metals will be the key contributors to improvement in Ebidta margins owing to steadily rising commodity prices.</p><span>\n</span><p>The airline industry has been affected from increasing fuel prices and weak pricing power, despite healthy traction on demand; the telecom sector from overall low ARPUs due to<br>competitive pressures and high debt burden and; the real estate sector from continued phase of stabilisation and consolidation post Real Estate Regulation and Development (RERA) Act and GST implementation, it added.</p><span>\n</span><p>Icra pointed out that the pharmaceutical sector is grappling from pricing pressure in the US generics market, limited new product launches in the generics space and higher costs associated with regulatory compliance.</p><span>\n</span><p>While earnings for IT companies have been on a declining trend reflecting the challenging operating, environment characterised by continued pressure on commoditised IT services, wage inflation, higher onsite costs necessitated by visa curbs as well as lower discretionary spend by corporate, the report said.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "continuing",
        "continued",
        "rising",
        "corporate",
        "healthy",
        "pointed",
        "past",
        "two",
        "improved",
        "improving",
        "back",
        "benign"
    ],
    "nouns": [
        "demand",
        "pressure",
        "consumption",
        "rising",
        "commodity",
        "pharma",
        "offset",
        "report",
        "growth",
        "trend",
        "year",
        "may",
        "telecom",
        "IT",
        "earnings",
        "past",
        "two",
        "impact",
        "back",
        "volume",
        "extent"
    ],
    "verbs": [
        "demand",
        "pressure",
        "offset",
        "report",
        "trend",
        "impact",
        "back"
    ]
}