{
    "creator": "Sumit Jha",
    "title": "Digital disruption: What makes the modern CFO?",
    "link": "https://www.financialexpress.com/industry/technology/digital-disruption-what-makes-the-modern-cfo/1200843/",
    "pubDate": "Mon, 11 Jun 2018 02:35:10 +05:30",
    "dc:creator": "Sumit Jha",
    "content": "As technologies such as artificial intelligence, automation, IoT, blockchain and machine learning are impacting how business decisions are  being taken, CFOs have learnt to go beyond number-crunching.",
    "contentSnippet": "As technologies such as artificial intelligence, automation, IoT, blockchain and machine learning are impacting how business decisions are  being taken, CFOs have learnt to go beyond number-crunching.",
    "guid": "https://www.financialexpress.com/?p=1200843",
    "categories": [
        "Industry",
        "Technology"
    ],
    "isoDate": "2018-06-10T21:05:10.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.2857142857142857,
        "tokens": [
            "digital",
            "disruption",
            "what",
            "makes",
            "the",
            "modern",
            "cfo?"
        ],
        "words": [
            "disruption"
        ],
        "positive": [],
        "negative": [
            "disruption"
        ]
    },
    "article": {
        "title": "Digital disruption: What makes the modern CFO?",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img src=\"https://images.financialexpress.com/2018/06/page-14.jpg\" alt=\"CFO, chief financial officer\" class=\"size-full wp-image-1200851\" srcset=\"https://images.financialexpress.com/2018/06/page-14.jpg 660w, https://images.financialexpress.com/2018/06/page-14-300x200.jpg 300w, https://images.financialexpress.com/2018/06/page-14-620x413.jpg 620w, https://images.financialexpress.com/2018/06/page-14-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> (From left) Ajay Kumar, Sr Director, Sales Consulting ERP &amp; EPM, Oracle; Giridhar Sanjeevi, Executive Vice President &amp; CFO, Taj Hotels; and Sugata Sircar, CFO, Schneider Energy.</figure>\n\t\t\t</section></div><span>\n</span><p>The technological changes sweeping the business landscape have reached the doors of chief financial officers (CFO), breaking the status quo and demanding a drastic alteration in their roles to ensure a company does not lag behind those who adapt quickly. A couple of years ago, technologies like artificial intelligence, automation, internet of things (IoT), blockchain and machine learning were billed as game changers but were largely restricted to the academic realm. However, this has changed dramatically considering nearly all businesses today use one or more of these tools for critical decision-making inputs.</p><span>\n</span><p>Says Sugata Sircar, CFO, Schneider Energy: “We have been observing that the role of CFOs is transforming to being a strategic partner today.” According to him, the expectation from the CFO is changing. CFOs are expected to have an insightful and analytical approach. “They now need to understand emerging technologies such as automation and digitalisation of the business,” he adds.</p><span>\n</span><p>This has been demanding on the traditional CFOs who rely on chunks of business information being relayed to them by different departmental teams. This process often leads to transmission losses that could hinder the CFO from looking at the full picture. However, with new tools, a CFO can analyse any isolated business event at a granular level in real time.</p><span>\n</span><p>The difference between a traditional  CFO and a modern CFO is explained by Ajay Kumar, senior director, sales consulting ERP &amp; EPM at Oracle. “An e-commerce operator has information on every single customer and transaction, their browsing history, what do they look at, what do they buy, what is their wish list,” he says. “In the traditional retail model of business, you know who the main customer is. But you do not know about many people who could potentially become your main customers.”</p><span>\n</span><p>Although the changes sound ominous for a conventional number-cruncher CFO, it also presents opportunities to leverage technology on the existing domain knowledge-base. The transition, however, requires not just understanding of technology but an unambiguous embrace of the same. </p><span>\n</span><p>Businesses are opting for digital technologies rapidly, so, as a senior leader in the organisation, CFOs need to support this transformation, says Giridhar Sanjeevi, executive vice president and chief financial officer of Taj Hotels. “The other aspect is the outlook of the finance function. It has become more and more forward-looking. The whole value proposition that CFOs bring has also changed. Now, CFOs are the data analysts for business,” points out Sanjeevi. </p><span>\n</span><p>This means a CFO has to take the mantle of a leader in digital transformation and start using modern technological tools in the finance department itself. For a smooth and successful digital transition, a CFO needs to adopt cloud computing that allows deployment of aforementioned technological tools rather inexpensively, says Oracle’s Kumar. This would need a change in mindset as traditionally CFOs are particular about protecting the data and are averse to hosting it on a location outside their premise.</p><span>\n</span><p>“If you want to analyse data, you need to have a huge computing ability. However, since this vast computing power is used only sparingly, say twice a month, an in-house system turns out to be expensive. That is the reason most of the organisations fail to invest in such kind of technologies. So now what is happening is that, they are moving on the cloud computing, technology is moving to cloud computing,” Kumar added.</p><span>\n</span><p>Additionally, cloud computing ensures that a CFO isn’t dithered by the prospect of failure in deploying a certain tool as a pilot project with limited scope. Modern tools allow a CFO to run such an experiment and analyse whether it works for the business and suitable for blanket implementation. “That fear is there. Now what technology is doing, is that for finance office, technology is making it very very simple and cost effective for the office of finance to experiment with transformation,” Kumar said.</p><span>\n</span><p>Further, a traditional CFO may want to hire people well-versed in finance to sift through huge amount of data being generated by new technologies. However, experts say it’s a fallacy as data analysts—who may not have domain knowledge of finance—are important to cull out relevant information from huge piles of data for further analysis.</p><span>\n</span><p>However, a pertinent question in the times of modern technology is whether it would lead to loss of jobs. Oracle’s Kumar answers in the negative. “The jobs will be re-defined, there will be change in the nature of the jobs,” he says. But will it affect the job market? “Probably for the very, very short while,” he admits, adding, “In my view, in the long run, there will be more jobs.”</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "artificial",
        "Digital",
        "taken",
        "modern",
        "go"
    ],
    "nouns": [
        "learning",
        "business",
        "As",
        "disruption",
        "modern",
        "intelligence",
        "automation",
        "CFO",
        "machine",
        "go",
        "number"
    ],
    "verbs": [
        "machine",
        "go",
        "number"
    ]
}