{
    "title": "A crisis which Chanda Kochhar could not overcome",
    "link": "https://timesofindia.indiatimes.com/business/india-business/a-crisis-which-kochhar-could-not-overcome/articleshow/64640858.cms",
    "pubDate": "Mon, 18 Jun 2018 22:30:00 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/a-crisis-which-kochhar-could-not-overcome/articleshow/64640858.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64640858.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/a-crisis-which-kochhar-could-not-overcome/articleshow/64640858.cms",
    "isoDate": "2018-06-18T22:30:00.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.375,
        "tokens": [
            "a",
            "crisis",
            "which",
            "chanda",
            "kochhar",
            "could",
            "not",
            "overcome"
        ],
        "words": [
            "crisis"
        ],
        "positive": [],
        "negative": [
            "crisis"
        ]
    },
    "article": {
        "title": "A crisis which Kochhar could not overcome",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>MUMBAI: </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/chanda-kochhar\">Chanda Kochhar</a><p> has been an old hand in dealing with crises. As the bank’s retail head, she was part of the team that had to deal with a run on the bank in 2003 that began in Gujarat following rumours. After taking charge as joint managing director during the global financial crisis, she had to again battle a near-run on the bank caused by rumours.\n\n</p><p>When in 2009 she took charge of the bank at the age of 48, becoming the youngest CEO to do so, a large chunk of the senior management exited. Kochhar was unruffled and drew up a post-crisis strategy, with the focus on 4Cs (Cost, Credit, Current and savings account, and Capital). The clearly articulated strategy was a success and the bank was again on a high growth path.\n</p><span>While there have been whispers of the deals between her husband </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Deepak-Kochhar\">Deepak Kochhar</a><p> and Videocon for over two years, she has maintained a stoic silence over it. But even as this progressed from whispers to headlines in mainstream media, and then to a full-blown investigation by authorities, Kochhar’s demeanour has not changed. Employees are not able to gauge to what extent she is affected by the recent crisis. Kochhar, who used to do theatre during her college days, is not known to reveal her emotions.\n</p><span>\n</span><div class=\"image\" data-msid=\"64641681\"><img src=\"https://timesofindia.indiatimes.com/img/64641681/Master.jpg\" alt=\"Ladder\"></div><span> \n</span><br><span>As a career ICICI banker, Kochhar had played a major role in building the bank’s retail business. More recently, she has demonstrated how quick decisions can help in effective resolution of bad loans, although ICICI was in the same boat as public-sector lenders when it came to non-performing assets.\n</span><br><span>\n</span><br><span>Where she differed from her peers was in her personal life where she was an intensely private person. Unlike her mentor and predecessor </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/K-V-Kamath\">K V Kamath</a><span>, who believed in steering the organisation with a light touch, Kochhar has always maintained a tight grip on things. Some insiders attribute this to a trust deficit on her part. Kochhar herself is understood to believe that the allegations against her are the handiwork of a disgruntled corporate borrower.\n</span><br><span>\n</span><br><span>At all events, including quarterly result announcements, Kochhar has been the only official spokesperson. For the press, it’s not unusual to see only one chair on the dais. The downside of not having enough spokespersons is that there are no voices of support now coming out from within the organisation.\n</span><br><span>\n</span><br><span>Insiders say that one of the reasons why Kochhar has been able to carry on even in difficult circumstances was that she always maintained a tight schedule, budgeting even the time during her car ride for telephonic engagements. Time management was an art that she had mastered when her children were growing up, ensuring that she managed to leave office around 6pm even as she continued to work out of her car. The family-first approach has continued even after she became CEO, squeezing in a lunch meeting with her husband or working out of the </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/ICICI-Securities\">ICICI Securities</a><span> office at Backbay in south Mumbai, a few hundred meters from her home, when a family member was unwell.\n</span><br><span>\n</span></div></div>"
    },
    "adjectives": [
        "10",
        "left",
        "top",
        "right"
    ],
    "nouns": [
        "A",
        "crisis",
        "india",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo"
    ],
    "verbs": [
        "overcome",
        "border",
        "align",
        "style",
        "top",
        "right"
    ]
}