{
    "title": "Govt takes first step on lateral hiring, officers get into a huddle",
    "link": "https://www.business-standard.com/article/economy-policy/govt-takes-first-step-on-lateral-hiring-officers-get-into-a-huddle-118061100016_1.html",
    "pubDate": "Mon, 11 Jun 2018 07:02:00 +0530",
    "content": "The Centre has announced its intention to hire domain experts and professionals at the level of joint secretary",
    "contentSnippet": "The Centre has announced its intention to hire domain experts and professionals at the level of joint secretary",
    "guid": "https://www.business-standard.com/article/economy-policy/govt-takes-first-step-on-lateral-hiring-officers-get-into-a-huddle-118061100016_1.html",
    "isoDate": "2018-06-11T01:32:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "govt",
            "takes",
            "first",
            "step",
            "on",
            "lateral",
            "hiring",
            "officers",
            "get",
            "into",
            "a",
            "huddle"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Govt takes first step on lateral hiring, officers get into a huddle",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tA surprise advertisement across national dailies kept the social media buzzing on Sunday, even as it sent shockwaves through government cadres, especially the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=indian+administrative+services\" target=\"_blank\">Indian Administrative Services </a>(IAS). Government officers’ associations immediately got busy to chalk out their action plan as a nondescript central government ad, drawing record number of eyeballs, invited applications from “talented and motivated Indian nationals” willing to contribute towards nation building.</p>\n<p>\n\tIn simpler terms, the government has formally announced its intention to directly hire professionals and domain experts at the level of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=joint+secretary\" target=\"_blank\">joint secretary.</a> This is a departure from the current practice of mostly IAS officers being posted as <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=joint+secretary\" target=\"_blank\">joint secretary </a>and above through promotions, though there have been some exceptions in the past. Joint secretaries are at a critical level of senior management in the government, leading <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=policymaking\" target=\"_blank\">policymaking </a>as well as implementation of various programmes and schemes.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tFearing the ramifications, at least three of the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=central+government+officers+rsquo+associations\" target=\"_blank\">central government officers’ associations </a>have called for a meeting of their members this week to discuss the advertisement to recruit officers directly to head 10 key departments.</p>\n<p>\n\tBut independent experts cheered the move that would allow people from the private sector and academics to compete with government officials for these posts.</p>\n<p>\n\tThe advertised posts in finance ministry, environment, road transport, shipping, and agriculture, among others, can be applied for by any Indian citizen with necessary qualifications, said the advertisement issued by the Department of Personnel and Training. This is a three-year contract posting.</p>\n<p>\n\tSocial media posts were filled with comments from officers who perceive it as a first large-scale move by the political executive to shift to a ‘spoils system’ as prevalent in the US where top government officers hold and resign from offices in step with the elected executives. Government officials are concerned that the advertisement has asked for a qualifying age of 40 years with 15 years of experience, raising a question mark over seniority. No central government officer currently becomes a <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=joint+secretary\" target=\"_blank\">joint secretary </a>at that age.</p>\n<p>\n\tAs a percentage of senior government officers, the number put out for open recruitment in Sunday’s advertisement is minuscule, at 10. There are 450-odd joint secretaries at the Centre, but each of the posts advertised for are all from high profile departments. This comes soon after a proposal mooted by the Prime Minister’s Office in May to make allocation to posts in the civil services contingent upon the officers’ performance during their post-recruitment training period. At present, the Union Public <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=service\" target=\"_blank\">Service </a>Commission (UPSC) decides among the 29 central government cadres, including IAS, where a candidate would be posted, based on his/her marks in a combined written examination and interview.</p>\n<p>\n\tNitin Desai, former chief economic advisor to the central government and later UN undersecretary general, said it was a good move. “Most countries in the Commonwealth have moved on from the archaic British system of permanent bureaucracy. India was holding out for a long time and without any demonstrably clear reason of efficiency or effectiveness”. Desai, too, was a lateral entrant to government <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=service\" target=\"_blank\">service.</a></p>\n<p>\n\tBut, Vivek Rae, member of the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=seventh+pay+commission\" target=\"_blank\">Seventh Pay Commission </a>and a former IAS officer, said he opposed the proposal. “I am not clear what is driving this proposal. The current lot of officers understands the demands of the political process in a democracy, through years of experience. So even as a trial balloon, it is not well considered, I feel”.</p>\n<p>\n\tNone of the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=service\" target=\"_blank\">service </a>associations <em>Business Standard</em> reached out to were willing to come on record at this stage. Members of the IAS officers association, the service expected to be the most affected by the plans of the government, said they were aware of the proposal for quite some time but would not comment as of now.</p>\n<p>\n\tAmong those planning to meet this week are officers from the Central Excise, Service, and Customs department, who are already aggrieved about an exercise conducted by <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=finance+secretary\" target=\"_blank\">Finance Secretary </a><a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=hasmukh+adhia\" target=\"_blank\">Hasmukh Adhia </a>comparing their performance in goods and services tax collection with that of state government officers. On and off for several years, the government has mooted proposals to recruit officers to head departments through lateral entry.</p>\n<p>\n\tDuring his term, former Prime Minister Manmohan Singh had suggested a similar scheme to recruit up to 10 per cent of the vacancies at joint secretary level from those in state governments, the private sector and from academics.</p>\n<p>\n\tHowever, he had stipulated that the selection process would run through the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=upsc\" target=\"_blank\">UPSC.</a> Manmohan Singh was one of the earliest lateral entrants to join the government. Singh was an economic advisor and then went on to hold the role of finance secretary, later. Montek Singh Ahluwalia, Vijay Kelkar, Rakesh Mohan, and R V Shahi are among other examples of officers who came from outside but held the posts of secretaries to the government. Desai said these officers drove reforms and showed how to work with the civil services. So there is every reason to expect that the new crop will be as efficient, he said.</p>\n<p>\n\tShailesh Pathak, former IAS and now chief executive officer, L&amp;T Infrastructure Develpment Projects, said the advertisement was long overdue.</p>\n<p>\n\t“It will benefit the younger crowd within the IAS as they will also get the chance to become a joint secretary, instead of waiting their turn”. He said once the scope of the exercise was expanded, it would create an incentive system among the government officers to excel.</p>\n<p>\n\tWhile Rae argued the officers who will join might score on domain knowledge, but they may fall short on the experience of working in the “fields”. “I am also concerned that they will not be able to speak their mind independently”, which, he said, was impossible if the officers were on limited contract.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "announced",
        "joint",
        "lateral",
        "level",
        "first"
    ],
    "verbs": [
        "Centre",
        "joint",
        "step",
        "level",
        "hire",
        "huddle"
    ],
    "nouns": [
        "domain",
        "secretary",
        "Centre",
        "joint",
        "intention",
        "step",
        "lateral",
        "level",
        "first",
        "huddle",
        "hire"
    ]
}