{
    "creator": "ANI",
    "title": "India envisioned as five trillion-dollar economy: PM Modi",
    "link": "https://www.financialexpress.com/economy/india-envisioned-as-five-trillion-dollar-economy-pm-modi/1210010/",
    "pubDate": "Mon, 18 Jun 2018 07:10:10 +05:30",
    "dc:creator": "ANI",
    "content": "The Prime Minister also encouraged states to give fresh ideas to the Finance Commission for incentivising outcome-based allocations, and expenditure correction.",
    "contentSnippet": "The Prime Minister also encouraged states to give fresh ideas to the Finance Commission for incentivising outcome-based allocations, and expenditure correction.",
    "guid": "https://www.financialexpress.com/?p=1210010",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-18T01:40:10.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "india",
            "envisioned",
            "as",
            "five",
            "trillion-dollar",
            "economy",
            "pm",
            "modi"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "India envisioned as five trillion-dollar economy: PM Modi",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1210013\" src=\"https://images.financialexpress.com/2018/06/cats-1140.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/cats-1140.jpg 660w, https://images.financialexpress.com/2018/06/cats-1140-300x200.jpg 300w, https://images.financialexpress.com/2018/06/cats-1140-620x413.jpg 620w, https://images.financialexpress.com/2018/06/cats-1140-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Prime Minister Narendra Modi said the world expects India to become a five trillion-dollar economy soon. (ANI)</figure>\n\t\t\t</section></div><span>\n</span><p>Prime Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/narendra-modi/\">Narendra Modi</a> said the world expects India to become a five trillion-dollar economy soon. “The world expects India to become a five trillion dollar economy soon,” he said while delivering the closing remarks at a meeting of the NITI Aayog’s governing council here on Sunday.</p><span>\n</span><p>The Prime Minister also encouraged states to give fresh ideas to the Finance Commission for incentivising outcome-based allocations, and expenditure correction. Welcoming the constructive discussion and suggestions made by various chief ministers of the states, the Prime Minister assured the gathering that these suggestions would be seriously considered in the course of decision-making.</p><span>\n</span><p>He also directed the government’s think tank to follow up with the states on the actionable points made by them within three months. “On the lines of the 115 aspirational districts identified by NITI Aayog, states can define their own parameters to identify 20 percent of the total blocks in the state as aspirational blocks,” he said. Expressing happiness that the states were organising investor summits, he further suggested that they should focus on exports.</p><span>\n</span><p>He also encouraged the states to boost ease of doing business, saying NITI Aayog should call a meeting with all the states for the same. He said “ease of living” for the common man was also the need of the hour, and states should take initiatives in this regard.</p><span>\n</span><p>Speaking on the issue of environment raised by chief ministers in the meet, Prime Minister Modi urged all states to use LED bulbs in their government buildings, official residences and streetlights. He suggested that this could be implemented within a definite timeframe. He called upon the Chief Ministers of Madhya Pradesh, Bihar, Sikkim, Gujarat, Uttar Pradesh, West Bengal and Andhra Pradesh, to work together to make recommendations on a coordinated policy approach to the two subjects of “agriculture and MNREGA,” including both pre-sowing, and post-harvest phases.</p><span>\n</span><p>The Prime Minister stated that it was vital to identify the “last people in the line” so that benefits of governance could reach them. He also said social justice was an important governmental objective and those noble causes required close coordination and constant monitoring.</p><span>\n</span><p>Prime Minister Modi reiterated the Union Government’s commitment to providing universal coverage of seven key schemes to 45,000 additional villages in 115 Aspirational Districts, by August 15 this year.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "trillion",
        "Prime",
        "envisioned",
        "five",
        "encouraged",
        "fresh",
        "based"
    ],
    "nouns": [
        "economy",
        "India",
        "expenditure",
        "trillion",
        "Commission",
        "Minister",
        "Finance",
        "Prime",
        "give",
        "five",
        "dollar",
        "PM",
        "outcome",
        "correction"
    ],
    "verbs": [
        "Commission",
        "Minister",
        "Finance",
        "Prime",
        "give"
    ]
}