{
    "creator": "PTI",
    "title": "Baba Ramdev’s Patanjali Group seeks more info on Adani’s bid on Ruchi Soya",
    "link": "https://www.financialexpress.com/industry/baba-ramdevs-patanjali-group-seeks-more-info-on-adanis-bid-on-ruchi-soya/1211068/",
    "pubDate": "Mon, 18 Jun 2018 22:02:04 +05:30",
    "dc:creator": "PTI",
    "content": "Baba Ramdev's Patanjali Group, which is in race to acquire bankruptcy-bound Ruchi Soya, has sought more information related to the bid submitted by its rival Adani Group and also on appointment of a legal advisor of the resolution professional. ",
    "contentSnippet": "Baba Ramdev's Patanjali Group, which is in race to acquire bankruptcy-bound Ruchi Soya, has sought more information related to the bid submitted by its rival Adani Group and also on appointment of a legal advisor of the resolution professional.",
    "guid": "https://www.financialexpress.com/?p=1211068",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-18T16:32:04.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "baba",
            "ramdev’s",
            "patanjali",
            "group",
            "seeks",
            "more",
            "info",
            "on",
            "adani’s",
            "bid",
            "on",
            "ruchi",
            "soya"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Baba Ramdev’s Patanjali Group seeks more info on Adani’s bid on Ruchi Soya",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1211079\" src=\"https://images.financialexpress.com/2018/06/cats-1210.jpg\" alt=\"Baba Ramdev,&nbsp;Patanjali Group,&nbsp;Adani bid on ruchi soya, adani, news onruchi soya, news on&nbsp;Patanjali Group, latest news on&nbsp;Baba Ramdev\" srcset=\"https://images.financialexpress.com/2018/06/cats-1210.jpg 660w, https://images.financialexpress.com/2018/06/cats-1210-300x200.jpg 300w, https://images.financialexpress.com/2018/06/cats-1210-620x413.jpg 620w, https://images.financialexpress.com/2018/06/cats-1210-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> According to sources, Patanjali, which has been declared as H2 (second highest bidder), has not yet submitted a revised bid to match or better the highest offer of Rs 6,000 crore by Adani Wilmar. (PTI)</figure>\n\t\t\t</section></div><span>\n</span><p>Baba Ramdev’s Patanjali Group, which is in race to acquire bankruptcy-bound Ruchi Soya, has sought more information related to the bid submitted by its rival Adani Group and also on appointment of a legal advisor of the resolution professional. According to sources, Patanjali, which has been declared as H2 (second highest bidder), has not yet submitted a revised bid to match or better the highest offer of Rs 6,000 crore by Adani Wilmar. The company was to submit its revised bid under the Swiss Challenge system by June 16. The Commitee of Creditors (CoC) would have to decide on whether to give a fresh deadline to Patanjali to submit a revised bid or declare Adani Wilmar as the winning bidder.</p><span>\n</span><p>However, sources said that Patanjali Ayurveda has sought more information from the lenders of Ruchi Soya. The company wants to know the parameters based on which Adani group has been declared as the highest bidder (H1), they said. Patanjali, which had bid for around Rs 5,700 crore under the Swiss Challenge System, has also sought details related to appointment of Cyril Amarchand Mangaldas as legal advisor of resolution professional, which was already advising Adani Group. When contacted, Patanjali spokesperson S K Tijarawala said: “We have replied to them within the stipulated time frame.” He did not reply to a query whether the Haridwar-based firm has submitted its revised bid or not. Tijarawala had earlier raised question over the neutrality of the process citing media reports of resignation of law firm Cyril Amarchand Mangaldas as advisor of Adani Wilmar.</p><span>\n</span><p>The law firm is also advising the Ruchi Soya’s resolution professional. Last week, Ruchi Soya had in a regulatory filing confirmed that the CoC declared Adani Wilmar as H1 (highest) bidder and Patanjali stood as H2 (second highest). Under the Swiss Challenge system, Patanjali has a right to match or brtter the offer made by Adani.</p><span>\n</span><p>The CoC has decided to conduct Swiss challenge method to maximise the asset value of Ruchi Soya. Sources had earlier said lenders who have to recover about Rs 12,000 crore in outstanding loans from Ruchi Soya, were not happy with the initial bids, wherein Patanjali was the top bidder with an offer of around Rs 4,300 crore followed by Adani at Rs 3,300 crore.</p><span>\n</span><p>Under the Swiss Challenge method, Adani will get another chance to make an offer if Patanjali were to match or better its offer of about Rs 6,000 crore. Patanjali Ayurveda already has a tie-up with the Indore-based Ruchi Soya for edible oil refining and packaging and it wants to further expand into cooking oil business.</p><span>\n</span><p>Ruchi Soya, which is facing the insolvency proceedings, has a total debt of about Rs 12,000 crore. The company has many manufacturing plants and its leading brands include Nutrela, Mahakosh, Sunrich, Ruchi Star and Ruchi Gold.</p><span>\n</span><p>In December 2017, Ruchi Soya Industries Ltd entered into the Corporate Insolvency Resolution Process (CIRP) and Shailendra Ajmera was appointed as interim resolution professional (IRP). The appointment was made by the National Company Law Tribunal (NCLT) on the application of the creditors Standard Chartered Bank and DBS Bank Ltd, under the Insolvency and Bankruptcy Code.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "professional",
        "sought",
        "legal",
        "bound",
        "related"
    ],
    "nouns": [
        "resolution",
        "info",
        "information",
        "bankruptcy",
        "appointment",
        "professional",
        "bid",
        "Group",
        "Soya",
        "rival",
        "advisor",
        "Baba",
        "race",
        "bound"
    ],
    "verbs": [
        "bid",
        "Group",
        "race",
        "acquire",
        "bound",
        "rival"
    ]
}