{
    "title": "Why inclusion of mainland China stocks in MSCI indices isn't good for India",
    "link": "https://www.business-standard.com/article/markets/why-inclusion-of-mainland-china-stocks-in-msci-indices-isn-t-good-for-india-118060400095_1.html",
    "pubDate": "Mon, 04 Jun 2018 09:19:00 +0530",
    "content": "About $140 bn is invested in Indian stocks by FPIs tracking the MSCI EM Index. With China's inclusion, this could decline",
    "contentSnippet": "About $140 bn is invested in Indian stocks by FPIs tracking the MSCI EM Index. With China's inclusion, this could decline",
    "guid": "https://www.business-standard.com/article/markets/why-inclusion-of-mainland-china-stocks-in-msci-indices-isn-t-good-for-india-118060400095_1.html",
    "isoDate": "2018-06-04T03:49:00.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.23076923076923078,
        "tokens": [
            "why",
            "inclusion",
            "of",
            "mainland",
            "china",
            "stocks",
            "in",
            "msci",
            "indices",
            "isn't",
            "good",
            "for",
            "india"
        ],
        "words": [
            "good"
        ],
        "positive": [],
        "negative": [
            "good"
        ]
    },
    "article": {
        "title": "Why inclusion of mainland China stocks in MSCI indices isn't good for India",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tThe addition of Chinese stocks listed on the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=shenzhen+stock+exchange\" target=\"_blank\">Shenzhen stock exchange </a>to the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=msci\" target=\"_blank\">MSCI </a>indices is only token at the moment. There's a minuscule weight of 0.39 per cent for 234 A-list China shares in the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=msci\" target=\"_blank\">MSCI </a>Emerging <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=markets\" target=\"_blank\">Markets </a>Index. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=msci\" target=\"_blank\">MSCI </a>is considering only 5 per cent of the free float for inclusion, that too, in two tranches, in May and August.</p>\n<p>\n\tHowever, this is an important symbolic gesture because it opens the door for China shares to receive higher weight in future. MSCI has finally accepted the case for inclusion of mainland Chinese stocks in its global indices after refusing to do this for several years. The acceptance signals that China is willing to open the door for foreign investors to invest in the PRC's financial assets.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tInstitutional investors benchmark holdings to the MSCI indices. An estimated $12 trillion equivalent is benchmarked to MSCI. ETFs must automatically buy any stock that's covered, in order to mirror the MSCI EM. Hence, the inclusion of Chinese assets ensures that there would be investments pouring into those stocks. Once a second tranche of weights is added in August, there could be more investments. Estimates suggests that anywhere between $15-35 bn of investments will come into the MSCI China index (prior to this, the MSCI China index only tracked Chinese companies listed overseas) and into the MSCI Emerging Market and All Country indices.</p>\n<p>\n\tWhile MSCI approves of the fact that China is easing access to financial assets for overseas investors, it doesn't think the Chinese authorities are doing enough to improve corporate governance, or access for overseas investors.</p>\n<p>\n\tThere are multiple ways in which Chinese authorities control trading on Shenzhen. There is a circuit breaker on individual stocks, and limits on foreign investor holdings. There is also a mechanism by which a company can request trading be suspended in its own shares, and that has been invoked by about half the listed companies on Shenzhen when their shareprices have fallen.  Besides these issues of interference, the MSCI feels that Chinese standards of corporate governance are poor.</p>\n<p>\n\tOver time however, it is inevitable that MSCI will increase the weights of Chinese listings and, it is also likely that the Chinese authorities will do away with the more draconian provisions of trading suspensions, and increase permitted limits for overseas investors. The world's second-largest economy would like foreign portfolio investments and foreign investors would to like exposure to China.</p>\n<p>\n\tThe inclusion of China could have a negative impact on Indian stocks. India has 8.48 per cent weight in the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=msci+emerging+markets+index\" target=\"_blank\">MSCI Emerging </a><a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=markets\" target=\"_blank\">Markets </a>index and about $140 billion or so is invested in Indian stocks by <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=fpis\" target=\"_blank\">FPIs </a>tracking the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=msci+em+index\" target=\"_blank\">MSCI EM Index.</a> As China weight increases, India weight could decline. The initial impact would be minor - MSCI's internal assessment is that 0.2 per cent of India weight could be reduced by August. If the SMCI decides to push China weight up to 20 per cent of free-float, however, the India weight may decline substantially.</p>\n<p>\n\tThe decision by the NSE, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=mcx\" target=\"_blank\">MCX </a>and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=bse\" target=\"_blank\">BSE </a>to stop sharing data with foreign platforms has also led to MCSI considering a review of Indian weights in the MSCI.  The ban on data-sharing reduces access to India for <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=fpis\" target=\"_blank\">FPIs </a>and that could lead to MSCI reducing India weight in retaliation.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Indian",
        "good",
        "About",
        "140"
    ],
    "nouns": [
        "Why",
        "inclusion",
        "mainland",
        "China",
        "stocks",
        "India",
        "Indian",
        "Index",
        "isn",
        "good",
        "tracking",
        "EM",
        "decline"
    ],
    "verbs": [
        "Index",
        "decline"
    ]
}