{
    "title": "Trade war: China hits back with tariffs on US",
    "link": "https://timesofindia.indiatimes.com/business/international-business/china-slaps-additional-tariffs-on-50-billion-worth-of-us-goods/articleshow/64612224.cms",
    "pubDate": "Sat, 16 Jun 2018 07:22:50 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/international-business/china-slaps-additional-tariffs-on-50-billion-worth-of-us-goods/articleshow/64612224.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64612224.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/international-business/china-slaps-additional-tariffs-on-50-billion-worth-of-us-goods/articleshow/64612224.cms",
    "isoDate": "2018-06-16T07:22:50.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.2222222222222222,
        "tokens": [
            "trade",
            "war",
            "china",
            "hits",
            "back",
            "with",
            "tariffs",
            "on",
            "us"
        ],
        "words": [
            "war"
        ],
        "positive": [],
        "negative": [
            "war"
        ]
    },
    "article": {
        "title": "China slaps additional tariffs on $50 billion worth of US goods",
        "content": "<div class=\"Normal\"><span>BEIJING: In a tit-for-tat action, China today imposed additional duties on $50 billion worth of American products, a day after US President </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Donald-Trump\">Donald Trump</a><span> slapped a stiff 25 per cent tariff on Chinese goods worth similar amount, triggering a full-fledged </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/trade-war\">trade war</a><p> between the world's two largest economies.\n\n</p><p>Trump on Friday accused China of intellectual property theft and unfair trade practices as he announced 25 per cent tariff on $50 billion worth of Chinese goods.\n</p><p>The Chinese government has decided to impose additional duties of 25 per cent on 659 items of US products worth about $50 billion, state-run Xinhua news agency reported.\n</p><p>The government also unveiled a list of US products which will be subjected to additional tariffs, it said.\n</p><p>Additional tariffs for 545 items worth about $34 billion including agricultural products, vehicles and aquatic products will be effective from July 6, 2018, a statement issued by China's Customs Tariffs commission said.\n</p><p>The implementation date for imposing additional tariffs on the remaining 114 items, covering chemical products, medical equipment and energy products will be announced later, it said.\n</p><p>The decision has been made in line with relevant stipulations of the Foreign Trade Law of China and the Regulations of the People's Republic of China on Import and Export Duties, as well as the fundamental principles of international laws, the statement said.\n</p><p>On Friday, the US announced additional tariffs of 25 per cent on Chinese imports worth approximately $50 billion.\n</p><p>From July 6, additional tariffs will be levied on some $34 billion worth of Chinese products. Meanwhile, the other $16 billion worth of Chinese products will undergo further review in a public notice and comment process.\n</p><span>\"The US move violates the relevant rules of the </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/World-Trade-Organization\">World Trade Organization</a><p>, goes against the consensus already reached in bilateral economic and trade consultations, seriously infringes upon the legitimate rights and interests of the Chinese side and undermines the interests of China and its people,\" the commission's statement said.\n</p><p>\"The Chinese side firmly opposes that,\" it said.\n</p><p>An official in charge of the Office of the Customs Tariff Commission said that the additional tariffs targeting Chinese goods, once imposed, would \"substantially change\" the trade conditions of these goods, and affect relevant producers and trade companies as well as the production and operation of the upstream and downstream industries.\n</p><p>The official said the Chinese action was taken in response to the emergent circumstances caused by the US violations of international obligations.\n</p><span>China has noticed the US statement which said Washington would continue to impose additional tariffs if China takes retaliatory measures. China reserves its rights to take corresponding measures, the unnamed official was quoted as saying in the report.\n</span><br><span>\n</span><br><span>The moves to import tariffs came as the two countries held several rounds of talks following Trump's demand to slash bilateral trade deficit by $100 billion in a month followed by $200 billion to address the $375 billion deficit.\n</span><br><span>\n</span><br><span>In mid-May, both sides announced a cease-fire after two rounds of trade negotiations. The two sides had said in a joint statement that China would \"significantly increase\" purchases of US agricultural and energy products to reduce the trade imbalance, a top Trump demand.\n</span><br><span>\n</span><br><span>Ten days later, the White House abruptly said it would proceed with the tariffs. A further round of trade talks in Beijing earlier this month failed to yield any breakthroughs.\n</span><br><span>\n</span><br><span>Trump's decision to impose fresh tariffs on China follows his recent imposition of steep tariffs on steel and aluminum imports from Canada, Mexico and the </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/European-Union\">European Union</a><p> on national security grounds.\n</p><span>\n</span></div>"
    },
    "adjectives": [
        "billion",
        "10",
        "left",
        "top",
        "right",
        "international",
        "back",
        "additional",
        "50",
        "worth"
    ],
    "nouns": [
        "billion",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo",
        "Trade",
        "international",
        "China",
        "china",
        "war",
        "back",
        "US",
        "us",
        "50",
        "worth"
    ],
    "verbs": [
        "border",
        "align",
        "style",
        "top",
        "right",
        "Trade",
        "war",
        "back"
    ]
}