{
    "creator": "Jharna Mazumdar",
    "title": "We plan to open around 40 stores, says CMD of V-Mart Retail",
    "link": "https://www.financialexpress.com/industry/we-plan-to-open-around-40-stores-says-cmd-of-v-mart-retail/1199281/",
    "pubDate": "Sat, 09 Jun 2018 02:14:50 +05:30",
    "dc:creator": "Jharna Mazumdar",
    "content": "Multi-brand value retail chain, V-mart retail, plans to shut around 5-6 non-performing stores while it would look at opening around 40 stores in the country in FY19. ",
    "contentSnippet": "Multi-brand value retail chain, V-mart retail, plans to shut around 5-6 non-performing stores while it would look at opening around 40 stores in the country in FY19.",
    "guid": "https://www.financialexpress.com/?p=1199281",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-08T20:44:50.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "we",
            "plan",
            "to",
            "open",
            "around",
            "40",
            "stores",
            "says",
            "cmd",
            "of",
            "v-mart",
            "retail"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "We plan to open around 40 stores, says CMD of V-Mart Retail",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1199291\" src=\"https://images.financialexpress.com/2018/06/vmart-1.jpg\" alt=\"V-mart retail share price, V-mart retail, v mart, sensex, bse, nse, nifty, v mart share price today, v mart share price rbi, v mart share price fii, v mart shares movment\" srcset=\"https://images.financialexpress.com/2018/06/vmart-1.jpg 660w, https://images.financialexpress.com/2018/06/vmart-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/vmart-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/vmart-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Lalit Agarwal, CMD, V-Mart Retail.</figure>\n\t\t\t</section></div><span>\n</span><p>Multi-brand value retail chain, V-mart retail, plans to shut around 5-6 non-performing stores while it would look at opening around 40 stores in the country in FY19. Lalit Agarwal, CMD, V-Mart Retail, told FE’s Jharna Mazumdar that the company is also looking at acquiring a local apparel brand and is in talks with a few players but has not yet found something attractive enough to strike a deal. Excerpts:</p><span>\n</span><p><strong>What are your expansion and investment plans in FY19?</strong></p><span>\n</span><p>At present, we have 178 stores operational in the country and we plan to add around 40 stores in FY19. In the next three years, we would have around 300 stores across the country. Our investments are around Rs 2 crore per store so in FY19 we may be investing around Rs 80 to 90 crore for expansion. We had shut one store in FY18 and are looking at 5 to 6 more stores closely, if it doesn’t work we will shut it. We will continue to expand in Tier II, III and IV cities.</p><span>\n</span><p>We have no plans to enter the metros and Tier I cities as they are not our target audience. Metro cities have been bombarded with many brands. But in the regional markets, there are only few brands, and in Tier 4 markets there is nothing. We at V-Mart always focus on the bottom line rather than the top line and we have been profitable since inception.</p><span>\n</span><p><strong>Your same-store sales growth was around 7% in Q4FY18 compared to 34% in Q4FY17. Can you please explain why it has been low this year?</strong></p><span>\n</span><p>We would like to attribute it to the high base of 34% in Q4FY17, and growing above such a high base we can’t exactly say that the SSG was low. We have witnessed our earnings before interest taxes depreciation and amortisation margin of 10.9% in Q4FY18 compared to 8.9% in Q4FY17. V-Mart’s net profit was up 147% to Rs 15.91 crore for the quarter ended March 2018 while revenue increased 18% to Rs 2,97.4 crore.</p><span>\n</span><p>The company opened five new stores during the quarter out of which four were in UP and one in Bihar, taking the total store count to 171 stores with a total retail area of 1.44 million sq ft. Mostly 80-85% of our sales comes from apparels; 10-12% is non-apparel, whereas only 5-7% is from the FMCG segment. For the last few years, our sales have been growing at 22% to 25% and we will continue to grow at this rate in FY19.</p><span>\n</span><p><strong>How has been the demand post-GST since most of your merchandise are priced at less than Rs 1,000? Have you passed on the benefits to the customers? Are you contemplating any price hike in the near future?</strong></p><span>\n</span><p>We have passed on the benefits of GST to consumers and had reduced prices by around 3% to 4 % which has helped us to witness better volumes in the last couple of quarters. There is some pressure on raw material costs as prices of cotton and polyester has gone up but we don’t intend to increase price in the immediate future and will try to mitigate with our efficiency in supply chain or increased volumes.</p><span>\n</span><p><strong>Are you looking at any acquisitions and fundraising?</strong></p><span>\n</span><p>We have been in talks with few local brands but there aren’t many options and we have not yet found anything attractive to close a deal. However, we are open to it and, if required, we would look at raising funds only if we finalise a deal.</p><span>\n</span><p><strong>When do you plan to go online?</strong></p><span>\n</span><p>E-commerce is not showing great profits and is facing challenges. Whenever we feel that it’s the right time to opt for it, we will do so. We don’t have any immediate plans.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "open",
        "opening",
        "40",
        "V",
        "shut"
    ],
    "nouns": [
        "country",
        "plan",
        "brand",
        "Mart",
        "mart",
        "chain",
        "Retail",
        "retail",
        "performing",
        "look",
        "open",
        "opening",
        "40",
        "V",
        "value"
    ],
    "verbs": [
        "plan",
        "brand",
        "chain",
        "Retail",
        "retail",
        "look",
        "open",
        "value",
        "shut"
    ]
}