{
    "title": "Gujarat tops e-way bill collection since April despite teething problems",
    "link": "https://www.business-standard.com/article/economy-policy/gujarat-tops-e-way-bill-collection-since-april-despite-teething-problems-118060900441_1.html",
    "pubDate": "Sat, 09 Jun 2018 20:32:00 +0530",
    "content": "Strong manufacturing sector helps state forge ahead of Maharashtra, Karnataka, UP and Haryana",
    "contentSnippet": "Strong manufacturing sector helps state forge ahead of Maharashtra, Karnataka, UP and Haryana",
    "guid": "https://www.business-standard.com/article/economy-policy/gujarat-tops-e-way-bill-collection-since-april-despite-teething-problems-118060900441_1.html",
    "isoDate": "2018-06-09T15:02:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "gujarat",
            "tops",
            "e-way",
            "bill",
            "collection",
            "since",
            "april",
            "despite",
            "teething",
            "problems"
        ],
        "words": [
            "problems",
            "tops"
        ],
        "positive": [
            "tops"
        ],
        "negative": [
            "problems"
        ]
    },
    "article": {
        "title": "Gujarat tops e-way bill collection since April despite teething problems",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tDespite industries such as textiles and ceramics, among others facing teething problems, Gujarat has emerged as the leading state in generating e-way bills during April, May and the first week of June.</p>\n<p>\n\tThe state has generated over 10.72 million inter- and intra-state e-way bills, followed by Maharashtra (8.13 million), Karnataka (8.05 million), Uttar Pradesh (7.64 million) and Haryana (7.63 million), respectively.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tRolled out on April 1, the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=e+way+bill\" target=\"_blank\">e-way bill </a>system under the new <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=goods+and+services+tax\" target=\"_blank\">Goods and Services Tax </a>(GST) regime requires businesses and transporters moving goods worth more than Rs 50,000 from one state to another to generate and produce an <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=e+way+bill\" target=\"_blank\">e-way bill.</a> The new regime mandates for e-way bills to be generated for intra-state movement of around 19 commodities as well.</p>\n<p>\n\tFor the period of April, May and first week of June, Gujarat recorded a collection of 4.9 million, 5.2 million, and 573,453 e-way bills, respectively.</p>\n<p>\n\tAccording to R R Patel, joint secretary-checkposts in the commercial tax department of the Government of Gujarat, the state's strength in manufacturing played a major role in the high <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=e+way+bill+collection\" target=\"_blank\"></a><a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=e+way+bill\" target=\"_blank\">e-way bill </a>collection. \"Being a manufacturing state, Gujarat had a high frequency of inter-state as well as intra-state goods movement. This led to the state posting the highest number so far,\" Patel told Business Standard.</p>\n<p>\n\tAmong the goods, cement, chemicals &amp; fertilisers, tobacco, cotton and yarn led the e-way bill collections for Gujarat.</p>\n<p>\n\tFurther, Patel also attributed the trend to around 23 mobile squads conducting surprise checks.</p>\n<p>\n\tHowever, despite sectors like textiles and ceramics facing a decline in capacity utilisation due to impact from the GST regime, the state did not see much impact on goods movement, said Patel.  \"Only fabric sector which was out of value added tax (VAT) but was brought under tax regime under GST was new to the whole system of e-way bill. Hence, we saw some impact there but it was marginal,\" he added.</p>\n<p>\n\tEarlier, a similar system had been implemented online during the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=vat\" target=\"_blank\">VAT </a>regime. \"Under the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=vat\" target=\"_blank\">VAT </a>regime, we had already uploaded the 402 and 403 forms online with transporters and businesses being aware of generating such bills for transit electronically. Hence, when the tax regime changed, many of them had no trouble switching to the e-way bill system,\" said Patel.</p>\n<p>\n\tAccording to another senior state government official, the high <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=e+way+bill+collection\" target=\"_blank\">e-way bill collection </a>is also a result of several district and taluka level awareness programmes conducted by the government. \"Awareness programmes were held with various stakeholders including industry associations, chartered accountants, and bar associations, among others. This too helped pave way for smoother transition to the e-way bill system,\" the official added.</p>\n<p>\n\tAmong the other top e-way bill collecting states following Gujarat, Maharashtra collected 2.99 million, 4.18 million, and 964,778 bills in the months of April and May, and the first of week of June. On the other hand, Karnataka collected 3.73 million, 3.89 million, and 444,047 bills, respectively, for the said period, followed by Uttar Pradesh (2.73 million, 4.41 million and 500,095), and Haryana (2.62 million, 4.51 million and 506,837).</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Strong",
        "tops",
        "ahead",
        "UP"
    ],
    "verbs": [
        "state",
        "forge",
        "bill",
        "UP"
    ],
    "nouns": [
        "state",
        "forge",
        "sector",
        "manufacturing",
        "collection",
        "Karnataka",
        "bill",
        "April",
        "teething",
        "Maharashtra",
        "Gujarat",
        "despite"
    ]
}