{
    "creator": "Ashish Pandey",
    "title": "How noise from ship movement in Indian Ocean is threatening marine life, this study explains",
    "link": "https://www.financialexpress.com/economy/how-noise-from-ship-movement-in-indian-ocean-is-threatening-marine-life-this-study-explains/1199669/",
    "pubDate": "Sat, 09 Jun 2018 14:22:07 +05:30",
    "dc:creator": "Ashish Pandey",
    "content": "The radiated noise that emanates from the movement of ships globally is known to double every decade since 1950, posing a harmful impact on the marine life.",
    "contentSnippet": "The radiated noise that emanates from the movement of ships globally is known to double every decade since 1950, posing a harmful impact on the marine life.",
    "guid": "https://www.financialexpress.com/?p=1199669",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-09T08:52:07.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.13333333333333333,
        "tokens": [
            "how",
            "noise",
            "from",
            "ship",
            "movement",
            "in",
            "indian",
            "ocean",
            "is",
            "threatening",
            "marine",
            "life",
            "this",
            "study",
            "explains"
        ],
        "words": [
            "threatening"
        ],
        "positive": [],
        "negative": [
            "threatening"
        ]
    },
    "article": {
        "title": "How noise from ship movement in Indian Ocean is threatening marine life, this study explains",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1199676\" src=\"https://images.financialexpress.com/2018/06/marine-noise.jpg\" alt=\"How noise from movement of ships in Indian Ocean is threatening marine life, this study explains\" srcset=\"https://images.financialexpress.com/2018/06/marine-noise.jpg 660w, https://images.financialexpress.com/2018/06/marine-noise-300x200.jpg 300w, https://images.financialexpress.com/2018/06/marine-noise-620x413.jpg 620w, https://images.financialexpress.com/2018/06/marine-noise-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The radiated noise that emanates from the movement of ships globally is known to double every decade since 1950. (Image: Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p><span>The radiated noise that emanates from the movement of ships globally is known to double every decade since 1950, posing a harmful impact on the marine life. The emerging geo-strategic relevance of the in the Indian Ocean Region (IOR) has ensured that this increase in the low-frequency shipping noise may be worse than the global average. </span></p><span>\n</span><p><span>The surge in the deaths of marine mammals along the coastline could be attributed to the increase in traffic along the major shipping routes, a study said. “The low-frequency ambient noise due to shipping in the IOR is attributable to the surge in big whale stranding in the west coast, according to a study by Maritime Research Centre (MRC), Pune.</span></p><span>\n</span><p><span>Considering the strategic significance of the IOR on the world map, the geo-economic and geopolitical issues in the region determine the global matters, further aggravating the problem. “The direct linkage of shipping traffic with the global economic index makes it extremely difficult to motivate the political leadership to contain or regulate the shipping traffic,” the study, Acoustic Habitat Degradation Due to Shipping in the Indian Ocean Region (IOR), stated. </span></p><span>\n</span><p><span>“The low-frequency shipping noise propagates to long distance as it gets least attenuated in the undersea medium. This coupled with the geographically well-distributed shipping traffic makes it a very complex mix to drive any conservation initiative. Further, the direct link of the shipping traffic with the economic growth engines makes it politically unviable to bring regulatory provisions. The opening of the north route for shipping will probably bring disaster in terms of the big whale population management”, Dr Arnab Das, the author of the study told FE Online.</span></p><span>\n</span><p><span>All the activities critical to the survival of marine life are being interfered with, studies said, by the increasing levels of noise from ocean-going ship engines, sonar devices, and seismic exploration. Climate change could make the noise problems for marine mammals even worse, several studies have shown. MRC also carried out spatiotemporal mapping of the sound exposure level (SEL) for whales in the low-frequency band of 20 hertz (Hz) to 3 kilohertz (kHz).</span></p><span>\n</span><p><span>“The Acoustic Habitat Degradation is a much serious concern particularly due to the lack of awareness among the policymakers and the practitioners. The conservation efforts somehow ignore the noise aspect of the marine habitat resulting in the sub-optimal response. Globally, there are significant initiatives to address this increasing radiated noise from shipping,” said Dr Arnab Das.</span></p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "marine",
        "Indian",
        "every",
        "threatening",
        "known",
        "double",
        "harmful"
    ],
    "nouns": [
        "marine",
        "Indian",
        "movement",
        "ship",
        "noise",
        "life",
        "Ocean",
        "study",
        "double",
        "decade",
        "posing",
        "impact"
    ],
    "verbs": [
        "noise",
        "ship",
        "study",
        "double",
        "impact"
    ]
}