{
    "title": "Indians may have to wait 151 years for Green Card",
    "link": "https://timesofindia.indiatimes.com/business/india-business/indians-with-advanced-degree-may-have-to-wait-151-years-for-green-card-report/articleshow/64611973.cms",
    "pubDate": "Sat, 16 Jun 2018 07:01:35 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/indians-with-advanced-degree-may-have-to-wait-151-years-for-green-card-report/articleshow/64611973.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64611973.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/indians-with-advanced-degree-may-have-to-wait-151-years-for-green-card-report/articleshow/64611973.cms",
    "isoDate": "2018-06-16T07:01:35.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "indians",
            "may",
            "have",
            "to",
            "wait",
            "151",
            "years",
            "for",
            "green",
            "card"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Wait for green card for Indians may now be as long as 151 years: Report",
        "content": "<div class=\"Normal\"><span>WASHINGTON: Indians with advanced degrees may have to wait for over 150 years for a </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/green-card\">green card</a><p> which authorises them to live and work in the US permanently, according to projections by a think-tank.\n\n</p><span>The new calculation on the Green Card wait period by Cato Institute, a Washington-based think-tank, comes after the US Citizenship and Immigration Services (</span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/USCIS\">USCIS</a><p>) recently released number of applicants for such cards.\n</p><p>The calculation is based on the number of green card issuances in 2017.\n</p><span>As of April 20, 2018, there were 632,219 Indian immigrants and their spouses and minor children waiting for green cards also known as legal permanent residency cards. The shortest wait is for the highest skilled category for </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/EB-1-immigrants\">EB-1 immigrants</a><span> with \"extraordinary ability\". </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/EB\">EB</a><p> stands for employment based.\n</p><p>The extraordinary immigrants from India will have to wait \"only\" six years, Cato Institute said in its latest report.\n</p><span>According to the USCIS, \n</span><span class=\"newsincontext nic_handler\" id=\"nic64491444\" pg=\"NIC#PARENT-business/india-business/indians-with-advanced-degree-may-have-to-wait-151-years-for-green-card-report:64611973-CHILD-:64491444~OPEN-Article\" data-id=\"nic64611973\" data-nic_msid=\"64491444\" data-nic_mstype=\"2\" data-nic_mssubtype=\"0\" data-nic_host=\"83\">\n   there are 34,824 Indian applicants under EB-1 category.\n <span>+</span></span><p> Along with their 48,754 spouse and children, 83,578 Indians are in line for green card under EB-1 category.\n</p><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/EB-3\">EB-3</a><p> immigrants-- those with bachelor's degrees-- will have to wait about 17 years, Cato Institute said. As of April 20, there were 54,892 Indians in this category. Clubbed with 60,381 spouses and children, the total number of Indians waiting for Green Card in EB-3 category are 1,15,273.\n</p><p>However, the biggest backlog is for EB-2 workers, who have advanced degrees.\n</p><p>\"At current rates of visa issuances, they will have to wait 151 years for a green card. Obviously, unless the law changes, they will have died or left by that point,\" Cato institute said.\n</p><p>According to the USCIS, there were 2,16,684 primary Indian applicants under EB-2 category and 2,16,684 spouses and children, thus making a total of 4,33,368.\n</p><p>This is primarily because of the existing laws which imposes per-country-limit of seven per cent.\n</p><p>In all 306,400 primary Indian applicants are waiting for their green cards. Clubbed with their spouses and children numbering 325,819; as many as 632,219 Indians in all are waiting for their green cards.\n</p><p>In 2017 only 22,602 Indians were issued the legal permanent residency cards. Of these 13,082 were in the EB-1 category, 2,879 in EB-2 category and 6,641 in Eb-3 category, according to the latest USCIS figures.\n</p><p>Cato Institute said the green card allocation is not based on the the backlog, so 69 per cent of the backlog is in the EB-2 category, but it received only 13 per cent of the green cards issued in 2017.\n</p><p>There are two reasons for this, it explained.\n</p><p>First, each category is guaranteed a minimum of 40,040 green cards, so the allocation between categories does not adjust when one category has higher demand than the others.\n</p><p>Second, EB-2 is currently subject to the per-country limits, that prevent Indian immigrants from receiving more than seven per cent of the green cards issued in the category, the report said.\n</p><span>Cato Institute notes that that for employment-based green cards, the per-country limit only applies in full force when the category is filled up, meaning that if some green cards would go to waste, Indian immigrants can receive above the per-country limit of 7 per cent. For this reason, Indian immigrants received nearly 18 per cent of the total green cards issued in the EB-3 category in 2017.\n</span><br><span>\n</span><br><span>Referring to the inconsistency in the application of the per-country limit, the report said if the per-country limits end up not applying fully for EB-2 during some future years, they could receive their green cards before the next century.\n</span><br><span>\n</span><br><span>For example, if they received the same number of green cards as EB-3 workers did in 2017, they would have to wait \"only\" for 65 years, rather than 151 years as projected based on the number of issuances in 2017.\n</span><br><span>\n</span><br><span>On the other hand, if the per-country limits end up applying fully for EB-3 workers after 2018, they could end up having to wait more than 40 years, rather than 17 years, the report said. \n</span><br><span>\n</span><br><span>\n</span><a href=\"https://eisamay.indiatimes.com/world/indians-may-now-have-to-wait-for-151-years-to-get-green-card/articleshow/64613301.cms\" rel=\"nofollow\">Read this story in Bengali</a><span>\n</span></div>"
    },
    "adjectives": [
        "Green",
        "green",
        "advanced",
        "10",
        "left",
        "top",
        "right"
    ],
    "nouns": [
        "margin",
        "Card",
        "card",
        "india",
        "may",
        "wait",
        "years",
        "Green",
        "green",
        "business",
        "degree",
        "report",
        "border",
        "10",
        "left",
        "style",
        "top",
        "right",
        "photo"
    ],
    "verbs": [
        "Card",
        "card",
        "wait",
        "Green",
        "green",
        "report",
        "border",
        "align",
        "style",
        "top",
        "right"
    ]
}