{
    "creator": "Nanda Kasabe",
    "title": "China inks contracts for 5L bales of cotton from India",
    "link": "https://www.financialexpress.com/market/commodities/china-inks-contracts-for-5l-bales-of-cotton-from-india/1208117/",
    "pubDate": "Sat, 16 Jun 2018 01:03:24 +05:30",
    "dc:creator": "Nanda Kasabe",
    "content": "With China's buffer stock of cotton coming down to barely a year’s inventory, the country has started looking at other markets for import.",
    "contentSnippet": "With China's buffer stock of cotton coming down to barely a year’s inventory, the country has started looking at other markets for import.",
    "guid": "https://www.financialexpress.com/?p=1208117",
    "categories": [
        "Commodities",
        "Market"
    ],
    "isoDate": "2018-06-15T19:33:24.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "china",
            "inks",
            "contracts",
            "for",
            "5l",
            "bales",
            "of",
            "cotton",
            "from",
            "india"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "China inks contracts for 5L bales of cotton from India",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1208124\" src=\"https://images.financialexpress.com/2018/06/1-39.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/1-39.jpg 660w, https://images.financialexpress.com/2018/06/1-39-300x200.jpg 300w, https://images.financialexpress.com/2018/06/1-39-620x413.jpg 620w, https://images.financialexpress.com/2018/06/1-39-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> China inks contracts for 5L bales of cotton from India</figure>\n\t\t\t</section></div><span>\n</span><p>With China’s buffer stock of cotton coming down to barely a year’s inventory, the country has started looking at other markets for import.</p><span>\n</span><p>According to top industry sources, China has signed contracts for 5,00,000 bales of cotton from Indian traders for the new season. With the country also announcing an additional quota for 48 lakh bales, which it may begin procuring from July1, India stands to gain at least 10-15% of the given quantity.</p><span>\n</span><p>Arun Sekhsaria, managing director, DD Cotton, a major international cotton exporter, pointed out that Chinese contracts have been signed with traders for around 5,00,000 bales and the shipments are expected to leave from India in November-December. China normally has a buffer stock of nearly 120-150 lakh tonne which is expected to drastically go down to barely 25-40 lakh tonne by August this year and therefore the country has begun building up its stocks, he said.</p><span>\n</span><p>A couple of days ago, the country had announced a quota of nearly 48 lakh bales which it intends to begin importing from July 1, 2018. China’s buffer stocks began depleting from 2015.<br>Since Indian prices are the cheapest in international market, China will also look towards India for cotton, he said. The recent contracts have been signed for 88-92 cents per pound for the season of 2018-19. According to traders, China is likely to import at least 20 lakh bales from India.</p><span>\n</span><p>India’s new cotton season commences from October. Since China’s production is expected to go down in the coming season, prices have gone up by nearly 18%. Indian cotton was sold at around 86 to 92 cents per pound on a cost and freight basis (C&amp;F) to China, for shipments in November and December.</p><span>\n</span><p>Exporters in India usually start selling new season cotton from end-August, after estimating the nation’s crop size. But robust demand from China and higher prices have prompted Indian exporters to sign deals in advance, industry people said.</p><span>\n</span><p>India could export more than 20 lakh bales to China in November and December as Indian cotton is nearly 10 cents a pound cheaper than supplies from other exporters such as the United States and Brazil.<br>China is likely to import 14 lakh tonne of cotton in the 2018-19 crop year, its agriculture ministry said, raising its forecast from a previous estimate of 12 lakh tonne due to poor local crop. Amid the robust export demand, cotton sowing in India has been delayed by nearly a fortnight in central and southern parts due to patchy rainfall, but it is expected to pick up in coming weeks.</p><span>\n</span><p>Meanwhile, the Confederation of Indian Textile Industry (Citi) has said that there is sufficient cotton for the textile sector to smoothly run their units throughout the year The recent increase in cotton prices in the Indian market is due to rise in prices across the globe, led by China and the US weather fears impacting the 2018-19 crop size negatively. Citi estimated the production of Indian cotton crop for the ongoing cotton season 2017-18 at 373 lakh bales (of 170 kg each), up around 8.11% from the previous year. The increase is mainly due to a 13% rise in area under cotton cultivation from 108.45 lakh hectare to 122.59 lakh hectare.</p><span>\n</span><p>“The estimated balance-sheet for 2017-18 shows production at 373 lakh bales, imports at 15 lakh bales and exports at 70 lakh bales. Further consumption is estimated to be 316 lakh bales (including non-mill consumption of 19 lakh bales) against 306 lakh bales in 2016-17,” said Citi chairman Sanjay K Jain. Considering the opening stock for 2017-18 at 47.81 lakh bales as decided by the Cotton Advisory Board, Citi said the closing stock will be around 49.81 lakh bales which is quite sufficient for the textile sector to smoothly run their units throughout the year.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "stock",
        "looking",
        "down",
        "coming"
    ],
    "nouns": [
        "India",
        "country",
        "stock",
        "China",
        "looking",
        "cotton",
        "buffer",
        "inventory",
        "coming",
        "import",
        "year",
        "down"
    ]
}