{
    "title": "Karnataka Bank to keep its gross NPA level below 5% after provisoning",
    "link": "https://www.business-standard.com/article/finance/karnataka-bank-to-keep-its-gross-npa-level-below-5-after-provisoning-118053100460_1.html",
    "pubDate": "Sat, 02 Jun 2018 20:53:00 +0530",
    "content": "The private lender expects to have at least Rs 3 trillion of total business by 2020",
    "contentSnippet": "The private lender expects to have at least Rs 3 trillion of total business by 2020",
    "guid": "https://www.business-standard.com/article/finance/karnataka-bank-to-keep-its-gross-npa-level-below-5-after-provisoning-118053100460_1.html",
    "isoDate": "2018-06-02T15:23:00.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.16666666666666666,
        "tokens": [
            "karnataka",
            "bank",
            "to",
            "keep",
            "its",
            "gross",
            "npa",
            "level",
            "below",
            "5",
            "after",
            "provisoning"
        ],
        "words": [
            "gross"
        ],
        "positive": [],
        "negative": [
            "gross"
        ]
    },
    "article": {
        "title": "Karnataka Bank to keep its gross NPA level below 5% after provisoning",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tAt a time when the banking sector in India is reeling under a huge burden of rising bad loans, Mangaluru-based private sector lender <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=karnataka+bank\" target=\"_blank\">Karnataka Bank </a>is hopeful of containing its gross non-performing assets (NPA) below five per cent in the current financial year, and doesn't see further slippages from its corporate accounts going ahead.</p>\n<p>\n\tThe bank, with a healthy net interest margin (NIM) of above three per cent, is also planning to reduce its cost of capital to less than one per cent from the current level of around 1.25 per cent.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\t\"As of now, even with the proactive disclosures of NPA, our gross <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=npa\" target=\"_blank\">NPA </a>remains well below five per cent. Definitely, it will never cross that level and gradually, the slippages could be in the range of less than one per cent and credit cost could be less than one per cent,\" CEO &amp; Managing Director of Karnataka Bank, Mahabaleshwara MS told Business Standard.</p>\n<p>\n\tNotably, net profit of the private sector lender slumped 92 per cent at Rs 110 million for the fourth (January- March) quarter of FY18 due to multi-fold jump in provisioning for bad assets. Gross <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=npa\" target=\"_blank\">NPA </a>rose to 4.92 per cent by the end of March 2018, while its net <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=npa\" target=\"_blank\">NPA </a>increased to 2.96 per cent.</p>\n<p>\n\tGiving the rationale behind the higher provisioning, Mahabaleshwara said the bank didn't have many loan defaults from its corporate accounts, but took the opportunity to clean up its balance sheet in the wake of new <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=rbi\" target=\"_blank\">RBI </a>norms.</p>\n<p>\n\t\"There was actually no pain in the sense that we have exposure to some corporates through the consortium. With the change in NPA recognition norm, we had to recognise a few of those accounts as NPA because of default by these groups on loans from other <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=banks\" target=\"_blank\">banks.</a> We took this opportunity to clean up our balance sheet and make adequate provisions,” said Mahabaleshwara.</p>\n<p>\n\t“We have declared more than Rs 5.90 billion as NPA and an equal amount, we have also provided for. So, we have further strengthened our balance sheet. The chance of further slippage appears to be very remote.\"</p>\n<p>\n\tHe also said that stress in its entire portfolio was over and the bank would see higher business growth in the current financial year. \"We have already put a strong foundation for our future growth by cleaning up the balance sheet. If you see, in FY18, when the credit growth for the entire industry was around eight per cent, we grew by 28 per cent. So, for the current year also, I am optimistic about attaining a growth rate of 20 per cent in advances. And, overall bank deposits are also likely to grow by 18 per cent,\" Mahabaleshwara said.</p>\n<p>\n\tMSME, housing finance, lease rental discounting, corporates with sound credit rating are some of the verticals on which the private sector lender is focussing on for credit growth this fiscal.</p>\n<p>\n\tMeanwhile, the bank has appointed Boston Consulting Group (BCG) to improve overall efficiency. \"With this tie-up, we want to emerge as a strong bank in the Indian banking system. By 2024, which is our centenary year, we want to improve our market share to one per cent from the present 0.54 per cent. We also want to double our business every three years. By 2020, we want to have at least Rs 3 trillion of total business,\" he said.<br></p>\n\t<p>\n\t\t<strong>POSITIVE STEPS </strong></p>\n\t<ul>\n\t\t<li>\n\t\t\tWith a healthy net interest margin of above 3 per cent, the bank is planning to reduce its cost of capital to less than one per cent from the current level of around 1.25 per cent.</li>\n\t\t<li>\n\t\t\tNet profit of the private sector lender slumped by 92 per cent to Rs 110 million for the fourth quarter of FY18.</li>\n\t\t<li>\n\t\t\tThe bank, reportedly, didn’t have many defaults from its corporate accounts.</li>\n\t</ul>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "least",
        "gross",
        "level",
        "private",
        "trillion",
        "total"
    ],
    "verbs": [
        "Bank",
        "keep",
        "gross",
        "level",
        "total"
    ],
    "nouns": [
        "least",
        "Bank",
        "gross",
        "NPA",
        "level",
        "private",
        "lender",
        "trillion",
        "total",
        "business",
        "keep",
        "Karnataka"
    ]
}