{
    "title": "ICICI Bank-Videocon case: Auditors and lawyers to help Srikrishna probe",
    "link": "https://www.business-standard.com/article/finance/icici-bank-videocon-case-auditors-and-lawyers-to-help-srikrishna-probe-118061600034_1.html",
    "pubDate": "Sat, 16 Jun 2018 01:36:00 +0530",
    "content": "ICICI Bank's audit committee, led by board member Uday Chitale, would assist the independent probe",
    "contentSnippet": "ICICI Bank's audit committee, led by board member Uday Chitale, would assist the independent probe",
    "guid": "https://www.business-standard.com/article/finance/icici-bank-videocon-case-auditors-and-lawyers-to-help-srikrishna-probe-118061600034_1.html",
    "isoDate": "2018-06-15T20:06:00.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.2,
        "tokens": [
            "icici",
            "bank-videocon",
            "case",
            "auditors",
            "and",
            "lawyers",
            "to",
            "help",
            "srikrishna",
            "probe"
        ],
        "words": [
            "help"
        ],
        "positive": [
            "help"
        ],
        "negative": []
    },
    "article": {
        "title": "ICICI Bank-Videocon case: Auditors and lawyers to help Srikrishna probe",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tFormer Supreme Court judge B N Srikrishna, who has been appointed by the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/icici\" target=\"_blank\">ICICI </a>Bank’s board to probe the allegations of conflict of interest against its MD and CEO Chanda Kochhar, will be aided by a number of internal and external ‘experts’ to complete the investigation.</p>\n<p>\n\tAccording to corporate lawyers, Srikrishna will require help from the bank’s independent directors, forensic auditors and lawyers with international expertise as many transactions between <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nupower\" target=\"_blank\">NuPower </a>Renewables, owned by Chanda’s husband Deepak Kochhar, the Videocon group, and the Matix group took place overseas.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/icici\" target=\"_blank\">ICICI </a>Bank’s audit committee, led by board member Uday Chitale, would assist the independent probe, Srikrishna told television channels.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nupower\" target=\"_blank\">NuPower </a>received equity as well as debt investments from Mauritius-based entities owned by two business groups. <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/icici\" target=\"_blank\">ICICI </a>Bank gave loans of Rs 32.5 billion to the Videocon group, which invested Rs 640 million in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nupower\" target=\"_blank\">NuPower.</a> There have been allegations that there was a quid pro quo in the deals.</p>\n<p>\n\tKochhar’s term is ending in March 2019, while Chairman M K Sharma will retire at the end of this month.</p>\n<p>\n\t“This is the standard operating procedure for such inquiries. The one-man inquiry panel would even need help from technology experts to retrieve old digital records, if necessary,” said a partner of an audit firm, which has done similar forensic audits at other companies.</p>\n<p>\n\tLawyers fear that one of the biggest impediments to the inquiry, which will cover the period from 2009 to now, will be absence of records. “This is a chronic problem in India. As the records are still in the possession of the company, it is difficult to investigate such cases. We have noticed that even e-mails are scrubbed clean from the systems as has happened in some cases,” said a leading lawyer.</p>\n<p>\n\tAn ICICI Bank spokesperson did not reply to an e-mail seeking response to terms of reference of Srikrishna’s probe. Earlier, ICICI Bank, the Videocon group, and the Matix group had denied any wrongdoing.</p>\n<p>\n\t\t<img align=\"left\" alt=\"ICICI Bank-Videocon case: Auditors and lawyers to help Srikrishna probe\" class=\"imgCont\" height=\"330\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/16/full/1529093245-27.jpg\" title=\"graph\" width=\"279\"></p>\n\tThe ICICI Bank board had earlier given a clean chit to Kochhar without any formal, independent inquiry. But after a letter was addressed directly to the board under the whistle-blower policy, it had decided to take action and announced it would appoint an independent person to probe the charges.\n<p>\n\tNuPower’s relations with the ICICI Bank clients are also being investigated by Sebi, the Securities and Exchange Commission of US, the Ministry of Corporate Affairs, the income tax department, and the Central Bureau of Investigation.</p>\n<p>\n\tThe first complaint to Prime Minister Narendra Modi was made two years ago by an ICICI Bank shareholder, Arvind Gupta. But the CBI filed a preliminary enquiry against Deepak Kochhar only in February this year. NuPower received Rs 3.25 billion equity infusion from Firstland Holdings in 2010 and exited two years later without making any profit or loss. Firstland is owned by the Kanodias of the Matix group.</p>\n<p>\n\tAn ICICI Bank source had earlier said as the Kanodias were not a borrower of ICICI Bank, the bank’s board was not kept in the loop under the conflict of interest guidelines.</p>\n<p>\n\tICICI Bank has lost 11 per cent of its value in 2018 so far. The BSE Sensex is up 2 per cent in the same period.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "independent"
    ],
    "verbs": [
        "probe",
        "Bank",
        "board",
        "assist",
        "case",
        "audit",
        "help"
    ],
    "nouns": [
        "committee",
        "probe",
        "independent",
        "Bank",
        "board",
        "assist",
        "member",
        "case",
        "audit",
        "help",
        "led"
    ]
}