{
    "title": "You don't have to own cryptocurrency to make money off it",
    "link": "https://www.business-standard.com/article/international/you-don-t-have-to-own-cryptocurrency-to-make-money-off-it-118060900952_1.html",
    "pubDate": "Sat, 09 Jun 2018 23:56:00 +0530",
    "content": "The world of digital currency is poised to draw billions of dollars from institutional investors if it can provide boring back-office services like custody banking and trading systems",
    "contentSnippet": "The world of digital currency is poised to draw billions of dollars from institutional investors if it can provide boring back-office services like custody banking and trading systems",
    "guid": "https://www.business-standard.com/article/international/you-don-t-have-to-own-cryptocurrency-to-make-money-off-it-118060900952_1.html",
    "isoDate": "2018-06-09T18:26:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "you",
            "don't",
            "have",
            "to",
            "own",
            "cryptocurrency",
            "to",
            "make",
            "money",
            "off",
            "it"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "You don't have to own cryptocurrency to make money off it",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tTo make his fortune on cryptocurrency, Jake Benson doesn’t have to choose a winner among the hundreds of firms hawking digital tokens. He just needs to do their taxes.</p>\n<p>\n\tBenson is following the ’49er model — as in 1849. Like industrious shopkeepers during the California Gold Rush, he’s offering the digital equivalent of picks and shovels. In his case, accounting services.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe world of digital currency is poised to draw billions of dollars from institutional investors if it can provide boring back-office services like custody banking and trading systems along with tax accounting. While the functions are essentially the same as in traditional businesses, crypto presents unique challenges.</p>\n<p>\n\t“Just to name one difference, the number of decimal places in a <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=crypto+asset\" target=\"_blank\">crypto asset </a>can be up to 18-plus digits,” said Benson, whose Libra back-office firm caters exclusively to the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=crypto+crowd\" target=\"_blank\">crypto crowd.</a> “That fact alone actually breaks a lot of accounting systems.”</p>\n<p>\n\tHundreds of firms like Benson’s are competing to sell the nuts and bolts of the burgeoning market. Startups financed by venture capital and token sales are fighting for advantage as the field begins to get crowded. Like the sellers of mining implements during the Gold Rush, they plan to profit whether or not Bitcoin and other cryptocurrencies turn out to be digital treasure.</p>\n<p>\n\t<strong>Traditional solutions</strong></p>\n<p>\n\t“What really excites me is this whole picks-and-shovels approach,” said David Wills, chief operating officer of Caspian, a Hong Kong-based provider of crypto trading systems and related technologies for hedge funds. “As long as the asset class has a pulse, those companies will be the ones to succeed.”</p>\n<p>\n\tIf established firms such as <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=state+street+inc\" target=\"_blank\">State Street Inc.</a> and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=bank+of+new+york+mellon+corp\" target=\"_blank\">Bank of New York Mellon Corp.</a> decide to do business with the virtual-currency world, it would lend credibility to the industry even if the firms aren’t that knowledgeable about crypto, said Morgan Hill, a partner at the $30 million Turing Funds in New York.</p>\n<p>\n\t“There are no off-the-shelf solutions from traditional finance,” Hill said. “Everything is still getting pieced together. The expertise in this space are people who got in early and have learned the pitfalls.”</p>\n<p>\n\tAt a trio of crypto conferences in New York last month, hundreds of companies clamored for one of two things, Hill said: investors in their initial coin offerings or customers for their back-office businesses.</p>\n<p>\n\tAlmost all the companies are startups, and most have yet to create what Hill calls an “MVP” -- a minimum viable product. A few, like Libra, Benson’s firm, have been around a few years and are adding clients and staff as demand surges. The trick is to get customers to stay, said Caspian’s Wills.</p>\n<p>\n\t<strong>Creatures of habit</strong></p>\n<p>\n\t“Human beings are creatures of habit,” Wills said. “Once a trading system is built into your operational workflow, it’s hard to remove it. In crypto, there are many different levels of workflow that need to be in place.”</p>\n<p>\n\tWills said Caspian is planning to sell a so-called utility token that can be used to pay trading fees. It will also be used to compensate developers of applications available through Caspian’s system.</p>\n<p>\n\tSince money managers are required to keep customer assets secure, a pressing need is a custodial bank. Custody banks such as BNY Mellon and State Street would fit the bill, but they haven’t committed to crypto.</p>\n<p>\n\t<strong>Job opening</strong></p>\n<p>\n\tThat leaves the job open for digital-money companies. Omega One, an agency brokerage for cryptocurrencies that’s opening an office in Bermuda, says it will work with insurers and the island’s government to set up a custody business there.</p>\n<p>\n\t“Bermuda has an incredibly strong legal, technical, reputational jurisdiction for financial services in general, but particularly for custody of assets and reinsurance,” said Alex Gordon-Brander, Omega One’s chief executive officer.</p>\n<p>\n\tToday’s crypto scene looks a lot like the birth of the dot-com boom in the mid-1990s, Gordon-Brander said. “Obviously, not everybody survives the cut,” he said. “But it’s clear that the revolution is happening and the leaders are emerging.”</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "institutional",
        "poised",
        "own",
        "off",
        "world",
        "digital",
        "boring",
        "back"
    ],
    "nouns": [
        "currency",
        "money",
        "banking",
        "trading",
        "don",
        "office",
        "world",
        "draw",
        "boring",
        "back",
        "services",
        "custody"
    ],
    "verbs": [
        "provide",
        "don",
        "own",
        "off",
        "draw",
        "back"
    ]
}