{
    "creator": "FE Bureau",
    "title": "India, US officials to soon hold talks on trade row",
    "link": "https://www.financialexpress.com/economy/india-us-officials-to-soon-hold-talks-on-trade-row/1208271/",
    "pubDate": "Sat, 16 Jun 2018 04:28:49 +05:30",
    "dc:creator": "FE Bureau",
    "content": "India and the US will soon hold talks to resolve contentious trade issues, including the US’ tight visa regime and a duty on Indian steel and aluminium supplies,",
    "contentSnippet": "India and the US will soon hold talks to resolve contentious trade issues, including the US’ tight visa regime and a duty on Indian steel and aluminium supplies,",
    "guid": "https://www.financialexpress.com/?p=1208271",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-15T22:58:49.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "india",
            "us",
            "officials",
            "to",
            "soon",
            "hold",
            "talks",
            "on",
            "trade",
            "row"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "India, US officials to soon hold talks on trade row",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1208281\" src=\"https://images.financialexpress.com/2018/06/1-66.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/1-66.jpg 660w, https://images.financialexpress.com/2018/06/1-66-300x200.jpg 300w, https://images.financialexpress.com/2018/06/1-66-620x413.jpg 620w, https://images.financialexpress.com/2018/06/1-66-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Stakes are high as Trump renews criticism of India’s ‘high’ tariff regime. Prabhu says US’ willingness to talk a positive step</figure>\n\t\t\t</section></div><span>\n</span><p>Amid heightened fears of an escalating global trade war, senior officials from India and the US will soon hold talks to resolve contentious trade issues, including the US’ tight visa regime and a duty on Indian steel and aluminium supplies, according to commerce and industry minister Suresh Prabhu. The minister was on a two-day visit to the US through June 12.</p><span>\n</span><p>Stakes are high as the officers’ level meeting comes close on the heels of US President Donald Trump renewing his criticism of India’s alleged high tariff regime, which he claimed is as high as 100% on some goods. On Friday, the US decided to go ahead with an earlier plan to slap additional tariffs on a range of Chinese goods totalling $50 billion, raising the possibility of a trade war with Beijing that has already threatened of retaliatory action of the same magnitude.</p><span>\n</span><p>The US has further hardened its stance with even its traditional close allies in the G7 nations, seeking to reduce trade imbalances with them. Against this backdrop, the fact that the US was willing to engage India (which has a trade surplus with the US) to resolve key issues should be viewed positively, Prabhu indicated.</p><span>\n</span><p>India wants an exemption from import duty slapped on steel and aluminium; relaxed visa regime for skilled professionals; delinking of a special tariff regime from market access talks; aircraft manufacturing in India by US firms, among others.</p><span>\n</span><p>During his visit to the US earlier this week, Prabhu held meetings with US commerce secretary Wilbur Ross, trade representative Robert E Lighthizer and agriculture secretary Sonny Perdue, apart from senators, think-tanks and businessmen.</p><span>\n</span><p>“Meeting with the USTR went very well. We made substantive progress on trade and investment issues. Officers’ meeting will take place very soon to discuss all pending issues. We have agreed to work on resolution of various issues and address the concerns of either side,” Prabhu told reporters here. He added that such a meeting might take place by the end of this month.</p><span>\n</span><p>While China alone accounted for a massive $375 billion, or 46%, of the US goods trade deficit of $810 billion in 2017, India made up for just 2.8% and occupied the 9th spot in the list of nations with which the Trump administration seeks to pursue a trade balance agenda.</p><span>\n</span><p>Asked about the impact of possible US trade sanctions on Iran, Prabhu said: “We have to follow any sanctions that the UN imposes. But if one country imposes it (on Iran), then we have to deal in a different way.” India is a major importer of crude oil from Iran. The Islamic republic is also the biggest buyer of its basmati rice.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "contentious",
        "Indian",
        "tight"
    ]
}