{
    "title": "NPA write-offs by PSBs surge 140 per cent over their losses in FY'18",
    "link": "https://www.business-standard.com/article/finance/npa-write-offs-by-psbs-surge-140-per-cent-over-their-losses-in-fy-18-118061500644_1.html",
    "pubDate": "Sat, 16 Jun 2018 01:03:00 +0530",
    "content": "This is for the first time in a decade that banks have made huge write-offs of bad loans along with booking of hefty losses",
    "contentSnippet": "This is for the first time in a decade that banks have made huge write-offs of bad loans along with booking of hefty losses",
    "guid": "https://www.business-standard.com/article/finance/npa-write-offs-by-psbs-surge-140-per-cent-over-their-losses-in-fy-18-118061500644_1.html",
    "isoDate": "2018-06-15T19:33:00.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.23076923076923078,
        "tokens": [
            "npa",
            "write-offs",
            "by",
            "psbs",
            "surge",
            "140",
            "per",
            "cent",
            "over",
            "their",
            "losses",
            "in",
            "fy'18"
        ],
        "words": [
            "losses"
        ],
        "positive": [],
        "negative": [
            "losses"
        ]
    },
    "article": {
        "title": "NPA write-offs by PSBs surge 140 per cent over their losses in FY'18",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tPublic sector banks have written off bad loans worth a whopping Rs 1.20 trillion, an amount that is nearly one-and-a-half times more than their total losses posted in 2017-18, according to official data.</p>\n<p>\n\tThis is a double whammy for the struggling PSBs as they had massive write-offs as well as huge losses in the last financial year.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThis is for the first time in a decade that banks have made huge write-offs of bad loans along with booking of hefty losses.</p>\n<p>\n\tTill 2016-17, 21 state-owned banks made combined profit while in 2017-18, they posted a staggering loss of Rs 853.7 billion, as per the data.</p>\n<p>\n\tDuring 2016-17, PSU banks wrote off non-performing assets (NPAs) worth Rs 816.83 billion as against combined net profit of Rs 4737.2 million.</p>\n<p>\n\tSBI alone has written off bad loans of Rs 401.96 billion, nearly 25 per cent of the total write-offs during 2017-18. This was followed by Canara Bank (Rs 83.1 billion), Punjab National Bank (Rs 74.07 billion) and Bank of Baroda (Rs 49.48 billion).</p>\n<p>\n\tAs per the data provided by rating agency Icra, Indian Overseas Bank has written of NPAs worth Rs 10,307 crore, followed by Bank of India (Rs 90.93 billion), IDBI Bank (Rs 66.32 billion) and Allahabad Bank (Rs 36.48 billion). These banks along with 7 others come under Prompt Corrective Action framework of RBI.</p>\n<p>\n\tAs per the government data, banks' write-offs stood at Rs 344.09 billion in 2013-14. The figure has jumped nearly four-fold in five years. In 2014-15, the banks wrote off Rs 490.18 billion; Rs 575.85 billion in 2015-16, Rs 816.83 billion in 2016-17 and hitting a record high of Rs 1.20 trillion (provisional) in 2017-18.</p>\n<p>\n\tWrite-off in banking parlance means that the bank has made 100 per cent provision from its earning against that account. Following this, NPA is no longer part of its balance sheet.</p>\n<p>\n\tHowever, a write-off puts pressure on balance sheet of banks as it erodes operating profit.</p>\n<p>\n\tIndian banking sector is grappling with mounting NPAs and host of scams and frauds. NPA in the banking sector stood at Rs 8.31 trillion as of December 2017.</p>\n<p>\n\tWeak financials due to mounting bad loans have already pushed 11 banks, out of 21 , under the Prompt Corrective Action (PCA) framework of RBI.</p>\n<p>\n\tThe recent tight prudential norms released by RBI on February 12 have added to the NPA woes.</p>\n<p>\n\tInterim Finance Minister Piyush Goyal has announced setting up of a committee to give recommendations in two weeks on formation of an Asset Reconstruction Company (ARC) for faster resolution of stressed accounts.</p>\n<p>\n\tThe committee under Sunil Mehta, non-executive chairman of PNB, will make recommendations for the same.</p>\n<p>\n\tThe finance minister said the committee will consider whether such an arrangement will be good for the banking system and, if any such suggestion is advisable, it will also consider the modalities by which such an ARC should be set up.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "first",
        "bad",
        "huge",
        "made",
        "140",
        "18",
        "hefty"
    ],
    "nouns": [
        "first",
        "time",
        "booking",
        "bad",
        "banks",
        "surge",
        "cent",
        "NPA",
        "losses",
        "18",
        "decade"
    ],
    "verbs": [
        "time",
        "surge",
        "write"
    ]
}