{
    "title": "Air India seeks Rs 2,000 crore additional funding from government",
    "link": "https://timesofindia.indiatimes.com/business/india-business/air-india-seeks-rs-2000-crore-additional-funding-from-government/articleshow/64518927.cms",
    "pubDate": "Sat, 09 Jun 2018 08:14:36 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/air-india-seeks-rs-2000-crore-additional-funding-from-government/articleshow/64518927.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64518927.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/air-india-seeks-rs-2000-crore-additional-funding-from-government/articleshow/64518927.cms",
    "isoDate": "2018-06-09T08:14:36.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "air",
            "india",
            "seeks",
            "rs",
            "2000",
            "crore",
            "additional",
            "funding",
            "from",
            "government"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Air India seeks Rs 2,000 crore additional funding from government",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>MUMBAI: Cash-crunched </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Air-India\">Air India</a><p>, which delayed salaries for three months in a row, has sought an additional funding of around Rs 2,000 crore from the government to tide over the situation, a senior company official said.\n\n</p><p>The airline is expecting these funds next month when the government moves the first batch of Supplementary Demands for Grants for 2018-19 in the Monsoon session of Parliament, the official said.\n</p><p>The national carrier has already received more than Rs 26,000 crore of the 10-year Rs 30,231-crore bailout package announced by the former UPA government in April 2012.\n</p><p>\"We have requested the government to restore equity infusion in the airline, which was stopped because of the proposed disinvestment. We are seeking an additional Rs 2,000 crore funds to deal with the present situation,\" the official said on condition of anonymity.\n</p><p>Air India had been receiving on an average Rs 3,000-4,000 crore funding per year from the government till financial year 2013-14. However, the amount got substantially reduced after that.\n</p><p>For 2018-19, the carrier was allocated only Rs 650 crore in view of the privatisation plan, which failed badly last month as the government did not receive even a single bid to acquire the 76 per cent stake on offer in the airline.\n</p><span>\"It (the issue of additional funding) will be decided when the first batch of Supplementary Grants for Demands come up in the Monsoon session of Parliament next month,\" the official said.\n</span><br><span>\n</span><br><span>Amid cash crunch, during which Air India also had to defer staff salaries, the airline borrowed Rs 6,250 crore from various banks between last September and this January.\n</span><br><span>\n</span><br><span>The carrier has already approached banks and financial institutions seeking Rs 1,000-crore working capital loans, which it want to avail within this month, in one or more tranches.\n</span><br><span>\n</span><br><span>Civil aviation minister Suresh Prabhu yesterday had said the future course of action for Air India disinvestment process will be decided by the group of ministers.\n</span><br><span>\n</span><p>He said that all alternatives will be discussed by the Air India Specific Alternative Mechanism (AISAM), headed by Union minister Arun Jaitley.\n</p><span>\n</span></div></div>"
    },
    "nouns": [
        "margin",
        "government",
        "India",
        "india",
        "border",
        "10",
        "crore",
        "funding",
        "left",
        "Air",
        "air",
        "top",
        "business",
        "style",
        "right",
        "photo"
    ],
    "verbs": [
        "border",
        "Air",
        "air",
        "top",
        "style",
        "right",
        "align"
    ],
    "adjectives": [
        "10",
        "left",
        "top",
        "right",
        "additional"
    ]
}