{
    "title": "IOCL's ethylene supply constraints threaten petro investments in Odisha",
    "link": "https://www.business-standard.com/article/economy-policy/iocl-s-ethylene-supply-constraints-threaten-petro-investments-in-odisha-118060900713_1.html",
    "pubDate": "Sat, 09 Jun 2018 18:59:00 +0530",
    "content": "The potential polymer-based units at the PCPIR hub were looking at a steady supply of ethylene from the IOCL refinery installed at Paradip",
    "contentSnippet": "The potential polymer-based units at the PCPIR hub were looking at a steady supply of ethylene from the IOCL refinery installed at Paradip",
    "guid": "https://www.business-standard.com/article/economy-policy/iocl-s-ethylene-supply-constraints-threaten-petro-investments-in-odisha-118060900713_1.html",
    "isoDate": "2018-06-09T13:29:00.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.2222222222222222,
        "tokens": [
            "iocl's",
            "ethylene",
            "supply",
            "constraints",
            "threaten",
            "petro",
            "investments",
            "in",
            "odisha"
        ],
        "words": [
            "threaten"
        ],
        "positive": [],
        "negative": [
            "threaten"
        ]
    },
    "article": {
        "title": "IOCL's ethylene supply constraints threaten petro investments in Odisha",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tOdisha’s efforts to draw downstream investors for its PCPIR (Petroleum, Chemicals &amp; Petrochemicals Investment Region) has suffered a jolt with the Indian <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=oil\" target=\"_blank\">Oil </a>Corporation Ltd (IOCL), which is the anchor tenant for the hub, citing constraints in supplying <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ethylene\" target=\"_blank\">ethylene.</a></p>\n<p>\n\tThe potential polymer-based units at the PCPIR hub were looking at a steady supply of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ethylene\" target=\"_blank\">ethylene </a>from the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=iocl\" target=\"_blank\">IOCL </a>refinery installed at <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=paradip\" target=\"_blank\">Paradip.</a> IOCL, however, has plans to use <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ethylene\" target=\"_blank\">ethylene </a>as a feed to set up a mono-ethylene glycol plant as part of its <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=petrochemical\" target=\"_blank\">petrochemical </a>complex. In this backdrop, the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=oil\" target=\"_blank\">oil </a>marketing company is not in a position to spare ethylene for the downstream units as the entire quantity is expected to be consumed in the value addition process.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=iocl\" target=\"_blank\">IOCL </a>chairman Sanjiv Singh, in a letter to Odisha’s chief secretary Sanjiv Singh, has cited the company’s constraints to supply ethylene.</p>\n<p>\n\t“None of the refineries in India is trading large commercial quantities of ethylene today. Also, we have not been approached by any party for ethylene”, said the letter, quoting Singh.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=iocl\" target=\"_blank\">IOCL </a>has suggested that the interested PVC (polyvinyl chloride) units could explore the alternative process of producing ethylene from natural gas with the availability of natural gas around <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=paradip\" target=\"_blank\">Paradip </a>in the future.</p>\n<p>\n\tIOCL’s ethylene glycol project is currently under investment approval. The plant with an annual capacity of 350,000 tonnes is targeted for completion by 2021-22. The <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=oil\" target=\"_blank\">oil </a>major is currently building a polypropylene plant at an estimated cost of Rs 31.5 billion, expected to be commissioned in this fiscal.</p>\n<p>\n\tAs the anchor tenant of the PCPIR, IOCL has sunk in Rs 350 billion on a 15 million tonne crude oil refinery. The refinery is positioned to offer feedstock to downstream industries in chemicals and petrochemicals. The oil major had pledged to invest Rs 517.79 billion more to commission various units of its planned <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=petrochemical\" target=\"_blank\">petrochemical </a>complex.</p>\n<p>\n\tIn January this year, Odisha’s chief minister Naveen Patnaik had sought the Prime Minister’s intervention to nudge IOCL for setting up a naphtha cracker unit. “The naphtha cracker unit would provide the possibility of maximising the production of ethylene, propylene, butadiene and aromatic cuts. These will work as feedstock for variety of industries that could serve the increasing demand of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=petrochemical\" target=\"_blank\">petrochemical </a>products in the country across sectors such as textiles, polymers, pharmaceuticals, specialty chemicals etc”, said Patnaik in his letter to the Prime Minister.</p>\n<p>\n\tTo help develop an ecosystem for plastic and polymer-based industries around the periphery of IOCL’s planned petrochemical complex at Paradip, the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=odisha\" target=\"_blank\">Odisha </a>government has been engaging the oil major to provide raw materials like propylene and ethylene directly to such units.</p>\n<p>\n\tIOCL, as part of its petrochemical complex, is setting up a polypropylene plant and a mono-ethylene glycol plant. But supplies of polypropylene and monoethylene would restrain the count of plastic units around the complex due to their limited applications.</p>\n<p>\n\tIOCL had previously offered to supply polypropylene in the form of granules. But, for the plastic industries, the offer was not attractive since they could always import granules and establish their units elsewhere instead of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=paradip\" target=\"_blank\">Paradip.</a></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "looking",
        "steady",
        "potential",
        "based"
    ],
    "verbs": [
        "supply",
        "steady",
        "threaten"
    ]
}