{
    "creator": "PTI",
    "title": "Good news for Indian IT sector! UK launches review of monthly visa cap to ease entry for professionals",
    "link": "https://www.financialexpress.com/industry/good-news-for-indian-it-sector-uk-launches-review-of-monthly-visa-cap-to-ease-entry-for-professionals/1208688/",
    "pubDate": "Sat, 16 Jun 2018 16:45:01 +05:30",
    "dc:creator": "PTI",
    "content": "The UK government has tabled changes to its immigration policy in Parliament, which includes a review of its strict visa quotas available to professionals from countries like India. ",
    "contentSnippet": "The UK government has tabled changes to its immigration policy in Parliament, which includes a review of its strict visa quotas available to professionals from countries like India.",
    "guid": "https://www.financialexpress.com/?p=1208688",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-16T11:15:01.000Z",
    "sentiment": {
        "score": 5,
        "comparative": 0.2777777777777778,
        "tokens": [
            "good",
            "news",
            "for",
            "indian",
            "it",
            "sector",
            "uk",
            "launches",
            "review",
            "of",
            "monthly",
            "visa",
            "cap",
            "to",
            "ease",
            "entry",
            "for",
            "professionals"
        ],
        "words": [
            "ease",
            "good"
        ],
        "positive": [
            "ease",
            "good"
        ],
        "negative": []
    },
    "article": {
        "title": "Good news for Indian IT sector! UK launches review of monthly visa cap to ease entry for professionals",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1208821\" src=\"https://images.financialexpress.com/2018/06/cats-1076.jpg\" alt=\"UK government, UK visa, UK visa policy, UK visa for indians,&nbsp;Indian IT sector,&nbsp;FICCI,&nbsp;UK visa regime, news on visa, latest news on visa\" srcset=\"https://images.financialexpress.com/2018/06/cats-1076.jpg 660w, https://images.financialexpress.com/2018/06/cats-1076-300x200.jpg 300w, https://images.financialexpress.com/2018/06/cats-1076-620x413.jpg 620w, https://images.financialexpress.com/2018/06/cats-1076-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The Indian IT sector is among those expected to benefit from the easing up of the cap, a move welcomed by Indian industry. (IE)</figure>\n\t\t\t</section></div><span>\n</span><p>The UK government has tabled changes to its immigration policy in Parliament, which includes a review of its strict visa quotas available to professionals from countries like India. As part of the immigration changes, the government said it would ask the independent Migration Advisory Committee to review the composition of the Shortage Occupation List. This is likely to further ease up the visa regime for businesses to be able to bring in professionals from countries like India to work in the UK. The Indian IT sector is among those expected to benefit from the easing up of the cap, a move welcomed by Indian industry.</p><span>\n</span><p>“Coming in the wake of long-standing demand from Indian professionals, the news to ease the Tier 2 visa category by the British government is a welcome development. This move will certainly smoothen the movement of highly-skilled professionals and increase overall competitiveness of the UK industry in the long run,” said Rashesh Shah, President of the Federation of Indian Chambers of Commerce and Industry (FICCI).</p><span>\n</span><p>“FICCI has always stood for a free, fair and transparent UK visa regime for ensuring and promoting vibrant trade and economic relations between the two countries,” he said. In an announcement in the lead up to the parliamentary statement yesterday, the government had already announced that doctors and nurses from countries outside the European Union (EU) would be exempt from its Tier 2 (General) visa limit to address particular shortages and pressures facing the state-funded National Health Service (NHS).</p><span>\n</span><p>With doctors and nurses exempt from the current monthly quota of 1,600, the Tier 2 category is expected to free up places for other key professions. “Businesses will welcome these reforms as a good first move. International skills and talent are a core foundation of the Global Britain employers want to help build,” said Matthew Fell, Chief UK Policy Director for the Confederation of British Industry.</p><span>\n</span><p>“A successful migration system should focus on people’s contribution to the UK economy and society, not numbers. Until our immigration system is reformed to reflect this, including scrapping the net migration target, businesses will continue to struggle to get the people they need to create jobs and growth,” he said.</p><span>\n</span><p>A number of further changes to the UK’s visa routes include opening up the exceptional talent visa to include leading fashion designers. They will have their application assessed by the British Fashion Council under the endorsement remit of Arts Council England (ACE), one of the existing five endorsing bodies on that route.</p><span>\n</span><p>“Today’s changes show that we are able to adapt to meet the demands of our frontline services and ensure we are able to attract people who can bring real benefits to our creative industries,” said UK immigration minister Caroline Nokes. The Tier 2 visa route, which has had an annual cap of 20,700 since 2011, has in recent months seen the number of applications exceed the monthly allocation of available places. This has been driven, in large part, by demand from the NHS, which accounts for around 40 per cent of all Tier 2 places.</p><span>\n</span><p>“I recognise the pressures faced by the NHS and other sectors in recent months. Doctors and nurses play a vital role in society and at this time we need more in the UK. That is why I have reviewed our skilled worker visa route. This is about finding a solution to increased demand and to support our essential national services,” said UK home secretary Sajid Javid.</p><span>\n</span><p>The exclusion of doctors and nurses from the cap comes as the UK health secretary Jeremy Hunt said he is putting in place long-term measures to increase the supply of domestic doctors, including increasing the number of training places. Hunt said: “Overseas staff have been a vital part of our NHS since its creation 70 years ago…It’s fantastic that patients will now benefit from the care of thousands more talented staff.”</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "Indian",
        "monthly",
        "Good",
        "strict",
        "available"
    ],
    "nouns": [
        "Indian",
        "India",
        "monthly",
        "government",
        "sector",
        "Good",
        "news",
        "review",
        "cap",
        "IT",
        "UK",
        "visa",
        "ease",
        "entry",
        "immigration",
        "policy",
        "Parliament"
    ],
    "verbs": [
        "review",
        "cap",
        "visa",
        "ease"
    ]
}