{
    "creator": "Reuters",
    "title": "Why Wall Street’s trading volumes surge to 2018’s global sell-off level",
    "link": "https://www.financialexpress.com/market/why-wall-streets-trading-volumes-surge-to-2018s-global-sell-off-level/1208392/",
    "pubDate": "Sat, 16 Jun 2018 10:34:34 +05:30",
    "dc:creator": "Reuters",
    "content": "Wall Street stocks ended lower on Friday, capping a day of heavy trading with investors mostly pulling back from initial concerns over an escalating trade dispute between the United States and China.",
    "contentSnippet": "Wall Street stocks ended lower on Friday, capping a day of heavy trading with investors mostly pulling back from initial concerns over an escalating trade dispute between the United States and China.",
    "guid": "https://www.financialexpress.com/?p=1208392",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-16T05:04:34.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "why",
            "wall",
            "street’s",
            "trading",
            "volumes",
            "surge",
            "to",
            "2018’s",
            "global",
            "sell-off",
            "level"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Why Wall Street’s trading volumes surge to 2018’s global sell-off level",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"wp-image-1208453 size-full\" src=\"https://images.financialexpress.com/2018/06/US-Stocks-fall-2.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/US-Stocks-fall-2.jpg 660w, https://images.financialexpress.com/2018/06/US-Stocks-fall-2-300x200.jpg 300w, https://images.financialexpress.com/2018/06/US-Stocks-fall-2-620x413.jpg 620w, https://images.financialexpress.com/2018/06/US-Stocks-fall-2-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Trading volume hit the highest point since Feb. 8, when the S&amp;P 500 sank to its lowest level of the year so far. (Image: Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>Wall Street stocks ended lower on Friday, capping a day of heavy trading with investors mostly pulling back from initial concerns over an escalating trade dispute between the United States and China. U.S. President Donald Trump unveiled an initial list of strategically important goods that would be subject to a 25 percent tariff effective July 6, a move China’s Commerce Ministry called “a threat to China’s economic interest and security.” China issued its own list of U.S. imports subject to tariffs, targeting soybeans, aircraft, autos and chemicals.</p><span>\n</span><p>Since early May, the two countries have held several rounds of talks but have yet to reach a deal, as the United States pressures China to narrow a $375 billion trade deficit. “A lot of people may have over-reacted at the very beginning of the day,” said Robert Pavlik, chief investment strategist at SlateStone Wealth LLC in New York. “I don’t think a trade war is going to be inevitable,” Pavlik said. “I think (the president is) posturing, I think he’s chest-pounding, I think he’s doing exactly what he thinks he got elected to do.”</p><span>\n</span><p>Friday also marked “quadruple witching day,” the quarterly simultaneous expiration of U.S. options and futures contracts, which tends to boost trading volume as investors replace expiring positions. Volume hit the highest point since Feb. 8, when the S&amp;P 500 sank to its lowest level of the year so far. Companies considered the most sensitive to trade war worries were among the day’s biggest drags. Shares of Boeing Inc, the single-largest U.S. exporter to China, fell 1.3 percent, while tariff-sensitive construction equipment maker Caterpillar Inc and chemical company DowDupont Inc were down 2.0 percent and 0.9 percent, respectively.</p><span>\n</span><p>The Dow Jones Industrial Average fell 84.83 points, or 0.34 percent, to 25,090.48, the S&amp;P 500 lost 3.07 points, or 0.11 percent, to 2,779.42 and the Nasdaq Composite dropped 14.66 points, or 0.19 percent, to 7,746.38. For the week, the Dow was down 0.9 percent while the S&amp;P 500 rose 0.01 percent and the Nasdaq gained 1.3 percent, its fourth consecutive weekly advance. Of the 11 major sectors of the S&amp;P 500 six ended the day in negative territory.</p><span>\n</span><p>The energy sector was the biggest percentage loser, down 2.1 percent as oil prices tumbled more than 3 percent ahead of next week’s OPEC meeting. Declining issues outnumbered advancing ones on the NYSE by a 1.21-to-1 ratio; on Nasdaq, a 1.02-to-1 ratio favored advancers. The S&amp;P 500 posted 23 new 52-week highs and four new lows; the Nasdaq Composite recorded 152 new highs and 40 new lows. Volume on U.S. exchanges was 9.9 billion shares, compared to the 6.9 billion average for the full session over the last 20 trading days.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "level",
        "back",
        "off",
        "heavy",
        "global",
        "initial",
        "United",
        "ended"
    ],
    "nouns": [
        "trading",
        "trade",
        "dispute",
        "stocks",
        "China",
        "Friday",
        "lower",
        "day",
        "level",
        "Why",
        "back",
        "heavy",
        "Street",
        "pulling",
        "Wall",
        "surge",
        "sell",
        "initial"
    ]
}