{
    "title": "Reserve Bank of India relaxes norms for FPI investment in bonds",
    "link": "https://www.business-standard.com/article/finance/reserve-bank-of-india-relaxes-norms-for-fpi-investment-in-bonds-118061600022_1.html",
    "pubDate": "Sat, 16 Jun 2018 07:05:00 +0530",
    "content": "FPIs had lobbied with the RBI and finance ministry, as well as the Securities and Exchange Board of India (Sebi), that a huge lot of NCD issuance was stuck because of RBI rules",
    "contentSnippet": "FPIs had lobbied with the RBI and finance ministry, as well as the Securities and Exchange Board of India (Sebi), that a huge lot of NCD issuance was stuck because of RBI rules",
    "guid": "https://www.business-standard.com/article/finance/reserve-bank-of-india-relaxes-norms-for-fpi-investment-in-bonds-118061600022_1.html",
    "isoDate": "2018-06-16T01:35:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "reserve",
            "bank",
            "of",
            "india",
            "relaxes",
            "norms",
            "for",
            "fpi",
            "investment",
            "in",
            "bonds"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Reserve Bank of India relaxes norms for FPI investment in bonds",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tThe Reserve Bank of India (RBI) on Friday relaxed its April notification, which forbade FPIs from investing more than 20 per cent of their portfolios in bonds issued by a single corporate group.</p>\n<p>\n\tWhile the regulations remained the same as mentioned in April, the central bank said FPIs could carry on with transactions committed till April 27, when the notification came. In the April 27 notification, the central bank had said an FPI, or its entities, could not have more than 50 per cent of investment in a single corporate bond and their portfolios could not take more than a 20 per cent exposure in any single corporate group.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tOn Friday, the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rbi\" target=\"_blank\">RBI </a>said its April provisions could be relaxed if a commitment for investment had been made by April 27 and the issuance was supposed to come in this calendar year.</p>\n<p>\n\tThe exemptions can be availed of if “the major parameters such as price/rate, tenor and amount of the investment have been agreed upon between the FPI and the issuer on or before April 27, 018”, the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rbi\" target=\"_blank\">RBI </a>said. <em>Business Standard </em>had reported on Friday the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rbi\" target=\"_blank\">RBI </a>was going to relax the norms, or allow ‘grandfathering’, which is carrying on with old rules till the time new regulations come.</p>\n<p>\n\tFPIs had lobbied with the RBI and <a class=\"storyTags\" href=\"https://www.business-standard.com/finance\" target=\"_blank\">finance </a>ministry, as well as the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/securities-and-exchange-board-of-india\" target=\"_blank\">Securities and Exchange Board of India </a>(Sebi), that a huge lot of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/ncd\" target=\"_blank\">NCD </a>issuance was stuck because of RBI rules. The stuck deals were estimated at about Rs 50 billion, according to market sources. <br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/markets/rbi-removes-minimum-maturity-cap-for-fpi-investment-in-bond-market-118042900008_1.html\" target=\"_blank\">RBI removes minimum maturity cap for FPI investment in bond market</a></strong></p>\n<p>\n\tWhile stressing that no FPI, or its affiliates, should invest more than 50 per cent in any corporate bond, the RBI said if an FPI had invested in more than 50 per cent of an issue, it should not invest more in it until this stipulation was met.</p>\n<p>\n\tThe latest RBI circular reaffirmed that an FPI’s exposure to a single corporate should not exceed 20 per cent of the portfolio. However, “in case an FPI has, as on April 27, 2018, exposure in excess of 20% to any corporate, it shall not make further investments in that corporate until this requirement is met”.</p>\n<p>\n\tBesides, new investments in corporates made after April 27 would be exempt from this requirement till March 31, 2019, the central bank said.</p>\n<p>\n\t“To facilitate newly registered FPIs to build up a diversified portfolio, FPIs registering after April 27 are permitted to comply with this requirement by March 31, 2019, or six months from the date of registration, whichever is later,” the RBI said.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "huge",
        "stuck"
    ],
    "verbs": [
        "Reserve",
        "Bank",
        "finance",
        "Exchange",
        "Board",
        "lot"
    ],
    "nouns": [
        "issuance",
        "India",
        "Reserve",
        "Bank",
        "investment",
        "RBI",
        "finance",
        "ministry",
        "Exchange",
        "Board",
        "lot"
    ]
}