{
    "creator": "FE Bureau",
    "title": "Capital and Risk Control: Fitch cuts ratings of Axis, ICICI Bank",
    "link": "https://www.financialexpress.com/industry/banking-finance/capital-and-risk-control-fitch-cuts-ratings-of-axis-icici-bank/1208270/",
    "pubDate": "Sat, 16 Jun 2018 04:40:50 +05:30",
    "dc:creator": "FE Bureau",
    "content": "In a blow to Axis Bank, Fitch Ratings on Friday revised the outlook on the private sector lender to negative from stable while the ratings were also downgraded for ICICI Bank. ",
    "contentSnippet": "In a blow to Axis Bank, Fitch Ratings on Friday revised the outlook on the private sector lender to negative from stable while the ratings were also downgraded for ICICI Bank.",
    "guid": "https://www.financialexpress.com/?p=1208270",
    "categories": [
        "Banking & Finance",
        "Industry"
    ],
    "isoDate": "2018-06-15T23:10:50.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.2727272727272727,
        "tokens": [
            "capital",
            "and",
            "risk",
            "control",
            "fitch",
            "cuts",
            "ratings",
            "of",
            "axis",
            "icici",
            "bank"
        ],
        "words": [
            "cuts",
            "risk"
        ],
        "positive": [],
        "negative": [
            "cuts",
            "risk"
        ]
    },
    "article": {
        "title": "Capital and Risk Control: Fitch cuts ratings of Axis, ICICI Bank",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1208285\" src=\"https://images.financialexpress.com/2018/06/banks.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/banks.jpg 660w, https://images.financialexpress.com/2018/06/banks-300x200.jpg 300w, https://images.financialexpress.com/2018/06/banks-620x413.jpg 620w, https://images.financialexpress.com/2018/06/banks-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Capital and Risk Control: Fitch cuts ratings of Axis, ICICI Bank</figure>\n\t\t\t</section></div><span>\n</span><p>In a blow to Axis Bank, Fitch Ratings on Friday revised the outlook on the private sector lender to negative from stable, citing heightened asset-quality stress and weak earnings. Axis Bank reported its first ever quarterly loss in Q4FY18. The ratings agency also downgraded ICICI Bank’s support rating to ‘3’ from ‘2’ and revised the support rating floor to ‘BB+’ from ‘BBB-’. The outlook on ICICI remains stable.</p><span>\n</span><p>While affirming the long-term issuer default ratings (IDRs) and viability ratings for ICICI Bank and Axis Bank at ‘BBB-’ and ‘bbb-’, respectively, the agency expressed concerns about capital buffers and gaps in risk controls at both banks. “[Axis Bank’s] capital buffers are less comfortable for its current rating despite raising fresh capital. ICICI’s capital buffers are better even though it has experienced similar financial deterioration in the previous few years,” it noted.</p><span>\n</span><p>Risk management at ICICI Bank has been under a cloud of late, with the board commissioning an external inquiry into allegations of conflict of interest against MD and CEO Chanda Kochhar with respect to loans to the Videocon group. “Adverse findings could create reputational risk, particularly if they point at broader weaknesses in management. Absent material adverse findings, Fitch expects ICICI’s financial profile to hold up in the near- to medium-term and this underpins the stable outlook on its IDR,” the ratings agency said.</p><span>\n</span><p>Both banks have been hit hard in the March quarter by the Reserve Bank of India’s (<a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a>) February 12 circular, which withdrew all existing restructuring schemes for stressed assets and led to a surge in slippages for the banking system. Of the Rs 15,737 crore worth of addition to gross non-performing assets (NPAs) at ICICI Bank in Q4, Rs 9,968 crore were the result of the withdrawal of restructuring schemes. For the same quarter, Axis reported slippages to the tune of Rs 16,536 crore, of which Rs 13,938 crore originated from its corporate lending book. ICICI Bank ended FY18 with a gross NPA ratio of 8.84%, while the ratio at Axis Bank was 6.77%.</p><span>\n</span><p>Shikha Sharma, MD &amp; CEO, Axis Bank, admitted after the lender’s March quarter results that its on the infrastructure sector had not paid off. “Clearly, what you will see in the results today is that we do think that we are now nearing the end of the recognition process and we should really start to focus on the resolution process going forward from here,” she had said.</p><span>\n</span><p>Sharma’s term at Axis Bank is set to end in December 2018; the board is yet to announce her successor. Axis Bank’s capital to risk weighted assets ratio at the end of March 2018 stood at 16.57%. In November, the bank had received board approval to raise equity and equity-linked capital worth Rs 11,626 crore from a set of investors, including private-equity player Bain Capital and the Life Insurance Corporation of India.</p><span>\n</span><p>infrastructure sector had not paid off. “Clearly, what you will see in the results today is that we do think that we are now nearing the end of the recognition process and we should really start to focus on the resolution process going forward from here,” she had said.</p><span>\n</span><p>Sharma’s term at Axis Bank is set to end in December 2018; the board is yet to announce her successor. Axis Bank’s capital to risk weighted assets ratio at the end of March 2018 stood at 16.57%. In November, the bank had received board approval to raise equity and equity-linked capital worth Rs 11,626 crore from a set of investors, including private-equity player Bain Capital and the Life Insurance Corporation of India.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "stable",
        "private",
        "In",
        "revised",
        "Capital",
        "negative"
    ],
    "verbs": [
        "stable",
        "Control",
        "Risk",
        "Bank",
        "blow",
        "negative"
    ],
    "nouns": [
        "stable",
        "sector",
        "Control",
        "private",
        "Friday",
        "In",
        "Capital",
        "Risk",
        "Fitch",
        "Axis",
        "Bank",
        "blow",
        "outlook",
        "lender",
        "negative"
    ]
}