{
    "creator": "PTI",
    "title": "Delhi Customs launches special drive to help exporters get quick tax refunds",
    "link": "https://www.financialexpress.com/economy/delhi-customs-launches-special-drive-to-help-exporters-get-quick-tax-refunds/1199942/",
    "pubDate": "Sat, 09 Jun 2018 18:15:49 +05:30",
    "dc:creator": "PTI",
    "content": "The Delhi Customs has launched a special drive to help exporters get quick refunds on taxes paid by them for exporting goods, Chief Commissioner of Delhi Customs Sunil K Sawhney said here on Saturday.",
    "contentSnippet": "The Delhi Customs has launched a special drive to help exporters get quick refunds on taxes paid by them for exporting goods, Chief Commissioner of Delhi Customs Sunil K Sawhney said here on Saturday.",
    "guid": "https://www.financialexpress.com/?p=1199942",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-09T12:45:49.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.16666666666666666,
        "tokens": [
            "delhi",
            "customs",
            "launches",
            "special",
            "drive",
            "to",
            "help",
            "exporters",
            "get",
            "quick",
            "tax",
            "refunds"
        ],
        "words": [
            "help"
        ],
        "positive": [
            "help"
        ],
        "negative": []
    },
    "article": {
        "title": "Delhi Customs launches special drive to help exporters get quick tax refunds",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"wp-image-1199950 size-full\" src=\"https://images.financialexpress.com/2018/06/exports.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/exports.jpg 620w, https://images.financialexpress.com/2018/06/exports-300x200.jpg 300w, https://images.financialexpress.com/2018/06/exports-401x267.jpg 401w\" sizes=\"(max-width: 620px) 100vw, 620px\"> Representative Image</figure>\n\t\t\t</section></div><span>\n</span><p>The Delhi Customs has launched a special drive to help exporters get quick refunds on taxes paid by them for exporting goods, Chief Commissioner of Delhi Customs Sunil K Sawhney said here on Saturday. The move is part of a first-of-its-kind exercise organised by the department to further enhance ease of doing business. This ongoing special facilitation drive will continue till June 14.</p><span>\n</span><p>Eligible exporters can get Integrated Goods and Services Tax (IGST) refunds from the customs department. A large number of such refunds are stuck due to flawed shipping documents filed by the exporters. Sawhney asked all exporters — who have exported their goods from Delhi and Haryana, and whose IGST refunds or Rebate of State Levies (RoSL) have not yet been disbursed for shipments made till April 30, 2018 — to immediately contact senior customs officers.</p><span>\n</span><p>The exporters can get in touch with the commissioners of customs, air cargo exports, Inland Container Depots (ICDs) at Tughlakabad and Patparganj in Delhi and ICDs in Haryana, he said. By contacting them, the exporters can get their export documents corrected so that the refunds are disbursed to them by June 14, in order to enhance their ease of doing business and mitigate their working capital problems, the official said.</p><span>\n</span><p>As on June 8, about 26,000 shipping bills pertaining to the exporters are still in errors for want of relevant documents and valid bank account details. The Delhi customs zone has successfully scrolled out IGST refunds to the tune of nearly Rs 290 crore related to over 12,000 shipping bills in the last eight days. In this process, as on June 8, the customs department has been able to correct 8,000 shipping bills of the exporters involving about Rs 143 crore of IGST and Rs 194.75 crore of RoSL.</p><span>\n</span><p>Successful sanction of IGST refunds related to exports involves the correlation of the IGST amount paid by the exporters and its matching with the relevant export documents, that is the shipping bills. Delhi customs has proactively taken steps to eliminate the errors. However, there are still quite a large number of exporters who are yet to come forward to make corrections in their export documents for getting IGST refunds, Sawhney said.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "special",
        "paid",
        "Chief",
        "K",
        "quick"
    ],
    "nouns": [
        "special",
        "Commissioner",
        "Customs",
        "Delhi",
        "drive",
        "help",
        "exporting",
        "quick",
        "tax",
        "Chief",
        "K",
        "Saturday"
    ]
}