{
    "title": "In age of selfies, camera manages to hold ground",
    "link": "https://timesofindia.indiatimes.com/business/india-business/in-age-of-selfies-camera-manages-to-hold-ground/articleshow/64609043.cms",
    "pubDate": "Sat, 16 Jun 2018 00:07:27 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/in-age-of-selfies-camera-manages-to-hold-ground/articleshow/64609043.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64609043.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/in-age-of-selfies-camera-manages-to-hold-ground/articleshow/64609043.cms",
    "isoDate": "2018-06-16T00:07:27.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "in",
            "age",
            "of",
            "selfies",
            "camera",
            "manages",
            "to",
            "hold",
            "ground"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "In age of selfies, camera manages to hold ground",
        "content": "<div class=\"section1\"><div class=\"Normal\"><p>NEW DELHI: The camera is making a comeback, and in a new avatar. At a time when millions of pictures are clicked and shared daily using smartphones, the good old camera is yet to give up.\n\n</p><span>While sales of volume-heavy point-and-shoot cameras (basic devices offering low quality images) have been hit by ever-improving smartphone cameras, the revival is being led by sophisticated, and high image-quality devices such as </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/DSLR\">DSLR</a><span> (digital single lens reflex) cameras. Sales of cameras from companies such as </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Nikon\">Nikon</a><span>, Canon and </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Sony\">Sony</a><p> are on a rise, and ironically the surge is being led by increasing use of cameras with smartphones.\n</p><p>The buyers include people engaged in wedding photography, wildlife and nature lovers, as well as the growing number of hobbyists. Though sales of smartphones are many times higher than cameras, growth rate for latter has been encouraging. Smartphone sales stood at 123 million in 2017-18 compared to 81 million 2013-14. Cameras, however, managed to stage a credible recovery in the past few years. Sales of DSLRs have grown from around 3.5 lakh units in 2013-14 to over 5 lakh in 2017-18.\n</p><span> \n</span><div class=\"image\" data-msid=\"64609044\"><img src=\"https://timesofindia.indiatimes.com/img/64609044/Master.jpg\" alt=\"Click.\"></div><span>Apart from offering numerous technical options for clicking breath-taking shots, DSLRs are increasingly getting equipped with one most important feature that everybody wants today - connectivity. Now, with these cameras you can go online by using wifi to share images in social media accounts, connect with smartphones, and edit pictures. The cameras even allow you to take selfies through connectivity with your phones and other modes.\n</span><br><span>\n</span><br><span>Affordability is also fuelling the trend. Threshold for buying a DSLR and a mirror-less camera has been coming down over the years and now a decent entry camera can be purchased for under Rs 30,000, nearly 50 per cent lower than the price of latest Apple iPhone or </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Samsung\">Samsung</a><span>'s flagship. \"Contrary to the belief that smartphones are capturing the camera market, we feel that they act as a catalyst for people to adopt DSLR cameras,\" Sajjan Kumar, MD of Nikon India, told TOI.\n</span><br><span>\n</span><br><span>Nikon believes that through increased use of smartphones, people are developing an affinity for photography. This is when the image quality becomes a differentiating factor, enabling a DSLR to trump the smartphone. Sony is also enthused by the trend. \"We feel the audience for professional cameras and smartphone cameras is totally different and there are clear reasons to choose a DSLR over a smartphone camera,\" Hiroyuki Tokuno, head of digital imaging business at Sony India, said.\n</span><br><span>\n</span><br><span>Tokuno says that Sony's devices are tuned for connectivity and the company's lineup of interchangeable lens cameras as well as high-end point-and-shoot devices are equipped with wi-fi and NFC (near-field connectivity) to pair them with smartphones.\n</span><br><span>\n</span><p>The consumers of DSLRs are varied, ranging from wedding photographers, to media professionals, and even hobbyists, who are upgrading from their smartphones. Says Nikon's Kumar, \"Photography in India is way more than just a technology, it is an expression of capturing memories and sharing the same with our near and dear ones. With advent of internet, photographs travel not across people but across continents where we can easily have a look at various photographs clicked by amateurs and professionals alike.\" Success of professional cameras has even prompted Leica, one of the world's most-sophisticated maker, to start focusing on India. The company, which sells cameras that can cost as high as Rs 35 lakh, has adopted franchisee route and is targeting markets such as Mumbai, Bangalore, Chennai, Delhi and Hyderabad.\n</p><span>\n</span></div></div>"
    },
    "adjectives": [
        "In",
        "10",
        "left",
        "top",
        "right"
    ],
    "verbs": [
        "age",
        "hold",
        "ground",
        "border",
        "align",
        "style",
        "top",
        "right"
    ],
    "nouns": [
        "In",
        "age",
        "hold",
        "ground",
        "india",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo",
        "camera"
    ]
}