{
    "title": "India's exports hit 6-month high; trade deficit widens as imports up 14.85%",
    "link": "https://www.business-standard.com/article/economy-policy/india-s-exports-hit-6-month-high-trade-deficit-widens-as-imports-up-14-85-118061600051_1.html",
    "pubDate": "Sat, 16 Jun 2018 02:24:00 +0530",
    "content": "The aftershocks of the Rs 140-billion Nirav Modi scam continued to affect the gems and jewellery sector",
    "contentSnippet": "The aftershocks of the Rs 140-billion Nirav Modi scam continued to affect the gems and jewellery sector",
    "guid": "https://www.business-standard.com/article/economy-policy/india-s-exports-hit-6-month-high-trade-deficit-widens-as-imports-up-14-85-118061600051_1.html",
    "isoDate": "2018-06-15T20:54:00.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.16666666666666666,
        "tokens": [
            "india's",
            "exports",
            "hit",
            "6-month",
            "high",
            "trade",
            "deficit",
            "widens",
            "as",
            "imports",
            "up",
            "1485"
        ],
        "words": [
            "deficit"
        ],
        "positive": [],
        "negative": [
            "deficit"
        ]
    },
    "article": {
        "title": "India's exports hit 6-month high; trade deficit widens as imports up 14.85%",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tA rise in receipts of petroleum, engineering and pharmaceutical products boosted May’s export growth figures to a six-month high of 20.18 per cent, up from 5.71 per cent in April.</p>\n<p>\n\tEven then the trade deficit widened to a four-month high of $14.62 billion, compared to the $13.7 billion deficit in April as imports rose by 14.85 per cent during the month, compared to the 4.60 per cent rise in April. This could pressurise the current account deficit in the first quarter of the current financial year after it stood at 1.9 per cent of GDP in the fourth quarter of 2017-18, compared to 2.1 per cent in the third quarter.</p>\n<p>\n\tHowever, within exports,  major labour-intensive sectors, such as gems and jewellery and ready-made garments, continued to see declines, which might affect jobs.<br></p>\n<p>\n\tThe export growth rate had peaked at over 30 per cent in November last year. Since then, the rate has fallen continuously until March. However, growth in outbound trade strengthened in May, with India exporting goods worth $28.86 billion.</p>\n<p>\n\tAfter major refining units remained shut for over two months, India finally managed to take advantage of rising global crude <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/oil-prices\" target=\"_blank\">oil prices </a>in May when petroleum <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/exports\" target=\"_blank\">exports </a>rose by over 104 per cent to $5.23 billion. It had declined by 4.48 per cent in April.<br></p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/rice-exports-to-decline-by-10-on-restrictions-from-importing-countries-118061500820_1.html\" target=\"_blank\">Rice exports to decline by 10% on restrictions from importing countries</a></strong></p>\n<p>\n\tThe same rising <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/oil-prices\" target=\"_blank\">oil prices </a>led to a much higher import bill of $43.48 billion in May. A major part of this was due to the $11.5 billion crude oil import bill, which jumped nearly 50 per cent, up from the 41 per cent rise in April.</p>\n<p>\n\tThe cost of overall oil imports is expected to grow in coming months. Experts predict that India’s oil bill will continue to rise in the current financial year as external pressures, such as the fallout of the Iran deal and a possible cut in production by oil producers, might heat up prices.</p>\n<p>\n\tThe aftershocks of the Rs 140-billion <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nirav-modi-scam\" target=\"_blank\">Nirav Modi scam </a>continued to affect the gems and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=jewellery+sector\" target=\"_blank\">jewellery sector.</a> Gold imports fell by a large margin. Imports reduced by 29.85 per cent in May to $3.48 billion although the rate of fall decreased from 33.05 per cent in the previous month. However, non-oil and non-gold imports, denoting domestic industrial demand, jumped 13.09 per cent. It had fallen by 0.14 per cent in the preceding month, after rising continuously in the few months before.  It had risen by 12.2 per cent in March and 7.28 per cent in February. The rise in May might affect the index of industrial production, which rose 4.9 per cent in April.</p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/seafood-exports-may-hit-all-time-high-of-6-bn-on-strong-volumes-mpeda-118061401050_1.html\" target=\"_blank\">Seafood exports may hit all-time high of $6 bn on strong volumes: MPEDA</a></strong></p>\n<p>\n\t“The growth of non-oil non-gold merchandise imports rebounded to double-digits in May 2018, driven by inputs such as iron and steel, non ferrous metals, fertilizers, chemicals, coal, machinery and transport equipment.” Aditi Nayar, Principal Economist at ICRA said.</p>\n<p>\n\tAs a result of low inbound gold shipments, gems and jewellery <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/exports\" target=\"_blank\">exports </a>contracted 6.47 per cent, which was lower than the 16.95 per cent fall in April. On Friday, Commerce and Industry Minister <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=suresh+pabhu\" target=\"_blank\">Suresh Pabhu </a>said the sector continued to suffer from unavailability of bank credit. He added the government was working towards resolving the situation.</p>\n<p>\n\tApparel <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/exports\" target=\"_blank\">exports </a>dropped by 16.62 per cent in May. While the rate of contraction has slowed from 22.76 per cent in April, experts pointed out that the sector had seen a downturn since last October.</p>\n<p>\n\tEngineering goods exports rose by 14.77 per cent in May to ship out merchandise worth $7.14 billion, down from the 17 per cent rise in April. Pharma exports rose by 25.67 per cent, building on the 13.56 per cent rise in the previous month.</p>\n<p>\n\t “MSME sectors are still facing the liquidity crunch as banks and lending agencies have continuously been tightening their lending norms, as reflected in sharp reduction in exports credit, which does not augur well for their exports.” Ganesh Kumar Gupta, President of the Federation of Indian Exports Organization said. Of the 30 major product groups, 23 recorded growth in May, up from the 16 a month ago.<br></p><p>\n\t\t<img align=\"left\" alt=\"India's exports hit 6-month high; trade deficit widens as imports up 14.85%\" class=\"imgCont\" height=\"593\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/16/full/1529095947-1881.jpg\" title=\"India's exports hit 6-month high; trade deficit widens as imports up 14.85%\" width=\"620\"></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "high",
        "14",
        "85",
        "140",
        "billion",
        "continued"
    ],
    "nouns": [
        "India",
        "hit",
        "month",
        "high",
        "trade",
        "deficit",
        "14",
        "billion",
        "scam",
        "affect",
        "jewellery",
        "sector"
    ],
    "verbs": [
        "hit",
        "trade",
        "scam",
        "affect"
    ]
}