{
    "creator": "Ananaya Banerjee",
    "title": "Want to become an entrepreneur or professional blogger but don’t know how to go about it? Here is how you can",
    "link": "https://www.financialexpress.com/industry/technology/want-to-become-an-entrepreneur-or-professional-blogger-but-dont-know-how-to-go-about-it-here-is-how-you-can/1209052/",
    "pubDate": "Sun, 17 Jun 2018 01:15:38 +05:30",
    "dc:creator": "Ananaya Banerjee",
    "content": "Anybody who wanted to become an entrepreneur, Bitcoin trader, professional blogger or baker but didn’t know how to go about it, need not resort to endless and confusing Google searches. ",
    "contentSnippet": "Anybody who wanted to become an entrepreneur, Bitcoin trader, professional blogger or baker but didn’t know how to go about it, need not resort to endless and confusing Google searches.",
    "guid": "https://www.financialexpress.com/?p=1209052",
    "categories": [
        "Industry",
        "Technology"
    ],
    "isoDate": "2018-06-16T19:45:38.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.047619047619047616,
        "tokens": [
            "want",
            "to",
            "become",
            "an",
            "entrepreneur",
            "or",
            "professional",
            "blogger",
            "but",
            "don’t",
            "know",
            "how",
            "to",
            "go",
            "about",
            "it?",
            "here",
            "is",
            "how",
            "you",
            "can"
        ],
        "words": [
            "want"
        ],
        "positive": [
            "want"
        ],
        "negative": []
    },
    "article": {
        "title": "Want to become an entrepreneur or professional blogger but don’t know how to go about it? Here is how you can",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1209056\" src=\"https://images.financialexpress.com/2018/06/app.jpg\" alt=\"app, technology, bloogging\" srcset=\"https://images.financialexpress.com/2018/06/app.jpg 660w, https://images.financialexpress.com/2018/06/app-300x200.jpg 300w, https://images.financialexpress.com/2018/06/app-620x413.jpg 620w, https://images.financialexpress.com/2018/06/app-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> App founder Varun Agarwal (centre) with his team.</figure>\n\t\t\t</section></div><span>\n</span><p>Anybody who wanted to become an entrepreneur, Bitcoin trader, professional blogger or baker but didn’t know how to go about it, need not resort to endless and confusing <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/google/\">Google</a> searches. At help is a new educational app, which brings forth dedicated tutorials on starting and succeeding at careers that are not considered mainstream, and for which there are no or few academic courses in educational institutions.</p><span>\n</span><p>Grades Don’t Matter, which was launched in March this year, brings for students around 30 masterclasses on a diverse range of careers: ‘Entrepreneurship’, ‘Becoming a chef’, ‘Getting published’, ‘Starting a patisserie’, ‘Producing a film’, ‘Beat-boxing’,‘Standup comedy’, ‘Starting a restaurant’, ‘Illustration’, etc. Earlier this month, the app was among the 40 under 40 achievement award — South India’s Most Vibrant Young Entrepreneur — from The New Indian Express.</p><span>\n</span><p>What’s more, Grades Don’t Matter has brought the best in the business to guide app users on the said subjects. So you have Dangal director Nitesh Tiwari teaching the nitty-gritties of filmmaking, best-selling author Amish Tripathi providing guidance on getting books published, film producer Siddharth Roy Kapur talking about the intricacies of producing a film, OYO Rooms founder and CEO Ritesh Agarwal sharing his knowledge on entrepreneurship, among others.</p><span>\n</span><p>Talking about the inception of the app, founder Varun Agarwal says many youngsters in the country want to try their hand at entrepreneurship, stand-up comedy, etc, but what they lack is formal education, which they can use to achieve success in these fields. And this is what he wants to fix with his app. “The best possible way to learn is to talk to successful people, learn how they did it and learn by doing,” says 28-year-old Agarwal, adding, “There are as many as 2,000 careers in India for which one doesn’t need a marksheet and which actually pay more than a career attained through a formal academic degree.”<br>With Grades Don’t Matter (50,000 registered users till now), Bengaluru-based Agarwal aims to help the youth become aware, gain clarity and make better career choices. The entrepreneur—who has been invited to speak about his journey at various colleges across India—shot to fame in 2009 after co-founding an online store called Alma Mater, which makes merchandise exclusively for schools and colleges. Later, he also wrote a book called How I Braved Anu Aunty &amp; Co-Founded a Million Dollar Company in which he talks about his sojourn in the corporate world.</p><span>\n</span><p>Grades Don’t Matter is Agarwal’s latest venture, for which he put together a team of 15 members—a mix of techies, content creators and designers—in Bengaluru last year. While friend Anil Reddy, head, Lollypop Studios (a Bengaluru-based user interface and user experience design studio), took over the design department, Nalin Chhajer, Logesh Kumar, two tech recruits from the city, stepped in as key members of the tech team. The team spent close to half a year figuring out alternative career streams that youngsters couldn’t learn about in a conventional classroom.</p><span>\n</span><p>The choices were narrowed down to 30 and those excelling in the respective fields were approached to deliver the tutorials. Not only were they extensively interviewed (300 hours worth of interviews), the footage was turned into a video course with a three-phase approach (see box). Ideal for those trying to figure out their desired field of interest, the app has been designed to help students eliminate career choices not suited to them. “My team and I also ensured that we packaged all the content to make it as engaging and immersive as possible. Our competition is with Netflix, Facebook and Instagram, as these distract the youth the most these days, preventing them from learning,” he says, adding that the purpose is to educate users on how to ideate, develop a systematic approach to practical learning and then sharpen their skillset in the desired field of interest.</p><span>\n</span><p>Interestingly, they have also factored in students with special needs, such as those suffering from attention deficit hyperactive disorder, and ensured that the courses cater to them as well. For this, they approached professionals and learnt from them techniques (such as visual aids, graphics, sharing information in an engaging and brief way, etc) to retain the attention of such youngsters.</p><span>\n</span><p>Users can access the entire course log for `199 on Grades Don’t Matter, which is available on Android and iOS. Post payment, the videos are available for unlimited viewings. Each course is broken down into multiple lessons (which can range from nine to 15, depending on the course). Each lesson ends with a quick summary of the key points covered for easy recall. An overview of all the lessons from each course is also available as a ‘Workbook’ in a downloadable PDF format for quick reference. On the completion of the course, students get a digitally-signed certificate as well.</p><span>\n</span><p>The 21 courses available on the app may be sufficient for curious minds for now, but Agarwal plans to launch more specialised courses over a period of time, such as filmography, Bitcoin and stock market trading, etc. The bigger desire, he says, is to aim for international laurels, be it a Grammy, Nobel or Oscar.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "confusing",
        "professional",
        "go",
        "endless",
        "Here",
        "wanted"
    ],
    "nouns": [
        "entrepreneur",
        "trader",
        "blogger",
        "professional",
        "resort",
        "go",
        "need",
        "Google",
        "Here",
        "Want",
        "don",
        "baker",
        "know"
    ],
    "verbs": [
        "become",
        "resort",
        "go",
        "need",
        "Google",
        "Want",
        "don",
        "know"
    ]
}