{
    "title": "US varsities may lose out as country gets tougher with overstaying students",
    "link": "https://www.business-standard.com/article/management/us-varsities-may-lose-out-as-country-gets-tougher-with-overstaying-students-118051900247_1.html",
    "pubDate": "Sun, 20 May 2018 00:56:00 +0530",
    "content": "Immigration experts say such policies will divert international students towards other countries",
    "contentSnippet": "Immigration experts say such policies will divert international students towards other countries",
    "guid": "https://www.business-standard.com/article/management/us-varsities-may-lose-out-as-country-gets-tougher-with-overstaying-students-118051900247_1.html",
    "isoDate": "2018-05-19T19:26:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "us",
            "varsities",
            "may",
            "lose",
            "out",
            "as",
            "country",
            "gets",
            "tougher",
            "with",
            "overstaying",
            "students"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "US varsities may lose out as country gets tougher with overstaying students",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=students\" target=\"_blank\">Students </a>travelling to US for higher studies will have a new set of concerns to keep track of as <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=us+citizenship\" target=\"_blank\">US Citizenship </a>and Immigration Services (USCIS) is set to clamp down harder on violation of immigration status which could potentially drive international <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=students\" target=\"_blank\">students </a>towards more immigration friendly nations.</p>\n<p>\n\tAccording to a USCIS policy memorandum issued last week, individuals who accrue more than 180 days of unlawful presence in a single stay before departing US can be barred from returning for a period of three to 10 years.</p>\n<p>\n\t“USCIS is dedicated to our mission of ensuring the integrity of the immigration system. F, J, and M non-immigrants are admitted to the United States for a specific purpose, and when that purpose has ended, we expect them to depart, or to obtain another lawful immigration status,” USCIS director L Francis Cissna said in a statement.</p>\n<p>\n\tThe message is clearly that non-immigrants cannot overstay their periods of admission or violate the terms of admission in the US anymore.</p>\n<p>\n\tThe memorandum, which is open for public comments till 11th June, becomes effective from 9th August. It applies to J,M and F type applicants who could earlier maintain their immigration status for as long as they pursued their educational course. These categories encompass foreign vocational <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=students\" target=\"_blank\">students </a>as well as visiting scholars.</p>\n<p>\n\t“The prior policy made more sense, and maintained the important distinction between maintenance of status and lawful or unlawful presence. The 3 and 10 year bars, or the permanent bar, are extremely draconian and should only be triggered when the nonimmigrant goes beyond a date certain expiration date,” noted Cyrus Mehta, immigration lawyer, in blog post.</p>\n<p>\n\tHe notes that following this guidance even F-1 students in post completion practical training could potentially be deemed later to have engaged in unauthourized activity for not working in an area consistent with their field of study or if a science, technology, engineering and math (STEM) trainee is placed at a third party client site.</p>\n<p>\n\tIt should be noted that earlier in the year, USCIS updated its policy for STEM students engaged in optional practical training (OPT) programs preventing students from working in third party client sites.</p>\n<p>\n\tAccording to USCIS, training experience must take place on-site at the employer’s place of business or worksite(s) to which U.S. Immigration and Customs Enforcement (ICE) has authority to conduct employer site visits to ensure that the employer is meeting program requirements.</p>\n<p>\n\tThis means that ICE must always have access to a student’s worksite; if the student is sent to different worksite locations as part of the training opportunity, ICE must be able to access such worksite locations. The OPT program allows students to work for a year in the US post completion of their course before they start applying for H1B visas.</p>\n<p>\n\tImmigration experts have been expressing their concerns toward protectionist US policies lately as this can negatively impact the talent flow into US. Already the country is facing a serious dearth of STEM professionals. As per industry reports, one in six international students in US is Indian.</p>\n<p>\n\t“We have already seen number of students dropped off from India and this will have significant negative impact because the US does provide substantial assurance of job for STEM workers,” said Austin T Fragomen, Jr. Chairman of Fragomen Del Rey, Bernsen &amp; Lowey LLP during a recent interaction with Business Standard on immigration policies.</p>\n<p>\n\tHe noted that students will opt for Germany or UK or other European countries which are liberal in allowing students (to work) who are educated there and US will lose a lot of good people and global talent, which can put it at a disadvantage. </p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "international"
    ],
    "nouns": [
        "say",
        "US",
        "international",
        "may",
        "country",
        "Immigration",
        "will"
    ],
    "verbs": [
        "say",
        "lose",
        "will",
        "divert"
    ]
}