{
    "title": "Why big Indian deals are falling short of closure",
    "link": "https://timesofindia.indiatimes.com/business/india-business/big-indian-deals-fall-short-of-closure/articleshow/64626849.cms",
    "pubDate": "Sun, 17 Jun 2018 21:27:07 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/big-indian-deals-fall-short-of-closure/articleshow/64626849.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64626849.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/big-indian-deals-fall-short-of-closure/articleshow/64626849.cms",
    "isoDate": "2018-06-17T21:27:07.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "why",
            "big",
            "indian",
            "deals",
            "are",
            "falling",
            "short",
            "of",
            "closure"
        ],
        "words": [
            "falling",
            "big"
        ],
        "positive": [
            "big"
        ],
        "negative": [
            "falling"
        ]
    },
    "article": {
        "title": "Big Indian deals fall short of closure",
        "content": "<div class=\"section1\"><div class=\"Normal\"><p>MUMBAI: Some of India Inc's biggest consolidation deals - aimed at retiring debt or hiving off bleeding business units - are struggling past unmet deadlines, highlighting the stress on bulge bracket deal-making in the country.\n\n</p><span>Adani Group's acquisition of </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Reliance-Infrastructure\">Reliance Infrastructure</a><span>'s power distribution business in Mumbai, </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Airtel\">Bharti Airtel</a><span>'s buyout of </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Tata-Teleservices\">Tata Teleservices</a><span>, </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Reliance-Industries\">Reliance Industries</a><p>' move to take out Reliance Communication's (RCom's) wireless assets and Tata Steel Europe's merger with Thyssenkrupp are among the big mergers and acquisitions (M&amp;As) that are dragging on for months due to multiple hurdles. These deals are still at work, and might close in extended timelines. But the recent record of mega deals have a striking mortality rate if failed mergers like HDFC Life-Max Life, IDFC Bank-Shriram Capital, and Tillman Global and TPG's offer to buy out RCom's tower assets are counted in.\n</p><p>Add to this the troubled deal-making under the country's bankruptcy code, where just two high-profile selloffs have reached reasonable conclusion. Suddenly, the flurry of activity to tackle the bad debt pile-up with Indian lenders is looking precarious. Besides raising an alarm on the non-performing assets front, the woes of closing deals even by the biggest Indian conglomerates pose worrying questions about the country's M&amp;A framework.\n</p><span>\n</span><div class=\"image\" data-msid=\"64626852\"><img src=\"https://timesofindia.indiatimes.com/img/64626852/Master.jpg\" alt=\"Bank\"></div><span>While shareholder activism, regulatory roadblocks and tightening of acquisition financing are among different reasons behind slow-moving M&amp;As in the country, one key factor that stands out is the rise of desperate or compulsive deal-making. \"Many transactions that are struggling were announced in a hurry, upon preliminary agreements, under duress. The deal terms become onerous as negotiations progress,\" said Singhi Advisors founder &amp; MD Mahesh Singhi. \"One can't say the same about commercially driven transactions,\" he added, pointing to Schneider Electric and Temasek's recent acquisition of L&amp;T Electricals for $2.5 billion.\n</span><br><span>\n</span><br><span>But there are bankers who aren't buying the 'bad deal' argument alone for several of their 'big kills' slipping away. And they get some support from those who believe that Indian regulators are behind the curve in a fast-paced deal economy, with mounting volumes and complexities. There is a struggle in marrying economic and regulatory interest in some cases. For instance, </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/private-equity\">private equity</a><span> firm General Atlantic's acquisition of share share registry Karvy Computershare has been waiting for nearly one year as Sebi decides on allowing financial investors control of market infrastructure institutions without adequate restrain.\n</span><br><span>\n</span><br><span>Luthra &amp; Luthra Law Offices partner Vaibhav Kakkar said, \"There are two causes for the delays in some of the M&amp;A transactions. First, the teething troubles for Indian regulators as they come to grips with the newly liberalised, and more sophisticated, Indian M&amp;A jurisdiction. The second reason for the compounding of regulatory delays stems from the tendency of Indian regulators, in the present environment, to interpret laws conservatively.\"\n</span><br><span>\n</span><br><span>Deal-making under the Insolvency Insolvency and Bankruptcy Code - Binani Cement, Jaypee Infratech and Essar Steel - has witnessed high drama usually associated with Bollygarchs (a reference to big Indian industrialists wielding influence over social and political narratives) on the march, often putting lenders, resolution professionals and the National Company Law Tribunal on the back foot. Economic Laws Practice partner Darshan Upadhyay said, \"We have not only seen changes and challenges, many of the matters have landed before judicial forums. Other regulations have not kept pace with the situation to have an integrated solution.\"\n</span><br><span>\n</span><p>As Indian tycoons once again embark on inorganic growth, eschewing a more conservative greenfield approach, big mergers are beginning to be driven by shareswap deals. Some of these deals have also run into shareholder activism or resistance, which are common in the western deal economies. \"Indian deal-making ambitions are bolder than ever before, but the ecosystem to operationalise such deals has been challenging of late,\" said a senior banker involved with one of the ambitious M&amp;As on condition of anonymity.\n</p><span>\n</span></div></div>"
    },
    "adjectives": [
        "Indian",
        "indian",
        "10",
        "left",
        "top",
        "right",
        "big",
        "falling",
        "short"
    ],
    "nouns": [
        "Indian",
        "india",
        "indian",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo",
        "closure",
        "Why",
        "fall",
        "short"
    ],
    "verbs": [
        "border",
        "align",
        "style",
        "top",
        "right",
        "closure",
        "fall",
        "short"
    ]
}