{
    "title": "New IIMs divided over mentorship with appointment of full-time director",
    "link": "https://www.business-standard.com/article/management/new-iims-divided-over-mentorship-with-appointment-of-full-time-director-118032400759_1.html",
    "pubDate": "Sun, 25 Mar 2018 06:29:00 +0530",
    "content": "Some new institutes believe older IIMs should cease to be mentors once a full-time director is appointed, while others are of the view that hand-holding is required till operations stabilize",
    "contentSnippet": "Some new institutes believe older IIMs should cease to be mentors once a full-time director is appointed, while others are of the view that hand-holding is required till operations stabilize",
    "guid": "https://www.business-standard.com/article/management/new-iims-divided-over-mentorship-with-appointment-of-full-time-director-118032400759_1.html",
    "isoDate": "2018-03-25T00:59:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "new",
            "iims",
            "divided",
            "over",
            "mentorship",
            "with",
            "appointment",
            "of",
            "full-time",
            "director"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "New IIMs divided over mentorship with appointment of full-time director",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tThe new <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=indian+institutes+of+management\" target=\"_blank\">Indian Institutes of </a><a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=management\" target=\"_blank\">Management </a>(IIMs) are divided over the idea of forgoing mentorship from the established counterparts. IIM Sirmaur had recently written to the Ministry of Human Resource Development seeking continued mentorship from IIM Lucknow, which has refused to do so.</p>\n<p>\n\tSome new institutes believe older <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=iims\" target=\"_blank\">IIMs </a>should cease to be mentors once a full-time <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=director\" target=\"_blank\">director </a>is appointed, while others are of the view that hand-holding is required till operations stabilise.</p>\n<p>\n\tNewbies like IIM Sambalpur which now has full-time directors have stopped seeking mentorship from the incumbents. They are building their own pool of full-time faculty members and curriculum and are getting infrastructure in place. But a few others such as IIM Amritsar, IIM Jammu, and IIM <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=bodh+gaya\" target=\"_blank\">Bodh Gaya </a>continue to seek support from their mentors irrespective of having a full-time <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=director\" target=\"_blank\">director.</a> They believe the withdrawal of support should be gradual.</p>\n<p>\n\tIIM <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=indore\" target=\"_blank\">Indore </a>was the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=mentor\" target=\"_blank\">mentor </a>of IIM Sambalpur which had placed Mahadeo Jaiswal as its helm last year. The institute is aiming at building its full-time faculty strength of 11 by the start of new academic year in 2018 for 120 students. “Once a full-time <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=director\" target=\"_blank\">director </a>is there, you don’t really need much mentoring. Newer <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=iims\" target=\"_blank\">IIMs </a>will have to eventually build their own system. We don’t need mentoring at least. For any specific help, we can reach out to older <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=iims\" target=\"_blank\">IIMs </a>anytime; not only for faculty, but also for guidance in curriculum,” Jaiswal told Business Standard.</p>\n<p>\n\tCiting difficulties in mentoring both IIM <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=jammu\" target=\"_blank\">Jammu </a>and IIM Sirmaur at the same time, IIM <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=lucknow\" target=\"_blank\">Lucknow </a>had withdrawn its faculty support from Sirmaur. The incumbent reportedly backed out following the appointment of a full-time director at IIM Sirmaur. IIM <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=lucknow\" target=\"_blank\">Lucknow </a>had stated that its faculty was far stretched as they had to teach at four places — IIM Lucknow, IIM Lucknow’s campus in Noida, IIM Sirmaur, and IIM <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=jammu\" target=\"_blank\">Jammu.</a> Call for continued support comes in the wake of newbies still operating from makeshift campuses and are in the process of hiring full-time directors. For instance, IIM Vishakhapatnam operates from Andhra University. IIM Bodh Gaya, being mentored by IIM Calcutta, has been allotted 119 acres to set up its own campus that would be ready in 2-3 years.</p>\n<p>\n\t“There are certain capabilities which can be quickly built, while others take relatively longer time such as faculty recruitment. IIMs should not only continue mentoring, but also have liberal rules to help newer ones. What goes on in a classroom is critical and cannot be built up in a short time. This is because a lot of bandwidth goes into setting up of infrastructure and academic performance should not suffer,” said Vinita Sahay, director of IIM <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=bodh+gaya\" target=\"_blank\">Bodh Gaya.</a> IIM <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=bodh+gaya\" target=\"_blank\">Bodh Gaya </a>has one full-time faculty for a batch of 60 students. It has 40-45 visiting faculty from sister institutes.</p>\n<p>\n\tAmong the established ones, IIM Kozhikode director Kulbhushan Balooni said the institute had no plans of withdrawing support from IIM Amritsar. “We are happy and satisfied about IIM Amritsar’s progress. We will continue to <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=mentor\" target=\"_blank\">mentor </a>the institute,” he said.</p>\n<p>\n\tIIM Amritsar, which is still without a director and permanent faculty, continues to operate from its temporary campus at Punjab Institute of Technology. It has eight full-time faculty members and is planning to hire more. At present, they are recruited on a contract basis. They can be offered a permanent status only after a full-time director is appointed under the IIM Act. IIM Amritsar has floated an advertisement inviting eligible candidates to apply for the post of director before April 16.</p>\n<p>\n\t“A few more (faculty) will join before the next session, ensuring all core courses offered in the first year are taught by IIM Amritsar faculty. In the beginning, IIM Kozhikode professors and other visiting faculty took care of all core and elective courses,” said IIM Amritsar replied in an email response.</p>\n<p>\n\tAround 14 IIM Kozhikode faculty members visited Amritsar in 2017-18. The latter is now handling responsibilities such as managing various committees for alumni, student placement, public relations, and research.</p>\n<p>\n\tRevenue generation is one of the biggest challenges for IIM Amritsar. Currently, fees from students, around Rs 9,00,000 per student for its post-graduate programme in management, is the only source of revenue. “But we will offer other programmes soon and have more sources of revenue,” the institute said. The first batch of 2016-18 had 104 students, whereas 2017-19 batch has 95 students. Consider the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=jammu\" target=\"_blank\">Jammu </a>branch. Here, 47 students opted for the campus, leaving 13 seats vacant in the first year of operation. Some seats remained vacant in the second year as well.</p>\n<p>\n\t“The recruiters too are not very keen on coming here. We had to send our students to IIM <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=lucknow\" target=\"_blank\">Lucknow </a>campus in Noida for placement,” said an IIM Jammu member. It will take at least 2-3 years to set up a permanent campus. IIM Jammu has six contractual faculty members and is in the process of hiring two more.</p>\n<p>\n\tThe institute will begin the process of hiring a full-time director soon.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "New",
        "new",
        "full",
        "older",
        "appointed",
        "divided",
        "Some",
        "required"
    ],
    "nouns": [
        "full",
        "holding",
        "time",
        "appointment",
        "director",
        "cease",
        "view",
        "hand",
        "till",
        "operations"
    ],
    "verbs": [
        "believe",
        "full",
        "stabilize",
        "time",
        "cease",
        "view",
        "hand",
        "till"
    ]
}