{
    "creator": "PTI",
    "title": "More steps needed to meet challenge of double digit growth: PM Narendra Modi",
    "link": "https://www.financialexpress.com/economy/more-steps-needed-to-meet-challenge-of-double-digit-growth-pm-narendra-modi/1209710/",
    "pubDate": "Sun, 17 Jun 2018 21:17:06 +05:30",
    "dc:creator": "PTI",
    "content": "Observing that the Indian economy has grown at a healthy rate of 7.7 per cent in the fourth quarter of 2017-18, Modi said that the \"challenge now is to take this growth rate to double digits, for which many more steps have to be taken\". ",
    "contentSnippet": "Observing that the Indian economy has grown at a healthy rate of 7.7 per cent in the fourth quarter of 2017-18, Modi said that the \"challenge now is to take this growth rate to double digits, for which many more steps have to be taken\".",
    "guid": "https://www.financialexpress.com/?p=1209710",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-17T15:47:06.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.07692307692307693,
        "tokens": [
            "more",
            "steps",
            "needed",
            "to",
            "meet",
            "challenge",
            "of",
            "double",
            "digit",
            "growth",
            "pm",
            "narendra",
            "modi"
        ],
        "words": [
            "growth",
            "challenge"
        ],
        "positive": [
            "growth"
        ],
        "negative": [
            "challenge"
        ]
    },
    "article": {
        "title": "More steps needed to meet challenge of double digit growth: PM Narendra Modi",
        "content": "<p>Observing that the Indian economy has grown at a healthy rate of 7.7 per cent in the fourth quarter of 2017-18, Modi said that the \"challenge now is to take this growth rate to double digits, for which many more steps have to be taken\". </p><div class=\"fe-post-content main-story-content\"><span>\n\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1209715\" src=\"https://images.financialexpress.com/2018/06/M_Id_484371_Narendra_Modi-2.jpg\" alt=\"Banks Board Bureau, 22 executive promotion, PSBs, BBB recommend ececutive promotion\"> The Banks Board Bureau (BBB) has recommended 22 general managers to be promoted as Executive Directors at various state-run banks, according to an announcement by the BBB.</figure></section></div><span>\t\t\t\t\n</span><p>The challenge before India is to take the economic growth rate to double-digits for which many more steps need to be taken, Prime Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/narendra-modi/\">Narendra Modi</a> told a meeting of chief ministers here today. Speaking at the Niti Aayog’s fourth meeting of Governing Council, Modi stressed that the world expects India to become a USD 5 trillion economy soon, according to a statement by the Prime Minister’s Office. As many as 23 chief ministers and one Lt Governor attended the meeting. The notable absentees were chief ministers of Odisha, Jammu and Kashmir and Delhi. Briefing reporters after the meeting, Niti Aayog Vice-Chairman Rajiv Kumar said some of the chief ministers could not participate as they were busy handling flood situation in their respective states. Regarding the absence of Delhi Chief Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/arvind-kejriwal/\">Arvind Kejriwal</a>, he said invites were sent to him, but there was no response.</p><span>\n</span><p>Kejriwal’s seat was reserved at the meeting, but he did not attend, Kumar added. Kejriwal, along with his ministers, has been holding a sit-in protest at the LG’s office. On development agenda document, ‘New India 2022′, he said: “It was not presented in the meeting. We want to make document to reflect ground realities”. The document will be sent to states for comments, he said, adding that it will be finalised in a month-or so. As per the PMO statement, Modi assured the chief ministers of flood-affected states of providing all central assistance to deal with the situation. He urged the chief ministers to “give fresh ideas” to the 15th Finance Commission for incentivising outcome based allocations and expenditure correction, amid demands by some states to revisit panel’s terms of reference. Modi said India has no shortage of capabilities, capacities and resources and in the current financial year, the states would receive over Rs 11 lakh crore from the Centre — an increase of about Rs 6 lakh crore from the last year of the previous government.</p><span>\n</span><p>Observing that the Indian economy has grown at a healthy rate of 7.7 per cent in the fourth quarter of 2017-18, Modi said that the “challenge now is to take this growth rate to double digits, for which many more steps have to be taken”. The conference deliberated on issues such as doubling of farmers’ income, development of aspirational districts, Ayushman Bharat, Mission Indradhanush, Nutrition Mission and celebrations of the 150th birth anniversary of Mahatma Gandhi. These steps, Modi said, are essential for achieving the vision of New India by 2020. The Governing Council, he said, is a platform which could bring about “historic change” in the development of the country. Modi further said the Council has approached complex issues of governance as “Team India”, in the spirit of cooperative, competitive federalism. Chief ministers have played a key role in policy formulation, through sub-groups and committees on issues such as Swachh Bharat Mission, Digital Transactions and Skill Development, he said. Modi said 1.5 lakh health and wellness centres are being constructed under the Ayushman Bharat programme.</p><span>\n</span><p>He said about 10 crore families will be provided with health assurance worth Rs 5 lakh every year. A comprehensive approach was being adopted for education, under the Samagra Shiksha Abhiyan, Modi added. Observing that schemes such as Mudra Yojana, Jan Dhan Yojana and Stand Up India were helping in greater financial inclusion, the prime minister said it was imperative to tackle economic imbalances on priority. He said all aspects and parameters of human development need to be addressed and improved upon in the 115 aspirational districts. The Gram Swaraj Abhiyan has emerged as a new model for implementation of schemes, he said, adding that it has been extended to 45,000 villages in the aspirational districts. In his closing remarks, Modi assured the gathering that suggestions made during the meeting would be “seriously considered” in the course of decision-making.</p><span>\n</span><p>He asked Niti Aayog to follow up with the states on the actionable points made by them within three months. On the lines of the 115 aspirational districts identified by NITI Aayog, Modi said states can define their own parameters to identify 20 per cent of the total blocks in the state as aspirational blocks. He also called for “widespread” debate on holding simultaneous elections to the Lok Sabha and state assemblies saying that it will result in financial savings. Speaking on the issue of environment, raised by chief ministers, he urged all states to use LED bulbs in their government buildings, official residences and street lights.</p><span>\n</span><p>As per the PMO, Modi called upon chief ministers of Madhya Pradesh, Bihar, Sikkim, Gujarat, Uttar Pradesh, West Bengal and Andhra Pradesh, to work together to make recommendations on a coordinated policy approach on agriculture and MNREGA. Kumar said the Prime Minister said the Centre will fulfil all promises made at the time of bifurcation of Bihar and Andhra Pradesh in “letter and spirit”. Referring to the government’s flagship ‘Swachh Bharat Mission’, Modi said the cleanliness drive was being discussed around the world. In the last four years, 7.70 crore toilets have been constructed. He called upon all present, to work towards 100 per cent sanitation coverage by October 2, 2019, the 150th birth anniversary of Mahatma Gandhi.</p><span>\n\t\t\t\t</span><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div><span>\n\t\t\t\t\t\t\t\t\t</span><span>\n\t\t\t\t\t</span><span>\n\t\t\t\t\t\t\t\t\t\t\t\t</span><span>\n\t\t\t\t\t\t\t\t\t\t\t\t</span></div>"
    },
    "adjectives": [
        "Indian",
        "grown",
        "needed",
        "Observing",
        "meet",
        "18",
        "healthy",
        "double",
        "More",
        "fourth",
        "taken"
    ],
    "verbs": [
        "rate",
        "challenge",
        "meet",
        "double",
        "quarter"
    ]
}