{
    "title": "DMart's lower same store sales, margins keep analysts on the sidelines",
    "link": "https://www.business-standard.com/article/companies/dmart-s-lower-same-store-sales-margins-keep-analysts-on-the-sidelines-118061700437_1.html",
    "pubDate": "Sun, 17 Jun 2018 18:22:00 +0530",
    "content": "Besides high valuations, untested e-commerce venture and pace of expansion are other concerns",
    "contentSnippet": "Besides high valuations, untested e-commerce venture and pace of expansion are other concerns",
    "guid": "https://www.business-standard.com/article/companies/dmart-s-lower-same-store-sales-margins-keep-analysts-on-the-sidelines-118061700437_1.html",
    "isoDate": "2018-06-17T12:52:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "dmart's",
            "lower",
            "same",
            "store",
            "sales",
            "margins",
            "keep",
            "analysts",
            "on",
            "the",
            "sidelines"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "DMart's lower same store sales, margins keep analysts on the sidelines",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/avenue-supermarts\" target=\"_blank\">Avenue Supermarts </a>stock is a favourite of investors. So much so that its market capitalisation is higher than the next ten listed multi-brand retailers. While investor demand has led to the doubling of the stock since its listing, barring a few names such as <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/goldman-sachs\" target=\"_blank\">Goldman Sachs </a>and HSBC, most brokerages are now cautious. Of the 15 analysts who track the stock as per Bloomberg, about two-thirds have a sell or a hold rating. Their average target price is Rs 1,336 for the stock trading at Rs 1,538.</p>\n<p>\n\tAfter the company's meeting with brokerages on Thursday (June 14), analysts are pointing to a few concerns, even as they continue to believe in DMart's long-term growth prospects. These relate to the company's <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=same+store+sales\" target=\"_blank\">same store sales </a>(SSS) growth, margins, expansion and the new format, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=dmart+ready\" target=\"_blank\">Dmart Ready.</a> SSS growth, which reflects the performance of stores in operation for at least a year, moderated from 21 per cent in FY17 to 14 per cent in FY18. Adjusted for price deflation on account of the goods and services tax, the same stood at 16 per cent. Cannibalisation by new stores was among reasons that led to the fall. Further, with the higher proportion of sales coming from mature stores, SSS growth is expected to moderate going ahead. The company highlighted that growth for mature stores is closer to inflation.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/markets/avenue-supermarts-hits-new-high-market-cap-crosses-rs-1-trillion-mark-118061100138_1.html\" target=\"_blank\">D-Mart operator Avenue Supermarts' m-cap crosses Rs 1-trillion mark</a></strong></p>\n<p>\n\tAnother issue is on margins. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=operating+profit\" target=\"_blank\">Operating profit </a>margins are already at high levels on the back of increasing proportion of higher margin products, more profitable geographies and tax classification, which drove 80 basis points gain in FY18 to nine per cent. Given efficiencies from central procurement already realised, margin gains from operational improvement are limited. Further, with the motto of keeping costs down and passing on the benefits to customers, margins may not increase from the current levels.</p>\n<p>\n\tThe company added 24 stores in FY18 to take its store count to 155. Given that it wants to add a higher number of stores going ahead annually, capital expenditure could rise. Further, given the owned-store model, costs related to buying and developing stores could increase going ahead. A more prudent approach could limit the growth option.</p>\n<p>\n\tWhile the company is banking on <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=dmart+ready\" target=\"_blank\">Dmart Ready </a>e-commerce model to expand and bring in incremental revenues (minuscule revenues currently as compared to large store format), analysts have some concerns on the same. An analyst with a domestic brokerage says, “While the low-cost model for <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=dmart+ready\" target=\"_blank\">Dmart Ready </a>is good, the lack of options for perishables (vegetables, fruits and dairy products) could be a dampener as customers who are looking for a single stop for all grocery needs will have to shop at multiple online and offline stores.\"<br></p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/markets/street-still-bets-big-on-dmart-store-expansion-new-format-growth-triggers-118061500019_1.html\" target=\"_blank\">Street still bets big on DMart; store expansion, new format growth triggers</a></strong></p>\n<p>\n\tFinally, valuations at over 75 times, FY20 estimates are at a steep premium to peers. This is even after adjusting for best in class operational performance of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/avenue-supermarts\" target=\"_blank\">Avenue Supermarts </a>and the 25-30 per cent earnings growth expected in each of the next two years.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "high",
        "untested"
    ],
    "nouns": [
        "commerce",
        "high",
        "expansion",
        "lower",
        "store",
        "keep",
        "sales",
        "pace",
        "venture"
    ],
    "verbs": [
        "lower",
        "store",
        "keep",
        "venture",
        "pace"
    ]
}