{
    "title": "Bt cotton to cover even larger area this year",
    "link": "https://www.business-standard.com/article/economy-policy/bt-cotton-to-cover-even-larger-area-this-year-118061600720_1.html",
    "pubDate": "Sun, 17 Jun 2018 07:00:00 +0530",
    "content": "The desi variety of cotton is also registering yields better than the national average",
    "contentSnippet": "The desi variety of cotton is also registering yields better than the national average",
    "guid": "https://www.business-standard.com/article/economy-policy/bt-cotton-to-cover-even-larger-area-this-year-118061600720_1.html",
    "isoDate": "2018-06-17T01:30:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "bt",
            "cotton",
            "to",
            "cover",
            "even",
            "larger",
            "area",
            "this",
            "year"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Bt cotton to cover even larger area this year",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tAfter a surge in the area under Bt <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/cotton\" target=\"_blank\">cotton </a>last year, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=cotton+cultivation\" target=\"_blank\"></a><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/cotton\" target=\"_blank\">cotton </a>cultivation under this high-yielding and genetically-modified seed is set to go up further this year.</p>\n<p>\n\tAcreage under Bt <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/cotton\" target=\"_blank\">cotton </a>declined significantly from over 95 per cent of the total area under cotton in 2013-14 to below 90 per cent in 2016-17. This happened due to stagnation in yield in the latest Bollgard variety and pest attacks on <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bt-cotton\" target=\"_blank\">Bt cotton </a>seeds.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tIncrease in the overall area, however, benefited <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bt-cotton\" target=\"_blank\">Bt cotton </a>more than the conventional, hybrid and desi varieties.</p>\n<p>\n\tOf the total cotton area at 12.44 million hectares for 2017-18, the acreage under Bt was reportedly 11.07 million hectares, which works out to 89 per cent.</p>\n<p>\n\tWhen compared with the total area of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=cotton+cultivation\" target=\"_blank\">cotton cultivation </a>at 10.82 million hectares, the coverage under <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bt-cotton\" target=\"_blank\">Bt cotton </a>stood at 81 per cent (8.77 million hectares) for 2016-17. This means the acreage under Bt cotton went up in 2017-18. “Farmers adopt Bt cotton for high yield. We expect the increase in cotton sowing under Bt to continue. In states like Rajasthan, however, farmers have chosen the desi variety, which fetched yields that are equally high under the guidance of many cotton bodies,” said Kavita Gupta, textiles commissioner, under the ministry of textiles.</p>\n<p>\n\tGupta had announced the cotton output estimates for 2017-18 after the second Cotton Advisory Board (CAB) meeting on Saturday.</p>\n<p>\n\tThe CAB lowered its cotton output estimates of 37.7 million bales to 37 million bales for 2017-18 on Saturday. This was largely attributed to pink bollworm attack on cotton crops in Maharashtra, Telangana and Andhra Pradesh. The estimated cotton output of 37 million for 2017-18, however, is higher by around 7 per cent from the previous year’s output of 34.5 million bales.</p>\n<p>\n\tMeanwhile, the textiles commissioner asked the ministry to collaborate with the ministry of agriculture to help farmers follow best practices in cotton farming that are adopted globally. <br></p>\n<p>\n\tSome of the proposals include intercropping of soybean with cotton, branding of cotton, production of contamination-free cotton and use of water efficient techniques for vertical growth of plants, among others.</p>\n<p>\n\t“Soybean plant can add nutrients to the cotton crop which may boost production. Hence, we have recommended to the ministry of textiles to engage the ministry of agriculture for better cotton production in the country,” said Gupta.</p>\n<p>\n\tAgainst the national average of 500 kg/hectare, some farmers in Punjab have yielded 2,000 kg/hectare. This is double the world average of 750 kg/hectare but similar to the world’s best production of 2,200 kg/hectare in Australia.</p>\n<p>\n\tThe desi variety of cotton is also registering yields better than the national average.</p>\n<p>\n\tGupta was also confident that the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/maharashtra\" target=\"_blank\">Maharashtra </a>government’s advisory for farmers to wait for rain before sowing this <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=kharif+season\" target=\"_blank\">kharif season </a>is unlikely to lower cotton output this year. This is because farmers have adopted global best practices for a higher yield.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "even",
        "larger",
        "better",
        "national",
        "average"
    ],
    "nouns": [
        "cotton",
        "cover",
        "even",
        "area",
        "year",
        "variety",
        "better",
        "national",
        "average"
    ],
    "verbs": [
        "cotton",
        "cover",
        "even",
        "better",
        "average"
    ]
}