{
    "creator": "FE Online",
    "title": "Reliance Jio vs Airtel vs Vodafone: Who is offering biggest dhamaka? Cheapest plans compared",
    "link": "https://www.financialexpress.com/industry/technology/reliance-jio-vs-airtel-vs-vodafone-who-is-offering-biggest-dhamaka-cheapest-plans-compared/1209520/",
    "pubDate": "Sun, 17 Jun 2018 18:51:20 +05:30",
    "dc:creator": "FE Online",
    "content": " Vodafone and Airtel are both looking to attract customers with lucrative data offers and unlimited voice calling opportunities with massive SMS packs to counter Jio.",
    "contentSnippet": "Vodafone and Airtel are both looking to attract customers with lucrative data offers and unlimited voice calling opportunities with massive SMS packs to counter Jio.",
    "guid": "https://www.financialexpress.com/?p=1209520",
    "categories": [
        "Industry",
        "Technology"
    ],
    "isoDate": "2018-06-17T13:21:20.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "reliance",
            "jio",
            "vs",
            "airtel",
            "vs",
            "vodafone",
            "who",
            "is",
            "offering",
            "biggest",
            "dhamaka?",
            "cheapest",
            "plans",
            "compared"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Reliance Jio vs Airtel vs Vodafone: Who is offering biggest dhamaka? Cheapest plans compared",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1209672\" src=\"https://images.financialexpress.com/2018/06/Airtel-Vs-Vodafone-Vs-Jio-.jpg\" alt=\"Airtel Vs Reliance Jio Vs Vodafone, jio recharge plan, jio 98 prepaid plan, jio vs airtel recharge plan, jio prepaid plan vs airtel prepaid plan, jio prepaid recharge, jio offers, jio prepaid offers, vodafone vs jio prepaid recharge offers, vodafone vs airtel plans, airtel recharge details, vodafone plans, vodafone prepaid plans, airtel Rs 98 plan, airtel recharge packs, vodafone Rs 199 offers, airtel vs jio vs vodafone prepaid online recharge, jio online recharge, airtel customer care from other network, airtel prepaid online, reliance jio recharge, jio prepaid offers\" srcset=\"https://images.financialexpress.com/2018/06/Airtel-Vs-Vodafone-Vs-Jio-.jpg 660w, https://images.financialexpress.com/2018/06/Airtel-Vs-Vodafone-Vs-Jio--300x200.jpg 300w, https://images.financialexpress.com/2018/06/Airtel-Vs-Vodafone-Vs-Jio--620x413.jpg 620w, https://images.financialexpress.com/2018/06/Airtel-Vs-Vodafone-Vs-Jio--401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Data war among rival telecom giants has entered an intense phase with Reliance Jio announcing the “Double Dhamaka” offer.</figure>\n\t\t\t</section></div><span>\n</span><p>Data war among rival telecom giants has entered an intense phase with Reliance Jio announcing the “Double Dhamaka” offer. Under Rs 400, the Rs 98 recharge pack offered by <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/mukesh-ambani/\">Mukesh Ambani</a>-owned Jio offers 2GB high-speed 4G data for 28 days. Some of the most popular and affordable Jio plans include those available at Rs 98, Rs 149 and goes up to Rs 399. The recharge plans offer customers various free services – from unlimited voice calls to no roaming charge to limited SMS pack. Similarly, Bharti Airtel and Vodafone have also launched cheap prepaid recharge packs under Rs 400 – Rs 99, Rs 149, Rs 199, Rs 349 and Rs 399. Vodafone and Airtel are both looking to attract customers with lucrative data offers and unlimited voice calling opportunities with massive SMS packs to counter Jio.</p><span>\n</span><p><strong>Below are the latest and cheapest prepaid plans introduced by Jio, Airtel and Vodafone (Under Rs 400):</strong></p><span>\n</span><p><strong>Reliance Jio:</strong></p><span>\n</span><p><strong>Rs 98 pack:</strong> With a validity of 28 days, the pack offers 2GB of 4G internet data per day during the validity period. The ‘Double Dhamaka’ pack also offers unlimited local, STD and roaming voice calling service with 300 free SMSes within the period.</p><span>\n</span><p><strong>Rs 299 pack:</strong> This pack has a validity of 28 days and offers 4.5GB of 3G/4G data per day. It also benefits customers with unlimited voice call service and 100 free SMSes per day during the period. The new Rs 299 plan offer will only remain valid till June 30.</p><span>\n</span><p><strong>Rs 149 pack:</strong> The data plan on this recharge pack include 3GB data a day for a period of 28 days. Which means, the plan offers 84GB within the validity period.</p><span>\n</span><p><strong>Rs 198 pack:</strong> A total of 3.5GB data a day is given for a period of 28 days. This means 98GB of data is given throughout the validity period.</p><span>\n</span><p><strong>Rs 399 pack:</strong> This plan gives a total of 3GB of 4G Internet data, and the validity of this plan is 84 days. Therefore, it offers a total of 252GB of data for the whole period of its validity. It also offers unlimited call opportunities 100 SMS per day.</p><span>\n</span><span>\n</span><p><img class=\"alignnone size-full wp-image-1209675\" src=\"https://images.financialexpress.com/2018/06/jio-7.jpg\" alt=\"\" width=\"400\" height=\"172\" srcset=\"https://images.financialexpress.com/2018/06/jio-7.jpg 400w, https://images.financialexpress.com/2018/06/jio-7-300x129.jpg 300w\" sizes=\"(max-width: 400px) 100vw, 400px\"></p><span>\n</span><p><strong>Airtel:</strong></p><span>\n</span><p><strong>Rs 99 pack:</strong> This plan offers 2GB data per day for a validity period of 28 days. The plan also offers unlimited STD, roaming and local voice calls with 2,800 SMSes during the entire period.</p><span>\n</span><p><strong>Rs 149 pack:</strong> Under this plan, 2GB data is given for a period of 28 days that amounts to 56GB data for the validity period. 100 SMSes per day along with unlimited STD, local and roaming voice calling opportunities.</p><span>\n</span><p><strong>Rs 199 pack:</strong> A total of 2.4GB is given per day for a period of 28 days. This would give around 67.2 GB for a 28-day time period. Like other plans, this also has unlimited voice calling features and 100 SMSes per day.</p><span>\n</span><p><strong>Rs 349 pack:</strong> This plan offers 3GB data per day for a time period of 28 days, which sums up to 84 GB data for the period of its validity.</p><span>\n</span><p><strong>Rs 399 pack:</strong> Under this prepaid plan, 2.4GB data is given for a period of 84 days. So, customers gets a total of around 201 GB data for 84 days.</p><span>\n</span><p><img class=\"alignnone size-full wp-image-1209676\" src=\"https://images.financialexpress.com/2018/06/vodafoner.jpg\" alt=\"\" width=\"400\" height=\"379\" srcset=\"https://images.financialexpress.com/2018/06/vodafoner.jpg 400w, https://images.financialexpress.com/2018/06/vodafoner-211x200.jpg 211w, https://images.financialexpress.com/2018/06/vodafoner-282x267.jpg 282w\" sizes=\"(max-width: 400px) 100vw, 400px\"></p><span>\n</span><p><strong>Vodafone:</strong></p><span>\n</span><p><strong>Rs 199 pack:</strong> This prepaid recharge pack provides subscribers with 1.4GB high-speed internet data per day. Validity of this plan is 28 days. This plan also offers unlimited local, STD and roaming calls within India.</p><span>\n</span><p><strong>Rs 255 pack:</strong> Subscribers are provided with 2 GB of 3G or 4G data per day for a validity period of 28 days with unlimited voice calls.</p><span>\n</span><p><strong>Rs 348 pack:</strong> Under this plan, the subscribers are given a total of 2.5GB data per day. The benefits provided under this plan are valid for 28 days with options of unlimited STD, local and roaming voice calling benefits.</p><span>\n</span><p><strong>Rs 349 pack:</strong> With this plan, the subscribers are given a total of 3GB data per day. The benefits provided under this plan are valid for 28 days with options of unlimited STD, local and roaming voice calling benefits.</p><span>\n</span><p><strong>Rs 399 pack:</strong> With validity of 70 days, this plan offers 1.4GB data per day. Unlimited local, STD and roaming voice call benefits with 100 SMSes per day is also offered in this pack.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "counter",
        "looking",
        "lucrative",
        "massive",
        "unlimited"
    ],
    "verbs": [
        "counter",
        "attract",
        "voice"
    ]
}