{
    "title": "Proposal to have natural gas & ATF under GST gets mixed reaction",
    "link": "https://www.business-standard.com/article/economy-policy/proposal-to-have-natural-gas-atf-under-gst-gets-mixed-reaction-118060900928_1.html",
    "pubDate": "Sun, 10 Jun 2018 06:50:00 +0530",
    "content": "Some states have strongly opposed inclusion of petrol and diesel under GST even as global oil prices have skyrocketed adding to the burden on consumers",
    "contentSnippet": "Some states have strongly opposed inclusion of petrol and diesel under GST even as global oil prices have skyrocketed adding to the burden on consumers",
    "guid": "https://www.business-standard.com/article/economy-policy/proposal-to-have-natural-gas-atf-under-gst-gets-mixed-reaction-118060900928_1.html",
    "isoDate": "2018-06-10T01:20:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.08333333333333333,
        "tokens": [
            "proposal",
            "to",
            "have",
            "natural",
            "gas",
            "",
            "atf",
            "under",
            "gst",
            "gets",
            "mixed",
            "reaction"
        ],
        "words": [
            "natural"
        ],
        "positive": [
            "natural"
        ],
        "negative": []
    },
    "article": {
        "title": "Proposal to have natural gas & ATF under GST gets mixed reaction",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tA debate on whether to include natural gas and jet fuel under the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=goods\" target=\"_blank\">goods </a>and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/services\" target=\"_blank\">services </a>tax (GST) has turned out to be a stormy affair with a few states stiffly opposing the move.</p>\n<p>\n\tAt an event in New Delhi, a <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gst\" target=\"_blank\">GST </a><a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=council\" target=\"_blank\">Council </a>official revealed that a proposal to include natural gas (on an experimental basis) and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/atf\" target=\"_blank\">ATF </a>could also be brought in before including <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/petrol\" target=\"_blank\">petrol </a>and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/diesel\" target=\"_blank\">diesel.</a>\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tSome states have strongly opposed inclusion of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/petrol\" target=\"_blank\">petrol </a>and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/diesel\" target=\"_blank\">diesel </a>under <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gst\" target=\"_blank\">GST </a>even as global oil prices have skyrocketed adding to the burden on consumers. However, the remaining are in favour of including natural gas and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/atf\" target=\"_blank\">ATF </a>under <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gst\" target=\"_blank\">GST </a>compared to passenger fuel due to lower revenue loss burden.</p>\n<p>\n\tDheeraj Rastogi, joint secretary of the GST Council, had at a PHD Chambers event on Friday said that there is some consensus for bringing natural gas under GST and it could be followed by <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/atf\" target=\"_blank\">ATF.</a></p>\n<p>\n\tHowever, Andhra Pradesh finance minister Yanamala Ramakrishundu reacted strongly to the statement and opposed inclusion of natural gas under GST in a letter to the chairman of the GST <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=council\" target=\"_blank\">Council.</a></p>\n<p>\n\t“Andhra Pradesh got a revenue of Rs 5.23 billion on sale of natural gas during the year 2017-18. Being a producer of natural gas, our state will lose substantial revenue if it is included under GST as our ultimate consumption is less than our production,” Ramakrishundu said.</p>\n<p>\n\tHe added that the state already lost autonomy in raising fiscal resources with the introduction of GST. “For the same reason, Andhra Pradesh opposes introduction of other <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/petroleum\" target=\"_blank\">petroleum </a>products under GST. We will stand to lose substantially in terms of revenues if <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/petroleum\" target=\"_blank\">petroleum </a>products are included under GST,” said Ramakrishundu on Saturday.</p>\n<p>\n\tHowever, some states do not find any harm in including natural gas and ATF under GST but have reservations so far as <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/petrol\" target=\"_blank\">petrol </a>and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/diesel\" target=\"_blank\">diesel </a>are concerned. But Maharashtra is in favour of including petrol and diesel under GST.</p>\n<p>\n\tAssam finance minister <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/himanta-biswa-sarma\" target=\"_blank\">Himanta Biswa Sarma </a>told <em>Business Standard</em> that his state is in favour of including natural gas and ATF within GST. “There is a probability that natural gas and ATF will be included under GST as the compensation burden will not be very huge. Assam supports inclusion of natural gas and ATF under GST.”</p>\n<p>\n\tHowever, the inclusion of petrol and diesel should take place only after GST stabilises, he added. “Currently, even if we include petroleum, consumers may not get much benefit because the burden of compensation cess will be higher. States need not worry as they will get full compensation. However, once GST stablises and states no longer require a compensation from the Centre, then only should we look at including <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/petroleum\" target=\"_blank\">petroleum </a>under GST.</p>\n<p>\n\tAn official pointed out that inclusion of natural gas and ATF might be easier as there were fewer states that would need to be convinced. “The use of natural gas is concentrated in only 8-10 states. As for ATF, only states with large airports will be worried,” he added. Besides, the portion of revenue from natural gas and ATF in the states’ revenue pool is far lower than from petrol and diesel.</p>\n<p>\n\t\t<img align=\"left\" alt=\"Proposal to have natural gas &amp; ATF under GST gets mixed reaction\" class=\"imgCont\" height=\"210\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/09/full/1528566011-407.jpg\" title=\"graph\" width=\"620\"></p>\n\tAccording to estimates, states earn about Rs 60 billion in tax revenue from natural gas with most of it concentrated in Gujarat, Maharashtra and Uttar Pradesh. “Petroleum products currently outside the GST regime can be brought in starting with natural gas and ATF, given their predominant B2B usage, less chances of diversion of credit and since they are easier to govern,” said Bipin Sapra, partner, EY.\n<p>\n\tOn the insistence of states, petroleum has been kept out of GST and, hence, continues to face a cascading effect of multiple taxes. However, certain petroleum products such as cooking gas, kerosene and naphtha are part of GST. While crude oil, diesel, petrol, natural gas and ATF do not attract GST, these are used as inputs in the petrochemical, fertiliser and transport industries and this leads to a cascading of taxes. Naphtha and liquefied petroleum gas are included under GST.</p>\n<p>\n\tPratik Jain, partner, PwC India, said “There is a lack of consensus on bringing passenger fuels like petrol and diesel under GST. Therefore, bringing natural gas and ATF first would be a great move. Natural gas is a cleaner fuel compared to coal and should definitely be under GST.</p>\n<p>\n\tCivil aviation secretary Rajiv Nayan Choubey had said recently that a proposal would be made to the finance ministry to bring ATF under the GST to curb increase in jet fuel costs due to rising global crude oil prices.</p>\n<p>\n\tThe finance ministry had earlier proposed bringing natural gas into the GST fold at 5 per cent duty to provide benefit to upstream exploration and production companies, which would allow them to receive credit for GST paid on inward supplies and ensure lower costs. Petroleum minister Dharmendra Pradhan, backed by transport minister Nitin Gadkari, has pitched for inclusion of petroleum products under GST so that consumers can benefit from price rationalisation.</p>\n<p>\n\tThe BJP-led government has lowered the excise duty on petrol and diesel only once during its tenure but raised it nine times between November 2014 and January 2016.</p>\n<p>\n\tStates earned Rs 1.6 trillion in tax revenue from petroleum products in 2016-17, with Maharashtra, Gujarat, Uttar Pradesh and Tamil Nadu being the top four revenue earners.</p>\n<p>\n\t“If the central government is serious about including petroleum products under GST, let it make a serious proposal. Let it commit to a programme for compensating the states for the loss of revenue. Without such firm commitments such talk is wooly,” Kerala finance minister Thomas Isaac tweeted recently. Bihar deputy chief minister Sushil Modi had earlier told Business Standard that states must be allowed to levy additional taxes over GST on petroleum products.</p>\n\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "natural",
        "mixed",
        "Some",
        "opposed",
        "even",
        "global"
    ],
    "nouns": [
        "gas",
        "petrol",
        "Proposal",
        "natural",
        "reaction",
        "inclusion",
        "diesel",
        "even",
        "oil",
        "burden",
        "ATF"
    ],
    "verbs": [
        "gas",
        "even",
        "oil",
        "burden"
    ]
}