{
    "title": "IPL 2018: CSK, Rajasthan Royals take guard to put troublesome past behind",
    "link": "https://www.business-standard.com/article/ipl/ipl-2018-csk-rajasthan-royals-take-guard-to-put-troublesome-past-behind-118040800662_1.html",
    "pubDate": "Sun, 08 Apr 2018 20:51:00 +0530",
    "content": "As in all successful comebacks, strong leadership will be key for Chennai Super Kings and Rajasthan Royals",
    "contentSnippet": "As in all successful comebacks, strong leadership will be key for Chennai Super Kings and Rajasthan Royals",
    "guid": "https://www.business-standard.com/article/ipl/ipl-2018-csk-rajasthan-royals-take-guard-to-put-troublesome-past-behind-118040800662_1.html",
    "isoDate": "2018-04-08T15:21:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "ipl",
            "2018",
            "csk",
            "rajasthan",
            "royals",
            "take",
            "guard",
            "to",
            "put",
            "troublesome",
            "past",
            "behind"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "IPL 2018: CSK, Rajasthan Royals take guard to put troublesome past behind",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=indian+premier+league\" target=\"_blank\">Indian Premier League </a>(IPL) is back with the promise of another heady season of cricket and entertainment, and with it the chance of a second innings for two franchises after a two-year ban. For <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=chennai+super+kings\" target=\"_blank\">Chennai Super Kings </a>(CSK) and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=rajasthan+royals\" target=\"_blank\">Rajasthan Royals </a>(RR)—two high-performing teams on opposite ends of the scale in terms of star appeal—the question is how to rebuild the franchises.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=csk\" target=\"_blank\">CSK </a>was the biggest brand in the IPL, says Indranil Das Blah, founding partner at <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=sports\" target=\"_blank\">sports </a>and celebrity firm KWAN Entertainment, ahead of the likes of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=mumbai+indians\" target=\"_blank\">Mumbai Indians </a>(MI) and Kolkata Knight Riders (KKR). The two-year gap has eroded CSK’s brand value a bit. But with its return, the brand will be as big as ever. There’s no dearth of sponsorships, which put it on a par with the other big clubs. “In effect, they’re starting off from where they had left, nothing has changed.” The return from a hiatus has in fact added to the hype around the brand, he says, adding if CSK’s on-field performances match earlier successes it could end the season as bigger than ever.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tFor a low-key <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=rajasthan+royals\" target=\"_blank\">Rajasthan Royals </a>(RR) on the other hand, Blah points out that their focus has been on a “moneyball approach”—which allows small-ticket teams a fair chance by buying assets that are undervalued by other teams and selling off those that are overvalued by the rest. As a brand, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=rr\" target=\"_blank\">RR </a>was therefore significantly hit, and the journey for the team to become a trustworthy brand will be longer and harder, he adds.</p>\n<p>\n\tUnlike M S Dhoni—the talismanic captain of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=csk\" target=\"_blank\">CSK </a>who remains one of India’s biggest cricket stars—<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=rr\" target=\"_blank\">RR </a>does not have a player who is a big brand himself to ride on. Also, an Indian cricketer (Ajinkya Rahane) taking over as captain after tainted Australian Steve Smith had to be recently removed might benefit the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=rr\" target=\"_blank\">RR </a>brand more than an international player helming it.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"http://www.business-standard.com/article/ipl/ipl-2018-don-t-yawn-there-s-cricketing-excitement-to-look-forward-to-118040601220_1.html\" target=\"_blank\">IPL 2018: Don't yawn, there's cricketing excitement to look forward to</a></strong></p>\n\n<p>\n\tN Chandramouli, CEO of brand insights firm TRA, emphasises that on-field performances will be key for both the returning teams, whose brands are starting afresh. Brand trust can only be established through performance. “It was never a perception of these two teams, but their owners who were caught in scandals. So, the brands are clean but they have to re-establish themselves through performance,” he says, adding that the two-year suspension only meant a loss in momentum for the teams. With a change of personnel in the management, the new owners must be proactively involved with the team to keep the players motivated, he adds.</p>\n<p>\n\tBased on the latest IPL brand valuation report published by financial advisory firm Duff &amp; Phelps last August, the overall value of the league stood at USD 5.3 billion with MI commanding the highest brand value (USD 107 million) and becoming the first IPL team to breach the $100-million mark. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=csk\" target=\"_blank\">CSK </a>was valued at $67 million and RR at $45 million before the ban.</p>\n<p>\n\tSantosh N, managing director, Duff &amp; Phelps, says KKR, MI and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=royal+challengers+bangalore\" target=\"_blank\">Royal Challengers Bangalore </a>might have turned profitable in the last few years. “Team performance is a critical component for a franchise to turn profitable. Consistent on-field performances, presence of marquee players and reach of the team all help in commanding a premium from sponsors as well as ensuring spectators flock to the stadium to watch their favourite teams. Along with the firm’s revenue generating capabilities, shrewd and effective management in utilising available resources and better corporate governance contribute towards a team’s profitability,” he adds.</p>\n<p>\n\tAgreeing that CSK and RR’s brand value may have eroded due to the ban, Santosh says they would need to lay greater emphasis on governance as it would otherwise be difficult to change people’s perception. “A combination of strong on-field performances in IPL 11 and perceived/demonstrated improvement in corporate governance should help them claw back,” he says, adding that since controversies snowball quickly in IPL due to the wide viewer interest, teams should avoid real and perceived conflicts of interest.</p>\n<p>\n\tHe too feels that with the IPL governing council taking the moral high ground and banning Smith, RR might be saved negative publicity that his presence might have otherwise generated.</p>\n<p>\n\tIf teams underperform over a period of time (for example, Delhi Daredevils, Kings XI Punjab), their brand value suffers and they struggle off the field to get sponsors. And IPL continues to sell as a product as a result of which it has survived many controversies. However, more than any other teams the onus is on the two staging a comeback to ensure they take extra measures to prevent any scandal both on and off the field.</p>\n\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "troublesome",
        "past",
        "behind",
        "successful",
        "strong",
        "key",
        "Super"
    ],
    "verbs": [
        "guard",
        "put",
        "will",
        "key"
    ],
    "nouns": [
        "guard",
        "put",
        "past",
        "behind",
        "As",
        "leadership",
        "will",
        "key",
        "Chennai",
        "Super"
    ]
}