{
    "creator": "Gaurab Dasgupta",
    "title": "The new workplace: From sleeping pods to meditation areas, co-working spaces are leaving no stone unturned to lure millennial worker",
    "link": "https://www.financialexpress.com/industry/the-new-workplace-from-sleeping-pods-to-meditation-areas-co-working-spaces-are-leaving-no-stone-unturned-to-lure-millennial-worker/1209068/",
    "pubDate": "Sun, 17 Jun 2018 01:48:33 +05:30",
    "dc:creator": "Gaurab Dasgupta",
    "content": "It’s no wonder then that multinational companies as well as small enterprises are opting for flexible set-ups for their daily business.",
    "contentSnippet": "It’s no wonder then that multinational companies as well as small enterprises are opting for flexible set-ups for their daily business.",
    "guid": "https://www.financialexpress.com/?p=1209068",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-16T20:18:33.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.05,
        "tokens": [
            "the",
            "new",
            "workplace",
            "from",
            "sleeping",
            "pods",
            "to",
            "meditation",
            "areas",
            "co-working",
            "spaces",
            "are",
            "leaving",
            "no",
            "stone",
            "unturned",
            "to",
            "lure",
            "millennial",
            "worker"
        ],
        "words": [
            "no"
        ],
        "positive": [],
        "negative": [
            "no"
        ]
    },
    "article": {
        "title": "The new workplace: From sleeping pods to meditation areas, co-working spaces are leaving no stone unturned to lure millennial worker",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1209073\" src=\"https://images.financialexpress.com/2018/06/gowork.jpg\" alt=\"gowork, it sector\" srcset=\"https://images.financialexpress.com/2018/06/gowork.jpg 660w, https://images.financialexpress.com/2018/06/gowork-300x200.jpg 300w, https://images.financialexpress.com/2018/06/gowork-620x413.jpg 620w, https://images.financialexpress.com/2018/06/gowork-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> GoWork in Gurugram, which regularly hosts meditation workshops, hackathons, investor sessions, etc.</figure>\n\t\t\t</section></div><span>\n</span><p>As you enter GoWork, a co-working space in Gurugram, the first thing you sense is the strong aroma of coffee in the air. Turning your head to locate the source, you spot a canteen-cum-brainstorming space to the left of the entrance. Even though coffee is an essential ingredient in the daily life of any corporate professional, it’s a bit unusual to find a caféteria right at the entrance of a workplace. Talking about the reason behind this curious placement, Sudeep Singh, co-founder and chief evangelist, GoWork, says, “We wanted the place to be used by the maximum number of people. If we had placed it somewhere else, that might not have been possible.”</p><span>\n</span><p>Spread over eight lakh square feet with a capacity of around 11,000 seats across its two offices in Gurugram, GoWork was started by Sudeep Singh along with co-founders Sanjeev Mahajan and Nimit Mahajan in June last year. Besides a workspace and canteen, it offers users a meditation zone for tackling work blues and regularly hosts Art of Living workshops, hackathons, investor sessions, etc. The founders are also in talks with other organisations to develop a crèche facility to encourage women entrepreneurs and single dads as well to work from a co-working environment.</p><span>\n</span><p>It’s no wonder then that these spaces are becoming increasingly popular with companies. A co-working space, or shared office space, houses employees of different organisations under one roof. Infrastructure and resources, such as the Internet, caféteria, etc, are used on a shared basis. No single user owns anything except their seats, for which they pay on a periodical basis. This sort of arrangement, hence, not only cuts down on real estate costs for companies, but also makes the working experience hassle-free for employees, enabling optimum utilisation of available resources.</p><span>\n</span><p>Originally conceptualised and implemented in the West, the concept of a co-working space gained prominence in India a couple of years back. Initially, however, it was seen as just the playground of the snowballing start-up industry. “The business model was based on the incubation of start-ups associated with VCs and ecosystem partners. Nobody actually saw co-working the way it was seen in the West,” says Singh.</p><span>\n</span><p>Driven by changing workplace dynamics, however, these spaces have today become the go-to choice for even multinational companies, as well as small- and medium-sized enterprises (SMEs), as they help companies save on resources such as furniture, fittings, etc. A shared economy also enables flexibility in the work culture (in the form of amenities such as sleeping pods, gaming zones, etc), giving workers respite from a hectic schedule.</p><span>\n</span><p>Take, for instance, Chennai-based Smartworks, where the focus is entirely on SMEs. The co-working space, spread over 45,000 sq ft, started last year in Guindy in the southern city. “We are not really focusing on start-ups. We are extremely enterprise-focused. The potential in this market is to convince people who are looking for conventional office spaces to come and sit within co-working spaces… show them the benefits of a shared economy… tell them that by sharing certain portions of your offices you can reduce the costs by 15-25%,” says Niteesh Sarda, co-founder, Smartworks, adding that they will soon come up with another 90,000-sq-ft co-working space in OMR Zone-I of the city.</p><span>\n</span><p>A 2017 joint study by the Confederation of Indian Industry, WeWork (an American company that provides shared workspaces) and Jones Lang LaSalle (a US-based investment management company specialising in real estate) pegs the total number of people using co-working spaces in India between 12 million and 16 million. Of this, around 10 million are employees of MNCs and big corporate houses.</p><span>\n</span><p>Customise your office</p><span>\n</span><p>In 2016, when American management consulting firm McKinsey &amp; Co moved its entire business to WeWork, a co-working space in New York, the decision wasn’t just triggered by the availability of a better location or facility. It was also driven by the opportunity to better utilise its own resources, thereby cutting down costs and proliferating output.</p><span>\n</span><p>Co-working spaces have twin benefits. First, scalability options help service providers bring down costs for clients, so that they can be offered lucrative deals. Second, the entire facility can be treated as an ecosystem to cater to different demands.</p><span>\n</span><p>For Gurugram-based GoWork—which counts among its clients companies such as Cox &amp; Kings, as well as start-ups such as FlyingFur, Impactify, Lifelong, Fixoo, etc—the objective was to create a built-to-suit co-working space. The prices start from Rs 350 a day per seat—the customised cabin comes for `50,000 a month. This includes all amenities (Wi-Fi access, admin help, technical support, etc) available within the facility. “All the services, from housekeeping and administration to maintenance and technical support, are in-house. We have built the model that way. Nothing is outsourced,” says Singh.</p><span>\n</span><p>Chennai-based Smartworks, on the other hand, doesn’t want to restrict itself to just being called a co-working space, as it’s more of an aggregation of resources not used by an organisation on a daily basis. “Suppose someone is looking for a 10,000-sq-ft office, of which they are ready to dedicate 2,000 sq ft for a caféteria and another 1,000 sq ft as a collaboration area. What we do is take one-lakh-sq-ft office space and dedicate 2,000 sq ft for a café. However, the café can now be used by 20 people instead of, say, one. A quid pro quo for both. That is how we operate,” says Sarda.</p><span>\n</span><p>For `7,500 a month, one can get an open workstation at Smartworks’ facility in Chennai. A team of four members, on the other hand, can opt for the ‘Cube’ category, which costs about `32,000 a month. And if you’re looking for a completely customised suite, you can opt for the ‘Smart Suite’ category, which can seat around 100 people and costs around `1 lakh a month.</p><span>\n</span><p>Then there is One Co.Work, a Delhi-based co-working start-up. Founded by Himanshu Bindal in 2015, the start-up has four co-working spaces across India in Delhi, Bengaluru and Gurugram. The Bengaluru facility, the company’s largest co-working space, is spread over 22,000 sq ft and opened in 2017. “We are in the real estate business to make money just like any other model. When we can generate more revenue by going for bigger spaces, why should we restrict ourselves to spaces, which can house only 20, 30 or 40 people in one go? The demand for large co-working spaces is increasing everyday, as more companies move towards a cost-benefit model. We are just catering to that demand,” says Bindal. The price per seat for a day here begins at `699 and goes up to `16,999 a month for 24×7 access. The services include technical support, in-house monitoring, value-added services, as well as innovative offerings such as cave-like pods for power naps.</p><span>\n</span><p>Collaborate, co-work</p><span>\n</span><p>A visit to a place like Starbucks in central Delhi makes one realise how much the millennial generation abhors working out of a fixed sterile office space. In one corner, you see a bunch of lawyers vehemently discussing a case over sandwiches and coffee, while another is occupied by a freelance interior designer working away silently on a laptop. “I don’t like working in an office space or creating one at my place… it restricts my thought process and creativity. I am usually working out of places that are on-the-go and provide me space, an Internet connection and something to eat. That’s enough for a freelancer like me. Why should I unnecessarily invest in an office space?” reasons 24-year-old interior designer Veer Awasthi.</p><span>\n</span><p>It’s this demand that co-working players are aiming to fulfil by coming up with customised solutions for the millennial working class. Not just that, they also provide people like Awasthi the chance to meet like-minded individuals and collaborate. “Large co-working spaces bring the chance of networking on the table and this makes all the difference. Imagine you’re working on a prototype for your start-up and you have a VC organisation working on the same floor. Wouldn’t it be easier for you to walk up to them and pitch your ideas? It’s all about networking in today’s age,” says GoWork’s Singh.<br>Companies providing co-working spaces are also going the extra mile to make the working experience unique. Take, for instance, Smartworks’ Chennai facility. Before opening the facility, the organisation hired a team of architects and designers from Design Republic, a Delhi-based company, to design the space in such a manner that it would make collaborations easy. The space today is vibrant, well-lit and designed keeping in mind demands of clients.</p><span>\n</span><p>Some co-working spaces also host dedicated events for the people working there. One Co.Work hosts group sessions every Friday, where people come and talk about their ideas and the work they are doing, leading to possible collaborations. “Every week, we do a survey, where we ask people for their preferred topics for discussion on Friday. Based on their suggestions, we organise the event,” says Bindal.</p><span>\n</span><p>Gurugram’s GoWork also has a unique concept called ‘Pitch over a pitcher’, wherein start-ups can pitch their ideas to VCs and MNCs over a pitcher of beer. The catch: you have time to pitch the idea only till the pitcher lasts, so your idea needs to be so exceptional that the people on the other side of the table don’t get the time to finish the pitcher. “It’s an innovative idea… It not only allows working professionals a break from their usual schedule, but also initiates long-term conversations. Why make such meetings boring through presentations and conferences when they can happen over a pitcher of beer?” says Singh.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "stone",
        "small",
        "new",
        "multinational",
        "working",
        "sleeping",
        "no",
        "unturned",
        "millennial",
        "flexible",
        "set",
        "daily"
    ],
    "verbs": [
        "stone",
        "lure",
        "wonder",
        "set"
    ],
    "nouns": [
        "stone",
        "small",
        "meditation",
        "It",
        "workplace",
        "working",
        "worker",
        "sleeping",
        "co",
        "leaving",
        "no",
        "lure",
        "wonder",
        "set",
        "daily",
        "business"
    ]
}