{
    "title": "Gold price may hit Rs 34,000 level by Diwali on weak rupee",
    "link": "https://timesofindia.indiatimes.com/india/gold-price-may-hit-rs-34000-level-by-diwali-on-weak-rupee/articleshow/64527841.cms",
    "pubDate": "Sun, 10 Jun 2018 07:11:55 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/india/gold-price-may-hit-rs-34000-level-by-diwali-on-weak-rupee/articleshow/64527841.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64527841.cms\" /></a>Gold prices are likely to hold in the range of Rs 30,000-34,000 per ten grams until Diwali in the domestic market, and internationally the yellow metal might be in $1,260-1,400 an ounce level, Commtrendz Risk Management director Gnanasekar Thiagarajan told PTI here.",
    "contentSnippet": "Gold prices are likely to hold in the range of Rs 30,000-34,000 per ten grams until Diwali in the domestic market, and internationally the yellow metal might be in $1,260-1,400 an ounce level, Commtrendz Risk Management director Gnanasekar Thiagarajan told PTI here.",
    "guid": "https://timesofindia.indiatimes.com/india/gold-price-may-hit-rs-34000-level-by-diwali-on-weak-rupee/articleshow/64527841.cms",
    "isoDate": "2018-06-10T07:11:55.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "gold",
            "price",
            "may",
            "hit",
            "rs",
            "34000",
            "level",
            "by",
            "diwali",
            "on",
            "weak",
            "rupee"
        ],
        "words": [
            "weak",
            "gold"
        ],
        "positive": [
            "gold"
        ],
        "negative": [
            "weak"
        ]
    },
    "article": {
        "title": "Gold price may hit Rs 34,000 level by Diwali on weak rupee",
        "content": "<div class=\"Normal\"><span>MUMBAI: </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/gold-price\">Gold prices</a><p> are likely rise up to Rs 34,000 per 10 grams level during Diwali mainly on the back of depreciating rupee and geo-political concerns, according to analysts.\n\n</p><span>Gold prices are likely to hold in the range of Rs 30,000-34,000 per ten grams until Diwali in the </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/domestic-market\">domestic market</a><p>, and internationally the yellow metal might be in $1,260-1,400 an ounce level, Commtrendz Risk Management director Gnanasekar Thiagarajan told PTI here.\n</p><p>\"Price would have absorbed the effect of rate hikes and rate hikes would only confirm inflationary expectations, which could increase the appeal for bullion as a inflationary hedge then. And with domestic currency poised to weaken further prices could test previous highs around Diwali,\" he added.\n</p><p>In India, gold on June 8 closed at Rs 31,010 per 10 grams and while in New York it closed at $1,302.70 an ounce.\n</p><p>Globally, Thiagarajan said, gold prices have been in a range being capped by rising yields and dollar, and supported by global uncertainties and geo-political tensions, but it is holding well in spite of a strengthening dollar.\n</p><p>\"With more rate cuts, the dollar could eventually come under pressure as cost of doing business increases in the US. So, I see the possibility of investors moving towards gold by the end of the second quarter in a big way,\" he added.\n</p><span>Commodity &amp; Currency managing director Priti Rathi was of the view that </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/business/india-business/gold-rates/articleshow/58628130.cms\">gold price</a><p> is likely to trade in the range of Rs 31,500-31,800 by Diwali.\n</p><p>\"However, the long-term chart for gold shows, prices are mildly bullish and seem to trade in the $1,200-1,350 range. We expect tight supply situation, geopolitical concerns, a possibly weak dollar and higher inflation might help price to work higher,\" she said.\n</p><p>She said, by the end of 2018, the prices are expected to trade sideways to higher with a possible average target of $1,350 (Rs 31,800).\n</p><p>\"The higher range would be $1,390 (Rs 32,500) and lower side would be $1,250 (Rs 30,400),\" she added.\n</p><p>Angel Broking Chief analyst Prathamesh Malaya said, \"There is a lot of optimism in the US economy and I feel there is a possibility of rate hike. This will cap the volatility in gold. So during Diwali the gold price is likely to be around Rs 31,500 in the upper range and Around Rs 30,000.\"\n</p><p>In US dollar term, gold is likely to be in the range of $1,360 in the upper level and $1,200 in the lower level. The price movement in gold usually triggered by geopolitical tensions, and things are looking better right now, he added.\n</p><p>The bear phase in gold, which started in 2011 took a pause as it rebounded in 2016 followed by a consolidation in 2017, she said adding currently gold prices seems to be well balanced as it is consolidating between $1,290 and $1,350.\n</p><span>\"Even though the equity market has boomed gold prices have held very well. This is an indication that investors are concerned of a stock market correction anytime which would be a good news for gold prices,\" she added.\n</span><br><span>\n</span><br><span>When it comes to gold demand in the domestic market, Thiagarajan said, investment demand has been virtually absent as stock markets have been delivering good returns and conventional jewellery demand has also not seen any rise due to high prices capping demand and the buying trends also changing slowly.\n</span><br><span>\n</span><br><span>Rural demand, however, is the only saviour going forward due to rise in </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/minimum-support-price\">minimum support price</a><span> (MSP) will aid in higher incomes and spending in gold.\n</span><br><span>\n</span><br><span>Normal monsoon predictions could also boost overall sentiment for rurual demand, he added.\n</span><br><span>\n</span><p>Meanwhile, Gupta said, high domestic prices kept away the Indian customers, however, they will comeback if the gold dips close to 30,500-30,000. \n</p><span>\n</span></div>"
    },
    "adjectives": [
        "domestic",
        "metal",
        "ten",
        "30",
        "Gold",
        "gold",
        "34",
        "weak",
        "likely",
        "10",
        "left",
        "level",
        "top",
        "right",
        "yellow",
        "400"
    ],
    "nouns": [
        "domestic",
        "market",
        "margin",
        "price",
        "india",
        "metal",
        "ten",
        "30",
        "Gold",
        "gold",
        "may",
        "hit",
        "rupee",
        "hold",
        "range",
        "border",
        "10",
        "Risk",
        "left",
        "level",
        "top",
        "director",
        "Management",
        "style",
        "right",
        "photo",
        "yellow",
        "ounce"
    ],
    "verbs": [
        "market",
        "price",
        "metal",
        "hit",
        "hold",
        "range",
        "border",
        "Risk",
        "level",
        "top",
        "style",
        "right",
        "align",
        "yellow"
    ]
}