{
    "creator": "PTI",
    "title": "Kerala government to leverage Blockchain technology to streamline supply network",
    "link": "https://www.financialexpress.com/industry/technology/kerala-government-to-leverage-blockchain-technology-to-streamline-supply-network/1209573/",
    "pubDate": "Sun, 17 Jun 2018 17:45:10 +05:30",
    "dc:creator": "PTI",
    "content": "The project is being implemented through the Kerala Development and Innovation Strategic Council (K-DISC), state's think-tank mandated to formulate and implement plans to create a healthy and conducive ecosystem with the help of new technologies.",
    "contentSnippet": "The project is being implemented through the Kerala Development and Innovation Strategic Council (K-DISC), state's think-tank mandated to formulate and implement plans to create a healthy and conducive ecosystem with the help of new technologies.",
    "guid": "https://www.financialexpress.com/?p=1209573",
    "categories": [
        "Industry",
        "Technology"
    ],
    "isoDate": "2018-06-17T12:15:10.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "kerala",
            "government",
            "to",
            "leverage",
            "blockchain",
            "technology",
            "to",
            "streamline",
            "supply",
            "network"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Kerala government to leverage Blockchain technology to streamline supply network",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1209605\" src=\"https://images.financialexpress.com/2018/06/block-chain.jpg\" alt=\"  Kerala government, Blockchain technology, purchase, distribution,crop insurance scheme, dairy sector,  ID number,  crop insurance, farmers, vegetables , fish, technology, kerala\" srcset=\"https://images.financialexpress.com/2018/06/block-chain.jpg 660w, https://images.financialexpress.com/2018/06/block-chain-300x200.jpg 300w, https://images.financialexpress.com/2018/06/block-chain-620x413.jpg 620w, https://images.financialexpress.com/2018/06/block-chain-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The Kerala government has embarked on a strategy to leverage the Blockchain technology to streamline purchase and distribution network of milk, vegetables and fish in the state.</figure>\n\t\t\t</section></div><span>\n</span><p>The Kerala government has embarked on a strategy to leverage the Blockchain technology to streamline purchase and distribution network of milk, vegetables and fish in the state. The project is being implemented through the Kerala Development and Innovation Strategic Council (K-DISC), state’s think-tank mandated to formulate and implement plans to create a healthy and conducive ecosystem with the help of new technologies.</p><span>\n</span><p>The state will also make its crop insurance scheme smarter and fool-proof, ensuring quick processing and settlement of claims to farmers suffering crop losses, a release said here today. K-DISC had recently launched a major programme to train students in Blockchain technology, providing them with the early-mover advantage in this system, which has huge job potential in India and abroad.</p><span>\n</span><p>In the dairy sector, the project will ensure speedy delivery of high-quality milk by continuously monitoring production, procurement and distribution through an electronic ledger, Chairman of K-DISC, K M Abraham said. Each component of the supply network will have a separate ID number, using which the source and quality of the product can be checked at every point of the chain, he said.</p><span>\n</span><p>New technologies like the Internet of Things (IoT) will be employed and RFID Tags and mobile applications will be used to monitor the movement of trucks and refrigerated tanks to make sure they adhere to fixed parameters like temperature in which the products are to be kept. Blockchain technology in crop insurance would help avoid time-lag in the assessment and delivery of compensation to farmers who suffer losses due to natural calamities, he said.</p><span>\n</span><p>It will make the entire process, starting with making applications for coverage to the settlement of claims hassle-free and time-saving. The new technology will come in handy in ascertaining whether the crop loss was due to natural causes or not, which would help avoid unnecessary disputes between insurance firms and beneficiaries besides eliminating the role of middlemen.</p><span>\n</span><p>Supply of vegetables and fish is a key area where the new technology is to be introduced, where farms and fish-landing spots will be linked with packaging centres using geo-coded images. This will enable continuous monitoring and verification of goods at every point of their movement right from the warehouses, wholesale and retail centres up to the point of sale to the consumer, it was said.</p><span>\n</span><p>Seeking to equip students to tap the immense job opportunities in India and abroad, K-DISC recently launched the Accelerated Blockchain Competency Development (ABCD) project.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "K",
        "healthy",
        "implemented",
        "conducive",
        "new",
        "Strategic"
    ],
    "verbs": [
        "leverage",
        "implement",
        "supply",
        "think",
        "project",
        "state",
        "streamline",
        "network",
        "tank",
        "formulate",
        "create",
        "help"
    ]
}