{
    "creator": "Shubham Verma",
    "title": "Google Pixel 3, Pixel 3 XL round-up: Rumoured specs, release date, and everything you should know",
    "link": "https://www.financialexpress.com/industry/technology/google-pixel-3-pixel-3-xl-round-up-rumoured-specs-release-date-and-everything-you-should-know/1200623/",
    "pubDate": "Sun, 10 Jun 2018 18:07:59 +05:30",
    "dc:creator": "Shubham Verma",
    "content": "Google Pixel 3 and Pixel 3 XL will bear resemblance with the predecessors to sport single rear cameras with the software optimised to produce the Bokeh effect",
    "contentSnippet": "Google Pixel 3 and Pixel 3 XL will bear resemblance with the predecessors to sport single rear cameras with the software optimised to produce the Bokeh effect",
    "guid": "https://www.financialexpress.com/?p=1200623",
    "categories": [
        "Industry",
        "Technology"
    ],
    "isoDate": "2018-06-10T12:37:59.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "google",
            "pixel",
            "3",
            "pixel",
            "3",
            "xl",
            "round-up",
            "rumoured",
            "specs",
            "release",
            "date",
            "and",
            "everything",
            "you",
            "should",
            "know"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Google Pixel 3, Pixel 3 XL round-up: Rumoured specs, release date, and everything you should know",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1200633\" src=\"https://images.financialexpress.com/2018/06/google_pixel_2_rear.jpg\" alt=\"Google, Google Pixel 3, Google Pixel 3 XL\" srcset=\"https://images.financialexpress.com/2018/06/google_pixel_2_rear.jpg 660w, https://images.financialexpress.com/2018/06/google_pixel_2_rear-300x200.jpg 300w, https://images.financialexpress.com/2018/06/google_pixel_2_rear-620x413.jpg 620w, https://images.financialexpress.com/2018/06/google_pixel_2_rear-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Google is pinning big hopes with Pixel 3 smartphone line as its predecessor Pixel 2 is yet to show a major sales outcome in the market</figure>\n\t\t\t</section></div><span>\n</span><p><a target=\"_blank\" href=\"http://www.financialexpress.com/tag/google/\">Google</a>’s next-generation Pixel devices, Pixel 3 and Pixel 3XL as they are dubbed right now, will be different from their predecessors. Previous reports have indicated that Google may give the Pixel 3 XL a notch on the top of the display, thanks to the compatibility bundled with Android P, while the Pixel 3 will have spruced up specifications, as well. While both the smartphones are expected to arrive in October, multiple reports suggest that Pixel 3 and Pixel 3 XL will have wireless charging and a true bezel-less design.</p><span>\n</span><p>As per a report by Bloomberg, Google is planning to introduce Pixel 3 and Pixel 3 XL later this year. The Pixel 3 XL will be the bigger variant that will a nearly edge-to-edge notched display, however, with a thin chin at the bottom of the phone. The notch, however, won’t be as wide as the one on the iPhone X and will be more like what we have seen on other Android phones with a notch. The Pixel 3 XL could have a 6.2-inch display. The Pixel 3, on the other hand, will not have the notch on the top of the display, bearing a similar design as of the Pixel 2. It is said to come with a 5.3-inch display.</p><span>\n</span><p>Google is pinning big hopes with Pixel 3 smartphone line as its predecessor Pixel 2 is yet to show a major sales outcome in the market. To rival the phones from other brands, Google will be packing the latest Qualcomm Snapdragon 845 SoC inside the Pixel 3 and Pixel 3 XL. Previous reports have also claimed that at least one Pixel 3 XL model will pack 4GB of RAM and 128GB of onboard storage. Expandable storage is not clear at this point and so is the battery capacity on both the handsets. Both the devices will ditch the 3.5mm headphone jack again to go for the USB Type-C port at the bottom. There will be stereo speakers on the handsets as well.</p><span>\n</span><p>Talking about the cameras, the Google Pixel 3 and Pixel 3 XL will bear resemblance with the predecessors to sport single rear cameras with the software optimised to produce the Bokeh effect. Bloomberg report suggests the Google will further enhance the camera software on the Pixel 3 XL to bring the photo quality to the level of the rivals. A leaked image, however, suggests that the Pixel 3 and Pixel 3 XL will sport dual cameras on the front. Of course, the smartphones will run on the latest Android P, which comes with new features such as Do Not Disturb, Digital Wellbeing, and more.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "rear",
        "XL",
        "round",
        "single"
    ],
    "verbs": [
        "release",
        "produce",
        "effect",
        "rear",
        "Google",
        "will",
        "know",
        "date",
        "round",
        "bear",
        "sport",
        "single"
    ]
}