{
    "creator": "FE Online",
    "title": "Make in India game-changer! Soon, Indigenous Lithium Ion battery production to end dependence on China, Japan",
    "link": "https://www.financialexpress.com/industry/technology/make-in-india-game-changer-soon-indigenous-lithium-ion-battery-production-to-end-dependence-on-china-japan/1200577/",
    "pubDate": "Sun, 10 Jun 2018 16:37:06 +05:30",
    "dc:creator": "FE Online",
    "content": "India will soon start producing first indigenous Lithium Ion batteries. A MoU was signed today between CSIR's Central Electro Chemical Research Institute (CECRI), Karaikudi, Tamil Nadu and RAASI Solar Power Pvt Ltd. ",
    "contentSnippet": "India will soon start producing first indigenous Lithium Ion batteries. A MoU was signed today between CSIR's Central Electro Chemical Research Institute (CECRI), Karaikudi, Tamil Nadu and RAASI Solar Power Pvt Ltd.",
    "guid": "https://www.financialexpress.com/?p=1200577",
    "categories": [
        "Industry",
        "Technology"
    ],
    "isoDate": "2018-06-10T11:07:06.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "make",
            "in",
            "india",
            "game-changer",
            "soon",
            "indigenous",
            "lithium",
            "ion",
            "battery",
            "production",
            "to",
            "end",
            "dependence",
            "on",
            "china",
            "japan"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Make in India game-changer! Soon, Indigenous Lithium Ion battery production to end dependence on China, Japan",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"wp-image-1200580 size-full\" src=\"https://images.financialexpress.com/2018/06/battery2.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/battery2.jpg 660w, https://images.financialexpress.com/2018/06/battery2-300x200.jpg 300w, https://images.financialexpress.com/2018/06/battery2-620x413.jpg 620w, https://images.financialexpress.com/2018/06/battery2-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> India will soon start producing first indigenous Lithium Ion batteries. (Image: PIB)</figure>\n\t\t\t</section></div><span>\n</span><p>India will soon start producing first indigenous Lithium Ion batteries. A memorandum of understanding for transfer of technology for India’s first Lithium Ion (Li-ion) Battery project was signed today between CSIR’s Central Electro Chemical Research Institute (CECRI), Karaikudi, Tamil Nadu and RAASI Solar Power Pvt Ltd.</p><span>\n</span><p>According to the Ministry of Science and Technology, the indigenous technology of Lithium-ion cells has been developed by a group of CSIR-CECRI headed by Dr Gopu Kumar in partnership with CSIR-National Physical Laboratory (CSIR-NPL) New Delhi, CSIR- Central Glass and Ceramic Research Institute (CSIR-CGCRI) Kolkata and Indian Institute of Chemical Technology (CSIR-IICT) Hyderabad.</p><span>\n</span><p>“CSIR-CECRI has set up a demo facility in Chennai to manufacture prototype Lithium-Ion cells. It has secured global IPRs with potential to enable cost reduction, coupled with appropriate supply chain and manufacturing technology for mass production,” a Science and Technology Ministry release said today.</p><span>\n</span><p><a href=\"https://www.financialexpress.com/india-news/make-in-india-at-work-tata-launches-india-made-portable-mri-scanner-to-take-diagnosis-to-remote-villages/1198748/\" target=\"_blank\" rel=\"noopener\"><strong>ALSO READ| TATA launches India-made portable MRI scanner</strong></a></p><span>\n</span><p>At present India depends on countries like China, Japan and South Korea for import of Lithium Ion batteries. India imported Li-Ion batteries worth $150 million in 2017 and is one of its largest importers in the world.</p><span>\n</span><p>Speaking after the signing of MoUs, Union Science and technology minister Harsh Vardhan said: “Today’s development is a validation of the capabilities of CSIR and its laboratories to meet technology in critical areas to support our industry, besides other sectors.”</p><span>\n</span><p><a href=\"https://www.financialexpress.com/industry/modis-make-in-india-gets-xiaomi-push-chinese-smartphone-maker-to-locally-source-this-crucial-component/1197288/\" target=\"_blank\" rel=\"noopener\"><strong>ALSO READ|&nbsp;Chinese smartphone maker to locally source this crucial component</strong></a></p><span>\n</span><p>The indigenous production of Li-Ion batteries is expected to boost Prime Minister Modi flagship programmes like generating 175 Giga Watts of clean energy by 2022 and National Electric Mobility Mission.</p><span>\n</span><p>“It will give tremendous boost to two flagship programmes of Prime Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/narendra-modi/\">Narendra Modi</a> – increasing the share of Clean Energy in the energy basket by generating 175 Giga Watts by 2022, of which 100 Giga Watts will be Solar and the second, National Electric Mobility Mission, to switch completely to electric vehicles by 2030,” said Harsh Vardhan.</p><span>\n</span><p>The project, the minister said, is also in tune with PM Modi’s vision of “<a target=\"_blank\" href=\"http://www.financialexpress.com/tag/make-in-india/\">Make in India</a>” to turn the country into ” a manufacturing hub and to cut down outflow of foreign exchange.”</p><span>\n</span><p><a href=\"https://www.financialexpress.com/defence/make-in-india-dhanush-indias-first-indigenous-long-range-artillery-gun-clears-final-test-ready-for-induction/1199115/\" target=\"_blank\" rel=\"noopener\"><strong>ALSO READ|&nbsp;Dhanush, India’s first indigenous long-range artillery gun</strong></a></p><span>\n</span><p>As per the MoU, Raasi Group will set up Li-Ion manufacturing facility in Tamil Nadu’s Krishnagiri district, which is close to Bengaluru. The company aims to bring down the cost of cell manufacturing below Rs 15,000 per KW to replace the Lead Acid batter. The company also plans to manufacture Li-Ion battery for solar rooftop with life span of 25 years.</p><span>\n</span><p>“We want to bring down the cost of cell manufacturing below Rs. 15,000/- per KW to replace Lead Acid Battery…“We also have plans to make Lithium Ion battery for solar roof top with life span of 25 years to make it affordable enough to drive the Photo Voltaic segment,” Raasi Group Chairman-cum-Managing Director C Narsimhan said.</p><span>\n</span><p>Why Lithium-Ion batteries:</p><span>\n</span><p>Li-Ion batteries have applications in Energy Storage System – from hearing aid to container sized batteries to power a cluster of villages, Electric Vehicles (2-wheeler, 3-wheeler, 4-wheeler and Bus), portable electronic sector, Grid Storage, Telecom and Telecommunication Towers, Medical Devices, Household and Office Power Back (UPS), Powering Robots in Processing Industry.</p><span>\n</span><p>Lithium-ion batteries can power any electrical application without the need of physical wires-means wireless.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "Indigenous",
        "indigenous",
        "game",
        "first",
        "Central",
        "Chemical",
        "Tamil",
        "Solar",
        "signed"
    ],
    "nouns": [
        "Make",
        "India",
        "changer",
        "Ion",
        "production",
        "end",
        "dependence",
        "China",
        "game",
        "will",
        "start",
        "first",
        "Lithium",
        "battery",
        "A",
        "Japan",
        "today",
        "Central",
        "Chemical",
        "Research",
        "Institute",
        "Tamil",
        "Power"
    ]
}