{
    "title": "Art of storytelling in the digital age: Keep the message short and simple",
    "link": "https://www.business-standard.com/article/current-affairs/art-of-storytelling-in-the-digital-age-keep-the-message-short-and-simple-118040800050_1.html",
    "pubDate": "Sun, 08 Apr 2018 05:27:00 +0530",
    "content": "The three-day annual extravaganza for advertising and marketing ended on Saturday",
    "contentSnippet": "The three-day annual extravaganza for advertising and marketing ended on Saturday",
    "guid": "https://www.business-standard.com/article/current-affairs/art-of-storytelling-in-the-digital-age-keep-the-message-short-and-simple-118040800050_1.html",
    "isoDate": "2018-04-07T23:57:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "art",
            "of",
            "storytelling",
            "in",
            "the",
            "digital",
            "age",
            "keep",
            "the",
            "message",
            "short",
            "and",
            "simple"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Art of storytelling in the digital age: Keep the message short and simple",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tKeep the message short and simple, especially if it is meant for mobile, said Rapha Vasconcellos, head of creative shop, Asia Pacific, Facebook, at Goafest on Saturday.</p>\n<p>\n\tAddressing the who’s who of advertising and marketing, Vasconcellos said in India, with patchy mobile networks, short videos were the best to drive home a brand’s viewpoint. He added that smartphones could be great creative tools, especially in India — the second-biggest smartphone market after the US.</p>\n<p>\n\tThe three-day annual extravaganza for advertising and marketing ended on Saturday.</p>\n<p>\n\tVasconcellos has worked in Brazil and the US. He said that on social media, people were looking for authentic connections and meaningful interactions within groups.</p>\n<p>\n\t“Small brands are rapidly teaching us how to rethink our craft, especially in areas of mobile and digital communication,” he added. Facebook’s creative shop is a specialist unit, working with brands to create communication for digital, social and mobile platforms.</p>\n<p>\n\tVasconcellos said being creatively agile was helpful when people’s attention spans were short.</p>\n<p>\n\t“There is so much choice available today on the web, that many do not know where to start,” he said, adding: “It works if you simply breakdown your piece of communication. That way it will last longer.” Another speaker for the day was Samuel Akesson, art director at Forsman and Bodenfors, a Swedish advertising agency, best known for its work for brands such as Uber and Volvo. This agency also believes in empowering employees, allowing trainee copywriters and art directors to work on big brands.</p>\n<p>\n\tAkesson highlighted that the best creative work could come from professionals who took responsibility and had courage.</p>\n<p>\n\t<strong>Sania speaks</strong></p>\n<p>\n\tTennis player <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=sania+mirza\" target=\"_blank\">Sania Mirza </a>held forth on diverse subjects such as feminism, competing with cricket and discrimination in sports. “We are a cricketing nation and not a sporting nation. It is not a bad thing. Every country has its favourite sport. …[But] if there are four pages devoted to sports in a newspaper, at least two should be given to other sports rather than one as of now,” she said.</p>\n<p>\n\t<strong><a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=nawazuddin\" target=\"_blank\">Nawazuddin </a>drops by</strong></p>\n<p>\n\tActor <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=nawazuddin\" target=\"_blank\">Nawazuddin </a>Siddiqui made his presence felt at Goafest on Saturday, speaking about his life experiences. One episode he narrated was a childhood prank he pulled on his parents for pocket money. “My parents were not educated. So I used to ask them for Rs 5 for a pen. When they asked how come a pen costs so much, I would tell them that the various components — the nib, the cap — had to be bought separately.”</p>\n<p>\n\t<strong>Millennials take over </strong></p>\n<p>\n\tAmelia Conway, a director with Adolescent, a youth-centric creative agency, explained how brands could talk to the Millennials. At Adolescent, the creative team consists of teens and youths.  They target an audience of peers and speak a language they relate to.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "three",
        "digital",
        "short",
        "simple",
        "annual",
        "ended"
    ],
    "nouns": [
        "three",
        "Art",
        "marketing",
        "age",
        "Keep",
        "message",
        "short",
        "simple",
        "day",
        "annual",
        "extravaganza",
        "advertising",
        "Saturday"
    ],
    "verbs": [
        "age",
        "Keep",
        "message",
        "short"
    ]
}