{
    "title": "SBI to auction 12 bad accounts to recover over Rs 1,325cr",
    "link": "https://timesofindia.indiatimes.com/business/india-business/sbi-to-auction-12-bad-accounts-this-month-to-recover-over-rs-1325-crore/articleshow/64528136.cms",
    "pubDate": "Sun, 10 Jun 2018 07:49:54 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/sbi-to-auction-12-bad-accounts-this-month-to-recover-over-rs-1325-crore/articleshow/64528136.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64528136.cms\" /></a>The country's largest lender SBI will conduct auction of 12 non-performing accounts (NPAs) later this month to recover dues of over Rs 1,325 crore. The e-auction of these accounts will take place on June 25, according to a SBI notice.",
    "contentSnippet": "The country's largest lender SBI will conduct auction of 12 non-performing accounts (NPAs) later this month to recover dues of over Rs 1,325 crore. The e-auction of these accounts will take place on June 25, according to a SBI notice.",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/sbi-to-auction-12-bad-accounts-this-month-to-recover-over-rs-1325-crore/articleshow/64528136.cms",
    "isoDate": "2018-06-10T07:49:54.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.2727272727272727,
        "tokens": [
            "sbi",
            "to",
            "auction",
            "12",
            "bad",
            "accounts",
            "to",
            "recover",
            "over",
            "rs",
            "1325cr"
        ],
        "words": [
            "bad"
        ],
        "positive": [],
        "negative": [
            "bad"
        ]
    },
    "article": {
        "title": "SBI to auction 12 bad accounts this month to recover over Rs 1,325 crore",
        "content": "<div class=\"section1\"><div class=\"Normal\"><p>NEW DELHI: The country's largest lender SBI will conduct auction of 12 non-performing accounts (NPAs) later this month to recover dues of over Rs 1,325 crore.\n\n</p><p>The e-auction of these accounts will take place on June 25, according to an SBI notice.\n</p><p>The NPA accounts that have been put under the hammer include Ankit Metal &amp; Power Ltd (Rs 690.08 crore), Modern Steels Ltd (Rs 122.61 crore), Good Health Agrotech Pvt Ltd (Rs 109.14 crore), Amit Cottons Pvt Ltd (Rs 84.70 crore), and Ind-Swift Ltd (Rs 80.49 crore).\n</p><p>The remaining are Nikhil Refineries (Rs 52.85 crore), Bhaskar Shrachi Alloys (Rs 51.48 crore), Sri Ganesh Sponge Iron Pvt Ltd (Rs 38.96 crore), Asmita Papers (Rs 37.23 crore), Forel Labs (Rs 22.86 crore), Karthik Agro Industries (Rs 20.82 crore) and Abhinandan Interexim (Rs 14.15 crore).\n</p><span>State </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Bank\">Bank</a><span> of India (SBI) said interested bidders can conduct due diligence of these assets with immediate effect after submitting the expression of interest and executing a </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/non-disclosure-agreement\">non-disclosure agreement</a><p> with the bank.\n</p><p>The lender's gross non-performing assets or bad loans as on March 31, 2018, reached Rs 2.23 lakh crore, which was 10.91 per cent of gross advances by the end of 2017-18.\n</p><p>SBI reported a record net loss of Rs 7,718 crore in the fourth quarter ended March, and of Rs 6,547 crore for 2017-18 due to higher provisioning for bad loans.\n</p><span>\n</span><br><span>The net NPAs were Rs 1,10,855 crore (5.73 per cent of net loans) by end of March, 2018.\n</span><br><span>\n</span><br><span>SBI said that the recovery in its written-off accounts improved to 21.18 per cent in March quarter and the losses during the past fiscal were mainly because it was required to make provisions at a higher rates in respect of advances to stressed sectors of the economy.\n</span><br><span>\n</span><br><span>The Reserve Bank's revised framework has earmarked specified norms for early identification of stressed assets, timeline for implementation of resolution plans and a penalty on banks for failing to adhere to the prescribed timeline.\n</span><br><span>\n</span><br><span>These guidelines came after the banking sector regulator scrapped the previous mechanisms such as the Corporate Debt Restructuring Scheme, Strategic Debt Restructuring Scheme (SDR) and Scheme for Sustainable Structuring of Stressed Assets (S4A). \n</span><br><span>\n</span></div></div>"
    },
    "adjectives": [
        "10",
        "left",
        "top",
        "right",
        "bad",
        "according",
        "12",
        "25",
        "later"
    ],
    "nouns": [
        "india",
        "performing",
        "conduct",
        "notice",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo",
        "crore",
        "country",
        "lender",
        "will",
        "place",
        "month",
        "June",
        "bad",
        "auction",
        "12",
        "25"
    ],
    "verbs": [
        "conduct",
        "notice",
        "border",
        "align",
        "style",
        "top",
        "right",
        "recover",
        "will",
        "place",
        "auction"
    ]
}