{
    "title": "IPL 2018: League teams hope to leverage growing star power of the players",
    "link": "https://www.business-standard.com/article/ipl/ipl-2018-league-teams-hope-to-leverage-growing-star-power-of-the-players-118042200700_1.html",
    "pubDate": "Sun, 22 Apr 2018 22:55:00 +0530",
    "content": "According to a report, India's licensing market will grow at 7.4 per cent, which is higher than the growth in USA, Canada, UK combined",
    "contentSnippet": "According to a report, India's licensing market will grow at 7.4 per cent, which is higher than the growth in USA, Canada, UK combined",
    "guid": "https://www.business-standard.com/article/ipl/ipl-2018-league-teams-hope-to-leverage-growing-star-power-of-the-players-118042200700_1.html",
    "isoDate": "2018-04-22T17:25:00.000Z",
    "sentiment": {
        "score": 3,
        "comparative": 0.23076923076923078,
        "tokens": [
            "ipl",
            "2018",
            "league",
            "teams",
            "hope",
            "to",
            "leverage",
            "growing",
            "star",
            "power",
            "of",
            "the",
            "players"
        ],
        "words": [
            "growing",
            "hope"
        ],
        "positive": [
            "growing",
            "hope"
        ],
        "negative": []
    },
    "article": {
        "title": "IPL 2018: League teams hope to leverage growing star power of the players",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tSuperheroes and cricketers are of the same feather when it comes to Indian fans, so believe franchise owners and managers of the eight teams playing the Vivo Indian Premier League (IPL) 2018. Eleven years into the league and after a 70 per cent year-on-year growth in merchandise sales over the past three to four years, albeit on a low base, the franchise owners are coming up with innovative games and shows around their teams besides spinning a<br>wider range of merchandise around their star players.</p>\n<p>\n\tAccording to a report (<em>Showbiz: The Indian Superpower Entertainment Marketing Report by ESP Properties, December 2017</em>) India’s licensing market will grow at 7.4 per cent, which is higher than the growth in USA, Canada and UK combined. The top 150 global licensors (which include non-film brands) reported total retail sales of Rs 17.51 trillion worldwide in 2017. India’s share in the global licensing pie is 5-7 per cent and of this, sports merchandising accounts for 13 per cent of the total.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=l+m\" target=\"_blank\">L&amp;M </a>has been on the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ipl\" target=\"_blank\">IPL </a>radar for a few years now, team owners enthused by the swelling online fan base and conversations around the league games on social media have long sought to leverage the reach and pull of their players. The <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ipl\" target=\"_blank\">IPL </a>teams also have the advantage of being in the game for a decade, which has helped nurture a large base of fans.</p>\n<p>\n\tExperts believe that fan base and loyalty have evolved over time. “At first, there were supporters going for a city or the players. Those were the factors that attracted loyalty of the fans. But as the seasons went by, the performance of the teams and the players associated with it became more important,” says Bhavik Vora, founder, Black White and Orange, a licensing agency based in Mumbai.</p>\n<p>\n\tThis is especially true for teams such as Mumbai Indians, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=kolkata+knight+riders\" target=\"_blank\">Kolkata Knight Riders </a>(KKR), <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=royal+challengers+bengaluru\" target=\"_blank\">Royal Challengers Bengaluru </a>(RCB) and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=chennai+super+kings\" target=\"_blank\">Chennai Super Kings </a>(CSK). Even though <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=csk\" target=\"_blank\">CSK </a>was benched for two years, the popularity of the team, mainly because of the their player line-up and its swashbuckling skipper MS Dhoni, is intact. The team has slipped back into the first year of playing after a two-year hiatus with an elaborate merchandise portfolio.</p>\n<p>\n\tThe market too has evolved over the years. A flourishing set of e-commerce players has helped <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ipl\" target=\"_blank\">IPL </a>franchises push their merchandise. Almost all teams are available at some online destination. KKR, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=mumbai+indians\" target=\"_blank\">Mumbai Indians </a>(MI) and Kings XI Punjab (KXIP) are present on <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=the+souled+store\" target=\"_blank\">The Souled Store </a>while others are present across Amazon, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=flipkart\" target=\"_blank\">Flipkart </a>and other marketplaces.</p>\n<br><blockquote class=\"blockquoteBG styleQ1\">\n\t<p>\n\t\t<span><strong>THE <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=l+m\" target=\"_blank\">L&amp;M </a>PIE</strong></span></p>\n\t<p>\n\t\t<strong>* </strong>Top global licensors (which include non-film brands) reported retail sales of Rs 17.51 trillion worldwide in 2017</p>\n\t<p>\n\t\t<strong>* </strong>India’s share in the global licensing market is 5-7%, but industry sources predict India’s licensing growth at 7.4%, which is higher than the growth in US, Canada and UK combined</p>\n\t<p>\n\t\t<strong>* </strong>India’s neighbouring markets offer an opportunity too, Pakistan and Sri Lanka are  thriving <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=l+m\" target=\"_blank\">L&amp;M </a>markets </p><p>\n\t\tSource: Showbiz: The Indian Superpower Entertainment Marketing Report, ESP Properties, December 2017</p>\n</blockquote><p>\n\t“L&amp;M continues to be a key focus area of growth for <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=kkr\" target=\"_blank\">KKR.</a> Our aim is to be at par with top sporting clubs around the world. And we have pioneered many initiatives, be it through launching an online marketplace for fans or forging exciting partnerships with brands,” says Venky Mysore, MD and CEO, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=kkr\" target=\"_blank\">KKR.</a> <br></p>\n<p>\n\tThe teams can do a lot more believe L&amp;M experts. There is an opportunity for innovation here by collaborating with other popular entertainment franchises. “That way, you get to target two fan bases and  provide something new,” says Vora. He is looking at collaborations with entertainment franchises, the superhero franchise, for instance.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=kkr\" target=\"_blank\">KKR </a>says it has a back-to-school range with Marvel, based on the Avengers collection. This includes apparel and games, it is more than packaging the team says. An example of the collaboration is a dart game where players are divided into the Avengers and KKR players, bringing both the franchises together not only in the packaging, but also in the actual game. “KKR along with Indiagames (the digital arm of Walt Disney India) has developed an immersive experience, where fans get a chance of actually running and managing a team,” adds Mysore.</p>\n<p>\n\tAs a result, the merchandise arm of the team has seen 70 per cent year on year growth over the past few years. Experts believe that this would be true to all the top teams. A market like India however poses multiple challenges. For one, being a price sensitive market, franchises and their retail partners are forever trying to balance quality with cost.</p>\n<p>\n\t“The challenge is two-fold in this case. On the one hand, there are few to no steps taken to curb piracy. You see jerseys being sold outside match venues which are definitely not official licensed merchandise. Add to that the fact that the Indian fan has still not evolved to the level of a let’s say a football club (international) fan to value original products irrespective of the price, and you have a big problem to tackle,” says Vora. Mysore agrees, “Counterfeit products continue to be a big menace in this industry and KKR is trying its best to urge its fans to buy only authentic merchandise which apart from a far superior quality gives fans a lot more gratification.”</p>\n<p>\n\tHowever to stamp down on counterfeits, teams and their licensed merchandise partners need to examine the price-value equation. As more and more fans wear their fanaticism on their sleeves or hold it in their coffee cups, the market will go wider and deeper. But only if the price is right, say experts.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "combined",
        "growing",
        "star",
        "According",
        "higher"
    ],
    "verbs": [
        "League",
        "will",
        "hope",
        "leverage",
        "grow",
        "star",
        "power",
        "report",
        "market"
    ],
    "nouns": [
        "League",
        "will",
        "India",
        "leverage",
        "growing",
        "growth",
        "star",
        "power",
        "report",
        "market",
        "cent",
        "USA",
        "Canada",
        "UK",
        "hope"
    ]
}