{
    "title": "Seat-share rules set off a war in the skies",
    "link": "https://www.business-standard.com/article/economy-policy/seat-share-rules-set-off-a-war-in-the-skies-118060900943_1.html",
    "pubDate": "Sun, 10 Jun 2018 06:55:00 +0530",
    "content": "Vistara and AirAsia India have argued that trading of RDG seats is the most market effective way of ensuring compliance, referring to it as a step to bring in level-playing field for new airlines",
    "contentSnippet": "Vistara and AirAsia India have argued that trading of RDG seats is the most market effective way of ensuring compliance, referring to it as a step to bring in level-playing field for new airlines",
    "guid": "https://www.business-standard.com/article/economy-policy/seat-share-rules-set-off-a-war-in-the-skies-118060900943_1.html",
    "isoDate": "2018-06-10T01:25:00.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.2222222222222222,
        "tokens": [
            "seat-share",
            "rules",
            "set",
            "off",
            "a",
            "war",
            "in",
            "the",
            "skies"
        ],
        "words": [
            "war"
        ],
        "positive": [],
        "negative": [
            "war"
        ]
    },
    "article": {
        "title": "Seat-share rules set off a war in the skies",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tThe Indian <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/aviation-industry\" target=\"_blank\">aviation industry </a>is divided over the tweaking of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=route+dispersal+guidelines\" target=\"_blank\">Route Dispersal Guidelines </a>(RDGs), which make it mandatory for <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/airlines\" target=\"_blank\">airlines </a>to fly between non-profitable, unserved and underserved routes. The proposed guideline change would allow <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/airlines\" target=\"_blank\">airlines </a>to trade seats between themselves, thereby making it easier for them to comply.</p>\n<p>\n\tThe aviation proposal is similar to the Reserve Bank of India norm that lets banks buy priority sector lending from each other. The RBI norm helps banks meet the condition of minimum 40 per cent lending to the priority sector, such as  agriculture and small enterprises.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tDocuments reviewed by <em>Business Standard</em> show that Tata-owned <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/airlines\" target=\"_blank\">airlines </a>Vistara and AirAsia India, as well as SpiceJet have supported the move, while IndiGo, GoAir and Jet Airways have opposed it, saying such trading will dilute the objective of increasing connectivity in unpenetrated regions. The debate has also triggered questions over the viability of RDGs at a time the government is operating an incentive-based Regional Connectivity Scheme with a similar purpose of increasing air connectivity to hinterlands.</p>\n<p>\n\t“Today there is no need or gain of trading seats under RDGs. Only a few airlines are proposing these rules due to their lack of interest in deploying capacity in CAT II and CT II-A routes,” says a submission of Jet Airways.</p>\n<p>\n\tRDGs divide domestic routes into three categories. Category-I represents the 20 most profitable routes among metros. Category-II includes the north-eastern region, Jammu and Kashmir, and Lakshadweep. Category-III represents metro to non-metro cities such as Coimbatore, Kochi, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/varanasi\" target=\"_blank\">Varanasi.</a> Airlines have to deploy on Category-II routes at least 10 per cent of their capacity deployed on Category-I routes. Likewise, they have to deploy on Category-III routes at least 35 per cent of their capacity deployed on Category-I routes.</p>\n<p>\n\tOperating a premium product, in a price sensitive market like India with massive infrastructure constraints, Vistara has registered losses of more than Rs 10 billion in the first three years of operations. With increasing oil price, relatively new airlines like Vistara are finding it taxing to fly remote routes where the business and premium economy cabins have little demand. Vistara, for instance, has in the recent past failed many times to comply with the norms.<br>Vistara and AirAsia India have argued that trading of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=rdg\" target=\"_blank\">RDG </a>seats is the most market effective way of ensuring compliance, referring to it as a step to bring in level-playing field  for new airlines.</p>\n<p>\n\t“Any new airline starting with an A-320 aircraft is at a disadvantage in operating <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=rdg\" target=\"_blank\">RDG </a>routes. Trading of seats is very much compliant with the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=rdg\" target=\"_blank\">RDG </a>guidelines,” AirAsia India said in its submission.</p>\n<p>\n\tVistara said airlines were facing a challenge to add flights to CAT-II airports due to lack of slots and infrastructure constraints.</p>\n<p>\n\tAirports like Guwahati, Leh, Bagdogra, Port Blair face so many constraints, that without the ability to add flights to these airports, adding CAT-II routes becomes more challenging, it pointed out. The incumbent airlines control 60-70 per cent slots, giving them a significant advantage against new airlines, Vistara stated in its argument.</p>\n<p>\n\t\t<img align=\"left\" alt=\"Seat-share rules set off a war in the skies\" class=\"imgCont\" height=\"484\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/09/full/1528567441-7317.jpg\" title=\"graph\" width=\"385\" data-pagespeed-url-hash=\"1781588813\" onload=\"pagespeed.CriticalImages.checkImageForCriticality(this);\"></p>\n\tExperts have suggested that the capacity that airlines deploy in the Regional Connectivity Scheme be allowed to use it as part of RDG compliance.\n<p>\n\tAmeya Joshi, founder of the airline blog Network Thoughts, said merging the benefits of RDG and RCS would allow regional airlines like Air Deccan and Air Odisha to find the RDG routes even more lucrative if they get to sell their capacity to larger airlines and benefit further. \"This cooperation can translate into code-share or interline with seamless connectivity across the country,\" Joshi wrote in his analysis.</p>\n<p>\n\tA senior Jet Airways executive said cross-subsidising UDAN routes with RDG compliance should be permitted only between subsidiary companies like Jet Airways and Jet Lite or Air India and Alliance Air. “Trading between fully-owned subsidiary and two different entities are different and with airlines deploying more capacity on UDAN routes, such a move may lead to monopolistic situation,” he said.</p>\n<p>\n\tKapil Kaul, CEO South Asia of aviation consultancy firm CAPA, said  simultaneous existence of both regional connectivity scheme and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=route+dispersal+guidelines\" target=\"_blank\">route dispersal guidelines </a>defies global compliance. “The government for the sake of increasing ease of business of aviation should permit trading of seats in RDG,” he said.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "off",
        "level",
        "new",
        "set",
        "effective"
    ],
    "verbs": [
        "share",
        "market",
        "off",
        "level",
        "Seat",
        "set",
        "war",
        "step",
        "bring",
        "field"
    ],
    "nouns": [
        "India",
        "share",
        "compliance",
        "market",
        "level",
        "trading",
        "playing",
        "Seat",
        "seats",
        "set",
        "war",
        "step",
        "field"
    ]
}