{
    "title": "Govt mulls GST refund mechanism for foreign tourists at airports",
    "link": "https://www.business-standard.com/article/economy-policy/govt-mulls-gst-refund-mechanism-for-foreign-tourists-at-airports-118061000171_1.html",
    "pubDate": "Sun, 10 Jun 2018 13:53:00 +0530",
    "content": "Initially, only purchases made by tourists from big retailers would be eligible for GST refunds at the airports",
    "contentSnippet": "Initially, only purchases made by tourists from big retailers would be eligible for GST refunds at the airports",
    "guid": "https://www.business-standard.com/article/economy-policy/govt-mulls-gst-refund-mechanism-for-foreign-tourists-at-airports-118061000171_1.html",
    "isoDate": "2018-06-10T08:23:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "govt",
            "mulls",
            "gst",
            "refund",
            "mechanism",
            "for",
            "foreign",
            "tourists",
            "at",
            "airports"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Govt mulls GST refund mechanism for foreign tourists at airports",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tForeign tourists may soon get to claim <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=gst\" target=\"_blank\">GST </a>refunds at airports at the time of exit as the revenue department is working on a mechanism to refund taxes paid by them on local purchases.</p>\n<p>\n\tInitially, only purchases made by tourists from big retailers would be eligible for <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=goods+and+services+tax\" target=\"_blank\">Goods and Services Tax </a>(GST) refunds at the airports when the tourist is leaving the country, an official said.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tIn several countries VAT or <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=gst\" target=\"_blank\">GST </a>are refunded to the tourists for purchases made beyond a prescribed threshold.</p>\n<p>\n\tThe department is working out a mechanism which will ensure refund of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=gst\" target=\"_blank\">GST </a>to foreign tourists and for that the field offices have to be sensitised, the official said.</p>\n<p>\n\t\"It has to be ensured that refunds are not claimed on the basis of fake invoices. The refund mechanism could start on the basis of invoices issued by big retailers,\" the official told PTI.</p>\n<p>\n\tA provision for <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=gst+refund\" target=\"_blank\">GST refund </a>to tourists have been made in the GST law, but it is yet to be operational.</p>\n<p>\n\tThe law has defined the term 'tourist' as a person not normally resident in India, who enters India for a stay of not more than six months for legitimate non-immigrant purposes.</p>\n<p>\n\tAMRG &amp; Associates Partner Rajat Mohan said tourist refund claims are a great inbound tourism marketing technique with a low cost to the exchequer.</p>\n<p>\n\t\"Internationally, countries like Singapore and Australia have an online robust system connecting multiple refund agencies and retailers on a single platform, offering tourists a seamless and hassle-free experience while verifying, processing and disbursing the tax refunds. Matching such state-of-the-art systems could be a technological nightmare for Indian counterparts,\" Mohan said.</p>\n<p>\n\tCountries like Australia, Germany, France, Singapore, Japan, Malaysia, United Kingdom and Switzerland offer VAT or <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=gst+refund\" target=\"_blank\">GST refund </a>to international tourists subject to certain conditions. These countries also have a threshold of the minimum amount spent for availing these <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=tax+refund\" target=\"_blank\">tax refund </a>advantage.</p>\n<p>\n\tIn Australia, to avail the tax benefit the minimum spend should be 300 Australian dollars (around Rs 15,000). Also, the goods have to be purchased from a single business with same Australian business number.</p>\n<p>\n\tIn case of Singapore, the norms are more relaxed and the minimum purchase amount fixed is SGD 100 (around Rs 5,000), while for Japan and Switzerland the threshold has been fixed at 5,401 yen (around Rs 3,000) and 300 Swiss francs (around Rs 20,000), respectively.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "foreign",
        "made",
        "big",
        "eligible"
    ],
    "nouns": [
        "refund",
        "mechanism"
    ],
    "verbs": [
        "refund"
    ]
}