{
    "title": "Firms are taking less time to detect a security breach, says Accenture",
    "link": "https://www.business-standard.com/article/technology/firms-are-taking-less-time-to-detect-a-security-breach-says-accenture-118042200598_1.html",
    "pubDate": "Sun, 22 Apr 2018 21:09:00 +0530",
    "content": "This year, 55 per cent of organisations took one week or less to detect a breach compared to 10 per cent last year",
    "contentSnippet": "This year, 55 per cent of organisations took one week or less to detect a breach compared to 10 per cent last year",
    "guid": "https://www.business-standard.com/article/technology/firms-are-taking-less-time-to-detect-a-security-breach-says-accenture-118042200598_1.html",
    "isoDate": "2018-04-22T15:39:00.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.16666666666666666,
        "tokens": [
            "firms",
            "are",
            "taking",
            "less",
            "time",
            "to",
            "detect",
            "a",
            "security",
            "breach",
            "says",
            "accenture"
        ],
        "words": [
            "breach"
        ],
        "positive": [],
        "negative": [
            "breach"
        ]
    },
    "article": {
        "title": "Firms are taking less time to detect a security breach, says Accenture",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tWith <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ransomware\" target=\"_blank\">ransomware </a>and distributed denial of service (DDoS) attacks on the rise, the average number of focused <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=cyber+attacks\" target=\"_blank\">cyber attacks </a>per organisation has more than doubled this year compared to the previous 12 months (232 through January 2018 versus 106 through January 2017).</p>\n<p>\n\tIn the face of these growing cyber threats, organisations are demonstrating far more success in detecting and blocking them, according to a study from <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=accenture\" target=\"_blank\">Accenture.</a> Yet, despite making significant progress, only two out of five organisations are currently investing in breakthrough technologies like machine learning, artificial intelligence (AI) and automation, indicating there is even more ground to be gained by increasing investment in cyber resilient innovations and solutions.</p>\n<p>\n\tThe study found organisations are upping their game and now preventing 87 percent of all focused attacks compared to 70 percent in 2017. However, with 13 percent of focused attacks penetrating defenses, organisations are still facing an average of 30 successful security breaches per year which cause damage or result in the loss of high-value assets. It’s also taking less time to detect a security breach; from months and years to now days and weeks.</p>\n<p>\n\tOn average, 89 per cent of respondents said their internal security teams detected breaches within one month compared to only 32 per cent of teams last year. This year, 55 per cent of organisations took one week or less to detect a breach compared to 10 per cent last year. Although companies are detecting breaches faster, security teams are still only finding 64 per cent of them, which is similar to last year, and they’re collaborating with <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=others\" target=\"_blank\">others </a>outside their organisations to find the remaining breaches. This underscores the importance of collaborative efforts among business and government sectors to stop <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=cyber+attacks\" target=\"_blank\">cyber attacks.</a> When asked how they learn about attacks that the security team has been unable to detect, respondents indicated that more than one-third (38 per cent) are found by white-hat <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=hackers\" target=\"_blank\">hackers </a>or through a peer or competitor (up from 15 per cent, comparatively, in 2017). Interestingly, only 15 percent of undetected breaches are found through law enforcement, which is down from 32 per cent the previous year.</p>\n\n<p>\n\t<strong>The gig <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=economy\" target=\"_blank\">economy </a>is thriving in Asia-Pacific </strong></p>\n<p>\n\t\t<img align=\"left\" alt=\"gig economy\" class=\"imgCont\" height=\"212\" src=\"http://bsmedia.business-standard.com/_media/bs/img/article/2018-04/22/full/1524411479-8179.jpg\" title=\"gig economy\" width=\"319\"></p>\n\tAbout 84 per cent of talent managers in Asia-Pacific hire or use gig workers, the region with the highest percentage globally.<br>This is compared to the global average of 65 per cent, according to a new research from KellyOCG, a global workforce solutions provider. Surveying 2,100 talent managers worldwide with 403 residing in the Asia-Pacific (APAC) region — across industries and career disciplines — KellyOCG uncovered new insights about gig adoption rates, the outlook for gig hiring, the growing influence of independents, and areas for competitive innovation.\n<p>\n\tThe key survey findings include: Gig work thriving globally: 65 per cent of talent/hiring managers say the gig <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=economy\" target=\"_blank\">economy </a>is rapidly becoming the new normal for how businesses organise work. The APAC region has outpaced the rest of the world with 84 per cent (APAC) of talent managers hiring or using gig workers.A flexible workforce is the way forward: three in four talent/hiring managers in APAC(79 per cent) say a much more flexible and fluid workforce will emerge as a way to navigate an increasingly dynamic global business climate. Workers are free agents by choice: 75 per cent of global free agents choose gig work for positive reasons, seeing it as a way to improve their personal and professional lives.The advantages are clear: Globally,</p>\n<p>\n\t43 per cent of organisations engaging gig workers experience at least a 20 per cent labour cost savings and 72 per cent say using gig workers/free agent talent gives their team/organisation a competitive advantage.</p>\n<p>\n\tInnovators make up just 13 per cent of all companies but can reap big rewards when it comes to deploying and leveraging gig labour.</p>\n<p>\n\tInnovators are heavy users of gig labour and are committed to building a more flexible and fluid workforce. They also tend to use independents for highly visible and strategic challenges as they view gig workers not as outsiders, but as a critical and valuable component of the overall workforce. Innovators are also highly advanced in how they use <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=technology\" target=\"_blank\">technology </a>to aid in the practices and processes of managing gig labour and are good at on-boarding and retaining them. Not surprisingly, this group reports the highest level of cost savings: innovators are nearly 3 times more likely than laggards to save over 30% on labour cost.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "taking",
        "less",
        "55",
        "one",
        "10",
        "last"
    ],
    "nouns": [
        "taking",
        "time",
        "security",
        "breach",
        "year",
        "cent",
        "one",
        "week",
        "10",
        "last"
    ],
    "verbs": [
        "time",
        "detect",
        "breach",
        "last"
    ]
}