{
    "title": "Demonetisation impact contained? Cash with public doubles since note ban",
    "link": "https://www.business-standard.com/article/economy-policy/demonetisation-impact-contained-cash-with-public-doubles-since-note-ban-118061000250_1.html",
    "pubDate": "Sun, 10 Jun 2018 12:53:00 +0530",
    "content": "This is an over two-fold jump from Rs 7.8 trillion as on December 9, 2016 -- the lowest level it had seen after the announcement of the demonetisation decision",
    "contentSnippet": "This is an over two-fold jump from Rs 7.8 trillion as on December 9, 2016 -- the lowest level it had seen after the announcement of the demonetisation decision",
    "guid": "https://www.business-standard.com/article/economy-policy/demonetisation-impact-contained-cash-with-public-doubles-since-note-ban-118061000250_1.html",
    "isoDate": "2018-06-10T07:23:00.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.2,
        "tokens": [
            "demonetisation",
            "impact",
            "contained?",
            "cash",
            "with",
            "public",
            "doubles",
            "since",
            "note",
            "ban"
        ],
        "words": [
            "ban"
        ],
        "positive": [],
        "negative": [
            "ban"
        ]
    },
    "article": {
        "title": "Demonetisation impact contained? Cash with public doubles since note ban",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tCurrency with the public has reached a record high level of over Rs 18.5 trillion, more than double from a low of about Rs 7.8 trillion it had hit post-<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=demonetisation\" target=\"_blank\">demonetisation </a>decision in late 2016, as per <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=rbi\" target=\"_blank\">RBI </a>data.<br></p>\n<p>\n\tAt the same time, the total currency put in circulation by the Reserve Bank has also more than doubled to over Rs 19.3 trillion -- from a low of about Rs 8.9 trillion post- <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=demonetisation\" target=\"_blank\">demonetisation.</a><br></p>\n<p>\n\tCurrency with the public is arrived at after deducting cash with banks from total currency in circulation.<br></p>\n<!-- INPAGE_BANNER -->\n\t \n<p>\n\tThis high level of currency available with the public is in sharp contrast to the reported cash crunch in various parts of the country a few months ago. There has been a fear that hoarding or accumulation of large amounts of cash for various reasons could have triggered an artificial currency crunch.<br></p>\n<p>\n\tThe figures for both 'currency with the public' and 'currency in circulation' have also exceeded the levels seen before the government's <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=demonetisation\" target=\"_blank\">demonetisation </a>decision on November 8, 2016, that saw nearly 86 per cent of the currency in circulation at that time being invalidated overnight by scrapping the then Rs 500/1,000 banknotes.<br></p>\n<p>\n\tThe public was given time to deposit the invalidated notes in banks, which saw nearly 99 per cent of banned notes coming back into the system.<br></p>\n<p>\n\tAs per the RBI's latest disclosure in this regard, people had returned Rs 15.28 trillion as on June 30, 2017, of the Rs 15.44 lakh crore banned currency, or 98.96 per cent, of the scrapped notes to the banking system.<br></p>\n<p>\n\tSince then, the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=rbi\" target=\"_blank\">RBI </a>has introduced new denominations of Rs 2,000 and Rs 200, among others, besides a new Rs 500 note. After the recent cash crunch, the government had announced that printing of Rs 500 notes would be stepped up.</p><p>\n\tWhile the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=rbi\" target=\"_blank\">RBI </a>is yet to announce its final word on processing and verification of all the returned notes, the latest 'money supply' data from the central bank puts the \"currency with the public\" at over Rs 18.5 trillion as on May 25, 2018 -- up more than 31 per cent from year-ago level.<br></p>\n<p>\n\tThis is an over two-fold jump from Rs 7.8 trillion as on December 9, 2016 -- the lowest level it had seen after the announcement of the demonetisation decision as people rushed to deposit the scrapped notes with banks and the RBI.</p>\n<p>\n\tPrior to demonetisation, the currency with the public stood at about Rs 17 trillion.<br></p>\n<p>\n\tIn terms of 'currency in circulation', the RBI puts the latest figure at over Rs 19.3 trillion as on June 1, 2018 -- again a jump of about 30 per cent from the year-ago level, according to the 'reserve money' data released by the central bank.<br></p>\n<p>\n\tThis also marks an over two-fold rise from a low of Rs 8.9 trillion as on January 6, 2017 -- the lowest level it saw post-demonetisation. The current level of currency in circulation is also above the pre-demonetisation figure of Rs 17.9 trillion as on November 5, 2016.<br></p>\n<p>\n\tThe RBI publishes the figures for currency in circulation on a weekly basis, while the currency with the public comes out every fortnight.<br></p>\n<p>\n\tAn analysis of historical data shows that the currency with the public stood at about Rs 13 trillion before the Modi government took charge in May 2014.<br></p>\n<p>\n\tIt rose to over Rs 14.5 trillion in a year and then further to close to Rs 16.7 trillion by May 2016. The figure crossed Rs 17 lakh crore level by October that year, before starting to decline due to demonetisation.<br></p>\n<p>\n\tThe figure again came back above Rs 10 trillion by February 2017 and crossed Rs 15 trillion mark in September last year.<br></p>\n<p>\n\tA similar trend was seen in the currency in circulation figure, which dropped sharply from November 2016 till early January 2017 due to demonetisation, before starting to go up.<br></p>\n<p>\n\tThe total money supply, described as M3 by the RBI, now stands at over Rs 140 trillion -- nearly 11 per cent higher than the year-ago level. It stood at about Rs 120 trillion during the demonetisation period and was below Rs 100 trillion level before the Modi government came to power.<br></p>\n<p>\n\tThe M3 includes currency with the public, deposit money of the public (demand deposits with the banking system plus 'other' deposits with the RBI) and the time deposits with the banking system.<br></p>\n<p>\n\tThis figure is equivalent to the net bank credit to the government, plus the bank credit to the commercial sector, plus net foreign exchange assets of the banking sector, plus government's currency liabilities to the public, minus the net non-monetary liabilities of the banking sector.<br></p>\n<p>\n\tThe government's currency liabilities to the public comprise rupee coins and small coins.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "contained",
        "public",
        "two",
        "trillion",
        "lowest",
        "level"
    ],
    "nouns": [
        "Demonetisation",
        "demonetisation",
        "impact",
        "Cash",
        "public",
        "doubles",
        "note",
        "ban",
        "two",
        "fold",
        "jump",
        "trillion",
        "December",
        "decision",
        "level",
        "announcement"
    ],
    "verbs": [
        "impact",
        "Cash",
        "note",
        "ban",
        "fold",
        "jump",
        "level"
    ]
}