{
    "title": "Chinese recipe: Yogi government to study Chinese SME model",
    "link": "https://www.business-standard.com/article/economy-policy/chinese-recipe-yogi-government-to-study-chinese-sme-model-118061000500_1.html",
    "pubDate": "Sun, 10 Jun 2018 18:14:00 +0530",
    "content": "The state government is planning to send a delegation to the Asian economic giant to study the successful implementation of China's One Town One Product (OTOP) programme",
    "contentSnippet": "The state government is planning to send a delegation to the Asian economic giant to study the successful implementation of China's One Town One Product (OTOP) programme",
    "guid": "https://www.business-standard.com/article/economy-policy/chinese-recipe-yogi-government-to-study-chinese-sme-model-118061000500_1.html",
    "isoDate": "2018-06-10T12:44:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "chinese",
            "recipe",
            "yogi",
            "government",
            "to",
            "study",
            "chinese",
            "sme",
            "model"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Chinese recipe: Yogi government to study Chinese SME model",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tEven as Prime Minister Narendra Modi is taking steps to boost trade and economic ties with China, the Yogi Adityanath government in <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=uttar+pradesh\" target=\"_blank\">Uttar Pradesh </a>is keen on taking notes from the successes of the Dragon in promoting small and medium enterprises (SME).</p>\n<p>\n\tThe state government is planning to send a delegation to the Asian economic giant to study the successful implementation of China’s One Town One Product (OTOP) programme to boost its traditional and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=sme\" target=\"_blank\">SME </a>units.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe Adityanath government has already launched its One District One Product (ODOP) scheme to boost traditional industries synonymous with each of UP’s 75 districts. The state is propping up ‘Make in UP’ on the lines of ‘Make in India’.</p>\n<p>\n\t“<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=china\" target=\"_blank\">China </a>has successfully implemented its OTOP model and we want to learn from their experiences for our ODOP scheme,” UP khadi, MSME and export promotion minister Satyadev Pachauri told Business Standard and informed a delegation would visit the neighbouring country next month. Started in 1989, OTOP is piloted by the small and medium enterprise wing under the Chinese federal ministry of economic affairs.</p>\n<p>\n\tBesides, the Adityanath government is mulling to host a mega ODOP summit in Lucknow in near future months on the lines of UP Investors Summit 2018, which was held here on 21-22 February and fetched total investment commitments of Rs 4.68 trillion across various sectors.</p>\n<p>\n\tThe state, which had formally launched ODOP in January 2018, has launched a dedicated ODOP website www.odop.in to promote the concept, which is expected to nurture traditional industries and create large number of job opportunities, besides arresting migration of youth to bigger urban centres and metros.</p>\n<p>\n\tUP is uniquely famous for product specific traditional industrial hubs across 75 districts viz. Varanasi (Banarasi silk sari), Bhadohi (carpet), Lucknow (chikan), Kanpur (leather goods), Agra (leather footwear), Aligarh (lock), Moradabad (brassware), Meerut (sports goods), Saharanpur (wooden products) etc. The website also showcases such authentic merchandises.</p>\n<p>\n\tAdityanath has zealously espoused ODOP as the government wants to promote local handicraft industries and products gain national and international recognition through branding, marketing support and easy credit.</p>\n<p>\n\tMSME sector is the backbone of UP’s industrial landscape and contributes 60% to its annual industrial output. It employs 40 million people, generating direct economic activity worth Rs 1.2 trillion annually. The state is home to over 5 million MSMEs and the sector is the second largest employer after agriculture, making it imperative for any development roadmap, especially in backdrop of the government targetting to generate 2 million jobs in the next 4 years.</p>\n<p>\n\tAt the UP Investors Summit 2018, the MSME sector had netted investment proposals worth over Rs 60 billion, although aggregate commitments to the sector was much higher, considering a number of MSME proposals were clubbed under different heads, such as food processing, services etc.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Chinese",
        "model",
        "Asian",
        "economic",
        "giant",
        "successful",
        "One"
    ],
    "verbs": [
        "study",
        "model",
        "state",
        "send",
        "programme"
    ],
    "nouns": [
        "Chinese",
        "China",
        "recipe",
        "Yogi",
        "government",
        "study",
        "model",
        "state",
        "planning",
        "delegation",
        "Asian",
        "implementation",
        "One",
        "Town",
        "Product",
        "programme",
        "giant"
    ]
}