{
    "title": "The Ganna that trumped Jinnah: Bitter crisis of the sugar industry in UP",
    "link": "https://www.business-standard.com/article/economy-policy/the-ganna-that-trumped-jinnah-bitter-crisis-of-the-sugar-industry-in-up-118061700130_1.html",
    "pubDate": "Sun, 17 Jun 2018 11:26:00 +0530",
    "content": "Pending sugarcane dues in Uttar Pradesh for the 2017-18 season have now mounted to Rs 130 billion, 37% of the value of the total sugarcane purchased by mills in this period",
    "contentSnippet": "Pending sugarcane dues in Uttar Pradesh for the 2017-18 season have now mounted to Rs 130 billion, 37% of the value of the total sugarcane purchased by mills in this period",
    "guid": "https://www.business-standard.com/article/economy-policy/the-ganna-that-trumped-jinnah-bitter-crisis-of-the-sugar-industry-in-up-118061700130_1.html",
    "isoDate": "2018-06-17T05:56:00.000Z",
    "sentiment": {
        "score": -5,
        "comparative": -0.38461538461538464,
        "tokens": [
            "the",
            "ganna",
            "that",
            "trumped",
            "jinnah",
            "bitter",
            "crisis",
            "of",
            "the",
            "sugar",
            "industry",
            "in",
            "up"
        ],
        "words": [
            "crisis",
            "bitter"
        ],
        "positive": [],
        "negative": [
            "crisis",
            "bitter"
        ]
    },
    "article": {
        "title": "The Ganna that trumped Jinnah: Bitter crisis of the sugar industry in UP",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>On a hot May afternoon, a long queue of tractor trolleys loaded beyond capacity with sugarcane, are lined up outside the Upper Doab <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/sugar-mills\" target=\"_blank\">Sugar Mills </a>in Shamli district – in the heart of western Uttar Pradesh’s sugarcane belt. By-elections for the Kairana Lok Sabha seat – of which, Shamli forms an assembly segment – are due to be held in a few days and pending <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=sugarcane+dues\" target=\"_blank\">sugarcane dues </a>– Rs 12.5 billion at the time – has become the one issue that has come to define this election. </p><p> Jeetender Singh, who has come with 60 quintals of sugarcane to deposit in the mill, was last paid in January and his unpaid dues have piled up to Rs 1,80,000 – 65% of the total value of sugarcane that he has brought to the mill this season. “The Bhartiya Janata Party has also turned out to be like every other party. What happened to their election promise?” he asks.</p> <p> Last year, prior to the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/uttar-pradesh\" target=\"_blank\">Uttar Pradesh </a>assembly elections of 2017, the BJP recognised the problem of delayed payments faced by sugarcane farmers and its political significance. It promised that it would change things if voted to power. Prime Minister Narendra Modi, while speaking at a rally in Meerut on February 4, 2017, a week before the sugarcane belt of western UP voted, <a href=\"https://www.ndtv.com/india-news/live-prime-minister-narendra-modi-speech-at-rally-in-uttar-pradeshs-meerut-1655941\" target=\"_blank\">said</a>, “My sugarcane farmer does the hard work. Everybody is growing fat by eating sugar. The <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=sugar+mill+owners\" target=\"_blank\">sugar mill owners </a>are fat, but my farmer has nothing to gain. My government in UP will clear dues within 14 days.”\n\n\n</p>\n<!-- INPAGE_BANNER --> <p> “Now, they don’t talk about <em><a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ganna\" target=\"_blank\">ganna </a></em>(sugarcane), now they want to talk about Jinnah. We will send them where Jinnah is,” said Singh, pointing skywards. Almost all farmers in the region, who predominantly grow sugarcane, echoed Singh’s strong sentiments.</p> <p> Leading up to polls, the BJP attempted to consolidate Hindu voters in the region using the ‘issue’ of a <a href=\"https://thewire.in/education/for-jinnah-portrait-hanging-since-1938-hindutva-activists-attack-amu-students\" target=\"_blank\">Jinnah portrait in the Aligarh Muslim University</a> (AMU). However, the attempts were neutralised at an early stage when Rashtriya Lok Dal’s Jayant Chaudhary issued a sharp retort: “<em>Kairana by-election mein kya mudda chalega: Jinnah ya <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ganna\" target=\"_blank\">Ganna?</a> </em>(What will be the poll agenda in Kairana by-election: Jinnah or <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ganna\" target=\"_blank\">ganna?</a>).”</p> <p> Chaudhary’s intervention percolated with the perception that an invocation of the Jinnah ‘issue’ by the BJP would mean that they are insensitive to the real issues of the region – where a majority of the population is dependent on agriculture, with sugarcane being the main cash crop and the issue of delayed payments from <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/sugar-mills\" target=\"_blank\">sugar mills </a>being the definitive economic issue.</p> <p> Thereafter, the BJP ran a very insipid campaign – by its standards – and its subsequent loss in the Kairana by-election has been, in part, attributed to losing the narrative primarily because of pending <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=sugarcane+dues\" target=\"_blank\">sugarcane dues.</a></p> <p> Outside the Upper Doab <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/sugar-mills\" target=\"_blank\">Sugar Mills </a>in the blistering May heat, farmers are queuing-up to deposit as much of their sugarcane produce as possible. The mill is scheduled to close operations at the end of the day. Whatever is left, will have to be sold at small jaggery producing units, locally known as <em>kohlu, </em>at a substantially lower price.</p> <p> Suresh Pal has travelled ten kilometres from his village Panjokhra to deposit his sugarcane produce. Sweating profusely under the blazing sun, he is waiting his turn. “It will take another six or seven hours. There is a lot of rush today,” he said wiping the sweat off his face with a <em>gamcha </em>wrapped around his neck.</p> <p> Pal has pending dues of Rs 2,30,000 from the sugar mill. “The last payment I got was Rs 75,000 in February. Since then I have deposited 700 quintals but haven’t been paid for them yet.”</p> <p> Pending <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=sugarcane+dues\" target=\"_blank\">sugarcane dues </a>in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/uttar-pradesh\" target=\"_blank\">Uttar Pradesh </a>for the 2017-18 season have now mounted to Rs 130 billion, 37% of the value of the total sugarcane purchased by mills in this period. Pending dues in the country have mounted to Rs 220 billion ­­– the highest ever. And they could rise further and reach Rs 260 billion by the end of the season <a href=\"https://industryoutlook.cmie.com/kommon/bin/sr.php?kall=wshreport&amp;nvdt=20180523114154060&amp;nvpc=055000000000&amp;nvtype=ANALYSIS+%26+OUTLOOK&amp;icode=0100000000000000\" target=\"_blank\">according to</a> The Centre for monitoring Indian economy.</p> <p> According to sugar mills, dues have remained pending as the selling price of sugarcane, due to excess production of sugar this year, is much below the cost of production. While the price of sugar has hovered around Rs 26 per kilogram, the cost of production, according to the Indian Sugar Mills Association, is Rs 35 per kilogram, implying a loss of Rs 9 per kilogram.</p> <p> “Till date, we have cleared 45% of the dues. The problem is the low price of sugar. There is nothing we can do till the situation remains the same. Where do we pay from?” said R. B. Khokhar, the chief operating officer of the Upper Doab Sugar Mills, when we met him on May 25.</p> <span> <img align=\"\" alt=\"sugar, sugarcane\" class=\"imgCont\" height=\"464\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2017-01/27/full/1485467939-0652.jpg\" title=\"sugar, sugarcane\" width=\"620\"> <span> A farmer works in his sugarcane field</span> </span> <p> To address the issue, the Centre has taken a few steps in the last few months, the latest being a Rs <a href=\"http://pib.nic.in/PressReleseDetail.aspx?PRID=1534489\" target=\"_blank\">70-billion bailout package</a>. However, the package is <a href=\"https://thewire.in/agriculture/farmer-centre-sugar-sector-bailout-does-little\" target=\"_blank\">inadequate to address</a> the current crisis which was the stated objective of the government. The package is aimed, primarily, at providing aid to sugar mills with the aim of expanding their capacity in the long run.</p> <p> Of the Rs 70 billion, only Rs 11.75 billion (17% of the total) has been allocated to pay the pending dues of sugarcane farmers. This allocation is only 5% of the total pending cane dues in the country which stand at Rs 220 billion and thus makes the government’s claim of addressing the current crisis quite puzzling. To add to the puzzle, it remains unclear how this allocation of Rs 11.75 billion would actually reach the farmers since the purpose of allocation has been described as ‘estimated expenditure’ on ‘creation of a buffer stock of 30 million tonnes of sugar’.</p> <p> “If they purchase 30 million tonnes of sugar and pay farmers, it is going to cost Rs 90 billion. They have only allocated Rs 11.75 billion which is to pay for the maintenance. I don’t understand how this allocation will go to farmers,” said Pushpendra Singh, president of Kisan Shakti Sangh.</p> <p> “There is nothing in this package which will benefit the farmers. It is only meant for the benefit of sugar mills. All the money is going to the sugar mills,” Singh added.</p> <p> Sugar mills are not too impressed by the package either. “It isn’t enough. At best, these are medium-term measures which will bring some benefit a few years down the line. But it does nothing to address the current crisis,” said a senior administrative officer of a sugar mill in UP, on the condition of anonymity.</p> <p> The government has also announced the setting of a minimum selling price of Rs 29 per kilogram for sugar. The selling price of sugar was already between Rs 26 and Rs 29, and sugar mills are of the view that the minimum selling price announced by the Centre is not enough.</p> <p> “When the cost of production of sugar is Rs 35 per kilogram, how does a minimum selling price of Rs 29 per kilogram help?” the officer asked.</p> <p> In May, Centre had <a href=\"https://www.business-standard.com/article/economy-policy/govt-okays-rs-5-5-quintal-aid-for-cane-growers-to-help-mills-clear-dues-118050201452_1.html\" target=\"_blank\">announced</a> that it will be providing financial assistance to sugar mills by paying farmers Rs 5.5 per quintal on their behalf. The total outlay would be Rs 15 billion. However, an eligibility condition that sugar mills were unlikely to fulfil was placed. A sugar mill would be eligible to avail of this financial assistance if it had exported at least 2 million tonnes of sugar in the 2017-18 season.</p> <p> In the current season, sugar prices in the global market have been significantly lower than those in the domestic market. Currently, while the domestic price of sugar is Rs 30 a kilogram, sugar is selling in the global market at Rs 23 per kilogram. Thus, making exports an unlikely route for any sugar mill to take and thereby making the Centre’s financial assistance unlikely to benefit farmers.</p> <p> The crisis that the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/sugar-industry\" target=\"_blank\">sugar industry </a>and sugarcane farmers find themselves in is a result of the production glut that we have seen in the current season. In the 2017-18 season, India has seen a record 31.6 million tonnes of sugar being produced, while the domestic demand remains at 25 million tonnes.</p>  <p> Supply has far outstripped demand leading to a fall in prices of sugar which has led to a liquidity crunch faced by sugar mills. As a result of which, sugar mills have argued that they have been unable to clear pending dues of farmers.</p> <span> <img align=\"\" alt=\"sugarcane\" class=\"imgCont\" height=\"464\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2017-10/19/full/1508420116-6036.jpg\" title=\"sugarcane\" width=\"620\"> <span> sugarcane</span> </span> <p> The situation is likely to repeat again next season as, going by estimates, we are in for another bumper produce of sugarcane. The area under sugarcane cultivation is up slightly from 4.7 million hectare to 4.8 million hectare. According to some <a href=\"http://indianexpress.com/article/india/a-sugar-rush-sugarcane-farmers-uttar-pradesh-kairana-bypoll-sugar-mills-5201826/\" target=\"_blank\">estimates</a>, sugar output for the 2018-19 season could be even higher than the current season, at 34 million tonnes. To add to woes, it is likely that there will be an opening stock of 10 million tonnes come next season. In all, supply next season could be 76% higher than the demand.</p> <p> “If the estimates are correct, the problem will repeat again next year. Sugar prices will continue to be low and we will be unable to pay farmers. And the issue of pending dues will remain,” said the vice president of a government-owned sugar mill in UP.</p> <p> As Harish Damodaran has <a href=\"http://indianexpress.com/article/india/a-sugar-rush-sugarcane-farmers-uttar-pradesh-kairana-bypoll-sugar-mills-5201826/\" target=\"_blank\">pointed out</a> in <em>The Indian Express</em>, the sugar glut is attributable to a superior yielding variety of sugarcane, CO-0238, which has been planted since 2013-14. Damodaran compared the sugar output for seasons 2012-13 and 2017-18 and found that while the area under sugarcane cultivation in UP declined slightly, the sugar output increased by more than half.</p> <p> According to the Indian Council of Agricultural Research, the cane yield for the CO-0238 variety has <a href=\"https://icar.org.in/node/4088\" target=\"_blank\">shown an improvement</a> of 20% over the previously sown variety. Thus, if a farmer was earlier producing 1000 quintals of sugarcane a season, using C0-0238 her produce would go up to 1,200 quintals a season on the same parcel of land. The CO-0238 also brings cheer to the sugar mills, as the sugar yield has shown an improvement of 16%.</p> <p> However, as a result of the increased yields, and as an unintended consequence of the superior CO-0238 sugarcane variety, India now has too much sugar with supply far in excess of demand.</p> <p> Farmers, who are already bearing a lion’s share of the crisis in the sugar sector, claim that the CO-0238 variety, on balance, hasn’t helped. </p><p>While productivity has increased as a result of the higher yielding variety and they are producing more on the same area of land, the CO-0238 variety, farmers point out, is more prone to pest attacks.</p> <p> At his farm in Vahelna, a small village in Muzaffarnagar known for the historic Jain temple that it houses, Ankur Kumar is spraying his sugarcane field with coragen, an insecticide. “If coragen is not sprayed, the crop will be destroyed. Pests will destroy the sugarcane from the root,” Kumar said.</p> <p> A 250 ml bottle of coragen costs Rs 2,000 and it has to be sprayed four times in a season. According to Kumar, the incidence of pest attacks has increased since he started using the CO-0238 variety. “Things were not so bad earlier. After we have started sowing 0238, we have to deal with pest attacks more frequently, and they are also more severe.”</p> <p> In addition to coragen, there are several other insecticides whose usage has increased after the CO-0238 variety, according to Kumar. “The cost per bigha has gone up by about Rs 3,000. So, whatever we gain because of higher yield, we lose because of higher costs.”</p> <p> After speaking to several farmers in the region, we can surmise that on an average, productivity has increased by 10 quintals per bigha after CO-0238, translating to an increased revenue of Rs 3,250 (10 x 325 (the state advised price of sugar)) per bigha. However, that is offset by the increase in costs of pesticides and insecticides to the tune of Rs 3,000 – an increase farmers here attribute to the CO-0238 variety.</p> <p> Sandeep Choudhary, an assistant professor at the Krishi Vigyan Kendra in Khekra, Baghpat, has worked extensively trying to solve problems that sugarcane farmers in the region face. He agrees that risk from pests has increased after the usage of CO-0238 variety began. “This variety is higher yielding and also increases the sugar recovery for mills. However, it brings increased risk for farmers as it carries a higher risk of diseases. The cost of pesticides and insecticides has also gone up in the last few years and this has increased costs for farmers,” he said.</p> <p> At the sugar mill in Shamli, Suresh Pal inches towards the entry point of the sugar mill. His produce is weighed. The total is 130 quintals and he is told to get rid of 30 quintals. He is given a <em>parchi </em>(receipt) noting the weight of the sugarcane the mill is buying, i.e., 100 quintals.</p> <p> “I will have to sell the rest at a <em>kolhu </em>at a lower price,” Pal mumbles as he separates the excess sugarcane.</p> <p> The prevailing price in kolhus<em>, </em>according to several farmers that we spoke to in Muzaffarnagar, Shamli and Meerut, ranges between Rs 180 and Rs 240 per quintal and is substantially lower than the assured price of Rs 325 per quintal at which they sell to mills.</p> <p> “Farmers make a loss by selling in kolhus<em>. </em>But what can be done? If mills don’t buy the entire produce, it has to be sold somewhere and this is the only option,” said Kuldeep Tyagi, president of the Bhartiya Kisan Andolan, a farmer organisation active in western UP.<span></span> <span></span> <span>After he is done unloading the sugarcane inside the mill compound, Pal asks mill officials when he will be paid his pending dues. “What about the other nine parchis? When will I get my money?” The mill officials rush in and quickly take him aside. “These people keep complaining. It is their habit. Don’t put that in your article,” we are told by a tall muscular mill official wearing a tight mustard shirt and golden aviator sunglasses.</span></p> <p> “See, this is how they treat us,” Pal tells us when we meet him outside the mill compound. “The mill owes me Rs 2,30,000 and I don’t know when I will be paid.”</p> <p> When cane dues remain pending for several months, the sowing cycle for the next season gets disrupted as farmers struggle to buy seeds, fertilisers and pesticides required at the time of sowing. “Invariably, we have to borrow,” said Ankur Kumar in Vahelna.</p> <span class=\"wp-caption aligncenter\" id=\"attachment_261025\"> <p class=\"wp-caption-text\"> With pending dues of Rs 4,00,000, for his working capital needs, Kumar has had to borrow Rs 1,00,000 from local money lenders ­– known as <em>sahukars ­</em>– in addition to the Rs 2,00,000 loan on his Kisan credit card (KCC). While the rate of interest due on the KCC loan is 7% per annum – which can further be reduced to 4% if repayment is timely – sahukars charge an interest rate of 3% per month, or 36% per annum.</p> </span> <p> “KCC loan is on the amount of land that is owned and I am entitled to Rs 2 lakh. For the rest, I had to borrow from a sahukar,” said Kumar. “And I will soon have to borrow again as this money has already been used and the mill still hasn’t paid up.”</p> <p> R. B. Khokhar of the Upper Doab Sugar Mills said that he understands the plight of farmers but is helpless. “I know that farmers have to suffer. But there is nothing that we can do till the situation remains the way it is. For every kilogram of sugar that we sell, we have to suffer a loss of Rs 10. We simply do not have the money to pay farmers. We are making losses.”</p> <p> Kuldeep Tyagi of the Bhartiya Kisan Andolan does not believe that mills are facing losses. “Sugar mills are lying. If they were making losses, there would not be so many mills in this region. They would have shut down. They are making additions, expanding capacity. Why would they do so if they were making losses? Mills were not paying farmers on time even when the price of sugar was Rs 40. So it’s not a question of the price of sugar. It is about their intentions.”</p> <p> Farmer leaders also argue that sugar mills benefit from the many by-products of sugarcane – such as bagasse and molasses which are used to produce paper and ethanol, respectively. “No sugar mill is making losses. They are using all the by-products of sugarcane to make super profits,” said V. M. Singh, convenor of the Rashtriya Kisan Mazdoor Sangathan.</p> <p> In fact, when sugar mills were confronted about this in the Allahabad high court in 2016, they did not disagree. Lawyers, on behalf of several mills, told the court that they were indeed making profits from distilleries and other allied businesses, but making losses from the sugar sector.</p> <p> “Their other businesses are also using sugarcane, which they buy from farmers, as its raw material. How can they justify not paying farmers if only the sugar business is not profitable, while the others are?” Singh asked.</p> <span class=\"wp-caption aligncenter\" id=\"attachment_261032\"> <p class=\"wp-caption-text\"> A pest infested sugarcane plant. Credit: Moniza Hafizee</p> </span> <p> The matter in question before the Allahabad high court also reveals a crucial aspect of the sugarcane payment delay conundrum – the question of interest on delayed payments.</p> <p> As per law, farmers are entitled to their dues 14 days from the day they are assigned parchis. If the mill defaults, it has to pay the farmer – in addition to the principal – an interest on the amount due at the rate of 15% per annum for the period of the delay.</p> <p> During the 2012-2015 period, sugar mills in UP defaulted on payments and owed farmers Rs 2,000 crore as interest, in addition to the principal. In April 2015, they approached Akhilesh Yadav, the then chief minister of the state, with the proposition that the interest dues be waived off as the ‘mills were making losses and could not afford to pay the interest’. Yadav obliged and in October 2016 <a href=\"https://indianexpress.com/article/india/india-news-india/akhilesh-yadav-government-waives-sugarcane-mill-owners-dues-3064292/\" target=\"_blank\">decided</a> to waive off the interest amounts that were owed by sugar mills to farmers.</p> <p> The Allahabad high court was approached by farmer organisations against the decision, and in March 2017, the court quashed the UP government’s decision, and had some <a href=\"https://thewire.in/agriculture/sugarcane-farmers-western-up\" target=\"_blank\">strong words</a> to say: “The state government waived the interest, citing mills’ inability to pay in view of low sugar prices. But by that logic, shouldn’t the interest being paid by farmers on loans from state-owned and cooperative banks also have been waived? In this case, farmers were basically supplying cane to mill at zero interest, even while borrowing at 10-15% or more themselves.”</p> <p> Despite the court order, mills are yet to pay the Rs 20 billion that they owe to farmers as interest on delayed payments for the period 2012-15. “The government hasn’t implemented the court order and hasn’t pushed the sugar mills to pay the interest,” Singh said.</p> <p> When the UP government releases figures for pending cane dues in the state, the amount of interest that, by law, should accrue to farmers owing to delay in payment beyond 14 days, is not included. Thus, the actual amount of pending dues to farmers in UP would be higher than the Rs 130 billion that is acknowledged by the government.</p> <p> “There is a tacit understanding that the mills won’t pay the interest amount,” said Singh. “If the mills knew that they have to pay interest when they default on payments, they would not hold back payment even for a day.”</p> <p> The interest due on delayed payments doesn’t figure in the farmer’s calculations either. “The interest has never been paid to us in all these years,” said Suresh Pal outside the Upper Doab Sugar Mills.</p> <p> “So, we don’t even ask for it. We don’t even expect it. Just give us our dues. That will be enough.”</p> <p> A question is often asked, sometimes condescendingly, that if farmers are suffering as a result of growing sugarcane, why do they continue to grow the crop? The data cited is the area under sugarcane cultivation, which has increased despite delays in payment.</p> <p> When we put this question to farmers in western UP, we were asked a rhetorical question in response, “Tell us which crop is profitable?”</p> <p> Satbir Singh, a farmer in Lawar near Meerut, explains that he attempted to grow potatoes instead of sugarcane for part of last season, but, the economics of it did not work out. “I thought that growing potatoes will be better since I can sell in the <em>mandi</em> and get cash immediately, unlike sugarcane where I would have to wait months to receive payment.”</p> <p> However, Singh’s plans turned sour as the prices of potatoes in mandis<em>, </em>last season, <a href=\"https://www.youtube.com/watch?v=Wld8if_JPIs\" target=\"_blank\">crashed</a> to as low as Rs 2 per kilogram. “My cost of production is around Rs 5-6 per kilogram, then add to it the cost of transport and storage. All in all, it costs around Rs 9-10 per kilogram. And the price in the mandi was Rs 2,” Singh said.</p> <p> Singh, like many other potato growers in UP, dumped his potatoes as transportation to mandis alone would have costed more than the price that their produce would fetch.</p> <p> For vegetables and fruits, the government offers farmers no protection from market volatility making them an unattractive proposition compared to sugarcane where farmers in UP get a state assured price (SAP) of Rs 325 per quintal which is higher – only marginally, farmers claim – than the cost of production.</p> <p> “With sugarcane, we at least know that we will get an assured income sooner or later. Next year, if not this year,” said Singh.</p> <p> For crops such as wheat and rice, a developed government procurement mechanism exists to purchase from the farmer at the minimum support price (MSP). However, farmers argue that the MSP itself is lower than the cost of production.</p> <p> “It costs around Rs 1700 per quintal, the MSP is lower than that,” Singh said.</p> <p> While the MSP for wheat at Rs 1,725 per quintal is not lower than Rs 1,700 – Singh’s estimate of the cost of producing wheat – it does not provide the kind of returns that sugarcane provides, albeit, belatedly.</p> <p> Recently, Harish Damodaran of <em>The Indian Express </em><a href=\"http://indianexpress.com/article/india/why-sugarcane-ganna-is-still-the-first-choice-for-farmers-despite-mounting-dues-5188809/\" target=\"_blank\">answered the why-farmers-still-grow-sugarcane question</a> authoritatively, with a one-line summary, “It is one of the few crops today that’s still profitable to grow.”</p> <p> Damodaran estimated that the cost of production of sugarcane per bigha worked out to Rs 12,000. A bigha, on an average, yields 60 quintals of sugarcane, translating to a revenue realisation of Rs 19,500 (60 x Rs 325 (state assured price of sugarcane)). Thus, giving the farmer a return of Rs 7,500 – 62% higher than the production cost.</p> <p> However, the costs do not account for interest on working capital, imputed value of family labour, rent on owned land and interest on capital assets. Thus, the final return would be substantially lower, painting a gloomy picture for sugarcane, the most profitable crop in UP, and western UP’s main cash crop.</p> <p> Ankur Sharma in Vahelna argues that the only profit for farmers from growing sugarcane is feed for bovines. “That’s all. They give us milk. We survive.”</p> <hr> <p> <em>(With inputs from Moniza Hafizee)<span></span> Published in arrangement with <strong>The Wire</strong></em></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Bitter",
        "UP",
        "Pending",
        "18",
        "mounted",
        "130",
        "billion",
        "37",
        "total"
    ],
    "verbs": [
        "Bitter",
        "sugar",
        "UP",
        "season",
        "value",
        "total"
    ],
    "nouns": [
        "industry",
        "Jinnah",
        "Bitter",
        "crisis",
        "sugar",
        "sugarcane",
        "18",
        "billion",
        "value",
        "total",
        "mills",
        "period",
        "season"
    ]
}