{
    "creator": "IANS",
    "title": "Facebook says satire often being used as cover for fake news",
    "link": "https://www.financialexpress.com/industry/facebook-says-satire-often-being-used-as-cover-for-fake-news/1209589/",
    "pubDate": "Sun, 17 Jun 2018 17:32:56 +05:30",
    "dc:creator": "IANS",
    "content": "While admitting limitations of fact-checkers in fighting fake news, Facebook has said the problem is often compounded by some publishers who spread false news on the social media platform in the garb of being satirical.",
    "contentSnippet": "While admitting limitations of fact-checkers in fighting fake news, Facebook has said the problem is often compounded by some publishers who spread false news on the social media platform in the garb of being satirical.",
    "guid": "https://www.financialexpress.com/?p=1209589",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-17T12:02:56.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.2727272727272727,
        "tokens": [
            "facebook",
            "says",
            "satire",
            "often",
            "being",
            "used",
            "as",
            "cover",
            "for",
            "fake",
            "news"
        ],
        "words": [
            "fake"
        ],
        "positive": [],
        "negative": [
            "fake"
        ]
    },
    "article": {
        "title": "Facebook says satire often being used as cover for fake news",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img src=\"https://images.financialexpress.com/2018/06/fb-5.jpg\" alt=\"Facebook, Facebook M, Facebook AI program, Facebook AI program M, Facebook India, Facebook smart speakers, Facebook smart speakers price, Facebook log in, Facebook Mark Zuckerberg, \" class=\"size-full wp-image-1209595\" srcset=\"https://images.financialexpress.com/2018/06/fb-5.jpg 660w, https://images.financialexpress.com/2018/06/fb-5-300x200.jpg 300w, https://images.financialexpress.com/2018/06/fb-5-620x413.jpg 620w, https://images.financialexpress.com/2018/06/fb-5-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Its other strategies to fight fake news include removing fake accounts, “which are often responsible for misinformation” and investing in news literacy programmes to help people better judge the publishers and articles they see on Facebook. (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>While admitting limitations of fact-checkers in fighting fake news, Facebook has said the problem is often compounded by some publishers who spread false news on the social media platform in the garb of being satirical.</p><span>\n</span><p>“Sometimes people try to call their sites ‘satire’ as a cover for their true motivation — to spread fake stories,” Tessa Lyons, Product Manager at Facebook, said in a statement.</p><span>\n</span><p>Media reports suggest that Facebook is already coming down heavily on some satire news organisations, triggering spirited reactions from some publishers.</p><span>\n</span><p>Popular satirical news site “The Onion”, for example, published a series of articles targeting Facebook and its CEO Mark Zuckerberg in recent days as a response to the social networking giant “choking” traffic to The Onion’s website, Business Insider reported on Saturday. </p><span>\n</span><p>“We have 6,572,949 followers on Facebook who receive an ever-decreasing amount of the content we publish on the network,” The Onion’s Editor-in-chief Chad Nackers was quoted as saying.</p><span>\n</span><p>Facebook said that “satire” sites can make it more difficult for fact-checkers to assess whether an article should be rated “false” or left alone, while adding that “people should be able to debate different ideas, even controversial ones”. </p><span>\n</span><p>“We also recognise there can be a fine line between misinformation and satire or opinion,” Lyons said.</p><span>\n</span><p>“Misinformation is bad for our community and bad for our business. It’s why we’re investing significant time and resources to fight it,” Lyons added.</p><span>\n</span><p>As part of its strategy to fight fake news, Facebook started forging partnership with third-party fact-checking organisations about one-and-a-half-year ago. </p><span>\n</span><p>But the social networking giant admitted that it would not be able to address the problem with human fact-checkers alone. </p><span>\n</span><p>“Over the last 18 months we’ve made good progress, but we’re also aware of the limits of this programme. Fact-checkers don’t exist in all countries, and different places have different standards of journalism as well as varying levels of press freedom,” Lyons said. </p><span>\n</span><p>Facebook started the third-party fact-checking programme in December 2016 and today it has 25 partners in 14 countries, many with recent or upcoming elections. </p><span>\n</span><p>“Even where fact-checking organisations do exist, there aren’t enough to review all potentially false claims online. It can take hours or even days to review a single claim,” Lyons added. </p><span>\n</span><p>“And most false claims aren’t limited to one article — they spread to other sites. To make real progress, we have to keep improving our machine learning and trying other tactics that can work around the world,” Lyons added. </p><span>\n</span><p>Its other strategies to fight fake news include removing fake accounts, “which are often responsible for misinformation” and investing in news literacy programmes to help people better judge the publishers and articles they see on Facebook. </p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "used",
        "compounded",
        "satirical",
        "fake",
        "fighting",
        "false",
        "spread",
        "social"
    ],
    "nouns": [
        "checkers",
        "cover",
        "fact",
        "satire",
        "fake",
        "news",
        "While",
        "problem",
        "fighting",
        "spread",
        "social",
        "platform",
        "garb"
    ],
    "verbs": [
        "cover",
        "fake",
        "garb",
        "spread"
    ]
}