{
    "creator": "PTI",
    "title": "5G panel identifies 6000 Mhz spectrum as available for next gen service",
    "link": "https://www.financialexpress.com/industry/technology/5g-panel-identifies-6000-mhz-spectrum-as-available-for-next-gen-service/1209468/",
    "pubDate": "Sun, 17 Jun 2018 15:31:29 +05:30",
    "dc:creator": "PTI",
    "content": "The 5G committee of the telecom ministry has said that around 6000 Mhz of spectrum can be made available without delay for the next generation mobile service.",
    "contentSnippet": "The 5G committee of the telecom ministry has said that around 6000 Mhz of spectrum can be made available without delay for the next generation mobile service.",
    "guid": "https://www.financialexpress.com/?p=1209468",
    "categories": [
        "Industry",
        "Technology"
    ],
    "isoDate": "2018-06-17T10:01:29.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "5g",
            "panel",
            "identifies",
            "6000",
            "mhz",
            "spectrum",
            "as",
            "available",
            "for",
            "next",
            "gen",
            "service"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "5G panel identifies 6000 Mhz spectrum as available for next gen service",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img src=\"https://images.financialexpress.com/2018/06/telecom-2.jpg\" alt=\"telecom, network, 5G, 5G service, 5G in india, 5G spectrum, 5G network, next gen tech\" class=\"size-full wp-image-1209473\" srcset=\"https://images.financialexpress.com/2018/06/telecom-2.jpg 660w, https://images.financialexpress.com/2018/06/telecom-2-300x200.jpg 300w, https://images.financialexpress.com/2018/06/telecom-2-620x413.jpg 620w, https://images.financialexpress.com/2018/06/telecom-2-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Paulraj said base station for 5G will have to be deployed at around every 50 metres as coverage of mobile signals in higher bands reduces that will lead to escalation of infrastructure cost. (Reuters) </figure>\n\t\t\t</section></div><span>\n</span><p>The 5G committee of the telecom ministry has said that around 6000 Mhz of spectrum can be made available without delay for the next generation mobile service. If accepted, the panel’s recommendation, which has been submitted to the government, can lead to India’s largest ever spectrum allocation for a service. An expert member of the panel, Arogyaswami Paulraj told PTI in an interview that initially the service will enhance mobile data speed in India by up to 50 per cent compared to current levels. Paulraj is Professor Emeritus, Stanford University, and a pioneer of MIMO wireless communications, a technology break through that enables improved wireless performance. MIMO is now incorporated into all new wireless systems, as per Stanford site. The Department of Telecom (DoT) is taking strong initiative to make spectrum available for the new service, Paulraj said.</p><span>\n</span><p>As much as 2,354.55 megahertz (MHz) of frequencies valued at around Rs 5.63 lakh crore were put up for grabs in country’s largest ever auction held in 2016. At present mobile phone signals in the country are transmitted in 800 Mhz to 2600 Mhz band. Now, the panel has spotted spectrum for 5G service across 11 bands of which 4 bands — premium 700 Mhz band, 3.5 gigahertz (Ghz), 24 Ghz and 28 Ghz band can be made immediately available for the service. The panel estimates that 5,250 megahertz of spectrum can be made available for 5G services in higher frequency bands, 300 Mhz in 3.5 Ghz band and 405 Mhz spectrum in sub- 1000 Mhz.</p><span>\n</span><p>Paulraj said: “Spectrum reduces cost of infrastructure. People will benefit from it. Our spectrum release in 5G will be more than spectrum to be released in many countries. “If you have more spectrum you can use less base station to serve more people, the cost goes down. If there is less spectrum, you have to deploy many BTS (mobile sites) and everybody pays the penalty.” He said that unlike earlier generation technologies including 3G and 4G, the next gen 5G will not be limited to mobile services but will play an important role in societal transformation with usage in power grids, smartcities, agriculture, banking, railways, healthcare and the like.</p><span>\n</span><p>Telecom Minister Manoj Sinha has set the target for commercial roll out of 5G services in India by 2020 — at par with advanced countries of the world. Paulraj said: “India has already taken lead over many other countries. Perhaps first country to do spectrum in 5G was US and I would think may be a little bit from Europe. “Otherwise we are ahead of many countries in the world. Bringing spectrum early will enable lot of things. Most important I feel it will enable growth of that manufacturing ability in our country.” Padma Bhushan award recipient Paulraj said the panel has not deliberated on spectrum allocation modalities but favoured issuing the radiowaves to telecom operators at rational prices.</p><span>\n</span><p>“To serve people of our country, operators must deploy (5G). For them to be able to deploy, they have to be profitable. So spectrum pricing must understand all this dimensions so that operators can make viable business out of it,” he said. He said that spectrum price per unit for 5G service in higher frequency bands cannot be priced at same level as lower frequency band. “Upper bands we will price lower. Also remember in order to deploy in upper band there is much more infrastructure required. It is more expensive for them to deploy in upper band. So obviously spectrum  should be cheaper for them,” Paulraj said.</p><span>\n</span><p>In lower frequency band like 700 Mhz band the mobile signal can coverage wide area but the coverage shrinks as the frequency band count increase like in 3.5 Ghz, 24 Ghz and 28 Ghz. The base price of one unit of pan-India 700 Mhz spectrum in 2016 was fixed at around Rs 11,000 crore by the government and interested telecom operators were required to buy minimum of five units of radiowaves in this band. There were no bidders for this premium band due to high base price.</p><span>\n</span><p>Paulraj said base station for 5G will have to be deployed at around every 50 metres as coverage of mobile signals in higher bands reduces that will lead to escalation of infrastructure cost. He said that spectrum in E (71-76 Gigahertz frequency and 81-86 Ghz) and V band (57-64 Ghz frequency range), in which data can be transmitted at speed of 1000 mbps, should be allocated as per international norms.</p><span>\n</span><p>“E and V bands, we will do that expeditiously… There are some minor issues to be sorted out. DoT is committed to release E and v band spectrum very quickly. It is essential because in those bands you can do high speed radiolinks. In India 5G will require a lot of backhaul. In 5G we need to have base stations almost at every 50 meters. We don’t have fibre every 50 meter here,” Paulraj said. The panel has recommended that government should identify spectrum for 5G services in 600 Mhz, 1.4 Ghz, 30 Ghz, 31 Ghz and 37 Ghz band, while exploring the feasibility of 5G spectrum for the service in 500 Mhz and 3.7 Ghz bands. </p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "available",
        "next",
        "mobile",
        "made"
    ],
    "nouns": [
        "panel",
        "spectrum",
        "service",
        "committee",
        "Mhz",
        "ministry",
        "telecom",
        "gen",
        "generation",
        "mobile",
        "delay"
    ]
}