{
    "title": "Charge farmers for water, remove sops on water-guzzling crops: report",
    "link": "https://www.business-standard.com/article/economy-policy/charge-farmers-for-water-remove-sops-on-water-guzzling-crops-report-118061401155_1.html",
    "pubDate": "Thu, 14 Jun 2018 22:23:00 +0530",
    "content": "Nabard-Icrier study calls for moving high-water reliant crops like sugarcane in Maharashtra, rice in Punjab to other areas; Gadkari says not possible",
    "contentSnippet": "Nabard-Icrier study calls for moving high-water reliant crops like sugarcane in Maharashtra, rice in Punjab to other areas; Gadkari says not possible",
    "guid": "https://www.business-standard.com/article/economy-policy/charge-farmers-for-water-remove-sops-on-water-guzzling-crops-report-118061401155_1.html",
    "isoDate": "2018-06-14T16:53:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "charge",
            "farmers",
            "for",
            "water",
            "remove",
            "sops",
            "on",
            "water-guzzling",
            "crops",
            "report"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Charge farmers for water, remove sops on water-guzzling crops: report",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tWith India staring at a looming water crisis, a new study on ‘water productivity mapping of major crops’ has called for putting a price on water used for <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/irrigation\" target=\"_blank\">irrigation </a>to at least recover operating and maintenance costs of structures like canals. It has also called for an end to free power, which has been used indiscriminately to exploit groundwater resources.</p>\n<p>\n\tThe study, conducted jointly by <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nabard\" target=\"_blank\">Nabard </a>and Icrier, has also advocated disincentivising cultivation of water-intensive crops like sugarcane in Maharashtra and rice in Punjab and moving them to eastern Indian states through better procurement policies.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tRice, wheat and sugarcane, which together account for 43 per cent of the total cropped area in the country, consume almost 80 per cent of available freshwater.</p>\n<p>\n\tTransport and Water Resources Minister, Nitin Gadkari, who was the chief guest at the launch along with top <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/agriculture\" target=\"_blank\">agriculture </a>ministry officials, seemed to disagree with some of the findings of the study. He wondered what would happen to India's food security if wheat and rice aren't grown in states like Punjab and Haryana.</p>\n<p>\n\tAlso, stopping sugarcane cultivation in water-scarce regions of Maharashtra overnight won’t be possible. Therefore efforts should be made to towards more judicious use of water in such areas, using measures such as through drip and sprinkler <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/irrigation\" target=\"_blank\">irrigation.</a><br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/india-facing-worst-water-crisis-millions-of-lives-under-threat-niti-aayog-118061400997_1.html\" target=\"_blank\">India facing worst water crisis, millions of lives under threat: NITI Aayog</a></strong></p>\n<p>\n\t“Please don’t ask Vidharbha <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/farmers\" target=\"_blank\">farmers </a>to stop growing sugarcane, as that is the only crop which is fetching some returns. Also, while we look at shifting cultivation of water-guzzling crops, we should look at solutions through which wastage of millions of gallons of water is stopped,” Gadkari said.</p>\n<p>\n\tHe added that India doesn’t have any shortage of water, but lacks proper methods to stop wastage.</p>\n<p>\n\tOn the controversy over the use of surplus food for fuel, Gadkari said there was opposition from within the government. He said he had a tough time convincing all that <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/farmers\" target=\"_blank\">farmers </a>would be benefitted in the long run as there won’t be any shortage of sugarcane, sugar beet, and rice straws, which have been included in the new alternative fuel policy announced by the government.</p>\n<p>\n\tHe said the country needs to move towards third-generation ethanol produced directly from corn and other crops.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=agriculture+secretary\" target=\"_blank\"></a><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/agriculture\" target=\"_blank\">Agriculture </a>Secretary S Pattanayak, who was also present at the book launch, too seemed to agree with Gadkari and wondered that if Punjab and Haryana do not grow wheat and rice, which other state would do so and what would happen to the nation's food security.</p>\n<p>\n\t“In the US, corn and soybean are grown primarily as feedstock, but that is not the case in India,” Pattanayak said in apparent response to calls for using surplus farm production to meet the country’s energy needs.</p>\n<p>\n\tThe report also calls for direct benefit transfer of input subsidies into the bank accounts of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/farmers\" target=\"_blank\">farmers </a>instead of subsidizing the inputs.</p>\n<p>\n\t“This direct benefit transfer of input subsidies will increase the purchasing power of farmers, stop much of the leakages of precious inputs and give right signals for their efficient use,” the report said.</p>\n<p>\n\tIt also suggests rationalisation of supplies in canal irrigation, expansion of micro-<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/irrigation\" target=\"_blank\">irrigation </a>network and encouragement of participatory irrigation management through water user associations and FPOs.</p>\n<p>\n\tGujarat best state in water management, MP second.</p>\n<p>\n\tGujarat has emerged as the best state on Niti Aayog's <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=composite+water+management+index\" target=\"_blank\">composite water management index </a>(CWMI) followed by Madhya Pradesh, Andhra Pradesh, Karnataka and Maharashtra.</p>\n<p>\n\tIn the northeastern and Himalayan states, Tripura has been adjudged as the top state in 2016-17, followed by Himachal Pradesh, Sikkim and Assam.</p>\n<p>\n\tNiti Aayog has ranked all states through a first-of-its-kind index on composite water management, consisting of nine broad sectors with 28 different indicators covering various aspects of groundwater, restoration of water bodies, irrigation, farm practices, drinking water, policy and governance.</p>\n<p>\n\tThe reporting states were divided into two special groups – 'North Eastern and Himalayan states' and 'Other States' - to account for the different hydrological conditions across these groups.</p>\n<p>\n\tAccording to a report released today in terms of incremental change in the index (over 2015-16 level), Rajasthan holds number one position in general states and Tripura ranks at first position amongst North Eastern and Himalayan states. </p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "high",
        "moving",
        "reliant",
        "possible"
    ],
    "nouns": [
        "water",
        "high",
        "report",
        "Charge",
        "remove",
        "sops",
        "guzzling",
        "study",
        "sugarcane",
        "Maharashtra",
        "rice",
        "Punjab",
        "possible"
    ],
    "verbs": [
        "water",
        "report",
        "Charge",
        "remove",
        "study",
        "rice"
    ]
}