{
    "title": "Honda bets on the new Amaze to gain market, price begins at Rs 559,900",
    "link": "https://www.business-standard.com/article/companies/honda-bets-on-the-new-amaze-to-gain-market-price-begins-at-rs-559-900-118051600419_1.html",
    "pubDate": "Thu, 17 May 2018 00:24:00 +0530",
    "content": "The car sets a new benchmark in Honda's localisation in the country, with 96 per cent of components by value being sourced locally",
    "contentSnippet": "The car sets a new benchmark in Honda's localisation in the country, with 96 per cent of components by value being sourced locally",
    "guid": "https://www.business-standard.com/article/companies/honda-bets-on-the-new-amaze-to-gain-market-price-begins-at-rs-559-900-118051600419_1.html",
    "isoDate": "2018-05-16T18:54:00.000Z",
    "sentiment": {
        "score": 4,
        "comparative": 0.2857142857142857,
        "tokens": [
            "honda",
            "bets",
            "on",
            "the",
            "new",
            "amaze",
            "to",
            "gain",
            "market",
            "price",
            "begins",
            "at",
            "rs",
            "559900"
        ],
        "words": [
            "gain",
            "amaze"
        ],
        "positive": [
            "gain",
            "amaze"
        ],
        "negative": []
    },
    "article": {
        "title": "Honda bets on the new Amaze to gain market, price begins at Rs 559,900",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\t<img align=\"\" alt=\"Amaze, Honda, Launch\" class=\"imgCont\" height=\"NaN\" src=\"http://bsmedia.business-standard.com/_media/bs/img/misc/2018-05/16/full/amaze-honda-launch-1526481203-00242410.jpg\" title=\"Amaze, Honda, Launch\" width=\"NaN\"></p>\n\tJapanese car maker <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=honda\" target=\"_blank\">Honda </a>wants the new generation of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=amaze\" target=\"_blank\">Amaze </a>compact sedan to become its third leg of Indian market operations – the other two being the City mid-sized sedan and the WR-V compact sports utility vehicle. Launched on Wednesday with an entry variant price of Rs 559,990 (petrol), <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=honda\" target=\"_blank\">Honda </a>is confident that the new <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=amaze\" target=\"_blank\">Amaze </a>will help it corner a bigger share in the Indian compact sedan market, where rival Maruti Suzuki’s Dzire sits on a share of almost sixty per cent. Dzire begins at a comparable price of Rs 556,000 (ex-showroom Delhi).\n<p>\n\t“We have got only positive reviews so far for the new <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=amaze\" target=\"_blank\">Amaze.</a> I believe it is going to be a game changer for us and replicate the success of the City. It may even overtake the City in volumes,” said Rajesh Goel, senior vice president and director (sales and marketing) at <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=honda\" target=\"_blank\">Honda </a><a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=cars\" target=\"_blank\">Cars </a>India.</p>\n<p>\n\tA compact sedan has for a long time been seen as a vehicle designed by attaching boot to an existing hatchback model. That is how the first Maruti Suzuki Dzire came into being (after the Swift hatchback). The story is similar for first generation of Amaze, which came after the Brio. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=goel\" target=\"_blank\">Goel </a>claims that Honda has changed the sequence by launching the sedan first this time. “I think we are the first company to have started with the sedan. That is why we have a full-fledged sedan and not just a boot attached to a hatch. This platform has been developed for India. The sequence of thought has changed,” he said.</p>\n<p>\n\tMaruti Suzuki launched the Dzire in May last year and brought the Swift in February this year. But the Amaze is unlikely to be followed by the Brio, a model that sells just 400 units a month and is one of the lowest-volume products in the small car segment. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=goel\" target=\"_blank\">Goel </a>said it was not necessary for a car maker to operate in all segments and Honda would focus on the segments where it has an advantage and can add value.</p>\n<p>\n\tHonda hopes the Amaze will appeal to two new kinds of car buyers, besides the compact sedan customers. “I believe that the first-time car buyer will consider going to this sedan for its looks. The compact SUV buyer will also find this car appealing. An SUV has a greater appeal but the looks of this Amaze should retain and pull in some buyers who might have been originally considering a small SUV. At that price point, a lot of cross-shopping takes place,” said <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=goel\" target=\"_blank\">Goel.</a></p>\n<p>\n\tLaunched in 2013, the first generation of the Amaze clocked a cumulative sales volume of 257,000 units. The new Amaze, Goel believes, will surpass these numbers and also change the complexion of compact sedan market in India. India is the first country among all Honda markets to produce and launch the new Amaze.</p>\n<p>\n\tBesides the twin combination of an excellent product and price, the new Amaze comes with best warranty in the industry, said Goel. “It is going to have the lowest maintenance cost with the extended warranty packages and also the cost of parts. The life cycle of parts is much higher and that reduces maintenance cost. We should be able to seam to success.”</p>\n<p>\n\tThe second-generation Amaze boasts an all new bold design, a sophisticated and spacious interior, a more efficient powertrain, outstanding driving dynamics with a strong focus on stability and ride performance. And, it is equipped with the latest in safety technologies and convenience features. The car sets a new benchmark in Honda’s localisation in the country, with 96 per cent of components by value being sourced locally. The outgoing model had a localisation of 94 per cent and the number is identical for the City and WR-V.</p>\n<p>\n\tThe outgoing Amaze had also catered to taxi and fleet segment buyers and that in some way also impacted its preference among personal-use buyers. Honda is cautious and will steer way from selling the Amaze to cab aggregators. “This is a beautiful new model. I would like to keep selling to personal buyers. I don’t intend to sell any numbers to fleet owners to begin with,” said Goel.</p>\n<p>\n\tThe new Amaze has been developed at Honda R&amp;D Asia Pacific Co, located in Bangkok, following extensive market surveys in India on people’s driving needs and lifestyles. India, being a key strategic market for Honda globally, has been specifically chosen to lead the launch of the new Amaze. The Amaze is also expected to help Honda grow its overall market share in India and play a critical role in helping it compete with Tata Motors (Honda lost the fourth position in the Indian car market to Tata last year). Goel is reluctant to share the volume targets for the Amaze but says the company is well prepared to cater to any volume demand that may come up. </p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "new",
        "96"
    ],
    "nouns": [
        "cent",
        "market",
        "price",
        "car",
        "benchmark",
        "gain",
        "localisation",
        "country",
        "value"
    ],
    "verbs": [
        "market",
        "price",
        "Amaze",
        "gain",
        "value"
    ]
}