{
    "title": "Home loans may grow 17-19% in FY19 on affordability, govt push: Icra",
    "link": "https://www.business-standard.com/article/economy-policy/home-loans-may-grow-17-19-in-fy19-on-affordability-govt-push-icra-118061301297_1.html",
    "pubDate": "Thu, 14 Jun 2018 01:47:00 +0530",
    "content": "Overall asset quality indicators for all housing finance firms remained stable with gross NPAs of 1.1% for FY18",
    "contentSnippet": "Overall asset quality indicators for all housing finance firms remained stable with gross NPAs of 1.1% for FY18",
    "guid": "https://www.business-standard.com/article/economy-policy/home-loans-may-grow-17-19-in-fy19-on-affordability-govt-push-icra-118061301297_1.html",
    "isoDate": "2018-06-13T20:17:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "home",
            "loans",
            "may",
            "grow",
            "17-19",
            "in",
            "fy19",
            "on",
            "affordability",
            "govt",
            "push",
            "icra"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Home loans may grow 17-19% in FY19 on affordability, govt push: Icra",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tGovernment incentives to boost the residential real estate sector, especially budget housing, may push housing credit growth to 17-19 per cent in the current fiscal year, according to a report.</p>\n<p>\n\t\"Growing affordability for the first-time home buyers, supported by government incentives like the PM's Awas Yojana are expected to result in a rise in primary home purchases, especially in the affordable housing segment, which will help segmental loan growth to 17-19 per cent,\"the Icra report said.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tHousing credit grew 16 per cent in FY18, taking the mortgage penetration (housing credit as a percentage of GDP) to double-digit mark of 10 per cent for the first time in FY18, up from 9.5 per cent in FY17.</p>\n<p>\n\tOverall housing credit grew 39 per cent in the year to March 2018, which was pushed by new mortgage players in the affordable housing segment.</p>\n<p>\n\t\"We expect mortgage penetration level to go up by 300 -500 bps over the next five years,\" the report said.</p>\n<p>\n\tOverall asset quality indicators for all housing <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/finance\" target=\"_blank\">finance </a>firms remained stable with gross NPAs of 1.1 per cent for FY18, better than the 1.2 per cent in December 2017 but worse than the 0.8 per cent NPAs in FY17.</p>\n<p>\n\tIcra expects overall gross NPAs for housing <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/finance\" target=\"_blank\">finance </a>companies (HFCs) to remain range-bound between 1.2 and 1.5 per cent this year.</p>\n<p>\n\t\"The <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=retail+home+loan+asset+quality\" target=\"_blank\">retail home loan asset quality </a>of HFCs is likely to be benefited by the recent Cabinet decision to treat home buyers as financial creditors,\" it said.</p>\n<p>\n\tHowever, gross NPAs in the sub-segment deteriorated from 3.3 per cent in FY17 to 4.1 per cent in FY18, driven by greater portfolio seasoning, entity-specific factors in some cases and external events such as note-ban and GST rollout, which have impacted cash flows of borrowers.</p>\n<p>\n\tOn the funding side, the report said HFCs would need to tie-up for Rs 4 trillion of incremental funds to meet the growth plans as well as replacing the maturing liabilities in FY19.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Home",
        "gross",
        "17",
        "19",
        "Overall",
        "quality",
        "stable"
    ],
    "verbs": [
        "finance",
        "Home",
        "grow",
        "gross",
        "push",
        "stable"
    ],
    "nouns": [
        "finance",
        "Home",
        "may",
        "gross",
        "17",
        "19",
        "push",
        "Overall",
        "asset",
        "quality",
        "housing",
        "stable"
    ]
}