{
    "creator": "Reuters",
    "title": "Asia stocks slip on spectre of higher US rates, dollar “a freight train”",
    "link": "https://www.financialexpress.com/market/world-markets/asia-stocks-slip-on-spectre-of-higher-us-rates-dollar-a-freight-train/454319/",
    "pubDate": "Thu, 24 Nov 2016 10:07:10 +05:30",
    "dc:creator": "Reuters",
    "content": "Most Asian stock markets fell on Thursday as upbeat economic data strengthened the prospect for higher U.S. interest rates, while the dollar's bull run continued as U.S. bond yields hovered near multi-year highs.",
    "contentSnippet": "Most Asian stock markets fell on Thursday as upbeat economic data strengthened the prospect for higher U.S. interest rates, while the dollar's bull run continued as U.S. bond yields hovered near multi-year highs.",
    "guid": "http://www.financialexpress.com/?p=454319",
    "categories": [
        "Market",
        "World Markets Markets Do Not Use"
    ],
    "isoDate": "2016-11-24T04:37:10.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.07692307692307693,
        "tokens": [
            "asia",
            "stocks",
            "slip",
            "on",
            "spectre",
            "of",
            "higher",
            "us",
            "rates",
            "dollar",
            "“a",
            "freight",
            "train”"
        ],
        "words": [
            "slip"
        ],
        "positive": [],
        "negative": [
            "slip"
        ]
    },
    "article": {
        "title": "Asia stocks slip on spectre of higher US rates, dollar “a freight train”",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-453114\" src=\"https://images.financialexpress.com/2016/11/Asian-Shares-re-660.jpg\" alt=\"The firm dollar kept most emerging market currencies on the ropes, with China's yuan nearing the 7 per dollar level for the first time since May 2008. (Reuters)\" srcset=\"https://images.financialexpress.com/2016/11/Asian-Shares-re-660.jpg 660w, https://images.financialexpress.com/2016/11/Asian-Shares-re-660-300x200.jpg 300w, https://images.financialexpress.com/2016/11/Asian-Shares-re-660-620x413.jpg 620w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The firm dollar kept most emerging market currencies on the ropes, with China’s yuan nearing the 7 per dollar level for the first time since May 2008. (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>Most Asian stock markets fell on Thursday as upbeat economic data strengthened the prospect for higher U.S. interest rates, while the dollar’s bull run continued as U.S. bond yields hovered near multi-year highs.</p><span>\n</span><p>Japanese stocks swam against the tide and rose to a near 11-month high as the yen weakened and after Wall Street shares closed at record highs overnight.</p><span>\n</span><p>The dollar index against major currencies rose nearly 0.2 percent to 101.84, not far from 101.91 touched overnight, its highest since March 2003.</p><span>\n</span><p>The greenback drew support from a further rise in U.S. Treasury yields.</p><span>\n</span><p>The two-year yield hit its highest levels since April 2010 on Wednesday as the market continued to bet that the Trump administration will increase debt-funded spending and spur higher growth and inflation.</p><span>\n</span><p>Such a view – which has also lifted expectations for more interest rate hikes by the Federal Reserve next year – was reinforced on Wednesday by data that showed new orders of U.S. manufactured capital goods rebounded in October. Consumer sentiment also jumped in November in the wake of Trump’s election.</p><span>\n</span><p>“It (the U.S. dollar) is a freight train that seems over limit at the moment, but it may have a long way to go before what looks and feels like a structural adjustment settles down,” said Greg McKenna, chief market strategist at CFD and FX provider AxiTrader.</p><span>\n</span><p>The dollar was up 0.2 percent at 112.740 yen after touching an eight-month high of 112.980 overnight. It has gained roughly seven big figures against its Japanese counterpart since Trump’s victory earlier this month.</p><span>\n</span><p>The euro was down 0.2 percent at $1.0530 after touching $1.0526 overnight, its lowest since Dec. 4, 2015. The common currency has dropped nearly 4 percent so far in November.</p><span>\n</span><p>The firm dollar kept most emerging market currencies on the ropes, with China’s yuan nearing the 7 per dollar level for the first time since May 2008.</p><span>\n</span><p>In equities, MSCI’s broadest index of Asia-Pacific shares outside Japan pulled back from a 12-day high scaled the previous day to lose 0.5 percent, facing the prospect of higher U.S. interest rates diverting money from emerging markets. It has lost 3.5 percent this month.</p><span>\n</span><p>Australian shares shed 0.1 percent and South Korea’s Kospi fell 0.5 percent. Shanghai was up 0.1 percent and Hong Kong’s Hang Seng dropped 0.5 percent.</p><span>\n</span><p>Japan’s Nikkei was up 1 percent, touching its highest level since early January.</p><span>\n</span><p>“If you want to hedge or profit from a ‘make America normal again’ trade, the best way is through the Japanese equity market, and specifically the banks,” wrote Chris Weston, chief market strategist at IG in Melbourne.</p><span>\n</span><p>Shares of Japan’s banks, along with some of their global peers, have climbed following Trump’s win, buoyed by the rise in yields and prospects of improved business opportunities under the next U.S. administration.</p><span>\n</span><p>Equities in emerging and developed economies have headed in different directions since Trump’s win.</p><span>\n</span><p>Higher U.S. yields have pulled those of other developed economies from rock-bottom levels, with investor money now expected to flow back from emerging markets which had offered relatively higher rates.</p><span>\n</span><p>The Dow marked a record closing high overnight while Germany’s DAX has gained nearly 2 percent since the victory by the Republican candidate. On the other hand, MSCI’s emerging markets index has fallen 5.8 percent this month.<br>Continuing to feel the tug of higher U.S. yields, Japan’s 30-year bond yield rose to an eight-month peak of 0.640 percent. The German 10-year bund yielded around 2.6 percent on Wednesday, having climbed from a record low of minus 0.2 percent struck in July.</p><span>\n</span><p>Oil prices were little changed amid uncertainty ahead of a planned OPEC-led crude production cut at a meeting on Nov. 30.</p><span>\n</span><p>U.S. crude was up 1 cent at $47.97 a barrel and Brent was down 2 cents at $48.93.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "Asian",
        "stock",
        "higher",
        "Most",
        "fell",
        "upbeat",
        "economic",
        "strengthened",
        "U",
        "continued",
        "near"
    ],
    "nouns": [
        "Asia",
        "Asian",
        "stocks",
        "stock",
        "slip",
        "spectre",
        "US",
        "rates",
        "dollar",
        "freight",
        "train",
        "fell",
        "Thursday",
        "upbeat",
        "data",
        "prospect",
        "U",
        "S",
        "interest",
        "bull",
        "run",
        "bond",
        "year"
    ],
    "verbs": [
        "stock",
        "slip",
        "freight",
        "train",
        "fell",
        "prospect",
        "interest",
        "bull",
        "run",
        "bond",
        "near"
    ]
}