{
    "title": "No rollback of decontrol in diesel and petrol pricing: Dharmendra Pradhan",
    "link": "https://www.business-standard.com/article/economy-policy/no-rollback-of-decontrol-in-diesel-and-petrol-pricing-dharmendra-pradhan-118060601162_1.html",
    "pubDate": "Thu, 07 Jun 2018 07:02:00 +0530",
    "content": "The government would take a holistic view on retail fuel pricing",
    "contentSnippet": "The government would take a holistic view on retail fuel pricing",
    "guid": "https://www.business-standard.com/article/economy-policy/no-rollback-of-decontrol-in-diesel-and-petrol-pricing-dharmendra-pradhan-118060601162_1.html",
    "isoDate": "2018-06-07T01:32:00.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.09090909090909091,
        "tokens": [
            "no",
            "rollback",
            "of",
            "decontrol",
            "in",
            "diesel",
            "and",
            "petrol",
            "pricing",
            "dharmendra",
            "pradhan"
        ],
        "words": [
            "no"
        ],
        "positive": [],
        "negative": [
            "no"
        ]
    },
    "article": {
        "title": "No rollback of decontrol in diesel and petrol pricing: Dharmendra Pradhan",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tUnion petroleum minister <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=dharmendra+pradhan\" target=\"_blank\">Dharmendra Pradhan </a>ruled out any rollback in deregulation of petrol and diesel prices. However, he said the government would protect the interest of common people and not let petroleum price go very high.</p>\n<p>\n\tSpeaking to reporters on his government’s four years’ achievements, Pradhan said, “We cannot go on reforms (in the sector). There is no question of rollback on deregulation.”</p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/current-affairs/cruel-joke-here-s-how-twitterati-reacted-to-petrol-price-cut-faux-pas-118053100245_1.html\" target=\"_blank\">Cruel joke: Here is how Twitterati reacted to petrol price cut faux pas</a></strong></p>\n<p>\n\tThe government would take a holistic view on retail fuel pricing. Besides global oil prices, tax and volatility in exchange rates played a role in fuel pricing.</p>\n<p>\n\tPradhan said the government was in favour of including all petroleum products under the goods and service tax (GST) ambit but a view would need to be taken by the GST Council. Currently, five products, petrol, diesel, ATF, crude oil and natural gas, are outside the GST purview which leaves the oil companies with a disadvantage on input tax credit.</p>\n<p>\n\tThe minister, who took a meeting of public sector oil companies on the issue of price rise last week, did not comment when asked whether oil producing companies like Oil and Natural Gas Corporation and Oil India would be asked to bear the subsidy burden.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/petrol-diesel-cut-after-16-days-petrol-at-rs-77-83-litre-in-delhi-118053000174_1.html\" target=\"_blank\">Petrol, diesel cut after 16 days: Petrol at Rs 77.83 / litre in Delhi</a></strong></p>\n<p>\n\tPradhan said for the first time Saudi <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=oil+minister\" target=\"_blank\">oil minister </a>called an Indian minister to say they were revisiting the decision on oil production cut. Oil producing nations also understand that in the next 25 years business opportunities will be in Asia, particularly in India, he said.</p>\n<p>\n\t“We are the world's third biggest oil consumer. Our per capita consumption is one of the lowest and growth is very high,” said Pradhan. He said it was too early to comment on the impact of American sanctions on India's oil imports from Iran.</p>\n<p>\n\tBoth diesel and petrol retail prices have been falling in the last one week though the quantum of fall is just 51 paise for diesel and 71 paise for petrol. Retail prices of both the fuels had touched historic highs last month leading to a demand for excise duty cut on the two products.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "holistic",
        "No"
    ],
    "nouns": [
        "government",
        "pricing",
        "No",
        "rollback",
        "diesel",
        "petrol",
        "view",
        "retail",
        "fuel"
    ],
    "verbs": [
        "decontrol",
        "view",
        "retail",
        "fuel"
    ]
}