{
    "creator": "FE Online",
    "title": "Rupee hits record low of 68.86 by plunging 30 paise against US dollar",
    "link": "https://www.financialexpress.com/market/indian-markets/rupee-free-fall-continues-unabated-sheds-another-27-paise/454391/",
    "pubDate": "Thu, 24 Nov 2016 10:24:50 +05:30",
    "dc:creator": "FE Online",
    "content": "Rupee's unabated free-fall continued for the fifth straight day today as it weakened by another 27 paise to hit a fresh 9-month low of 68.83 against the dollar in early trade amid foreign fund outflows and the greenback's surge in overseas markets. ",
    "contentSnippet": "Rupee's unabated free-fall continued for the fifth straight day today as it weakened by another 27 paise to hit a fresh 9-month low of 68.83 against the dollar in early trade amid foreign fund outflows and the greenback's surge in overseas markets.",
    "guid": "http://www.financialexpress.com/?p=454391",
    "categories": [
        "Indian Markets Do Not Use",
        "Market"
    ],
    "isoDate": "2016-11-24T04:54:50.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "rupee",
            "hits",
            "record",
            "low",
            "of",
            "6886",
            "by",
            "plunging",
            "30",
            "paise",
            "against",
            "us",
            "dollar"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Rupee hits record low of 68.86 by plunging 30 paise against US dollar",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-453742\" src=\"https://images.financialexpress.com/2016/11/newnotes-2.jpg\" alt=\"Forex dealers said besides a strong month-end demand for the American currency from importers, continued capital outflows by foreign funds and the dollar's bull run on an imminent hike in Fed's interest rates, mainly weighed on the domestic currency. (Reuters)\" srcset=\"https://images.financialexpress.com/2016/11/newnotes-2.jpg 660w, https://images.financialexpress.com/2016/11/newnotes-2-300x200.jpg 300w, https://images.financialexpress.com/2016/11/newnotes-2-620x413.jpg 620w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Forex dealers said besides a strong month-end demand for the American currency from importers, continued capital outflows by foreign funds and the dollar’s bull run on an imminent hike in Fed’s interest rates, mainly weighed on the domestic currency. (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>The rupee hit a record low of 68.36 by plunging 30 paise against the US dollar on Thursday amid sustained foreign fund outflows and the greenback’s surge in overseas markets. The low surpassed the rupee’s previous all-time nadir of 68.85 hit in August 2013, when the country was mired in its worst currency crisis in more than two decades. News agency Reuters reported that the Reserve Bank of India was spotted intervening in the foreign exchange market. India’s central bank sold around $500 million to support the rupee, traders said. Two interventions by the central bank in the morning sparked a sharp rebound in the currency from near record lows hit earlier in the day. The Indian currency shrunk 2.92 per cent since Donald Trump’s victory in the US Presidential polls earlier this month. Sources from the Finance Ministry told ET Now that various factors can be attributed but certainty around US rate hike and currency curb impact are the main reasons for Rupee’s fall.</p><span>\n</span><p>India Forex Advisors speaking to Bloomberg TV India said that the Rupee may remain weak for some time and may hit 69-69.50/$ level. Forex dealers said besides a strong month-end demand for the American currency from importers, continued capital outflows by foreign funds and the dollar’s bull run on an imminent hike in Fed’s interest rates, mainly weighed on the domestic currency. The fall in the rupee comes at a time when investors are souring on the government’s shock move to remove high-value notes from circulation, which came on the eve of the unexpected election of Donald Trump as U.S. President. A huge outflow of capital by foreign investors has been weakening the rupee as they apprehend an impact on the economy in the short-term following the India’s move to demonetise Rs 500 and Rs 1,000 banknotes. Surging US bond yields and a strong dollar overseas are also contributing to the rupee’s fall. The NSE index has slumped 6 percent since the demonetisation announcement on Nov. 8, compared with a fall of 2.8 percent in the MSCI Asia-Pacific index excluding Japan.</p><span>\n</span><span>\n</span><p>“The gloom in the market due to the lack of (cash) liquidity is unlikely to ease until February next year,” said Saurabh Jain, assistant vice-president of research at SMC Global Securities. The NSE index was down 0.45 percent after gaining about 1 percent in the previous two sessions. The benchmark BSE index was down 0.37 percent. Auto makers, which could be hit by reduced consumer demand due to the demonetisation, were among the leading decliners. <a target=\"_blank\" href=\"http://www.financialexpress.com/auto/new-cars/tata/\">Tata</a> Motors fell 3.7 percent. But the IT Index outperformed the market, it was up on the back of a weaker rupee. Tech <a target=\"_blank\" href=\"http://www.financialexpress.com/auto/new-cars/mahindra/\">Mahindra</a> rose 2.2 percent.</p><span>\n</span><p>The dollar index, which tracks the greenback against a basket of six major peers, rose 0.1 percent to 101.77, pushing back toward its overnight high of 101.91, its highest in nearly 14 years.</p><span>\n</span><p>(With inputs from Agencies)</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "low",
        "68",
        "86",
        "30",
        "free",
        "fresh",
        "continued",
        "fifth",
        "straight",
        "weakened",
        "27",
        "83",
        "early",
        "foreign",
        "overseas",
        "unabated"
    ],
    "nouns": [
        "Rupee",
        "hit",
        "record",
        "low",
        "30",
        "US",
        "dollar",
        "free",
        "fall",
        "straight",
        "day",
        "today",
        "27",
        "month",
        "trade",
        "fund",
        "surge",
        "fifth",
        "greenback"
    ],
    "verbs": [
        "hit",
        "record",
        "low",
        "free",
        "fall",
        "trade",
        "fund",
        "surge"
    ]
}