{
    "title": "Hotstar, Jio ride IPL rollercoaster with paid services, entertainment shows",
    "link": "https://www.business-standard.com/article/ipl/hotstar-jio-ride-ipl-rollercoaster-with-paid-services-entertainment-shows-118040401428_1.html",
    "pubDate": "Thu, 05 Apr 2018 05:56:00 +0530",
    "content": "Digital players ride the Indian Premier League roller-coaster with premium services and entertainment shows",
    "contentSnippet": "Digital players ride the Indian Premier League roller-coaster with premium services and entertainment shows",
    "guid": "https://www.business-standard.com/article/ipl/hotstar-jio-ride-ipl-rollercoaster-with-paid-services-entertainment-shows-118040401428_1.html",
    "isoDate": "2018-04-05T00:26:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "hotstar",
            "jio",
            "ride",
            "ipl",
            "rollercoaster",
            "with",
            "paid",
            "services",
            "entertainment",
            "shows"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Hotstar, Jio ride IPL rollercoaster with paid services, entertainment shows",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>The Vivo <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=indian+premier+league\" target=\"_blank\">Indian </a><a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=premier+league\" target=\"_blank\">Premier League </a>2018 (<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ipl\" target=\"_blank\">IPL </a>2018) is turning into a battle of brands even on the digital network. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=hotstar\" target=\"_blank\">Hotstar </a>and Jio have fired the first salvo, using the game to launch paid services and create special comedy shows around players and the teams. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=hotstar\" target=\"_blank\">Hotstar </a>announced today that the matches will be available to premium (paid) subscribers only. And <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=reliance+jio\" target=\"_blank\">Reliance Jio </a>has announced a set of cricket-themed comedy shows; with this it is looking to maximize its returns from the digital rights that it holds for all <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ipl\" target=\"_blank\">IPL </a>teams for a portion of their non-match time. Season 11 may well turn out to be the game changer, pitting not just team against team, but also digital players against traditional television broadcasters in the hunt for brand attention.</p><p>\nInterestingly, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=hotstar\" target=\"_blank\">Hotstar </a>is using the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ipl\" target=\"_blank\">IPL </a>as the launch pad for its premium offering in sports, just as it did the season six premier of HBO’s fantasy drama Game of Thrones for entertainment. So far, it provided a delayed feed of the IPL for free. This year, the delayed feed has been discontinued and paying users can access the live feed—a sign of the huge pull that the tournament wields among the young. Brands eyeing this demographic are expected to jump in for a slice of the pie.\n\n\n</p>\n<!-- INPAGE_BANNER --><p>\n“Cricket is a game that changes with every ball, and best enjoyed on a live feed. So this year, all our users will have a chance to experience live cricket,” Hotstar said in a statement. The ‘All Sports Pack’ is an all access pass to all sports games on Hotstar, for an annual fee of Rs 299. This includes Vivo IPL, Asia Cup, Pro Kabaddi League, Premier League, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=formula+one\" target=\"_blank\">Formula One </a>and all Grand Slams (except Australian open).</p><p>\nAll users get the first 10 minutes of the live match free, as a promotional offer, but for all else, there is a paywall. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=reliance+jio\" target=\"_blank\">Reliance Jio </a>and Airtel network users are already subscribed to the Hotstar’s premium service and can watch the matches.</p><p>\nExperts point out that the IPL is now turning out to be larger than the game itself for broadcasters and brands with entertainment shows too are riding on its popularity. The show, ‘Jio Dhan Dhana Dhan Live: Never Run-Out of Laughter’ for instance is on the MyJio app, available free to both Jio and non Jio subscribers.  Hosted by comedian <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=sunil+grover\" target=\"_blank\">Sunil Grover </a>and sports anchor, Samir Kochhar, every episode will feature cricketers and celebrity guests in conversations, gags and more. The two will be joined by a host of comedians and cricket legends such as Kapil Dev and Virendra Sehwag.</p><p>\nSources reveal that an edited form of the show may be aired on general entertainment channel Colors (Viacom 18) in which the Mukesh Ambani owned-TV18 has acquired controlling stake. Jio also announced the launch of ‘Jio Cricket Play Along: Jeeto Dhan Dhana Dhan’ which will be accessible to all smartphone users in India and can be played in 11 Indian languages. Apart from this, Jio has introduced a Cricket Season Pack that will allow viewers to get access to live matches on mobile and stream almost every live match throughout the duration of the tournament.  For both Hotstar and Jio, the stakes are running high as they look to leverage the game on their respective platforms.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "paid",
        "Digital",
        "Indian",
        "Premier",
        "premium"
    ],
    "nouns": [
        "roller",
        "ride",
        "services",
        "entertainment",
        "Indian",
        "Premier",
        "premium",
        "League",
        "coaster"
    ],
    "verbs": [
        "ride",
        "Premier",
        "League"
    ]
}