{
    "creator": "FE Online",
    "title": "Rupee dives to lowest level since August 2013! 5 reasons why the Indian currency is in a free fall",
    "link": "https://www.financialexpress.com/market/indian-markets/rupee-dives-to-lowest-level-since-august-2013-5-reasons-why-the-indian-currency-is-in-a-free-fall/454970/",
    "pubDate": "Thu, 24 Nov 2016 16:44:28 +05:30",
    "dc:creator": "FE Online",
    "content": "The Indian rupee has plunged to its lowest level in over 3 years, 68.86, and there is no respite in sight.",
    "contentSnippet": "The Indian rupee has plunged to its lowest level in over 3 years, 68.86, and there is no respite in sight.",
    "guid": "http://www.financialexpress.com/?p=454970",
    "categories": [
        "Indian Markets Do Not Use",
        "Market"
    ],
    "isoDate": "2016-11-24T11:14:28.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "rupee",
            "dives",
            "to",
            "lowest",
            "level",
            "since",
            "august",
            "2013",
            "5",
            "reasons",
            "why",
            "the",
            "indian",
            "currency",
            "is",
            "in",
            "a",
            "free",
            "fall"
        ],
        "words": [
            "free",
            "lowest"
        ],
        "positive": [
            "free"
        ],
        "negative": [
            "lowest"
        ]
    },
    "article": {
        "title": "Rupee dives to lowest level since August 2013! 5 reasons why the Indian currency is in a free fall",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-454977\" src=\"https://images.financialexpress.com/2016/11/2000-reuters.jpg\" alt=\"Rupee, Indian Rupee, Rupee level, Rupee outlook, Rupee forex\" srcset=\"https://images.financialexpress.com/2016/11/2000-reuters.jpg 660w, https://images.financialexpress.com/2016/11/2000-reuters-300x200.jpg 300w, https://images.financialexpress.com/2016/11/2000-reuters-620x413.jpg 620w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Indian Rupee: The currency is in a free fall owing to multiple reasons, such as FIIs exiting the Indian market, dollar’s bull run. (Reuters photo)</figure>\n\t\t\t</section></div><span>\n</span><p>The <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/indian-rupee/\">Indian rupee</a> has plunged to its lowest level in over 3 years and there is no respite in sight, despite the Reserve Bank of India (<a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a>) is actively intervening to step the rapid depreciation of the currency versus the US dollar. The currency is in a free fall owing to multiple reasons, such as FIIs exiting the Indian market, dollar’s bull run on possible US Federal Reserve rate hike, and month-end demand for the American currency. Analysts widely expect the Indian rupee to see continued pressure in the coming days. There are others who believe that the rupee had appreciated reasonably well off-late and a certain amount of depreciation is warranted. We take a look at 5 reasons why the rupee is falling and what the government has to say about it:</p><span>\n</span><p><strong>1)</strong> <strong>Continued capital outflows by foreign funds:</strong> There has been a massive outflow of capital by foreign investors, and this has been one of the main reasons for the weakening of the rupee. Reports suggest that FIIs are also wary of the possible impact of demonetisation of old Rs 500 and Rs 1,000 banknotes on the economy.</p><span>\n</span><p><strong>2)</strong> <strong>Strong dollar:</strong> Expectations that President-elect Trump will pursue an expansionary fiscal policy that will drive inflation higher and lead to higher US interest rates are behind rising US yields that have attracted investors to the dollar. The American currency is on a bull run and amidst fears of the US Federal Reserve possibly hiking rates in the near future, the dollar has been strengthening the US dollar. Additionally, surging US bond yields are also contributing to the rupee’s fall.</p><span>\n</span><span>\n</span><span>\n</span><span>\n</span><p><strong>3) Month-end demand</strong> for the US dollar from importers is yet another reason for the rupee sliding as much as it is, feel foreign exchange dealers.</p><span>\n</span><p><strong>4) The domestic market has been weak</strong> after the demonetisation drive and dull global markets mood post Trump victory. Many brokerages have lowered their targets for Sensex for this financial year.</p><span>\n</span><p><strong>5) Outflows are also tied to the redemptions</strong> of dollar deposits (FCNR-B), expected to total around $28 billion, that were raised from Indians living abroad to help pull the rupee out its crisis three years ago.</p><span>\n</span><p>The rupee has fallen around 3% in November, recording its biggest fall against the US dollar since August 2015. One relief is that the currency has fared better than many other emerging market currencies since Donald Trump’s shock win in the US presidential election. Although foreign investors are pulling money away from India’s capital markets, analysts say its strong economic growth should lend some support to the currency. Foreign exchange reserves also are at a near record high and inflation remains low.</p><span>\n</span><p><em>(With inputs from Reuters)</em></p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "free",
        "lowest",
        "level",
        "Indian",
        "68",
        "86",
        "no",
        "August"
    ]
}