{
    "title": "Riding on fuel, core inflation, WPI jumps to 14-month high in May",
    "link": "https://www.business-standard.com/article/economy-policy/riding-on-fuel-core-inflation-wpi-jumps-to-14-month-high-in-may-118061401141_1.html",
    "pubDate": "Thu, 14 Jun 2018 21:40:00 +0530",
    "content": "The impact of firming input prices also showed up in manufactured products' inflation, which was up 62 bps",
    "contentSnippet": "The impact of firming input prices also showed up in manufactured products' inflation, which was up 62 bps",
    "guid": "https://www.business-standard.com/article/economy-policy/riding-on-fuel-core-inflation-wpi-jumps-to-14-month-high-in-may-118061401141_1.html",
    "isoDate": "2018-06-14T16:10:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "riding",
            "on",
            "fuel",
            "core",
            "inflation",
            "wpi",
            "jumps",
            "to",
            "14-month",
            "high",
            "in",
            "may"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Riding on fuel, core inflation, WPI jumps to 14-month high in May",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tWholesale price index-based (WPI) inflation jumped to 4.4 per cent in May, from 3.2 per cent in April, the highest level in 14 months.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=fuel+inflation\" target=\"_blank\">Fuel inflation </a>was the main driver, jumping up over 330 basis points (bps) on-month, while core inflation crept up 30 bps and closed in on 2 per cent.</p>\n<p>\n\tWe measure core inflation using the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=crisil+core+inflation+indicator\" target=\"_blank\"></a><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/crisil\" target=\"_blank\">CRISIL </a>Core Inflation Indicator (CCII). It reduces volatility by excluding base metals from the manufacturing index, is, therefore, more stable and captures demand-side pressures on prices more accurately than other core inflation measures.</p>\n<p>\n\tCCII-based inflation has been picking up for the last two months. This is not only indicative of rising input prices (from oil, rupee and metals) but also suggests that with improving domestic demand conditions, pricing power of manufacturers has begun to rise.</p>\n<p>\n\tThe impact of firming input prices also showed up in manufactured products’ inflation, which was up 62 bps.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/may-wpi-inflation-spikes-to-4-43-vs-3-18-in-april-govt-data-118061400356_1.html\" target=\"_blank\">May WPI Inflation spikes to 4.43% vs 3.18% in April: Govt data</a></strong></p>\n\n<p>\n\tThe pick-up in overall inflation was also led by food inflation, which rose 44 bps, led by cereals and few protein-based items.</p>\n<p>\n\tFuel was the biggest driver in May. In May, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/oil-prices\" target=\"_blank\">oil prices </a>surged 7 per cent on-month and 50 per cent on-year, while the average value of the rupee weakened 3 per cent on-month and 4.8 per cent on-year. Sharp increases in global crude <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/oil-prices\" target=\"_blank\">oil prices </a>can put pressure on manufacturers’ margins unless there is scope to pass on the increasing costs.</p>\n<p>\n\tFuel and power inflation spiked to 11.2 per cent in May, from 7.9 per cent in April. This was led by a sharp increase in inflation in mineral oils (mainly diesel, petrol, naphtha, and furnace oil) as well as some increase in electricity inflation.</p>\n<p>\n\tManufactured products’ inflation rose to 3.7 per cent in May, from 3.1 per cent in April. Splitting this category into two gives us the core inflation (measured by CCII) and base metal inflation.<br></p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t<img align=\"left\" alt=\"Riding on fuel, core inflation, WPI jumps to 14-month high in May\" class=\"imgCont\" height=\"372\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/14/full/1528986560-0661.jpg\" title=\"chart\" width=\"620\"></p>\n\n<p>\n\tCore inflation crept higher, to 1.9 per cent, from 1.6 per cent in April, driven by higher inflation in textiles, chemicals, fabricated metal products, and non-metallic <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=mineral+products\" target=\"_blank\">mineral products.</a> Base metal inflation saw a much sharper increase – rising to 15.8 per cent, from 13 per cent in April – as global prices recorded a 22 per cent rise on-year.</p>\n<p>\n\tMeanwhile, overall food inflation (food articles plus manufactured food) rose to 1.1 per cent in May, from 0.7 per cent in April. The increase mainly came from food articles inflation – up at 1.6 per cent, from 0.9 per cent - driven by a higher inflation in cereals and eggs, meat and fish category. Inflation in vegetables saw a sharp increase (more base-effect led), while that in fruits, softened. Pulses inflation continued to fall, albeit at a slower pace. Inflation in manufactured food articles marginally eased to 0.2 per cent, from 0.3 per cent in April.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/reuters/fed-hikes-rates-amid-stronger-inflation-shifts-from-crisis-era-stance-118061400029_1.html\" target=\"_blank\">Fed hikes rates amid stronger inflation, shifts from crisis-era stance</a></strong></p>\n\n<p>\n\tGoing forward, inflationary conditions are likely to firm up. With improving domestic demand conditions, manufacturers will pass on higher input costs to consumers, which will show up in core inflation. On an upward trajectory, crude prices were nearly 18.6 per cent higher on-year in fiscal 2018. <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/crisil\" target=\"_blank\">CRISIL </a>expects another 23 per cent average increase in average crude <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/oil-prices\" target=\"_blank\">oil prices </a>this fiscal. Also, metal prices are firming up.</p>\n<p>\n\tSimilarly, food inflation will have a softening bias this year. It may stay relatively low, given the expectation of a normal monsoon. However, aggressive implementation of the announced minimum support price measures could offset the impact of good monsoons numbers.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "manufactured",
        "14",
        "high",
        "62"
    ],
    "nouns": [
        "impact",
        "month",
        "14",
        "high",
        "May",
        "core",
        "Riding",
        "fuel",
        "inflation",
        "input",
        "bps"
    ],
    "verbs": [
        "impact",
        "core",
        "fuel",
        "input"
    ]
}