{
    "creator": "FE Online",
    "title": "Sensex to hit 30,000 mark by September 2017, instead of March: Citi",
    "link": "https://www.financialexpress.com/market/indian-markets/sensex-to-hit-30000-mark-by-september-2017-instead-of-march-citi/454433/",
    "pubDate": "Thu, 24 Nov 2016 11:09:02 +05:30",
    "dc:creator": "FE Online",
    "content": "Citi expects the Sensex to hit the 30,000 mark by September 2017, as against the earlier projection of March 2017. ",
    "contentSnippet": "Citi expects the Sensex to hit the 30,000 mark by September 2017, as against the earlier projection of March 2017.",
    "guid": "http://www.financialexpress.com/?p=454433",
    "categories": [
        "Indian Markets Do Not Use",
        "Market"
    ],
    "isoDate": "2016-11-24T05:39:02.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "sensex",
            "to",
            "hit",
            "30000",
            "mark",
            "by",
            "september",
            "2017",
            "instead",
            "of",
            "march",
            "citi"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Sensex to hit 30,000 mark by September 2017, instead of March: Citi",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-454440\" src=\"https://images.financialexpress.com/2016/11/sensex-6.jpg\" alt=\"Sensex, Sensex target, Sensex Citi target, Sensex 30,000\" srcset=\"https://images.financialexpress.com/2016/11/sensex-6.jpg 660w, https://images.financialexpress.com/2016/11/sensex-6-300x200.jpg 300w, https://images.financialexpress.com/2016/11/sensex-6-620x413.jpg 620w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Surendra Goyal, Head of India Equity Research at Citi India told CNBC-TV 18 that FIIs (Foreign Institutional Investors) will be spooked by rupee’s depreciation.</figure>\n\t\t\t</section></div><span>\n</span><p>Citi expects the Sensex to hit the 30,000 mark by September 2017, as against the earlier projection of March 2017. Surendra Goyal, Head of India Equity Research at Citi India told CNBC-TV 18 that FIIs (Foreign Institutional Investors) will be spooked by rupee’s depreciation. Goyal believes that it is tough to assess the damage caused by demonetisation. Talking sector-specific, Goyal said that real estate, cement, consumer discretionary, rural-focused NBFCs will face stress for longer time than others on account of demonetisation. Citi is overweight on pharma due to its “reasonable valuation”, Goyal said. He expects pharma sector earnings to be better than IT. As far as the IT goes, Goyal is of the view that the visa issue will compound the problems that the sector is already facing.</p><span>\n</span><p>Meanwhile, Morgan Stanley has kept its March 2017 target unchanged at 30,000, stating that the impact of a US Federal rate hike “seems to be becoming less relevant for the domestic market”. “In the context of the country’s macro stability today that risk (Fed) is less relevant to India. We are pretty comfortable and in fact this is the first time since the liberalisation 25 years ago that India has cut rates against a Fed rate hike (Fed had hiked rates last December but <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a> has lowered rates since then),” Morgan Stanley India Equity Strategist Ridham Desai was reported as saying. “This is a manifestation of the strength of our external balancesheet. We never had the courage to go against the Fed in the past. And our base call is that this will happen the second time when RBI cuts interest rates as against a hike by US Fed,” he added.</p><span>\n</span><span>\n</span><span>\n</span><span>\n</span><p>Besides, PTI reported Ridham Desai as saying that while demonetisation will have some negative impact on the Indian economy in the short term, the scenario looks positive in the long run. “Demonetisation is not a serious issue. People are making a big deal out of it. If there will be a problem in the economy why to think there will not be any response from the policymakers and RBI?” he asked. Interestingly, Desai said GST would have a much larger implication on unaccounted money compared to scrapping of high value notes.</p><span>\n</span><p><em>(With inputs from PTI)</em></p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "30",
        "earlier"
    ],
    "nouns": [
        "mark",
        "March",
        "projection",
        "hit",
        "30",
        "September"
    ],
    "verbs": [
        "mark",
        "March",
        "hit"
    ]
}