{
    "title": "Bank strike: Digital operations, delayed salaries to give some pain ahead",
    "link": "https://www.business-standard.com/article/finance/bank-strike-digital-operations-delayed-salaries-to-give-some-pain-ahead-118053100086_1.html",
    "pubDate": "Thu, 31 May 2018 06:48:00 +0530",
    "content": "Various rounds of wage negotiations between banks and unions have failed to make headway",
    "contentSnippet": "Various rounds of wage negotiations between banks and unions have failed to make headway",
    "guid": "https://www.business-standard.com/article/finance/bank-strike-digital-operations-delayed-salaries-to-give-some-pain-ahead-118053100086_1.html",
    "isoDate": "2018-05-31T01:18:00.000Z",
    "sentiment": {
        "score": -4,
        "comparative": -0.36363636363636365,
        "tokens": [
            "bank",
            "strike",
            "digital",
            "operations",
            "delayed",
            "salaries",
            "to",
            "give",
            "some",
            "pain",
            "ahead"
        ],
        "words": [
            "pain",
            "delayed",
            "strike"
        ],
        "positive": [],
        "negative": [
            "pain",
            "delayed",
            "strike"
        ]
    },
    "article": {
        "title": "Bank strike: Digital operations, delayed salaries to give some pain ahead",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>Branch-level operations, including cheque clearance and cash deposits, took a hit on Wednesday after 1 million <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=bank+employees\" target=\"_blank\">bank employees </a>participated on the first day of a two-day nationwide strike called by unions demanding wage hike.</p><p>\nWhile ATM functions were not affected much, about 80 per cent were operational, some digital transactions were hit.</p><p>\nA total of 3.9 million instruments, including cheques and demand drafts worth Rs 217 billion could not be processed by <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=banks\" target=\"_blank\">banks </a>during the day, said C H Venkatachalam, general secretary of the All India Bank Employees' Association. The impact is expected to be similar on Thursday.</p><p>\nThe strike resulted in the shutdown of around 85,000 branches of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=public+sector+banks\" target=\"_blank\">public sector </a><a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=banks\" target=\"_blank\">banks </a>and some of those of the older private sector banks, for the full day, Venkatachalam said. However, operations of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=banks\" target=\"_blank\">banks </a>such as ICICI Bank, HDFC Bank and Axis Bank were normal in most states.</p><p>\nTrade unions have opposed the Indian Banks Association's (IBA's) offer of a 2 per cent wage hike. Banks, saddled with high levels of bad loans, have expressed their inability to offer a bigger wage hike.</p><p>\nAt least 88 per cent employees working in <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=public+sector+banks\" target=\"_blank\">public sector banks </a>did not report to work, according to a preliminary assessment report.</p><p>\nBihar, Jharkhand, West Bengal and the seven north-eastern states were the worst hit.</p><p>\nIn Madhya Pradesh, 97 per cent bank staff did not report to work, followed by Karnataka and Chandigarh (95 per cent), Gujarat (94.5 per cent) and Chhattisgarh (94 per cent).</p><p>\nIn some states, a few branches of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=private+sector+banks\" target=\"_blank\">private sector banks </a>were functioning. In Maharashtra, 70 per cent of the workers in private banks skipped work.</p><p>\nSince the strike coincides with the month-end cycle, salary withdrawals may be affected. Owing to the strike call, several government departments had credited advance salaries to employees on May 29.</p><p>\nAccording to industry body Assocham, the two-day strike called by the Union Forum of Bank Unions (UFBU), representing nine unions, will affect transactions worth up to Rs 200 billion.</p><p>\nBranch deposits, treasury operations and money market operations could also be hit.</p><p>\nBankers, however, downplayed the impact and said most of them were prepared in advance because the strike notice was given by unions two weeks in advance. \"We have alerted all our regions and will ensure that <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=atms\" target=\"_blank\">ATMs </a>run at normal capacity. While there will be some treasury impact, a lot of operations are now digital and are unlikely to be hit,\" State Bank of India Chief Operating Officer Neeraj Vyas said.</p><p>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/current-affairs/bank-strike-paralyse-operations-west-bengal-kerala-bihar-among-worst-hit-118053100143_1.html\" target=\"_blank\">Bank strike paralyses operations; Bengal, Kerala, Bihar among worst hit</a></strong><br>A <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=reserve+bank+of+india\" target=\"_blank\">Reserve Bank of India </a>(RBI) official told Press Trust of India that some <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=digital+banking\" target=\"_blank\">digital banking </a>transactions were done through electronic systems such as RTGS, but the functioning of banks' servers was severely affected. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=digital+banking\" target=\"_blank\">Digital banking </a>comprised about 5 per cent of banks' total operations, the official added.</p><p>\nVarious rounds of wage negotiations between banks and unions have failed to make headway. Bank unions have argued that the employee workload had increased \"drastically\" due to the implementation of the government's flagship schemes such as Mudra and Jan Dhan, as well as the demonetisation exercise. In the last <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=wage+revision\" target=\"_blank\">wage revision </a>in 2012, for the period between November 1, 2012 and October 31, 2017, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=bank+employees\" target=\"_blank\">bank employees </a>were awarded a 15 per cent hike.</p><p>\nAnother point of contention for unions was the decision of six public sector banks, including State Bank of India, Oriental Bank of Commerce and Union Bank, to restrict wage negotiations to Scale-III officers, or till the senior manager level. However, bank unions are demanding a wage hike for officers up to Scale-VII, which will include general managers, deputy general managers, assistant general managers and divisional managers.</p><p>\nThe office of the Central Labour Commissioner held a meeting with bank unions and managements on Monday. However, disappointed with the bankers' response, unions decided to go ahead with the strike. The CLC advised banks to swiftly set up a meeting with unions and offer a fresh wage hike. It also told banks to cover all officers in wage negotiations since it might \"not be conducive for amicable industrial relations.\"<br></p><hr>\n<em>(With inputs from Gireesh Babu in Chennai and Nikhat Hetavkar in Mumbai)</em><br>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "delayed",
        "Digital",
        "ahead",
        "Various"
    ],
    "nouns": [
        "Bank",
        "banks",
        "give",
        "strike",
        "headway",
        "operations",
        "pain",
        "wage"
    ],
    "verbs": [
        "Bank",
        "give",
        "strike",
        "pain",
        "wage"
    ]
}