{
    "title": "Maruti Suzuki's Swift keeps the lead, breaks a-car-a-minute sales barrier",
    "link": "https://www.business-standard.com/article/companies/maruti-suzuki-s-swift-keeps-the-lead-breaks-a-car-a-minute-sales-barrier-118032900446_1.html",
    "pubDate": "Thu, 29 Mar 2018 22:00:00 +0530",
    "content": "Two editions down and 13 years old, the old warhorse from the Maruti Suzuki stable is still in the list of bestsellers",
    "contentSnippet": "Two editions down and 13 years old, the old warhorse from the Maruti Suzuki stable is still in the list of bestsellers",
    "guid": "https://www.business-standard.com/article/companies/maruti-suzuki-s-swift-keeps-the-lead-breaks-a-car-a-minute-sales-barrier-118032900446_1.html",
    "isoDate": "2018-03-29T16:30:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "maruti",
            "suzuki's",
            "swift",
            "keeps",
            "the",
            "lead",
            "breaks",
            "a-car-a-minute",
            "sales",
            "barrier"
        ],
        "words": [
            "barrier",
            "swift"
        ],
        "positive": [
            "swift"
        ],
        "negative": [
            "barrier"
        ]
    },
    "article": {
        "title": "Maruti Suzuki's Swift keeps the lead, breaks a-car-a-minute sales barrier",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tTen weeks into its launch, the third generation <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=swift\" target=\"_blank\">Swift </a>from Maruti Suzuki has already clocked a cumulative booking of 100,000 cars, implying an average booking of one car every minute. Not only does this make <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=swift\" target=\"_blank\">Swift </a>the envy of every rival car makers, but it also turns up the heat in house because the numbers are way ahead of those notched up by the company’s recent bestsellers like the new Dzire and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=baleno\" target=\"_blank\">Baleno.</a></p>\n<p>\n\tLaunched at the Auto Expo early last month, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=swift\" target=\"_blank\">Swift </a>already has a waiting period of three to four months for different variants. “Some of our recent bestsellers- the new Dzire and Baleno- had done exceedingly well but we did not achieve this landmark (100,000 bookings) in such a short span of the launch,” said R S Kalsi, senior executive director (marketing &amp; sales) at Maruti Suzuki.</p>\n<p>\n\tThe new Swift begins at a price of Rs 499,000 (ex-showroom, Delhi) for the petrol variant, Rs 19,000 more than the outgoing entry model. The price of the entry level diesel variant is, however, cheaper by Rs 21,000 and begins at Rs 599,000 as more buyers now prefer petrol over diesel. Therefore, the gap between entry variants of petrol and diesel Swift is down to Rs 100,000 compared to Rs 140,000 in the previous generation. <br></p><p>\n\t\t<img align=\"left\" alt=\"Maruti Suzuki's Swift keeps the lead, breaks a-car-a-minute sales barrier\" class=\"imgCont\" height=\"464\" src=\"http://bsmedia.business-standard.com/_media/bs/img/article/2018-03/29/full/1522340760-1938.jpg\" title=\"Maruti suzuki swift\" width=\"620\"></p>\n<p>\n\tSwift was first launched in the year 2005. The first generation of Swift kind of defined the premium hatchback segment in the country. It challenged the set notions about small cars in general and about cars from <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=maruti+suzuki+in\" target=\"_blank\">Maruti Suzuki in </a>particular that were mostly seen as hand-me-downs from the Japanese partner. Design was not a big concern and the small car buyer was expected to readily accept anything and everything from ‘boxy shapes to bland, simple lines’, the company said.</p>\n<p>\n\tWith Swift, Maruti Suzuki claims that it questioned these trade-offs. The 2005 model sported a bold and aggressive design for its times while being reliable and economical. It was contemporary and yet functional, appealing to the youth and also to those looking for a family car. “More than a car, it was a refreshing new thought process. From this or that, the Swift stood for this and that,” the company said.</p>\n<p>\n\tIt was seen as a “coming of age” moment for the Indian middle class buyer. While demonstrating a new design sensibility from an Indian auto maker, it retained the focus on value-pricing and thereby appealed to the young consumer. The volumes spoke for Swift. Swift’s volume increased for nine consecutive years after the launch irrespective of the fluctuations in the industry growth. The first generation of Swift made way for the second generation in mid-2011 after clocking cumulative volume of 606,004 units.<br></p><p>\n\t\t<img align=\"left\" alt=\"Maruti Suzuki's Swift keeps the lead, breaks a-car-a-minute sales barrier\" class=\"imgCont\" height=\"296\" src=\"http://bsmedia.business-standard.com/_media/bs/img/article/2018-03/29/full/1522340821-258.jpg\" title=\"info\" width=\"400\"></p>\n<p>\n\tThe second generation was sold till December 2017 with cumulative sales of 1.19 million, almost double that of the first generation. It has been a top performer for the company and has consistently been among the top five models sold in the country.</p>\n<p>\n\t“This is the brand that has redefined the Indian automobile industry. Swift was launched in India in 2005 and since then it created a glorious legacy of its own.</p>\n<p>\n\tBuyers loved the car for its sporty stance, bold attitude and exciting performance,” Kenichi Ayukawa, managing director and chief executive officer said last month.</p>\n<p>\n\tTalking about the response to the new Swift, Kalsi said the first two generations of the Swift had been equally popular. “We sold almost 1.8 million units of the Swift between the first two generations. This is the third full model change of the Swift. We have been raising the bar every time in style, interiors, technology and fuel efficiency”. Mileage has improved and the new Swift claims to offer a jump of approximately ten per cent in fuel efficiency.</p>\n<p>\n\tKalsi said the previous generations of the Swift and Dzire were extensions of each other. However, this time the design and style of the two models are distinct. “We have tried to keep the brand relevant by keeping it youthful. The focus is on ensuring a long term acceptability of a brand. There are many models in the market that remain a hero for six months or a half hour and then start declining,” added Kalsi.<br></p><p>\n\t\t<img align=\"left\" alt=\"Maruti Suzuki's Swift keeps the lead, breaks a-car-a-minute sales barrier\" class=\"imgCont\" height=\"233\" src=\"http://bsmedia.business-standard.com/_media/bs/img/article/2018-03/29/full/1522340852-8141.jpg\" title=\"info\" width=\"550\"></p>\n<p>\n\tOne-third of the booking has come for the top variant as Swift, for the first time, offers the auto gear shift technology. The automaker says that it has taken into account some of the big concerns of those behind the wheels today, improved acceleration performance, strength and rigidity, spacious and a more comfortable driving experience. So far consumers seem to have bought into the promise of the brand, hoping that it will live up to its legacy. <br></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "stable",
        "minute",
        "Swift",
        "Two",
        "down",
        "13",
        "old"
    ],
    "nouns": [
        "sales",
        "stable",
        "car",
        "minute",
        "lead",
        "years",
        "Swift",
        "barrier",
        "Two",
        "down",
        "13",
        "old",
        "warhorse",
        "list"
    ],
    "verbs": [
        "stable",
        "lead",
        "down",
        "list"
    ]
}