{
    "creator": "FE Bureau",
    "title": "Maharashtra to provide financial aid to tur farmers",
    "link": "https://www.financialexpress.com/market/commodities/maharashtra-to-provide-financial-aid-to-tur-farmers/1196424/",
    "pubDate": "Thu, 07 Jun 2018 02:34:39 +05:30",
    "dc:creator": "FE Bureau",
    "content": "By May end, Maharashtra had recorded procurement of around 1 lakh tonne of chana and around 3.24 lakh tonne of tur.",
    "contentSnippet": "By May end, Maharashtra had recorded procurement of around 1 lakh tonne of chana and around 3.24 lakh tonne of tur.",
    "guid": "https://www.financialexpress.com/?p=1196424",
    "categories": [
        "Commodities",
        "Market"
    ],
    "isoDate": "2018-06-06T21:04:39.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "maharashtra",
            "to",
            "provide",
            "financial",
            "aid",
            "to",
            "tur",
            "farmers"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Maharashtra to provide financial aid to tur farmers",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1196428\" src=\"https://images.financialexpress.com/2018/06/Tur-Dal.jpg\" alt=\"maharashtra, financial aid, tur farmers\" srcset=\"https://images.financialexpress.com/2018/06/Tur-Dal.jpg 660w, https://images.financialexpress.com/2018/06/Tur-Dal-300x200.jpg 300w, https://images.financialexpress.com/2018/06/Tur-Dal-620x413.jpg 620w, https://images.financialexpress.com/2018/06/Tur-Dal-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The Maharashtra government would provide financial grant of Rs 1,000 per quintal to those farmers whose tur and gram could not be purchased by the administration before the May 31 deadline.</figure>\n\t\t\t</section></div><span>\n</span><p>The Maharashtra government would provide financial grant of Rs 1,000 per quintal to those farmers whose tur and gram could not be purchased by the administration before the May 31 deadline, chief minister Devendra Fadnavis has said after the state cabinet meet. “The government has taken an important decision for farmers. We will provide a financial grant of rs 1,000 per quintal for farmers, subject to verifications, whose tur and chana were not purchased by us,” he said. The state government had set up tur procurement target of 44.6 lakh quintal.</p><span>\n</span><p>Farmers in Maharashtra, like their counterparts from other states, have been demanding better remunerative price for their produce, a complete loan waiver, and implementation of recommendations of the Swaminathan Commission. The Centre had extended the deadline for tur procurement in Maharashtra till May 31 this year. By May end, Maharashtra had recorded procurement of around 1 lakh tonne of chana and around 3.24 lakh tonne of tur. Absence of storage space had prevented Maharashtra from meeting its quota, though procurement of tur was extended by a month. The government has been seeking a further extension for the procurement of tur. However there has been no response from the Centre yet.</p><span>\n</span><p>The state government had started purchasing tur from farmers by offering them guaranteed rates following bumper production. Fadnavis said the government would also give a financial aid of Rs 160 crore to farmers whose crops got damaged due to unseasonal rains or hailstorms. The chief minister also announced a special subsidy for milk producers. “To aid milk producing farmers, the government had earlier decided to give a special subsidy for converting milk into milk powder. We are now thinking of giving an export incentive to farmers to further monetise their produce. We have formed a team that will look into the issue,” the CM said.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "financial",
        "recorded",
        "24"
    ],
    "nouns": [
        "Maharashtra",
        "procurement",
        "aid",
        "May",
        "end",
        "lakh",
        "tonne",
        "24"
    ],
    "verbs": [
        "provide",
        "aid",
        "end"
    ]
}