{
    "title": "RBI increases repo rate by 25 bps to 6.25%; maintains neutral stance",
    "link": "https://www.business-standard.com/article/finance/rbi-increases-repo-rate-by-25-bps-to-6-25-maintains-neutral-stance-118060700027_1.html",
    "pubDate": "Thu, 07 Jun 2018 01:07:00 +0530",
    "content": "The central bank's April policy tone was dovish and it had actually lowered inflation forecasts for the first and second half of 2018-19",
    "contentSnippet": "The central bank's April policy tone was dovish and it had actually lowered inflation forecasts for the first and second half of 2018-19",
    "guid": "https://www.business-standard.com/article/finance/rbi-increases-repo-rate-by-25-bps-to-6-25-maintains-neutral-stance-118060700027_1.html",
    "isoDate": "2018-06-06T19:37:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "rbi",
            "increases",
            "repo",
            "rate",
            "by",
            "25",
            "bps",
            "to",
            "625",
            "maintains",
            "neutral",
            "stance"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "RBI increases repo rate by 25 bps to 6.25%; maintains neutral stance",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tThe six-member monetary policy committee (MPC) on Wednesday unanimously voted for a rate hike, citing the fear of inflation, partly flared by the recent spike in crude oil prices. The hike in policy <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=repo+rate\" target=\"_blank\">repo rate </a>to 6.25 per cent from 6 per cent was contrary to market expectation that the central bank will hold rates and the unanimous decision came as a surprise to the markets.</p>\n<p>\n\tThe central bank’s April policy tone was dovish and it had actually lowered inflation forecasts for the first and second half of 2018-19. On Wednesday, the inflation outlook was revised up once again.</p>\n<p>\n\tWith the hike in the June policy, the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=reserve+bank\" target=\"_blank\">Reserve Bank </a>of India (RBI) has reversed the rate cutting cycle it had engaged in since January 15, 2015. The last rate hike happened on January 28, 2014, when the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=repo+rate\" target=\"_blank\">repo rate </a>was increased to 8 per cent. The last policy action was in August 2017, when the central bank had lowered the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=repo+rate\" target=\"_blank\">repo rate </a>by 25 basis points (bps).<br></p><p>\n\t\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/finance/rbi-announces-hike-in-limits-for-cheaper-loan-for-affordable-housing-118060600824_1.html\" target=\"_blank\">RBI announces hike in limits for cheaper loan for affordable housing</a></strong></p>\n\n<p>\n\tEven as the central bank kept its stance ‘neutral’, the bond market saw the policy statement as hawkish, expecting at least one more rate hike soon. The 10-year gilt yield, which had already factored in a 25-bp hike in rates, jumped 8 bps after the policy announcement. The 10-year gilt yield closed at 7.92 per cent, up from its previous close of 7.83 per cent.</p>\n<p>\n\tWednesday’s policy statement showed that the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=mpc\" target=\"_blank\">MPC </a>was clearly concerned about rising prices, and, importantly, households’ expectations about the future course of prices. The May 2018 round of the RBI’s survey of households reported a significant rise in households’ inflation expectations of 90 bps and 130 bps, respectively, for three-month and one-year ahead horizons.</p>\n<p>\n\tThis “significant rise” in households’ expectations, “could feed into wages and input costs in the coming months”, the RBI’s policy statement noted.</p>\n<p>\n\t\t<img align=\"left\" alt=\"RBI increases repo rate by 25 bps to 6.25%; maintains neutral stance\" class=\"imgCont\" height=\"459\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/07/full/1528313714-639.jpg\" title=\"graph\" width=\"193\"></p>\n\tOnce again changing its inflation forecast, from 4.7-5.1 per cent for the first half and 4.4 per cent in the second half, to 4.8-4.9 per cent and 4.7 per cent, respectively, the RBI said it had not anticipated a 12 per cent rise ($66 to $74 a barrel) in the Indian basket of crude oil between the April and June policies.\n<p>\n\tRetail inflation rose sharply to 4.6 per cent in April from 4.3 per cent in March. Core inflation, which includes food and fuel, remained consistently high at 5.8 per cent in April, up from 5.23 per cent in March.</p>\n<p>\n\t“Crude oil prices have been volatile recently and this imparts considerable uncertainty to the inflation outlook – both on the upside and the downside,” the policy statement said. Besides, the policy statement also cited uncertainty around global financial markets, and the possible second-round effect of increase in HRA by state governments.<br></p>\n<p>\n\t“Underlying the MPC’s decision was the concern that headline inflation has been sharper than anticipated and that it has remained above the target of 4 per cent for six months in succession,” RBI Governor Urjit Patel said in his opening remarks.</p>\n<p>\n\t“An abiding concern of the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=mpc\" target=\"_blank\">MPC </a>has been that the impulses of growth were nascent and taking root. In its current assessment, domestic economic activity has exhibited revival in recent quarters, and the output gap has almost closed,” he said. Investment activity was recovering well and could receive a further boost from resolution of distressed assets.</p>\n<p>\n\t“Going forward, we will continue to be cautious and remain vigilant in which the balance of risks around both – growth and inflation – play out,” Patel said.</p>\n<p>\n\tGenerally, the central bank changes its stance first and then moves to change the policy rate in a reversing cycle. But this time the central bank kept its stance unchanged while going for a hike.</p>\n<p>\n\tPatel defended this choice saying it was standard practice elsewhere. “It is not conflicting at all as a neutral stance leaves all options open and other central banks do the same. There is no tension between the two, the committee felt that there was enough uncertainty for us to keep to the neutral stance and yet respond to the risks to inflation target that have emerged in recent months,” Patel said.</p>\n<p>\n\tEconomists said the Indian central bank was actually moving in line with other central banks in the region that have hiked their rates ahead of the withdrawal of accommodative policies of major global central banks. Indonesia and the Philippines have hiked their rates to protect their local currencies and be prepared against the outflow of foreign investments, something that India is also witnessing now.</p>\n<p>\n\t“Pre-emptive policy tightening is preferable over reactive policy changes. Investors have become sensitive to economies that face overheating risks, characterised by twin deficits and high inflation, that could potentially unsettle macroeconomic stability,” noted Radhika Rao, India Economist at DBS Bank.</p>\n<p>\n\tStating that the central bank may have hiked a little earlier than expected, Su Sian Lim, senior economist at BNP Paribas, said the language of the central bank suggested that it would “prefer to take a gradual approach to tightening.”</p>\n<p>\n\tBoth Rao and Lim expect another 25 <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=basis+point\" target=\"_blank\">basis point </a>hike in the calendar year, even as early as in August.</p>\n<p>\n\tAccording to Jayesh Mehta, head of treasury at Bank of America Merrill Lynch, bond yields may breach the 8 per cent mark unless the central bank engages in liquidity infusion operations through secondary market bond purchases. Patel said the RBI would provide adequate liquidity to anchor overnight call rates around the policy repo rate.</p>\n<p>\n\t“We will watch evolving liquidity conditions to determine our choice of instruments for both transient and durable liquidity management,” said deputy governor Viral Acharya.</p>\n<p>\n\tAmong other policy measures, the central bank said state development loans could be now valued at market price, and not a uniform mark-up of 25 basis points above gilt yields. It once again allowed banks to spread their nominal losses on their bond portfolios over four quarters.</p><p>\n\t\t<img align=\"left\" alt=\"RBI increases repo rate by 25 bps to 6.25%; maintains neutral stance\" class=\"imgCont\" height=\"565\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/07/full/1528313774-3691.jpg\" title=\"graph\" width=\"328\"></p>\n\tThe central bank also said it would allow urban cooperative banks to become small finance banks, and took measures to help micro, small and medium enterprises defer their loans beyond 180 days, irrespective of their goods and services tax registration.\n<p>\n\tIn a major move, the central bank expanded the definition of the affordable housing scheme to loans up to Rs 3.5 million from Rs 2.8 million.</p>\n<p>\n\tIt said banks could now avail a lower haircut for gilts submitted by them for liquidity operations, and allowed more participants to short-sell gilts.</p>\n<p>\n\tThe RBI also said it would be allowing more players in the payments system, while it was constituting a task force for implementing a public credit registry for companies.</p><p>\n\t\t<img align=\"left\" alt=\"RBI increases repo rate by 25 bps to 6.25%; maintains neutral stance\" class=\"imgCont\" height=\"579\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/07/full/1528313790-36.jpg\" title=\"graph\" width=\"328\"></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "25",
        "neutral",
        "central",
        "dovish",
        "lowered",
        "first",
        "second",
        "half",
        "19"
    ],
    "nouns": [
        "bank",
        "rate",
        "RBI",
        "policy",
        "stance",
        "inflation",
        "25",
        "bps",
        "neutral",
        "central",
        "April",
        "tone",
        "first",
        "second",
        "half",
        "19"
    ],
    "verbs": [
        "bank",
        "rate",
        "tone",
        "second"
    ]
}