{
    "creator": "Bloomberg",
    "title": "Raghuram Rajan sees stress in emerging markets; will Asia face it too? What former RBI Governor says",
    "link": "https://www.financialexpress.com/economy/raghuram-rajan-sees-stress-in-ems-will-asia-face-it-too-this-is-what-former-rbi-governor-says/1193844/",
    "pubDate": "Tue, 05 Jun 2018 09:28:05 +05:30",
    "dc:creator": "Bloomberg",
    "content": "Tipping the Federal Reserve to raise interest rates another three times this year, Rajan said that emerging markets are in a stronger position to absorb those hikes compared with the so-called taper tantrum in 2013, however, warning that accidents can happen.",
    "contentSnippet": "Tipping the Federal Reserve to raise interest rates another three times this year, Rajan said that emerging markets are in a stronger position to absorb those hikes compared with the so-called taper tantrum in 2013, however, warning that accidents can happen.",
    "guid": "https://www.financialexpress.com/?p=1193844",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-05T03:58:05.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.058823529411764705,
        "tokens": [
            "raghuram",
            "rajan",
            "sees",
            "stress",
            "in",
            "emerging",
            "markets",
            "will",
            "asia",
            "face",
            "it",
            "too?",
            "what",
            "former",
            "rbi",
            "governor",
            "says"
        ],
        "words": [
            "stress"
        ],
        "positive": [],
        "negative": [
            "stress"
        ]
    },
    "article": {
        "title": "Raghuram Rajan sees stress in emerging markets; will Asia face it too? What former RBI Governor says",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1186700\" src=\"https://images.financialexpress.com/2018/05/RaghuramRajan.jpg\" alt=\"Raghuram Rajan, World Hindu Congress, Chicago, Vivekanand, VHP, Vishwa Hindu Parishad, former RBI Governor, Second World Hindu Congress, Sangh Parivar, Rashtriya Swayamsevak Sangh\" srcset=\"https://images.financialexpress.com/2018/05/RaghuramRajan.jpg 660w, https://images.financialexpress.com/2018/05/RaghuramRajan-300x200.jpg 300w, https://images.financialexpress.com/2018/05/RaghuramRajan-620x413.jpg 620w, https://images.financialexpress.com/2018/05/RaghuramRajan-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Rajan said that emerging markets are in a stronger position to absorb US rate hikes compared to 2013.</figure>\n\t\t\t</section></div><span>\n</span><p>Emerging markets will face stress as they cope with a stronger dollar and rising interest rates but Asia appears to be insulated, for now, according to <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/raghuram-rajan/\">Raghuram Rajan</a>, former governor of the Reserve Bank of India. Tipping the Federal Reserve to raise interest rates another three times this year, Rajan said that developing economies are in a stronger position to absorb those hikes compared with the so-called taper tantrum in 2013. But he cautioned that accidents can happen.</p><span>\n</span><p>“There will be still stresses for emerging markets, they will have to cope with a rising dollar and rising international interest rates and the flow back of capital flows,” Rajan said in an interview with Bloomberg Television’s Haslinda Amin in Singapore on Tuesday. He cited Turkey, Argentina and Brazil as risks and also highlighted Italy as a key concern. For Asia, narrow current account deficits, moderate inflation and resilient currencies mean the region is insulated. “Some of them can get stressed,” he said. “At this point I would say, amongst the big ones, no clear and present danger.”</p><span>\n</span><p><strong>Currency rout</strong></p><span>\n</span><p>After a stellar run than began in early 2016, emerging-market assets have come under severe pressure in recent months, most notably in Argentina, where the peso has plunged 19 percent against the dollar this quarter, and in Turkey, where the lira is down 14 percent. Economists like Andrew Tilton at Goldman Sachs Group Inc. say economic fundamentals are mostly intact, while fund managers like Patricia Ribeiro at American Century Investment Management say investors aren’t treating emerging markets as a monolithic bloc anymore.</p><span>\n</span><p>“I can’t find one reason today that we can tie all these countries together,” said New York-based Ribeiro, whose main fund has beaten 91 percent of its peers over the past 12 months. It’s “completely the opposite of what we saw back in the 1990s” when these countries pegged their currencies at very depreciated prices to boost exports and generate dollars, she said.</p><span>\n</span><p>In Asia, India has been one of the hardest hit economies in the emerging-market rout, with the rupee down almost 5 percent against the dollar this year. That’s adding to pressure on inflation and pushing the central bank closer to an interest-rate hike, possibly as early as Wednesday.</p><span>\n</span><p><strong>Fed tightening</strong></p><span>\n</span><p>Current <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a> governor Urjit Patel made a plea to the Fed to slow the pace that it’s shrinking its balance sheet to help emerging economies cope with the turmoil. Rajan said the Fed will probably stay the course with its planned tightening cycle since it’s focused on domestic growth and labor-market conditions. The Fed meets next week and is expected to raise interest rates.</p><span>\n</span><p>Rajan brushed off speculation that he’s a possible successor to Mark Carney as governor of the Bank of England, saying he is “perfectly happy where I am” in his current job at the University of Chicago Booth School of Business. He declined to say if he’d been approached for the job. On trade, Rajan said the world isn’t ready for the dismantling of the current global order that is threatened by rising protectionism.</p><span>\n</span><p><strong>Here are more of his comments on trade:</strong></p><span>\n</span><p>“The world is not prepared for the entity at the center of the global financial and monetary order and trade order turning around and saying I don’t believe in all of this, I want to change things. Now the system has been built by the U.S. around the U.S. and now the U.S. actually doesn’t believe in using the multilateral system. This is a very big change and we are not prepared for it.” “The problem, of course, is positions harden. You make a threat, someone makes a counter threat, soon you find you cannot back off. This is true of war, it is true of trade war.</p><span>\n</span><p>One of the big worries is that threats are being made left, right and center by strongmen who want to be seen a strong and the room to back off is far more limited.” “My worry is that, what you may think of as bargaining ploys — working out the art of the deal — soon become hardened positions which are very hard to back off. And then you enter actual conflagration and that, combined with the high degree of leverage and asset prices that are prices to perfection, that’s a potent volatile combination.”</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "warning",
        "former",
        "three",
        "emerging",
        "Federal"
    ],
    "nouns": [
        "face",
        "year",
        "Governor",
        "warning",
        "taper",
        "raise",
        "Reserve",
        "will",
        "former",
        "RBI",
        "Asia",
        "three",
        "times",
        "stress",
        "Federal",
        "interest",
        "rates",
        "position",
        "so",
        "tantrum"
    ],
    "verbs": [
        "face",
        "taper",
        "raise",
        "Reserve",
        "will",
        "stress",
        "interest",
        "position",
        "absorb",
        "happen"
    ]
}