{
    "title": "$7 billion Of TCS investments guided by payout plan",
    "link": "https://timesofindia.indiatimes.com/business/india-business/7-billion-of-tcs-investments-guided-by-payout-plan/articleshow/64463796.cms",
    "pubDate": "Tue, 05 Jun 2018 10:30:00 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/7-billion-of-tcs-investments-guided-by-payout-plan/articleshow/64463796.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64463796.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/7-billion-of-tcs-investments-guided-by-payout-plan/articleshow/64463796.cms",
    "isoDate": "2018-06-05T10:30:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "7",
            "billion",
            "of",
            "tcs",
            "investments",
            "guided",
            "by",
            "payout",
            "plan"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "$7 billion Of TCS investments guided by payout plan",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>NEW DELHI: </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Tata-Consultancy-Services\">Tata Consultancy Services</a><span> (</span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/TCS\">TCS</a><span>) is bunching the Rs 47,700 crore of its cash reserves in short and long-tenure securities to balance its need for easy </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/liquidity\">liquidity</a><p> with safety as it looks to make significant payouts to shareholders each year.\n\n</p><p>Asia’s largest software services provider invested about 53 per cent of its reserves in government securities as of March 31, with the rest spread over deposits, mutual funds and corporate paper, according to TCS’s annual report. Investments declined 1.4 per cent from the previous financial year’s Rs 48,400 crore after last year’s share buyback, which the company says was India’s largest.\n</p><span>“We are essentially saying that we will distribute close to 80-to-100 per cent of our free reserves, free cash generated a year,” Chief Executive Officer </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Rajesh-Gopinathan\">Rajesh Gopinathan</a><span> said in an interview in Mumbai. “We formed this dumbbell-shaped holding because we have core holdings, which are long tenure, and then we have a set of holdings that are more short tenure because during the course of the year it has to be liquidated and paid off.”\n</span><br><span>\n</span><br><span>Software services firms, which have been hoarding cash, are under pressure to return money to shareholders via buybacks and dividends as the outlook for the industry dimmed with clients cutting IT budgets and the US government cracking down on the work visas the companies have long depended on. Gopinathan said the industry has been overdoing the negativity and his aim is to return to double-digit revenue growth.\n</span><br><span>\n</span><br><span>The company’s cash-distribution plan is one of the primary drivers of its investment strategy rather than returns maximization, Gopinathan said. That exposes its holdings to the vagaries of the market, with a Bloomberg index tracking total returns on India’s 10-year bonds down about 2 percent this year as markets look ahead to higher benchmark interest rates.\n</span><br><span>\n</span><br><span>“Neither on the tenure side, nor on the instrument side, we are not changing much,” said Gopinathan. “The core holdings keep on getting consolidated into long-duration instruments.”\n</span><br><span>\n</span><p>TCS’s approach to its currency exposure is similar, with the firm guarding against changes in the value of the rupee against major peers including the dollar, euro, pound, Canadian and Australian dollars. The rupee has been the worst performer in Asia after the Philippines, dropping 4.8 percent against the U.S. dollar.\n</p><span>\n</span></div></div>"
    },
    "adjectives": [
        "billion",
        "guided",
        "10",
        "left",
        "top",
        "right"
    ],
    "nouns": [
        "billion",
        "plan",
        "india",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo"
    ],
    "verbs": [
        "plan",
        "border",
        "align",
        "style",
        "top",
        "right"
    ]
}