{
    "creator": "Shubham Verma",
    "title": "Computex 2018: Asus’ new ZenBook Pro laptop has a touchscreen display instead of touchpad",
    "link": "https://www.financialexpress.com/industry/technology/computex-2018-asus-new-zenbook-pro-laptop-has-a-touchscreen-display-instead-of-touchpad/1194901/",
    "pubDate": "Tue, 05 Jun 2018 22:57:30 +05:30",
    "dc:creator": "Shubham Verma",
    "content": "Asus ZenBook Pro introduces the all-new ScreenPad to the world, which is more like an extended version of the Touch Bar on MacBook Pro launched by Apple last year",
    "contentSnippet": "Asus ZenBook Pro introduces the all-new ScreenPad to the world, which is more like an extended version of the Touch Bar on MacBook Pro launched by Apple last year",
    "guid": "https://www.financialexpress.com/?p=1194901",
    "categories": [
        "Industry",
        "Technology"
    ],
    "isoDate": "2018-06-05T17:27:30.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "computex",
            "2018",
            "asus’",
            "new",
            "zenbook",
            "pro",
            "laptop",
            "has",
            "a",
            "touchscreen",
            "display",
            "instead",
            "of",
            "touchpad"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Computex 2018: Asus’ new ZenBook Pro laptop has a touchscreen display instead of touchpad",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1194910\" src=\"https://images.financialexpress.com/2018/06/asus_zenbook_pro.jpg\" alt=\"asus, asus zenbook pro price, asus zenbook pro\" srcset=\"https://images.financialexpress.com/2018/06/asus_zenbook_pro.jpg 660w, https://images.financialexpress.com/2018/06/asus_zenbook_pro-300x200.jpg 300w, https://images.financialexpress.com/2018/06/asus_zenbook_pro-620x413.jpg 620w, https://images.financialexpress.com/2018/06/asus_zenbook_pro-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Asus ZenBook Pro comes with up to 4K UHD LCD display that comes with an optional touchscreen</figure>\n\t\t\t</section></div><span>\n</span><p>At Computex 2018, <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/asus/\">Asus</a> showcased the culmination of every laptop ever seen to date. The Taiwanese company launched the world’s first laptop that features a touchscreen in the place of the regular touchpad. Called the Asus ZenBook Pro, the laptop introduces the all-new ScreenPad to the world, which is more like an extended version of the Touch Bar on MacBook Pro launched by Apple last year – but without the weird placement. The Asus ZenBook Pro will go on sale in mid-July at a starting price of $2,299 (roughly Rs 1.55 lakh).</p><span>\n</span><p>The Asus ZenBook Pro comes with top-of-the-line specifications but the most intriguing hardware you’ll see on the devices is the integrated touchscreen – ScreenPad – in the place of a touchpad. It’s essentially a dumbed-down smartphone that serves as an input tool, much like the regular touchpad, besides providing additional functionalities. It’s comparable to what Apple has done with the Touch Bar on the MacBook Pro. You can launch apps, calculator, calendar, and even open a numeric keypad to ease out the pain of reaching the number keys on the top.</p><span>\n</span><p>What’s more, the 5.5-inch full-HD ScreenPad does is the ability to play YouTube videos – on both the inbuilt display and on the laptop’s display. You can even drag the app windows down from the main display of the laptop to the ScreenPad so that you work in a minuscule setup. The ability to switch between the displays is carried out by the F6 button. The ScreenPad can also double up a toggle for settings – mostly the connectivity options, brightness control, and other app-centric controls, much like what you get on the MacBook Pro’s Touch Bar.</p><span>\n</span><p>For the specifications, the Asus ZenBook Pro comes with up to 4K UHD LCD display that comes with an optional touchscreen. The device is powered by up to Intel Core i9 while the lower processor variants include Intel Core i7 and Core i5. You get up to 16GB RAM and up to 1TB PCIe SSD storage without any HDD storage. For graphics, the Asus ZenBook Pro packs the Nvidia GeForce GTX 1050 Ti with 4GB RAM. For connectivity, the laptop has two USB Type-A, two USB 3.1 Type-C with support for Thunderbolt 3, one HDMI 1.4, and a microSD card reader. There are Harman Kardon-powered speakers equipped with Asus SonicMaster Premium audio technology. There is also a 71Wh that is rated to deliver 10 hours of life.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "Pro",
        "world",
        "new",
        "last",
        "extended"
    ],
    "verbs": [
        "Touch",
        "display",
        "last",
        "Bar"
    ]
}