{
    "title": "Sugar surges 21% in three weeks on govt's reverse stock limit order",
    "link": "https://www.business-standard.com/article/markets/sugar-surges-21-in-three-weeks-on-govt-s-reverse-stock-limit-order-118061100997_1.html",
    "pubDate": "Tue, 12 Jun 2018 01:38:00 +0530",
    "content": "Hits Rs 3,341 a quintal in Vashi Mandi; mills say govt's Rs 70-bn package, buffer stock move are knee-jerk reactions, supply glut not addressed",
    "contentSnippet": "Hits Rs 3,341 a quintal in Vashi Mandi; mills say govt's Rs 70-bn package, buffer stock move are knee-jerk reactions, supply glut not addressed",
    "guid": "https://www.business-standard.com/article/markets/sugar-surges-21-in-three-weeks-on-govt-s-reverse-stock-limit-order-118061100997_1.html",
    "isoDate": "2018-06-11T20:08:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "sugar",
            "surges",
            "21",
            "in",
            "three",
            "weeks",
            "on",
            "govt's",
            "reverse",
            "stock",
            "limit",
            "order"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Sugar surges 21% in three weeks on govt's reverse stock limit order",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tSugar prices jumped by over 21 per cent in three weeks on Monday, to hit the highest since March on expectations of reduced supply from mills, following the reverse stock limit imposed by the government to control supply.</p>\n<p>\n\tThe benchmark M30 variety of sugar, which had hit the lowest this season to Rs 2,762 a quintal on May 19 on a supply glut, rose sharply over the next three weeks to trade at Rs 3,341 in the wholesale Vashi Mandi on Monday.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tWith 31.5 million tonnes of sugar output in the current season along with nearly four million tonnes of carry-over stock from last year, total availability in India stands at about 35.5 million tonnes for the current year. Considering consumption of about 25 million tonnes, total surplus works out to 10.5 million tonnes.</p>\n<p>\n\tIn order to address this issue, the government has introduced a Rs 70-billion package with three million tonnes of proposed buffer stock. It had earlier ordered mills to export two million tonnes.</p>\n<p>\n\t“The current price rise is a knee-jerk reaction from the trade in response to the package announced by the government recently. This is unsustainable in my view, as the basic issue of supply glut has not been addressed,” said Vijay Banka, Chief Financial Officer, Dwarikesh Sugar Industries Ltd.</p>\n<p>\n\tMeanwhile, sugar mills’ ex-factory realisation has also risen in proportion to the spurt in wholesale prices. In Maharashtra, for instance, ex-factory realisation of sugar had declined to Rs 2,465 a quintal on May 17, the lowest this season, but has moved up to trade currently at Rs 3,125-3,175.</p>\n<p>\n\tThe wholesale price of the benchmark sugar in Uttar Pradesh currently rules at Rs 3,400 a quintal.</p>\n<p>\n\tInterestingly, sugar mills have been unable to export the allocated quantity of the sweetener due to subdued global prices and the reverse stock limit imposed in February and March this year.</p>\n<p>\n\tAccording to industry sources, sugar mills have been able to execute export orders of a mere 70,000-80,000 tonnes so far this year. Since sugar prices have jumped in domestic markets and stagnated globally, the prospects of further export look dim.</p>\n<p>\n\t“The decision to impose stock holding limits on sugar mills tantamounts to controls on sugar sales, which is not the right way to move into the future. Creation of buffer stocks of three million tonnes will reduce some surplus from the market, though only for a year, and will improve market sentiments to support domestic prices. What is of concern is that there is no idea or proposal onthe rationalisation of cane pricing policy, which is actually the main reason for all the problems of the industry today,” said Abinash Verma, Director General, Indian Sugar Mills Association (ISMA).</p>\n<p>\n\tA recent study by the rating agency Crisil estimates the bailout package to clear only Rs 91 billion over one year which works out to 40 per cent of entire cane arrears of Rs 220 billion.</p>\n<p>\n\tAnalysts however forecast that most of sugar mills across the country would not be able to operate more than one month next year due to non-availability of storage space. With the reverse stock limit imposed, most mills would have huge unsold sugar quantity for next year. Apart from that, the bumper cane crop is estimated to fetch 32 million tonnes of sugar output next year resulting into the worsening of supply glut.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "reverse",
        "stock",
        "addressed",
        "21",
        "three",
        "70"
    ],
    "verbs": [
        "reverse",
        "supply",
        "say",
        "stock",
        "limit",
        "order",
        "move",
        "Sugar",
        "package",
        "buffer",
        "jerk",
        "glut"
    ]
}