{
    "creator": "Bloomberg",
    "title": "Why Apple’s chase for $1 trillion market cap is completely logical",
    "link": "https://www.financialexpress.com/market/why-apples-chase-for-1-trillion-market-cap-is-completely-logical/1194236/",
    "pubDate": "Tue, 05 Jun 2018 14:06:21 +05:30",
    "dc:creator": "Bloomberg",
    "content": "Another way of describing Apple Inc.’s ascent toward $1 trillion, which at $943 billion is closer than any US company has come to the milestone, is 'completely logical'.",
    "contentSnippet": "Another way of describing Apple Inc.’s ascent toward $1 trillion, which at $943 billion is closer than any US company has come to the milestone, is 'completely logical'.",
    "guid": "https://www.financialexpress.com/?p=1194236",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-05T08:36:21.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "why",
            "apple’s",
            "chase",
            "for",
            "1",
            "trillion",
            "market",
            "cap",
            "is",
            "completely",
            "logical"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Why Apple’s chase for $1 trillion market cap is completely logical",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1190558\" src=\"https://images.financialexpress.com/2018/06/apple-r-l-1-1-1.jpg\" alt=\"Apple, iPhone, phone-to-phone,&nbsp;Augmented reality, AR\" srcset=\"https://images.financialexpress.com/2018/06/apple-r-l-1-1-1.jpg 660w, https://images.financialexpress.com/2018/06/apple-r-l-1-1-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/apple-r-l-1-1-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/apple-r-l-1-1-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Shares of Apple jumped 0.8 percent to 1.83 at 4 p.m. in New York Monday after unveiling updated operating software at its annual conference for developers.</figure>\n\t\t\t</section></div><span>\n</span><p>Mind-boggling. Unprecedented. And here’s another way of describing Apple Inc.’s ascent toward $1 trillion: completely logical. Not to take anything away from Apple, which at $943 billion is closer than any U.S. company has come to the milestone. But in a world where $20 trillion has been added to U.S. equities in a decade, what would really be astonishing is if nobody were knocking at the 13-digit door. Maybe the existence of three other megacaps worth more than $700 billion doesn’t convince you. Or that relative to earnings, Apple trades at a third of what <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/microsoft/\">Microsoft</a> fetched in 2000. How about another test — whether Apple is really so freakishly large compared with everything else?</p><span>\n</span><p>Right now, the iPhone maker is 4.2 percent of the S&amp;P 500. That’s a lot, but nowhere near a record. In fact, its weighting is only slightly larger than the average for the market’s biggest company since 1980. It’s not a case against Apple exceptionalism. It’s an observation that the stock market has evolved into a place where trillion-dollar companies are just a lot more likely to exist. “The fact that the market keeps growing its earnings and pushing prices higher, you’d expect sooner or later, some companies will top that one trillion mark,” said Bruce McCain, chief investment strategist at Key Private Bank in Cleveland. “It shouldn’t be surprising.”</p><span>\n</span><p>Shares of Apple jumped 0.8 percent to $191.83 at 4 p.m. in New York Monday after unveiling updated operating software at its annual conference for developers. Its iOS 12 includes support for multi-player AR games, additional features for the Siri digital assistant, and new ways to search for photos, block notifications and conduct FaceTime video conference calls. Since 1980, four other companies have been this big relative to the market. IBM’s weight surpassed 6 percent from 1983 to 1985, S&amp;P data show. Adjusted for the market’s overall appreciation since then, a company of that size would be worth $1.5 trillion today.</p><span>\n</span><p>Like a lot of things, something that looks extraordinary up close is a little less amazing when you step back. A fund manager posted twice the return of the S&amp;P 500? More than 60 did it last year. A company doubled over 12 months? It happened 57 times in 2017. A similar cognitive error informs the impulse to see Apple as unique. In fact, some company has almost always been this big compared to its public peers — what’s new is that the entire market has quadrupled since 2009. Yes, Apple’s valuation reflects the popularity of its products versus others. But its sheer size is testament more to the steady accumulation of wealth that’s almost always occurred in U.S. equities.</p><span>\n</span><p>Not that the wealth creation has been so gangbusters of late. Consider the performance of stocks since the start of the century, a period when equities twice erased about half their value in bear markets, and didn’t fully recover until 2013. Up about 5 percent a year since 2000, the return trails the annualized rate of 9 percent in the past nine decades. Despite all that, it’s practically conventional wisdom that others will soon be joining Apple in the trillion-dollar club. Going by the highest share-price estimate among analysts, <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/amazon/\">Amazon</a> and Microsoft will be the next to reach that milestone over the next 12 months.</p><span>\n</span><p>Part of the equation is inflation. Since 2000, the S&amp;P 500’s advance has exceeded the wider pace of price appreciation in the broader economy by about 3 percentage points a year. If left to no other device than inflation, a $690 billion company in 2000 would be worth $1 trillion now. “It’s inevitable that companies hit the trillion-dollar size, as it will be inevitable that companies hit $2 trillion, or $10 trillion some day,” said Rich Weiss, chief investment officer and senior portfolio manager of multi-asset strategies at American Century Investments. “As long as there is inflation, you’d expect to see a nominal dollar continuing of growth.”</p><span>\n</span><p>For those who’d contend that something anomalous is going on, a model favored by billionaire investor Warren Buffett lends support. It’s the value of companies relative to the economy. Based on data compiled by the Federal Reserve, stocks are almost as expensive as they were during the dot-com era, when judged against gross domestic product. But that’s an argument the market has done something weird. Not just Apple.</p><span>\n</span><p>Other valuation arguments say Apple is cheap. Even as its profits have surged 13-fold in the past decade, investors have steadfastly refused to pay a higher multiple for the stock. At 18 times reported earnings, Apple is the cheapest among all companies that have a market cap of at least $500 billion. Then again, it’s not unusual for a megacap to trade at a discount to the market. Exxon Mobil, No. 1 in 2008, was valued at half the S&amp;P 500’s multiple at that time.</p><span>\n</span><p>Another objection says that Apple and companies like it are pretty much synonymous with the rally: you can’t adjust them for the market — they are the market. Everyone knows that gains in benchmarks owe a lopsided debt to a tiny cohort of giant companies. To say Apple is a product of the market’s success is a lesson in circular logic. The problem is, there’s been an Apple (and an Amazon and a <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/google/\">Google</a>) in every bull market for the last half century. A study in 2016 by Cliff Asness of AQR Capital Management showed that the contribution of the Faang stocks to this rally’s progress has been both significant and completely normal.</p><span>\n</span><p>Taking Apple out of the S&amp;P 500 reduced its advance by 1.5 percentage points in 2017. While the impact was among the largest in data going back to 1991, it’s only 1.1 standard deviation from the average when removing the biggest gainer has done. In other words, Apple’s ascent is pretty much in line with history. “Is it the biggest engine on the track? Yes,” said Howard Silverblatt, a senior index analyst at S&amp;P. “But companies used to own countries.”</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "trillion",
        "logical",
        "Another",
        "billion"
    ],
    "verbs": [
        "company",
        "chase",
        "market",
        "cap"
    ]
}