{
    "creator": "Sushim Banerjee",
    "title": "Growth in manufacturing sector to sustain demand for steel",
    "link": "https://www.financialexpress.com/industry/growth-in-manufacturing-sector-to-sustain-demand-for-steel/1211186/",
    "pubDate": "Tue, 19 Jun 2018 00:35:14 +05:30",
    "dc:creator": "Sushim Banerjee",
    "content": "The trend of manufacturing sector and for that matter the behaviour of industrial production in India since December 2017 has been a matter of satisfaction for all other industrial segments, including steel.",
    "contentSnippet": "The trend of manufacturing sector and for that matter the behaviour of industrial production in India since December 2017 has been a matter of satisfaction for all other industrial segments, including steel.",
    "guid": "https://www.financialexpress.com/?p=1211186",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-18T19:05:14.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.1111111111111111,
        "tokens": [
            "growth",
            "in",
            "manufacturing",
            "sector",
            "to",
            "sustain",
            "demand",
            "for",
            "steel"
        ],
        "words": [
            "demand",
            "growth"
        ],
        "positive": [
            "growth"
        ],
        "negative": [
            "demand"
        ]
    },
    "article": {
        "title": "Growth in manufacturing sector to sustain demand for steel",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1211199\" src=\"https://images.financialexpress.com/2018/06/steel-7-1.jpg\" alt=\"steel, steel sector, steel manufacturing,&nbsp;steel consumption in india\" srcset=\"https://images.financialexpress.com/2018/06/steel-7-1.jpg 660w, https://images.financialexpress.com/2018/06/steel-7-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/steel-7-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/steel-7-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The trend of manufacturing sector and for that matter the behaviour of industrial production in India since December 2017 has been a matter of satisfaction for all other industrial segments, including steel.</figure>\n\t\t\t</section></div><span>\n</span><p>The trend of manufacturing sector and for that matter the behaviour of industrial production in India since December 2017 has been a matter of satisfaction for all other industrial segments, including steel. It was earlier pointed out in this column that growth in steel consumption in the country is crucially dependent on more investment in construction and infrastructure sectors that account for nearly 62% of steel consumption. It was noted that subdued performance (even negative growth in manufacturing and industrial output in some of the months in last year) would undermine the growth potential in construction due to non availability of matching support to the growth in infrastructure sector. Thus, one may argue that if poor growth would not have plagued the manufacturing and infrastructure sectors (accounting for nearly 38% of steel consumption), our steel consumption would have attained a higher growth path.</p><span>\n</span><p>Exports of engineering goods in which machinery and equipment are the major components have declined in the recent past as a testimony to poor growth in manufacturing sector and thereby adversely affecting steel demand. In October 2017, manufacturing and IIP observed 2.5% and 2.2% growth over last year. This became 4.4% in March 2018 and now April data shows that the same has moved up by 5.2% and 4.9%. What is interesting to note is that all steel intensive segments like capital goods have risen by 13%, consumer durable by 4.3%, infrastructure and construction sectors by 7.5%. More specifically the growth in manufacture of vehicles and trailers grew by as high as 21.9%, manufacture of machinery and equipment by 8.5%, manufacture of other transport (rails, ships, aircrafts) by 13.9% and manufacture of furnitures by 10.3% during the month. The growth in industrial output is well reflected in consumption of specific products.</p><span>\n</span><p>While the growth in long products (TMT, Structurals, Rails) can directly be linked with infra and construction demand, the growth in flat categories is mostly linked with manufacturing growth. Demand for wire rods is mostly connected with growth in manufacturing sector. Thus, during April 2018, although the consumption of TMT/ wire rods has marginally gone down, demand for Railway materials rose significantly. Demand for HRC, plates, CRC, coated products has also grown by an average 12.5%. This phenomenon is directly linked with growth in manufacturing. It is also observed that higher imports in HRC, plates and coated products have contributed to growth in consumption in these categories. As the demand scenario is brightened, the question comes if domestic producers could have supplied the higher import volumes.</p><span>\n</span><p>If the choice of the purchasers centres on prices only and if the imports are arriving taking advantage of lower import duties (as the trigger prices on HR, plates, CR, wire rods following AD investigation are ineffective), the matching of the landed prices is essential. For this purpose, it is imperative that an adequate import monitoring mechanism is installed early to support the indigenous producers with pre-arrival information to be able to face the challenge. Indian producers are left with sudden shocks after the arrival of the materials with no prior knowledge about the extent of the damage. The system has been set up quite successfully in many developed countries like the US. During April-May 2018, India exported 1.27 million tonne of steel which is 0.136 million tonne lower as compared to imports.</p><span>\n</span><p>India has achieved export growth in plates, HR, coated products and ESS. The consumption of electrical steel sheets has gone up by 59% in April 2018 as compared to last year, largely contributed by higher imports of CRGO as supply from domestic sources is minimal. WPI just released for the month of May 2018 indicates 4.43% growth annually over last year. This has largely been triggered by the rise in crude prices that has a strong multiplier impact on food and commodity prices, primarily through higher transport costs. The manufacturing prices have gone up by 3.73% and specifically the iron and steel semis prices by 12.1%.</p><span>\n</span><p>Categorywise, the maximum price rise is observed in respect of WPI of coated products that rose by 12.6%. Logically the rise in crude oil prices would imply more pressure on rail transport by steel, coal and cement sectors. With current rise in crude prices, the supply chain and logistics scenario are changing in favour of more localised supplies, more thrusts on bulk supply via rakes and more demand for loose wagon supply from Railways where direct bulk delivery is not possible. With the picking up of consumer demand and stability in the flow of investment in infra, the manufacturing growth is likely to continue unabated. China, despite all major changes being implemented in the structure of the economy, is exhibiting an average industrial growth of 6%. There is no reason why India cannot exceed this rate in the coming months.</p><span>\n</span><p>(Views expressed are personal)</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "industrial"
    ],
    "nouns": [
        "India",
        "demand",
        "manufacturing",
        "production",
        "matter",
        "Growth",
        "sector",
        "steel",
        "trend",
        "behaviour",
        "December",
        "satisfaction"
    ],
    "verbs": [
        "demand",
        "matter",
        "sustain",
        "steel",
        "trend"
    ]
}