{
    "title": "Patanjali cancels proposed Rs 6,000-crore mega food processing park in UP",
    "link": "https://timesofindia.indiatimes.com/business/india-business/patanjali-cancels-proposed-rs-6000-crore-mega-food-processing-park-in-up/articleshow/64469130.cms",
    "pubDate": "Tue, 05 Jun 2018 16:58:12 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/patanjali-cancels-proposed-rs-6000-crore-mega-food-processing-park-in-up/articleshow/64469130.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64469130.cms\" /></a>Baba Ramdev's Patanjali Ayurved on Tuesday said it is pulling out of its proposed Rs 6,000-crore mega food processing project along the Yamuna Expressway in Uttar Pradesh, citing non-cooperation from the state government.",
    "contentSnippet": "Baba Ramdev's Patanjali Ayurved on Tuesday said it is pulling out of its proposed Rs 6,000-crore mega food processing project along the Yamuna Expressway in Uttar Pradesh, citing non-cooperation from the state government.",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/patanjali-cancels-proposed-rs-6000-crore-mega-food-processing-park-in-up/articleshow/64469130.cms",
    "isoDate": "2018-06-05T16:58:12.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.09090909090909091,
        "tokens": [
            "patanjali",
            "cancels",
            "proposed",
            "rs",
            "6000-crore",
            "mega",
            "food",
            "processing",
            "park",
            "in",
            "up"
        ],
        "words": [
            "cancels"
        ],
        "positive": [],
        "negative": [
            "cancels"
        ]
    },
    "article": {
        "title": "Patanjali cancels proposed Rs 6,000-crore mega food processing park in UP",
        "content": "<div class=\"Normal\"><span>NEW DELHI: Baba Ramdev's </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Patanjali-Ayurved\">Patanjali Ayurved</a><span> on Tuesday said it is pulling out of its proposed Rs 6,000-crore mega food processing project along the Yamuna Expressway in </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/india/uttar-pradesh\">Uttar Pradesh</a><p>, citing non-cooperation from the state government.\n</p><p>However, the UP government said it has given one more month to Patanjali to meet the conditions required to get the final approval.\n</p><p>The Yamuna Expressway Industrial Development Authority (YEIDA) could not get the required clearances for transfer of land from the state government, said a top company official.\n</p><p>The Hairdwar-based company had proposed to invest up to Rs 6,000 crore to set up a plant in 425 acres of land at YEIDA to cater the domestic and export markets through its step-down firm Patanjali Food &amp; Herbal Park.\n</p><span>Confirming the development, Patanjali Ayurved Managing Director Acharya </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Balkrishna\">Balkrishna</a><p> told PTI: \"We are cancelling the project as we did not get required clearances from the UP state government.\"\n</p><p>The company now plans to shift the project to some other state, he said without disclosing further details.\n</p><p>Citing the reason for pulling out of the state, he said, \"We did not get any cooperation from the state government for this project. We have waited for long time for the clearances but could not get from the state government. Now we have decided to shift the project.\"\n</p><p>Patanjali was given one-month extension by the Ministry of Food Processing Industries till end of June to get the requisite clearances to start the project.\n</p><p>When contacted Food Processing Secretary J P Meena told PTI:\" Patanjali was given four months time to meet the conditions required to get the final approval. There are four to five conditions, including land and bank loans, which any party that wants to set up mega food park has to fulfil.\"\n</p><p>Meena further said, \"We have not cancelled the project. We have given one month extension to Patanjali... they have to meet the condition. In case, Patanjali does not meet the condition, we have no choice but to cancel. We have done it earlier in many projects.\"\n</p><p>Patanjali had already got support from the financial institutions for the project, Balkrishna claimed.\n</p><span>\"We got extensions two times from the Ministry of Food Processing Industries and now it (time) is lapsing as we could not get the required clearances from the state government,\" Balakrishna said.\n</span><br><span>\n</span><br><span>Mega food parks are to be implemented within 30 months and financial assistance is provided to them by the central government.\n</span><br><span>\n</span><br><span>Earlier, Patanjali had said that its Yamuna Expressway-based plant would produce goods worth Rs 25,000 crore annually, if it runs to its full capacity.\n</span><br><span>\n</span><br><span>It would create 10,000 direct jobs, Patanjali had said.\n</span><br><span>\n</span><p>Patanjali is presently investing in mega food park projects, including Nagpur (MP) and Tejpur (Assam).\n</p><span>\n</span></div>"
    },
    "adjectives": [
        "top",
        "10",
        "left",
        "right",
        "UP"
    ],
    "nouns": [
        "india",
        "margin",
        "Expressway",
        "processing",
        "project",
        "business",
        "government",
        "top",
        "park",
        "state",
        "10",
        "border",
        "left",
        "style",
        "right",
        "photo",
        "Tuesday",
        "crore",
        "food",
        "Baba",
        "pulling",
        "cooperation"
    ],
    "verbs": [
        "project",
        "top",
        "park",
        "state",
        "border",
        "align",
        "style",
        "right",
        "UP"
    ]
}