{
    "title": "Trump-Kim meet: The carrots US offers North will define the deal's success",
    "link": "https://www.business-standard.com/article/economy-policy/trump-kim-meet-the-carrots-us-offers-north-will-define-the-deal-s-success-118061200656_1.html",
    "pubDate": "Tue, 12 Jun 2018 15:09:00 +0530",
    "content": "The quest now is to either turn North Korea into 'not a nuisance' like Burma, or a relatively friendly state like Vietnam",
    "contentSnippet": "The quest now is to either turn North Korea into 'not a nuisance' like Burma, or a relatively friendly state like Vietnam",
    "guid": "https://www.business-standard.com/article/economy-policy/trump-kim-meet-the-carrots-us-offers-north-will-define-the-deal-s-success-118061200656_1.html",
    "isoDate": "2018-06-12T09:39:00.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.16666666666666666,
        "tokens": [
            "trump-kim",
            "meet",
            "the",
            "carrots",
            "us",
            "offers",
            "north",
            "will",
            "define",
            "the",
            "deal's",
            "success"
        ],
        "words": [
            "success"
        ],
        "positive": [
            "success"
        ],
        "negative": []
    },
    "article": {
        "title": "Trump-Kim meet: The carrots US offers North will define the deal's success",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\t<em><strong>If the US chooses eventually to reward North Korea’s good behaviour, there can be no better candidate than it for shifting production out of China, combining disciplined workforce with very low wages</strong></em></p>\n<p>\n\tThe first grainy images to come out of the historic Kim-Trump summit indicate that while nothing concrete has been reached, there are 4 focus areas: First, establishment of regular bilateral relations, possibly formal; second, establishing a stable peace in the Korean peninsula; third, working towards complete denuclearisation of the peninsula; and fourth, help retrieve the remains of the US war dead.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tAs such, this would seem unremarkable, yet it holds great potential. What one must remember here is, you do not go from enmity to friendship overnight. Remember that the US-China rapprochement also began with the Chinese side ceding nothing and real cooperation taking years to mature. It is important, therefore, to understand the positives, negatives and limitations of any North Korean-US rapprochement.</p>\n<p>\n\tThe first issue here is legitimacy. While several commentators have made the case that the prime Democratic People's Republic of Korea (DPRK) goal is to get recognition from the US, the reality is the North Koreans see this more as a circuit breaker, where bilateral problems can be isolated and sorted out, without infecting North-South relations.</p>\n<p>\n\tWhat is surprising is that anyone who has been to North Korea and talked to citizens of DPRK (with and without minders) are told just this. Yet, a vast amount of international literature on the subject (from people who have never been to North Korea) presumes that shaking hands with a US president lends credibility to the North Korean leadership, a leadership that does not have a credibility deficit. In many ways this is not dissimilar to the position India takes on Kashmir with Pakistan – that bilateral issues must be sorted out bilaterally, and it makes eminent sense, as it prevents superpower agendas from infecting a bilateral problem.</p>\n<p>\n\tWhat this summit has achieved is that it has broken the taboo of formally engaging with North Korea. In so doing it has removed China’s monopoly over interpreting and taking the blame for North Korean’s actions. From this point on, should a crisis erupt, the US and North Korean leadership can communicate directly rather than through intermediaries with their own agendas.</p>\n<p>\n\tThis brings us to the question of what we tangibly do get from here; the promise towards denuclearisation of the Korean peninsula, being the most important. The problem here is America’s track record of regime change &amp; instigating insurgencies. Kim Jong Un, of course, will be fully aware of what happened to Gaddafi, Milosevic and Saddam Hussein, the important link being that none of them had nuclear weapons. As such, one must be realistic – the US has a severe credibility crisis and this must be seen as Libya in reverse. Here, the US is first committing to tentative security guarantees, to produce North Korean good behaviour (not to forget DPRK previously demolished its nuclear test sites and has committed to destroying its missile engine testing site). The first step will be to suspend joint exercises with South Korea. This is not the price of this agreement, this is the price the US has to pay for its misadventures since a regime change.</p>\n<p>\n\tEconomics, on the other hand, is something that was not spoken about but has great potential. People tend to forget that till 1979 North Korea had the second-highest per capita income in Asia, next only to Japan. DPRK is not a third-world country, it is a de-industrialised state where residual work ethics and core competencies remain. If America chooses to reward DPRK’s good behaviour, there is no better candidate for shifting production out of China (something India failed at abysmally) combining a disciplined workforce with very low wages. Given the campaign against sweatshops, this may be a political thorn, but given rising Chinese wages, an economic necessity. The question is, will this rapprochement work the way the outreach to China and Vietnam did, or will it ossify like the aborted outreach to Cuba?</p>\n<p>\n\tThis is where this 4-point agreement makes eminent sense. The 4 points it seems deliberately leave out the US carrot (economics) and sticks (human rights) in order to balance 4 responsibilities. That is, should DPRK not escalate tensions in the region, provide assistance in retrieving the corpses of US war dead and make the right noises on denuclearisation, the US will provide diplomatic recognition and economic benefits over time while holding the human rights lobby in check. This further course of action, of course, generates reciprocal duties from the North Koreans. For example, any serious violation of human rights like the deliberate starvation of Hamgyong province in an act of collective punishment cannot be repeated. However, all things remaining normal, the US will balance its ties with DPRK the way it does with other egregious human rights violators like Saudi Arabia, Pakistan, Turkmenistan and Uzbekistan to name a few. From a US point of view, getting DPRK up to that level may in fact be a significant improvement from the current situation.</p>\n<p>\n\tUltimately, however, it is the carrots the US provides, that will determine the success of this deal, given that the state DPRK is in leaves no sticks to dish out. The only way from here is up. The worst equilibrium one can expect is that which the US has reached with Pakistan: strained but still working, with some carrots in order to maintain leverage. Turning the DPRK into an ally against China, as <em><strong><a href=\"http://www.nbr.org/research/activity.aspx?id=865\" target=\"_blank\">this interesting article</a></strong></em> argues, might be a bridge too far, but incentivising it enough not to participate in Chinese attempts at keeping the region off balance will still be a major positive. As analogies go, North Korea was a blackmail state like Pakistan; the quest now is to either turn it into “not a nuisance” like Burma, or a relatively friendly state like Vietnam. Even if this agreement does the bare minimum in getting a few years of calm in the peninsula and loosening china’s monopoly, it will be an unqualified success.</p>\n<hr>\n\t<em>Abhijit Iyer-Mitra is Senior Fellow at the Institute of Peace and Conflict Studies </em>\t\t\t\t\n\t\t\t\t    \t\t\t\t     <p>\n\t\t\t\t\t\t\t\t<em>Disclaimer: Views expressed are personal. They do not reflect the view/s of Business Standard.</em></p>\n\t\t\t\t\t\t</span>"
    },
    "adjectives": [
        "meet",
        "North",
        "friendly"
    ],
    "nouns": [
        "state",
        "turn",
        "deal",
        "Trump",
        "US",
        "Korea",
        "will",
        "success",
        "meet",
        "North",
        "nuisance",
        "friendly",
        "Vietnam",
        "Burma",
        "quest"
    ],
    "verbs": [
        "state",
        "turn",
        "deal",
        "Trump",
        "will",
        "meet",
        "define",
        "quest"
    ]
}