{
    "title": "Why India is a preferred destination amid turmoil in emerging markets",
    "link": "https://www.business-standard.com/article/economy-policy/why-india-is-a-preferred-destination-amid-turmoil-in-emerging-markets-118061200138_1.html",
    "pubDate": "Tue, 12 Jun 2018 08:41:00 +0530",
    "content": "Mumbai's $2.2 trillion stock market is primarily driven by investors at home",
    "contentSnippet": "Mumbai's $2.2 trillion stock market is primarily driven by investors at home",
    "guid": "https://www.business-standard.com/article/economy-policy/why-india-is-a-preferred-destination-amid-turmoil-in-emerging-markets-118061200138_1.html",
    "isoDate": "2018-06-12T03:11:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "why",
            "india",
            "is",
            "a",
            "preferred",
            "destination",
            "amid",
            "turmoil",
            "in",
            "emerging",
            "markets"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Why India is a preferred destination amid turmoil in emerging markets",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tAs the threat of a trade war grows and emerging-market central banks sacrifice growth to protect their currencies, equity investors have their backs to the wall. But in their search for a haven, one name keeps cropping up: India.<br></p>\n<p>\n\tThe South Asian nation, the fastest-growing major economy in the world, enjoys relative insulation from external shocks as a booming middle class delivers enough domestic demand to counter the fallout from protectionism, according to money managers including Franklin Templeton and Newton Asset Management.<br></p>\n<p>\n\tExchange-traded fund house WisdomTree Investments Inc. goes a step further, recommending investors allocate as much as 20 per cent of their portfolios to Indian equities.<br></p>\n<!-- INPAGE_BANNER -->\n\t<br><strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/markets/india-tops-emerging-markets-in-foreign-portfolio-investor-flows-in-2018-118042200619_1.html\" target=\"_blank\">India tops emerging markets in foreign portfolio investor flows in 2018</a></strong><p>\n\tIndia is “one of those places that provide better risk-reward compared with emerging markets at large, especially China or more globally-linked countries,” Gaurav Sinha, an asset-allocation strategist at WisdomTree, said in an interview in London. “If I am investing in India, I am investing for the local consumption.”<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/companies/uber-to-reinvest-profits-into-tech-in-india-to-scale-up-uber-eats-says-ceo-118052400757_1.html\" target=\"_blank\">Uber to reinvest profits in tech for emerging markets like India, says CEO</a></strong><br></p>\n<p>\n\tThat might sound brave to anyone who’s been watching India’s performance this year. While stocks are up 4.1 per cent in local-currency terms, the rupee’s weakness has left investors with losses in dollar terms. Since a global selloff began in January, equities have erased $274 billion, equivalent in value to the entire market of Finland. Increased volatility and passive-fund outflows suggest India is no less vulnerable to the jitters than its peers.<br><strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/avoiding-the-innovation-paradox-118050500713_1.html\" target=\"_blank\">India and emerging markets' 'innovation paradox': Technology-shy firms</a></strong><br></p>\n<p>\n\tThe country’s central bank raised interest rates for the first time in four years last week, and Governor Urjit Patel has even gone as far as pleading with the Fed to go slow with its interest-rate increases. With general elections less than 12 months away and Prime Minister Narendra Modi facing a united opposition, political uncertainty looms large too.<br></p>\n<p>\n\tBut that’s doing little to deter the bulls. When the dust settles, they say, the country will start to outperform again. And they have history on their side: India was quicker to rebound from the 2008 crisis, handing investors 70 per cent greater returns than the rest of the developing world since then.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/international/asian-emerging-markets-are-open-for-business-but-the-terms-may-be-tough-118050900277_1.html\" target=\"_blank\">Asian emerging markets are open for business but the terms may be tough</a></strong></p>\n<p>\n\t“I don’t think our positive stance on India has changed,” said Vikas Chiranewal, a Mumbai-based senior executive director for Franklin Templeton Investments’ emerging-markets group. “The broader market was becoming a bit pricey and some amount of price decline is healthy.”<br></p>\n<p>\n\t<strong>Growing Consumerism</strong><br></p>\n<p>\n\tPropelled by economic reforms that started in 1991 and have been deepened by Modi’s government, India’s middle class has ballooned past 600 million, according to a study by Mumbai University. The nation will become the third-largest consumer economy, with household spending tripling to $4 trillion by 2025, according to a report by Boston Consulting Group last year. That’s made Indian markets a magnet for foreign investors, spurring flows of $335 billion in the past 10 years.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/markets/msci-em-index-banking-is-the-dominant-sector-in-emerging-markets-118030101182_1.html\" target=\"_blank\">MSCI EM index: Banking is the dominant sector in emerging markets</a></strong></p>\n<p>\n\tThe International Monetary Fund predicts India’s gross domestic product will grow an average of more than 8 per cent annually in the next five years.<br></p>\n<p>\n\t“India is the only, large accessible country which has the potential to grow at substantial rates,” Sinha said.<br></p>\n<p>\n\tYet India is less reliant on exports than most other emerging markets. With almost two-thirds of GDP accounted for by consumption, companies have their hands full serving local demand. As a result, exports account for just 11 per cent of the GDP, compared with China’s 19 per cent and Russia’s 23 per cent.<br></p>\n<p>\n\tMumbai’s $2.2 trillion stock market is primarily driven by investors at home. Foreign-investment flows have accounted for a fraction of the trading even during this year’s declines.<br></p>\n<p>\n\tStill, signs abound that India’s stock market is overcrowded. Investors have to pay more than $18 for every dollar of projected profit, one of the world’s highest valuations. The country’s sensitivity to oil prices and the approach of the 2019 general elections increase the risk that the market may be volatile for the next 12 months.<br></p>\n<p>\n\t“Valuations have become more stretched for the Indian equity market as a whole, but provided the oil price does not continue to rise, we think India does offer relative insulation against protectionist trade policy,” said Douglas Reed, a London-based strategist at Newton Investment Management.</p>\n<hr>\n\t<em><strong>©2018Bloomberg</strong></em>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "emerging",
        "preferred",
        "trillion",
        "stock",
        "driven",
        "home"
    ],
    "nouns": [
        "India",
        "market",
        "Why",
        "destination",
        "turmoil",
        "Mumbai",
        "trillion",
        "stock",
        "home"
    ],
    "verbs": [
        "market",
        "stock",
        "home"
    ]
}