{
    "creator": "Nanda Kasabe",
    "title": "Maharashtra cooperative bank raises sugar valuations to Rs 2,900 per quintal",
    "link": "https://www.financialexpress.com/market/commodities/maharashtra-cooperative-bank-raises-sugar-valuations-to-rs-2900-per-quintal/1211204/",
    "pubDate": "Tue, 19 Jun 2018 00:51:31 +05:30",
    "dc:creator": "Nanda Kasabe",
    "content": "The Maharashtra State Cooperative Bank (MSCB), the apex cooperative bank of the state, has decided to increase sugar valuations to Rs 2,900 per quintal, keeping in mind the Minimum Floor Price (MFP) decided by the Centre. ",
    "contentSnippet": "The Maharashtra State Cooperative Bank (MSCB), the apex cooperative bank of the state, has decided to increase sugar valuations to Rs 2,900 per quintal, keeping in mind the Minimum Floor Price (MFP) decided by the Centre.",
    "guid": "https://www.financialexpress.com/?p=1211204",
    "categories": [
        "Commodities",
        "Market"
    ],
    "isoDate": "2018-06-18T19:21:31.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "maharashtra",
            "cooperative",
            "bank",
            "raises",
            "sugar",
            "valuations",
            "to",
            "rs",
            "2900",
            "per",
            "quintal"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Maharashtra cooperative bank raises sugar valuations to Rs 2,900 per quintal",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1211212\" src=\"https://images.financialexpress.com/2018/06/sugar-reuters-2.jpg\" alt=\"Maharashtra cooperative bank, sugar,&nbsp;Minimum Floor Price,&nbsp;Devendra Fadnavis,&nbsp;\" srcset=\"https://images.financialexpress.com/2018/06/sugar-reuters-2.jpg 660w, https://images.financialexpress.com/2018/06/sugar-reuters-2-300x200.jpg 300w, https://images.financialexpress.com/2018/06/sugar-reuters-2-620x413.jpg 620w, https://images.financialexpress.com/2018/06/sugar-reuters-2-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The Maharashtra State Cooperative Bank (MSCB), the apex cooperative bank of the state, has decided to increase sugar valuations to Rs 2,900 per quintal, keeping in mind the Minimum Floor Price (MFP) decided by the Centre.</figure>\n\t\t\t</section></div><span>\n</span><p>The Maharashtra State Cooperative Bank (MSCB), the apex cooperative bank of the state, has decided to increase sugar valuations to Rs 2,900 per quintal, keeping in mind the Minimum Floor Price (MFP) decided by the Centre. The central government declared MFP at Rs 2,900 per quintal when a package was announced for the sugar sector last week. Vidyashar Anaskar, the newly appointed chairman of the board of administrators of the bank, said that during the middle of the season, sugar prices had dropped to Rs 2,500 per quintal from Rs 3,500 per quintal, leading to a lot of pressure on the sector. The Fair and Remunerative Price (FRP) has been fixed at Rs 2,550 per quintal by the Centre, making it difficult for sugar factories to make cane payments to farmers.</p><span>\n</span><p>Since several miller accounts fell into short margins, it would not have been possible for MSCB to issue pre-seasonal loans to them, he pointed out. Since the Centre has now decided a Minimum Floor Price at Rs 2,900 per quintal after a meeting with Maharashtra chief minister Devendra Fadnavis and Union minister Nitin Gadkari, the bank has also come forward to increase sugar valuations to Rs 2,900 per quintal to help out the sugar sector, he said. The margin has also been reduced to 10% instead of 15% which means sugar millers can use 90% of the loan amount and can get Rs 1,860 as the pledge amount. In case millers want more, they can mortgage their properties with the bank to avail a 100% loan, he said. He added that the bank is working on measures to increase the working capital given to sugar millers. The decisions taken by the apex bank also reflect on the rest of the regional rural cooperative banks.</p><span>\n</span><p>Millers use this amount to pay fair and remunerative price to cane growers and this is repaid to the bank by selling the sugar stock. The devaluations, however, left less money in the hands of millers, making clearing of cane dues to farmers difficult. This season, the issue of short margins also rose because the sugar sales did not generate enough revenue for millers due to a downslide in prices. In turn, the millers could not repay the bank, leaving their accounts in the red, thereby making them ineligible for future loans. Last week, the total quantum of short margins was to the tune of Rs 649 crore. Millers have been seeking the short margin money as pre-seasonal working capital loans so that they can sell sugar without having to pay the dues first. Anaskar said that the bank has decided to increase the exposure of millers, allowing them to use 90% of the loan amount given by the bank. Usually, the bank keeps a margin of 15% as a cushion.</p><span>\n</span><p>Almost all the mills have run into the problem of short margin, which has made them ineligible for pre-seasonal loan necessary for undertaking such work. This comes just months before the start of the next season, which has reported a bumper cane crop on an estimated over 11 lakh hectare. Maharashtra’s cane dues are nearly&nbsp;Rs 1,768 crore. Meanwhile, the Centre has fixed the norms for creating 30 lakh tonne of sugar buffer stock and a notification has been issued by the Union ministry of consumers affairs and public distribution.</p><span>\n</span><p>According to the notification, instead of buying sugar from mills, the government will finance the cost of sugar and storage will be at mill-owned godowns, along with sugar pledged by mills with banks. It will also bear a finance cost of 12% a year or actual interest charged by the banks, whichever is lower, along with insurance and storage charges at 1.5% a year. Significantly, the sugar price of Rs 29 per kg is the same as the minimum ex-factory price notified for mills. However, this price will be only for reimbursement of finance and insurance charges by the government to the mills. The reimbursed charges on buffer stock, which government has fixed for each mill, will have to be used by the latter to clear cane farmers dues. The government will charge the reimbursement expenses to the subsidy account, according to the notification.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "Minimum",
        "decided",
        "cooperative",
        "Cooperative"
    ],
    "nouns": [
        "Price",
        "State",
        "state",
        "sugar",
        "Centre",
        "mind",
        "Minimum",
        "increase",
        "bank",
        "Bank",
        "quintal",
        "Maharashtra",
        "cooperative",
        "Cooperative",
        "keeping",
        "apex",
        "Floor"
    ],
    "verbs": [
        "Price",
        "State",
        "state",
        "sugar",
        "Centre",
        "mind",
        "increase",
        "bank",
        "Bank",
        "Floor"
    ]
}