{
    "creator": "Bloomberg",
    "title": "Modi’s big welfare bet for 50 crore workers to win voters’ hearts ahead of 2019 Lok Sabha polls",
    "link": "https://www.financialexpress.com/economy/after-modicare-heres-modis-big-welfare-bet-to-win-voters-hearts-ahead-of-2019-polls/1193808/",
    "pubDate": "Tue, 05 Jun 2018 08:43:30 +05:30",
    "dc:creator": "Bloomberg",
    "content": "Prime Minister Narendra Modi is set to extend a welfare program to India’s 500 million workers as he bids for re-election in 2019, but he has limited time and resources to implement the ambitious plan.",
    "contentSnippet": "Prime Minister Narendra Modi is set to extend a welfare program to India’s 500 million workers as he bids for re-election in 2019, but he has limited time and resources to implement the ambitious plan.",
    "guid": "https://www.financialexpress.com/?p=1193808",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-05T03:13:30.000Z",
    "sentiment": {
        "score": 5,
        "comparative": 0.2777777777777778,
        "tokens": [
            "modi’s",
            "big",
            "welfare",
            "bet",
            "for",
            "50",
            "crore",
            "workers",
            "to",
            "win",
            "voters’",
            "hearts",
            "ahead",
            "of",
            "2019",
            "lok",
            "sabha",
            "polls"
        ],
        "words": [
            "win",
            "big"
        ],
        "positive": [
            "win",
            "big"
        ],
        "negative": []
    },
    "article": {
        "title": "Modi’s big welfare bet for 50 crore workers to win voters’ hearts ahead of 2019 Lok Sabha polls",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"wp-image-1193821 size-full\" src=\"https://images.financialexpress.com/2018/06/pm-modi-reutes-1.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/pm-modi-reutes-1.jpg 660w, https://images.financialexpress.com/2018/06/pm-modi-reutes-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/pm-modi-reutes-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/pm-modi-reutes-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The plan will be one of the largest mass benefit programs in the country of 1.3 billion people.</figure>\n\t\t\t</section></div><span>\n</span><p><span>Prime Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/narendra-modi/\">Narendra Modi</a> is set to extend a welfare program to India’s 500 million workers as he bids for re-election in 2019, but he has limited time and resources to implement the ambitious plan.&nbsp;</span><span>Modi aims to initially provide three programs — old age pension, life insurance and maternity benefits, while leaving out unemployment, child support and other benefits — to most working citizens, government officials said, asking not to be identified as discussions are private.</span></p><span>\n</span><p><span>While it could translate into significant political gains to offset the challenges he faces in the lead up to the national poll, it is likely to add pressure on India’s fiscal deficit, already one of the widest in Asia.&nbsp;</span><span>The government has drafted a bill to extend benefits to all workers, including those in informal employment, by merging and simplifying 15 federal labor laws into one. It plans to present the bill in July in the upcoming session of Parliament, Labor Minister Santosh Gangwar told Bloomberg News, while remaining non-committal on a full-fledged roll-out before the national poll.</span></p><span>\n</span><p><span>The plan will be one of the largest mass benefit programs in the country of 1.3 billion people and comes after the February announcement of a health protection plan targeted to cover 100 million poor families, dubbed ‘ Modicare’.</span></p><span>\n</span><p><span>The government plans to pilot the project in six districts in the months leading up to the federal elections due in May next year, the officials said.&nbsp;</span><span>“Nobody can deny the importance of social security for the country’s working class and it is overdue,” said Satish Misra, a political analyst at the Observer Research Foundation in New Delhi. “But the timing suggests it’s political in nature and Modi wants to push it in a hurry so that in election campaign he can claim it’s a game changer for poor.”</span></p><span>\n</span><p><strong>Challenging Process</strong></p><span>\n</span><p><span>It will be a challenge to make the system sustainable, and difficult for the government to provide benefits from its current $376 billion budget. It intends to limit the initial scope to maternity, pension, and death or disability benefits, leaving out unemployment and child support, the officials said.</span></p><span>\n</span><p><span>The move is expected to have a dual impact on the economy. Higher social spending would add to fiscal stress and limit the scope for infrastructure development. But by giving benefits mostly to informal workers who contribute to about half of the country’s GDP, it would enhance the quality of life and raise productivity.</span></p><span>\n</span><p><span>“The whole issue is should the government be doing it? The answer is yes. Can the government do it? The answer is no, because it does not have the money for it,” said Madan Sabnavis, chief economist at Care Ratings. “If the government does not spend a substantial amount, it will not be a proper social security plan. If it spends a good amount, the fiscal deficit will be pressured.”&nbsp;</span><span>While the comprehensive plan is for all workers, the government is concerned about the bottom half of the country’s workforce. The rest are expected to make their own contributions, either fully or partially.</span></p><span>\n</span><p><span>It will help reduce poverty in a country that’s home to a third of the world’s poor and still spends less than 2 percent of its GDP on social security. More than 90 percent of India’s workforce is in informal employment and without any social protection.</span></p><span>\n</span><p><strong>Money Matters</strong></p><span>\n</span><p><span>Providing minimum social security to the lower half of the working class, who make up about a fifth of the country’s population, would cost the government 0.38 percent of GDP or about 500 billion rupees annually, Santosh Mehrotra, an economics professor at Jawaharlal Nehru University in New Delhi, said in an interview.</span></p><span>\n</span><p><span>The panel will recommend benefits are paid at a rate that’s above the poverty line — 27 rupees (.40 cents) a day in rural areas and 33 rupees in urban areas, said Mehrotra, who has been asked by the government to calculate the cost of the program.&nbsp;</span><span>“In 22 years, India will be an aging society like China. If it doesn’t start working on social security today, who will pay for those old people?” said Mehtrotra.</span></p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "Prime",
        "million",
        "set",
        "50",
        "500",
        "big",
        "ahead",
        "limited",
        "ambitious"
    ],
    "nouns": [
        "Prime",
        "Minister",
        "program",
        "million",
        "India",
        "crore",
        "plan",
        "bet",
        "set",
        "time",
        "50",
        "500",
        "welfare",
        "win",
        "hearts",
        "polls",
        "re",
        "election",
        "limited",
        "implement"
    ],
    "verbs": [
        "Prime",
        "Minister",
        "program",
        "plan",
        "bet",
        "set",
        "time",
        "win",
        "extend",
        "implement"
    ]
}