{
    "creator": "Pragya Srivastava",
    "title": "Is India’s economy really a car with 3 tyres punctured? Here’s what economists say",
    "link": "https://www.financialexpress.com/economy/chidambarams-4-tyre-economic-theory-modis-1-tyre-that-is-not-punctured-will-soon-mend-other-3-too/1194374/",
    "pubDate": "Tue, 05 Jun 2018 17:13:54 +05:30",
    "dc:creator": "Pragya Srivastava",
    "content": "Are the three tyres of the Indian economy -- private investment, private consumption and exports -- punctured? Not for too long, say economists.",
    "contentSnippet": "Are the three tyres of the Indian economy -- private investment, private consumption and exports -- punctured? Not for too long, say economists.",
    "guid": "https://www.financialexpress.com/?p=1194374",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-05T11:43:54.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "is",
            "india’s",
            "economy",
            "really",
            "a",
            "car",
            "with",
            "3",
            "tyres",
            "punctured?",
            "here’s",
            "what",
            "economists",
            "say"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Is India’s economy really a car with 3 tyres punctured? Here’s what economists say",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1194564\" src=\"https://images.financialexpress.com/2018/06/modi_.jpg\" alt=\"Chidambaram's 4-tyre economic theory: Modi’s 1 tyre that is not punctured will soon mend other 3 too\" srcset=\"https://images.financialexpress.com/2018/06/modi_.jpg 660w, https://images.financialexpress.com/2018/06/modi_-300x200.jpg 300w, https://images.financialexpress.com/2018/06/modi_-620x413.jpg 620w, https://images.financialexpress.com/2018/06/modi_-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The one tyre of the Indian economy that is not punctured is the government expenditure, even former Finance Minister P Chidambaram said it. (Image: FE)</figure>\n\t\t\t</section></div><span>\n</span><p><span>The one tyre of the Indian economy that is not punctured is the government expenditure, even former Finance Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/p-chidambaram/\">P Chidambaram</a> said it. And the stellar growth registered in the last quarter of the year full of disruption could be attributed to government’s expenditure. Does it mean that the other three tyres of the Indian economy — private investment, private consumption and exports — are punctured? Not for too long, say economists as they see at least investments and consumption picking up in the new fiscal year.</span></p><span>\n</span><p><span>“We will see a positive spillover from the government’s expenditure. As you can see sectors like construction witnessed positive growth, which means there’s been an increase in their order books. In absence of private investment, the government stepped up and investment ought to increase and improve capex. Moreover, as banks’ balance sheet is also expected to improve due to IBC, it will lead to increase in both domestic consumption and private investment,” Shubhada M Rao, Chief Economist, Yes Bank told FE Online.</span></p><span>\n</span><p><span>The uptick in the fourth quarter of the FY18 can be attributed to the strong performance by manufacturing and construction sector. India’s manufacturing GVA growth in Q4 FY18 was an impressive 9.1% as compared to 6.1% in the same quarter last fiscal year and construction GVA growth was 11.5% vs -3.9% year-on-year. The financial and real estate sector also showed strong performance at 5% vs mere 1% year-on-year. </span></p><span>\n</span><p><span>The growth was led by was led by a pickup in growth of Gross Fixed Capital Formation (GFCF) and Private Final Consumption Expenditure (PFCE), which was more than the offset caused by the slowdown in the growth of Government Final Consumption Expenditure (GFCE) and exports.</span></p><span>\n</span><p><span>“Consumption will definitely pick up in coming quarters as when the growth increases, lending increases and when lending increases, consumption has to pick-up,” Saugata Bhattacharya, Chief Economist and Senior Vice President at Axis Bank told FE Online, adding that a lot of public investment will continue to happen in FY19 as well. Other economists see an uptick in rural consumption on the back of normal monsoon.</span></p><span>\n</span><p><span>ICRA expects a healthy consumer demand, government expenditure, and a back-ended pickup in investment activity in FY19. Madan Sabnavis of Care Ratings says that the growth in FY19 is likely to be from “pick up in consumption especially rural consumption with the forecast of normal monsoon, increased public sector spending and the uptick in the&nbsp;</span><span>performance of the manufacturing sector in the upcoming quarters”, Care Ratings said.</span></p><span>\n</span><p><span>On India’s exports, Federation of Indian Exports Organisation has said that there would be a northward movement in petroleum and commodity prices adding to export growth. “The recent depreciation of <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/indian-rupee/\">Indian Rupee</a> is also supporting exports… Indian exports, which are hovering around $300 billion, should exhibit 15-20% growth so as to reach around $350 billion during the current fiscal (FY19),” FIEO said in a statement.</span></p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "private",
        "Indian",
        "punctured",
        "Here",
        "three",
        "long"
    ],
    "nouns": [
        "consumption",
        "private",
        "India",
        "Indian",
        "economy",
        "car",
        "Here",
        "say",
        "Are",
        "three",
        "investment"
    ],
    "verbs": [
        "say",
        "long"
    ]
}