{
    "creator": "Reuters",
    "title": "Technology stocks on a tear as FAANGs and BATTS bite; crude oil prices surge after 3 days",
    "link": "https://www.financialexpress.com/market/technology-stocks-on-a-tear-as-faangs-and-batts-bite-crude-oil-prices-surge-after-3-days/1194461/",
    "pubDate": "Tue, 05 Jun 2018 16:33:15 +05:30",
    "dc:creator": "Reuters",
    "content": "World tech stocks hit a record high on Tuesday, spurred on by a new all-time peak for Apple, a 17-year top for European tech firms and news that Twitter and Netflix were set to join Wall Street's flagship S&#038;P 500 index. ",
    "contentSnippet": "World tech stocks hit a record high on Tuesday, spurred on by a new all-time peak for Apple, a 17-year top for European tech firms and news that Twitter and Netflix were set to join Wall Street's flagship S&P 500 index.",
    "guid": "https://www.financialexpress.com/?p=1194461",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-05T11:03:15.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.058823529411764705,
        "tokens": [
            "technology",
            "stocks",
            "on",
            "a",
            "tear",
            "as",
            "faangs",
            "and",
            "batts",
            "bite",
            "crude",
            "oil",
            "prices",
            "surge",
            "after",
            "3",
            "days"
        ],
        "words": [
            "crude"
        ],
        "positive": [],
        "negative": [
            "crude"
        ]
    },
    "article": {
        "title": "Technology stocks on a tear as FAANGs and BATTS bite; crude oil prices surge after 3 days",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"wp-image-1194476 size-full\" src=\"https://images.financialexpress.com/2018/06/US-stocks-Reuters.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/US-stocks-Reuters.jpg 660w, https://images.financialexpress.com/2018/06/US-stocks-Reuters-300x200.jpg 300w, https://images.financialexpress.com/2018/06/US-stocks-Reuters-620x413.jpg 620w, https://images.financialexpress.com/2018/06/US-stocks-Reuters-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Market participants will also be keeping an eye on a speech by ECB President Mario Draghi. (Image: Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>World tech stocks hit a record high on Tuesday, spurred on by a new all-time peak for Apple, a 17-year top for European tech firms and news that Twitter and Netflix were set to join Wall Street’s flagship S&amp;P 500 index. MSCI’s global tech index scored the milestone after the FAANGs — Facebook, Apple, <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/amazon/\">Amazon</a>, Netflix and <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/google/\">Google</a> — drove the technology-heavy Nasdaq to a new closing high in New York on Monday. That then raised Asia’s big BATTS — Baidu, Alibaba, Tencent, Taiwan Semiconductor, Samsung — with Alibaba notching a new high and Baidu surging 5 percent for its best day in more than a month.</p><span>\n</span><p>Europe got in on the act too as tech stocks there jumped more than 1 percent in a third day of gains that took them to their highest since the dot-com boom of 2001. “The market is being pushed up by just a few huge companies,” said Jerome Schupp, equity analyst at Prime Partners in Lausanne. “All big names from Apple to Amazon and <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/microsoft/\">Microsoft</a> are able to make huge buybacks and acquisitions, and the internal growth of most of these companies is pretty in line with expectations.”<br>Moves in other markets were modest or centred around growing nervousness about global trade tensions.</p><span>\n</span><p>The dollar, the euro and yen largely cancelled each other out, but the dollar made 0.6 percent on Mexico’s peso after Mexico said it would impose a 20 percent tariff on U.S. pork imports in retaliation for U.S. levies on steel and aluminium. There was some selling of Italian government bonds again too after their rebound of the last few days and as traders waited for the country’s senate to hold a confidence vote later on Giuseppe Conte’s appointment as prime minister.</p><span>\n</span><p>Market participants will also be keeping an eye on a speech by ECB President Mario Draghi for any indication of how the political developments in southern Europe may affect monetary policy. Other euro zone government bond yields were 1-2 basis points lower, as a measure of calm returned to the market.</p><span>\n</span><p>Germany’s 10-year government bond, the benchmark for the bloc, saw its yield drop 1.5 bps to 0.40 percent, while the 10-year U.S. Treasury note yield stood near the 11-day high of 2.946 percent brushed overnight. Spain also saw a change of government last week, with socialist Pedro Sanchez replacing conservative Mariano Rajoy. Investors assessed the likelihood of another election there as low, which kept a lid on volatility.</p><span>\n</span><p><strong>PEDAL TO THE METALS</strong></p><span>\n</span><p>Asia’s moves overnight saw Japan’s Nikkei gain 0.2 percent, Hong Kong’s Hang Seng climb 0.15 percent and the Shanghai Composite Index rise 0.25 percent after data showed China’s services sector expanding at a steady pace. The Australian dollar declined 0.15 percent to $0.7636 after climbing to a six-week high of $0.7666 overnight on upbeat domestic data. In commodities, oil prices went sideways after falling nearly 2 percent in the previous session on growing U.S. production and expectations of higher OPEC supplies.</p><span>\n</span><p>Brent crude futures dipped 15 cents to $75.13 while U.S. crude futures were up 19 cents at $64.95 a barrel after finishing the previous session down 1.6 percent. Industrial metals like copper, and zinc and aluminium were all 0.6-1.4 percent higher though safe-haven spot gold was little changed at $1,291.54 an ounce after posting three days of losses.</p><span>\n</span><p>Copper’s rise lifted it to its highest in six weeks and came as wage talks at the world’s biggest mine – BHP’s, Escondida mine in Chile – rumbled on. Last year, a failure to reach a labour deal at the mine led to a 44-day strike that jolted the global copper market. “Union leaders at the Escondida copper operation sent their most ambitious wage proposal to owners BHP Billiton, raising the possibility of strike action later this year,” analysts at ANZ bank said in a note.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "crude",
        "high",
        "set",
        "new",
        "World",
        "17",
        "top",
        "European",
        "500"
    ],
    "nouns": [
        "days",
        "year",
        "index",
        "oil",
        "crude",
        "stocks",
        "hit",
        "high",
        "set",
        "time",
        "news",
        "Technology",
        "tech",
        "surge",
        "World",
        "tear",
        "record",
        "bite",
        "Tuesday",
        "Apple",
        "17",
        "top",
        "peak",
        "Twitter",
        "Wall",
        "Street",
        "European",
        "S",
        "P",
        "join",
        "500",
        "flagship"
    ],
    "verbs": [
        "index",
        "oil",
        "hit",
        "set",
        "time",
        "tear",
        "bite",
        "surge",
        "record",
        "peak",
        "top",
        "Twitter",
        "join",
        "Wall"
    ]
}