{
    "creator": "Anirban Roy Choudhury",
    "title": "Online forums and the quest for advertisers",
    "link": "https://www.financialexpress.com/industry/online-forums-and-the-quest-for-advertisers/1202206/",
    "pubDate": "Tue, 12 Jun 2018 00:02:08 +05:30",
    "dc:creator": "Anirban Roy Choudhury",
    "content": "Various portals online answer queries on myriad topics in the virtual world but is there enough room for everyone to survive? What can help rake in the ad dollars?",
    "contentSnippet": "Various portals online answer queries on myriad topics in the virtual world but is there enough room for everyone to survive? What can help rake in the ad dollars?",
    "guid": "https://www.financialexpress.com/?p=1202206",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-11T18:32:08.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "online",
            "forums",
            "and",
            "the",
            "quest",
            "for",
            "advertisers"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Online forums and the quest for advertisers",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1202209\" src=\"https://images.financialexpress.com/2018/06/quora-1.jpg\" alt=\"quora, Shewakramani, Barack Obama, Flipkart, Sachin Bansal, Wikipedia\" srcset=\"https://images.financialexpress.com/2018/06/quora-1.jpg 660w, https://images.financialexpress.com/2018/06/quora-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/quora-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/quora-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> This is definitely on the agenda for Quora.</figure>\n\t\t\t</section></div><span>\n</span><p>Various portals online answer queries on myriad topics in the virtual world but is there enough room for everyone to survive? What can help rake in the ad dollars?</p><span>\n</span><p>Sure, <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/google/\">Google</a> and Bing might have answers to your queries online but sometimes, one wants humans to respond to one’s queries in the virtual world. It is then that you resort to knowledge sharing portals like Quora (started by former Facebook CTO Adam D’Angelo), Answers.com (founded by Bob Rosenschein) or Yahoo Answers.</p><span>\n</span><p>While earlier, knowledge sharing platforms were for queries like, ‘Things to do in Mumbai’ or ‘The best way to prepare for interviews’, now there are specialised websites and thousands of videos on YouTube answering the same questions. When Yahoo Answers and Answers.com.com each started in 2005 (and Quora in 2008), Facebook and YouTube weren’t even one third of the size that they command today. To add to the competition in the present day scenario, all major tech brands have their own product/service forums where designated engineers answer customer queries, lending credibility to the answers. Where does this leave traditional online public forums?</p><span>\n</span><p>“Sure, there are specialised sites. Yes, Apple engineers are answering queries in the company’s forum but they are answering at Quora too,” maintains Gautam Shewakramani, India country manager at Quora. “Not just them, but engineers/experts from other companies too are responding to questions. So, the one who posted the question gets different perspectives.”</p><span>\n</span><p><b>The times they are a-changin’</b></p><span>\n</span><p>With evolving needs of the online world, Q&amp;A portals are upgrading themselves to keep up. Take Quora, which claims to have 200 million unique visitors per month of which 50% are from the US. As per estimates, India is the second biggest market for the platform with over 40 million monthly visits. In India, till a few years back, reading ‘on the go’ was very popular and people were frequently interacting on knowledge sharing platforms. However, this has transitioned to ‘watching on the go’.</p><span>\n</span><p>The drop in data prices and improvement of bandwidth infrastructure has seen a serious growth in do it yourself (DIY) video consumption on YouTube in India. People get to see a question answered in detail on a video.</p><span>\n</span><p><img class=\"alignnone size-full wp-image-1202210\" src=\"https://images.financialexpress.com/2018/06/qoura.jpg\" alt=\"\" width=\"660\" height=\"247\" srcset=\"https://images.financialexpress.com/2018/06/qoura.jpg 660w, https://images.financialexpress.com/2018/06/qoura-300x112.jpg 300w, https://images.financialexpress.com/2018/06/qoura-620x232.jpg 620w, https://images.financialexpress.com/2018/06/qoura-480x180.jpg 480w\" sizes=\"(max-width: 660px) 100vw, 660px\"></p><span>\n</span><p>But online forums aren’t perturbed. Shewakramani recalls, “There was once this question: what is <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/indian-railways/\">Indian Railways</a> doing to ensure safety?’ While there were many to respond, one of them happened to be Railway Minister Piyush Goyal himself. This is where Quora is different from what is available elsewhere.” Shewakramani shares that people like former US President <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/barack-obama/\">Barack Obama</a>, <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/flipkart/\">Flipkart</a> co-founder Sachin Bansal, Wikipedia founder Jimmy Wales and other famous personalities have, in the past, landed on the platform to answer a query.</p><span>\n</span><p><b>A ‘question’ of money</b></p><span>\n</span><p>If fighting newer technology and changing behaviour is one aspect of survival, the other is monetisation. Quora launched a self-service advertising platform in May, 2017, which enabled marketers to promote their brands through the website.</p><span>\n</span><p>The ads appear as a solution on the relevant page. For example, if someone posts a question like, “Which is the best camera to use for wildlife photography?”, an ad appears on the thread that goes, “The ways in which Nikon makes wildlife photography easier”. “We have not gone and pitched to any brands in India but we are seeing that a lot of them are organically running campaigns on Quora,” adds Shewakramani. The California headquartered platform plans to set up a sales unit in India and pitch to brands across categories.</p><span>\n</span><p>“It is still early days for online query forums in India. The discussions are currently restricted to trivia, technology, sports, entrepreneurship and start-ups. They only appeal to the intellectual crowd at this stage,” says Rajiv Dingra, CEO and founder, WATConsult. “For platforms to get advertisers in a big way, they need to spread the horizon in India.”</p><span>\n</span><p>This is definitely on the agenda for Quora. The platform last year in its Series D funding raised $85 million at a valuation of $1.8 billion. As a part of its ‘internationalisation’ strategy, it has launched its Hindi version with Acche Insaan Bane, Sabka Samaan Karein as its tagline and will soon be launching in Bangla, Tamil and Marathi. The knowledge sharing website will not monetise its regional versions for now, as it waits to attain scale.</p><span>\n</span><p>“While Google is all about keyword contextuality, it is important for websites like Quora to provide an emotional contextuality. So, mining the emotion, time, situation and social context might give you a more emotionally leveraged answer or a prompt when you associate with these websites,” says Harish Bijoor, brand expert and founder of Harish Bijoor Consults.</p><span>\n</span><p>Dingra believes that for such forums to make a larger appeal, they need to get more people on the platform discussing the FMCG, food, lifestyle and fashion categories. “One can do display advertising here, but then it becomes like any other traffic website. The challenge is to get the people to talk about big spenders; only then will brands get attracted,” sums up Dingra.</p><span>\n</span><p><i>@anirban90rc</i></p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "Online",
        "online",
        "Various",
        "myriad",
        "virtual",
        "world",
        "enough"
    ],
    "nouns": [
        "quest",
        "answer",
        "world",
        "enough",
        "myriad",
        "room",
        "help",
        "rake",
        "ad"
    ],
    "verbs": [
        "quest",
        "answer",
        "room",
        "survive",
        "help",
        "rake"
    ]
}