{
    "title": "Govt may announce a package of almost Rs 80 bn to bail out sugar sector",
    "link": "https://www.business-standard.com/article/economy-policy/govt-may-announce-package-of-almost-rs-80-bn-to-bail-out-sugar-sector-118060500056_1.html",
    "pubDate": "Tue, 05 Jun 2018 07:04:00 +0530",
    "content": "This will be in addition to the financial assistance of Rs 5.50 per quintal of sugarcane announced a few weeks ago, costing over Rs 15 billion",
    "contentSnippet": "This will be in addition to the financial assistance of Rs 5.50 per quintal of sugarcane announced a few weeks ago, costing over Rs 15 billion",
    "guid": "https://www.business-standard.com/article/economy-policy/govt-may-announce-package-of-almost-rs-80-bn-to-bail-out-sugar-sector-118060500056_1.html",
    "isoDate": "2018-06-05T01:34:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "govt",
            "may",
            "announce",
            "a",
            "package",
            "of",
            "almost",
            "rs",
            "80",
            "bn",
            "to",
            "bail",
            "out",
            "sugar",
            "sector"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Govt may announce a package of almost Rs 80 bn to bail out sugar sector",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p> Days after the ruling BJP suffered an electoral setback, primarily in the sugarcane-growing belt of western Uttar Pradesh, and with farmers in parts of the country stopping supplies of essential commodities to protect price fall, the Centre is expected to announce a fresh package of almost Rs 80 billion to bail out the sugar sector.</p> <p> This will be in addition to the financial assistance of Rs 5.50 per quintal of sugarcane announced a few weeks ago, costing over Rs 15 billion.\n\n\n</p>\n<!-- INPAGE_BANNER --> <p> Officials said the government is likely to take a formal decision on the sugar package at a Cabinet meeting this week. And could include creating a 3 million-tonne buffer stock of sugar with an expenditure of Rs 12 billion and also a scheme to boost the ethanol production capacity of sugar mills.</p> <p> This ethanol production scheme is expected to cost the exchequer around Rs 44 billion and could entail an interest subsidy of 6 per cent to sugar mills for expansion and creating capacity for ethanol.</p> <p> The scheme, sources said, also provides five years to mills for repaying loans and a moratorium on repayment in the first year.</p> <p> The petroleum ministry is looking at raising the ethanol price from the existing Rs 40.85 per litre by another Rs 6-7 a litre so that mills can makes payment to farmers at the earliest.</p> <p> “These steps, if approved, are moves in the right direction though they have come slightly late, but nonetheless would help in improving the liquidity position of sugar mills,” Prakash Naiknavare, managing director of the National Federation of Cooperative Sugar Factories (NFCSF), told Business Standard.</p> <p> He said improvement in ex-mill prices of sugar would not only help mills clear their cane arrears, but also help them in improving their working capital needs to start operations next year.</p> <p> Sugarcane arrears have risen to over Rs 220 billion owing to a sharp drop in ex-mill prices on account of the bumper harvest.</p> <p> Last month, the government had announced a Rs 15 billion production-linked subsidy to help millers pay payments. </p><p>But, it wasn’t found to be adequate enough because of the conditions on availing the subsidy.</p> <p> Sugar mills are unable to make payments because their financial health has worsened owing to a sharp fall in sugar prices after a record production of 31.6 million tonnes (MT) so far in the 2017-18 season (October-September).</p> <p> Maximum cane dues of more than Rs 120 billion are in Uttar Pradesh alone, the country's biggest sugarcane-producing state.</p> <p> Besides the buffer stock, the Centre is considering fixing the minimum ex-mill sale price at around Rs 30 per kg and reintroducing the monthly release mechanism and imposing stock limits on mills by fixing quotas for each mill. The average ex-mill price of sugar is in the range of Rs 25.60-26.22 per kg, which is below the cost of production.</p> <p> The Centre has doubled the sugar import duty to 100 per cent and scrapped the export duty to check sliding domestic prices. It has also asked mills to export 2 million tonnes of sugar.<span></span> <span></span> </p><p> <img align=\"left\" alt=\"graph\" class=\"imgCont\" height=\"373\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/05/full/1528142636-7627.jpg\" title=\"graph\" width=\"620\" data-pagespeed-url-hash=\"198755772\" onload=\"pagespeed.CriticalImages.checkImageForCriticality(this);\"></p> <span></span>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "announced",
        "80",
        "financial",
        "50",
        "few",
        "ago",
        "15",
        "billion"
    ],
    "nouns": [
        "may",
        "package",
        "80",
        "bail",
        "sugar",
        "sugarcane",
        "sector",
        "will",
        "addition",
        "assistance",
        "50",
        "quintal",
        "few",
        "costing",
        "15",
        "billion"
    ],
    "verbs": [
        "announce",
        "package",
        "bail",
        "sugar",
        "will"
    ]
}