{
    "creator": "Jharna Mazumdar",
    "title": "Why retailers are flocking to tier II, III towns for expansion",
    "link": "https://www.financialexpress.com/industry/why-retailers-are-flocking-to-tier-ii-iii-towns-for-expansion/1211319/",
    "pubDate": "Tue, 19 Jun 2018 04:24:04 +05:30",
    "dc:creator": "Jharna Mazumdar",
    "content": "Rising incomes, increasing awareness and high aspirations in rural areas spell big opportunity for several retailers who are making a beeline for tier II and tier III towns. ",
    "contentSnippet": "Rising incomes, increasing awareness and high aspirations in rural areas spell big opportunity for several retailers who are making a beeline for tier II and tier III towns.",
    "guid": "https://www.financialexpress.com/?p=1211319",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-18T22:54:04.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "why",
            "retailers",
            "are",
            "flocking",
            "to",
            "tier",
            "ii",
            "iii",
            "towns",
            "for",
            "expansion"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Why retailers are flocking to tier II, III towns for expansion",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1211331\" src=\"https://images.financialexpress.com/2018/06/cats-168-1.jpg\" alt=\"retailers, retail therapy, tier two town, tier three town\" srcset=\"https://images.financialexpress.com/2018/06/cats-168-1.jpg 660w, https://images.financialexpress.com/2018/06/cats-168-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/cats-168-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/cats-168-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Rising incomes, increasing awareness and high aspirations in rural areas spell big opportunity for several retailers who are making a beeline for tier II and tier III towns.</figure>\n\t\t\t</section></div><span>\n</span><p>Rising incomes, increasing awareness and high aspirations in rural areas spell big opportunity for several retailers who are making a beeline for tier II and tier III towns. As these locations are unexplored and real estate costs here are 30-40% lower than those in metros and tier I cities, retailers are all the more interested. Govind Shrikhande, managing director, Shoppers Stop, said: “We are likely to open five new stores in 2018-19 and will enter four new locations of Calicut, Nashik, Guwahati and Bhubaneswar. Rs 120 crore has been earmarked for opening five department stores, 12 beauty stores and on improving our technology.”</p><span>\n</span><p><img class=\"alignnone size-full wp-image-1211334\" src=\"https://images.financialexpress.com/2018/06/123-6.jpg\" alt=\"\" width=\"384\" height=\"185\" srcset=\"https://images.financialexpress.com/2018/06/123-6.jpg 384w, https://images.financialexpress.com/2018/06/123-6-300x145.jpg 300w\" sizes=\"(max-width: 384px) 100vw, 384px\"></p><span>\n</span><p>Currently, Shoppers Stop has 83 stores operational in 38 cities spanning across 4.26 million sq ft. In May, international brand Hennes &amp; Mauritz (H&amp;M) India opened one store in Mysuru and another in Aurangabad. The company currently operates 32 stores across Delhi-NCR, Mumbai, Hyderabad, Chennai, Bengaluru, Pune, Amritsar, Indore, Coimbatore, Kolkata, Mohali, Mysore, Ahmedabad and Raipur. Pankaj Rehenjn, managing director, JLL, said: “Around 50-60% expansion by modern trade is happening in the tier II and tier III cities as the appetite to spend in these smaller cities is increasing and customers are becoming more fashion-conscious. Also, real estate costs are lower in these areas.</p><span>\n</span><p>With online retailers delivering in smaller towns and cities, customers are now aware of more brands and there is demand. Moreover, these markets are virgin and competition is less as of now.” Sumit Dhingra, chief operating officer, heritage brands division, Arvind Lifestyle Brands, said the company is focusing to expand Arrow stores in locations like Nashik, Rohtak, Gorakhpur and suburbs of Pune. Arrow at present has 250 stores in the country. While big retailers are penetrating smaller towns, Vmart, which has always focused on tier II cities, is now planning to penetrate into even smaller towns. Lalit Agarwal, chairman and managing director, Vmart, said: “Currently, the company is operating 174 stores across 147 cities and 14 states, and we plan to open more than 40 stores in 2018-19, mainly in small cities as these markets are unexplored by modern retail and there is a lot of opportunity.”</p><span>\n</span><p>However, industry experts have a word of caution for retailers expanding to smaller cities. They are of the view that customers may initially aspire to buy these brands, but getting them to return might be a challenge if the retailers don’t cater to price points and suitable merchandise in stores. Pinaki Ranjan Mishra, partner and national leader, Ernst &amp; Young India, said: “High-end fashion available in cities may not appeal to customers residing in smaller towns. Prices also might be high for small towns, which will make it difficult for retailers to survive in these markets. While real estate costs are low, product prices and merchandise will play a large role for success in these locations.”</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "several",
        "high",
        "II",
        "III",
        "Rising",
        "increasing",
        "rural",
        "big"
    ],
    "nouns": [
        "expansion",
        "high",
        "opportunity",
        "Why",
        "Rising",
        "awareness",
        "tier",
        "spell",
        "II",
        "making",
        "III",
        "beeline"
    ],
    "verbs": [
        "spell"
    ]
}