{
    "creator": "Chirag Madia",
    "title": "One more rate hike strong possibility in next two policy meets, says Amandeep Chopra of UTI Asset Management Company",
    "link": "https://www.financialexpress.com/industry/one-more-rate-hike-strong-possibility-in-next-two-policy-meets-says-amandeep-chopra-of-uti-asset-management-company/1211232/",
    "pubDate": "Tue, 19 Jun 2018 01:38:48 +05:30",
    "dc:creator": "Chirag Madia",
    "content": "The one risk which we are getting conscious about is the impact on corporate credit quality in a rising interest rate environment, says Amandeep Chopra, group president and head-Fixed Income, UTI Asset Management Company (AMC). ",
    "contentSnippet": "The one risk which we are getting conscious about is the impact on corporate credit quality in a rising interest rate environment, says Amandeep Chopra, group president and head-Fixed Income, UTI Asset Management Company (AMC).",
    "guid": "https://www.financialexpress.com/?p=1211232",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-18T20:08:48.000Z",
    "sentiment": {
        "score": 4,
        "comparative": 0.21052631578947367,
        "tokens": [
            "one",
            "more",
            "rate",
            "hike",
            "strong",
            "possibility",
            "in",
            "next",
            "two",
            "policy",
            "meets",
            "says",
            "amandeep",
            "chopra",
            "of",
            "uti",
            "asset",
            "management",
            "company"
        ],
        "words": [
            "asset",
            "strong"
        ],
        "positive": [
            "asset",
            "strong"
        ],
        "negative": []
    },
    "article": {
        "title": "One more rate hike strong possibility in next two policy meets, says Amandeep Chopra of UTI Asset Management Company",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1211239\" src=\"https://images.financialexpress.com/2018/06/uti-l-screenshot.jpg\" alt=\"corporate credit quality,&nbsp;UTI Asset Management Company, interest rate,&nbsp;debt market\" srcset=\"https://images.financialexpress.com/2018/06/uti-l-screenshot.jpg 660w, https://images.financialexpress.com/2018/06/uti-l-screenshot-300x200.jpg 300w, https://images.financialexpress.com/2018/06/uti-l-screenshot-620x413.jpg 620w, https://images.financialexpress.com/2018/06/uti-l-screenshot-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The one risk which we are getting conscious about is the impact on corporate credit quality in a rising interest rate environment, says Amandeep Chopra, group president and head-Fixed Income, UTI Asset Management Company (AMC).</figure>\n\t\t\t</section></div><span>\n</span><p>The one risk which we are getting conscious about is the impact on corporate credit quality in a rising interest rate environment, says Amandeep Chopra, group president and head-Fixed Income, UTI Asset Management Company (AMC). In an interview to Chirag Madia, Chopra says that one more rate hike by the <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a> has a strong possibility in the next two policy meets. Edited excerpts:</p><span>\n</span><p>Was the Reserve Bank of India’s recent rate hike on expected lines? What is your outlook on debt markets?</p><span>\n</span><p>The markets had priced in the hike though the opinion polls as per Bloomberg did not share a consensus view. The policy in some ways tried to moderate hawkishness by maintaining a neutral stance. This in our view indicates data dependent rate hike and not a tightening cycle. There could be similar tactical moves like we saw in 2013 when inflation shot-up, volatility in currency and concerns related to flows from emerging market had led RBI to hike repo rates three times. From the debt market’s perspective, we are going to see current year as a period of adjustments. I think adjustments are justified given the changing macro environment, which was at its best in March 2017 and has been deteriorating as reflected in inflation trajectory, current account deficit and other key variables. We are also in a year where there is fair amount of concern emerging around populism politics in terms of policy initiatives around minimum support price (MSPs), loan waivers etc. As we head into election year, will government become populist? We have seen agitation by the farmers and they are not happy with the price levels. They want to be compensated for their cost of production. I think that would lead to additional impetus as far as inflation trajectory is concerned. But as things stand today, the government seems to be conscious about the impact of its decision on inflation and consequently on interest rates, if they are not too aggressive in price hikes under MSPs then it might be comforting for the markets.</p><span>\n</span><p>Where do you think the benchmark bond yield will settle?</p><span>\n</span><p>The 10-year benchmark yield, which is close to around 7.9%, is likely to be in the range of 7.75%-8.25% in this financial year. Here I am pricing in two more rate hikes this fiscal. Among all the gloom, the comforting factors are normal monsoon this year limiting additional stress on agri prices, OMOs in second half of FY19 and inflation trending down in second half of 2019. How are you managing the portfolio at this point of time? We have been little conservative and low on duration in most of our debt funds. So for example, in short term funds we are sitting in duration of one to one and half years, for ultra short term funds duration is around six months. Even in the long bond funds, we are sitting on average maturity of three and half to four years, which is typically half of what we typically invest. So our focus from the portfolio management is to wait out this period of volatility and we are not turning bullish as yet.</p><span>\n</span><p>In such scenario where do you see interest rates moving going forward?</p><span>\n</span><p>Our view right now is that, in the next RBI policy in August, there are chances of a hike of 25 basis points. Rate hike will be influenced by the strong core inflation and its momentum as also oil and minimum support prices (MSP), which are likely to be announced in next one month or so). So if oil stays at current levels and MSP rates are increased aggressively, we could see rate hike. Even if oil moves up sharply and MSP rates are increased moderately, such scenario could also lead to a rate hike. The only way we might not see rate hikes in August is that, both oil and MSP’s moderate… But with a strong and sticky core and likely Fed rate hike in September, the rate hike will be pushed to October policy with more clarity on data points. So in the next two policy meets, one more rate hike by RBI has a strong possibility.</p><span>\n</span><p>As a fund manager which are the key risks or concerns in the debt markets?</p><span>\n</span><p>The one risk which we are getting conscious about is the impact on the corporate credit quality in a rising interest rate environment. This could be a cause of concern as in the rising interest rates scenario, cost of funds-specially for the leveraged and more weaker — lower rated — corporate balance sheet could become an issue. Till now they were benefiting from declining interest rates and if they have not de-leveraged or chose growth through leverage, then I think risks with higher cost of capital to their cash flows increase. This could impact their ratings. Another factor that might have some impact is from the foreign portfolio investors (FPIs) and if they start selling aggressively in debt markets. We are in a way part of the emerging market basket and typically flows effect local markets beyond what the macros would dictate and right now it has been very moderate. There has been $5 billion outflows from the bond market by the FPIs, no new money is coming in — but for now outflows are not too big. Thankfully, our macros are better in the EM space, But sometimes FPIs take a very broad brush approach in their EM exposures and they just want to reduce, irrespective of the country. I think that will add to the pressure for the bond market.</p><span>\n</span><p>Given the current situation, what strategy should investor adopt at this point of time?</p><span>\n</span><p>First product at this time from the investors perspective should certainly be fixed maturity plans (FMPs). I think investors should take the opportunity to add these funds as, three years AAA quasi-sovereign bond are yielding anywhere between 8.30%-8.40%, and that’s an extremely attractive levels. They can earn over 8% without taking any significant credit risk. Secondly, they can also look at short term income funds and low risk credit risk funds. Even in the last one year, when yields moved up sharply, these funds have outperformed other debt funds category like bonds funds and dynamic fund funds. So yes, there will be volatility in such funds for the next 12-24 months, but return profile is much better now as markets have seemingly priced in a lot of pessimism in their outlook on interest rates and we do not see a repeat of what happened with rates over last 8 months.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "two",
        "strong",
        "next",
        "rising",
        "One",
        "one",
        "conscious",
        "corporate",
        "quality",
        "Fixed"
    ],
    "nouns": [
        "two",
        "rate",
        "hike",
        "possibility",
        "policy",
        "One",
        "one",
        "Asset",
        "Management",
        "Company",
        "risk",
        "rising",
        "getting",
        "impact",
        "credit",
        "quality",
        "interest",
        "environment",
        "group",
        "president",
        "head",
        "Income"
    ],
    "verbs": [
        "rate",
        "hike",
        "Company",
        "risk",
        "impact",
        "credit",
        "interest",
        "group",
        "head"
    ]
}