{
    "creator": "Meghna Sharma,Anushree Bhattacharyya",
    "title": "FIFA World Cup 2018: Sony to ‘Liv’ it up – 10 sec spots going at Rs 3.5-4 lakhs; Rs 200 cr revenue aimed",
    "link": "https://www.financialexpress.com/industry/fifa-world-cup-2018-sony-to-liv-it-up-10-sec-spots-going-at-rs-3-5-4-lakhs-rs-200-cr-revenue-aimed/1211381/",
    "pubDate": "Tue, 19 Jun 2018 05:35:06 +05:30",
    "dc:creator": "Meghna Sharma,Anushree Bhattacharyya",
    "content": "As advertisers jostle for space between football matches, Sony Pictures Network and its video over-the-top (OTT) platform Sony Liv are making the most of the FIFA World Cup.",
    "contentSnippet": "As advertisers jostle for space between football matches, Sony Pictures Network and its video over-the-top (OTT) platform Sony Liv are making the most of the FIFA World Cup.",
    "guid": "https://www.financialexpress.com/?p=1211381",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-19T00:05:06.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "fifa",
            "world",
            "cup",
            "2018",
            "sony",
            "to",
            "‘liv’",
            "it",
            "up",
            "–",
            "10",
            "sec",
            "spots",
            "going",
            "at",
            "rs",
            "35-4",
            "lakhs",
            "rs",
            "200",
            "cr",
            "revenue",
            "aimed"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "FIFA World Cup 2018: Sony to ‘Liv’ it up – 10 sec spots going at Rs 3.5-4 lakhs; Rs 200 cr revenue aimed",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1211386\" src=\"https://images.financialexpress.com/2018/06/wc-1.jpg\" alt=\"FIFA World Cup 2018, sony,&nbsp;revenue, football,&nbsp;Sony Pictures Network,&nbsp;Sony Liv,&nbsp;Sony Liv revenue\" srcset=\"https://images.financialexpress.com/2018/06/wc-1.jpg 660w, https://images.financialexpress.com/2018/06/wc-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/wc-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/wc-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> As advertisers jostle for space between football matches, Sony Pictures Network and its video over-the-top (OTT) platform Sony Liv are making the most of the FIFA World Cup.</figure>\n\t\t\t</section></div><span>\n</span><p>As advertisers jostle for space between football matches, Sony Pictures Network and its video over-the-top (OTT) platform Sony Liv are making the most of the FIFA World Cup. With ten second spots going at Rs 3.5-4 lakh, the official broadcaster for the event is hoping to net revenues of Rs 200 crore; that’s twice the amount it made during the last World Cup. Sony Liv is expecting to earn advertising revenues of Rs 50 crore from the once-in-four-years event. Uday Sodhi, EVP, SonyLiv, explained the advertising inventory had been bundled and sold across six languages to advertisers. “We also have exclusive advertisers who opted to buy spots only on the digital platform,” Sodhi said. Moreover, if viewers want a live feed for the India-England cricket series too they can buy a three-month combo subscription for Rs 149 or a six-month pack for Rs 199; else they can stay with a one-month package which comes for Rs 99 a month.</p><span>\n</span><p>Viewers can also watch the matches free on a delayed feed. With 14 brands on board, SPN could well achieve its revenue target. Rohit Gupta, president, network sales and international business, SPN, says the interest levels are high given FIFA is one of the biggest sporting events in the world. Among the sponsors are Hero MotoCorp, Parle Agro, <a target=\"_blank\" href=\"http://www.financialexpress.com/auto/new-cars/volkswagen/\">Volkswagen</a>, Castrol, Apollo Tyres, Apple, Uber, Amul, <a target=\"_blank\" href=\"http://www.financialexpress.com/auto/new-cars/honda/\">Honda</a> Motors and Carlsberg. For the first time, the FIFA World Cup is being telecast in multiple languages — English, Hindi, Bangla, Tamil, Telugu and Malayalam — in India. Sunil Chhetri will host the pre-, mid- and post-match live studio show, Football Extraaa. SPN is also showcasing detailed insights in the morning through its breakfast show, Kick-Off.</p><span>\n</span><p>SonyLiv is using its tie-ups with Airtel and RelianceJio to drive viewership. “Users of Airtel and Jio would be able to watch the matches through their respective apps – Airtel TV and Jio TV,” he said. Viewers are required to pay for data while they are allowed to watch the content for free. The ‘unofficial’ sponsor of fans this IPL season, Vodafone, is engaging with football fans through its app to cater for digital savvy customers. Kavita Nair, associate director, commercial operations, Vodafone India said “gamifying things” on the app makes it an opportunity for customers as well as for the company. Seeing the event as an unrivaled opportunity to reach out to 3.5 billion people across the globe, Budweiser has planned multiple activations to bring alive the FIFA World Cup experience for fans in India by hosting screenings at over 250 locations across the country, along with launching its own IP — BUD 90.</p><span>\n</span><p>“We are also launching our hero asset— special sound activated Red Light Cups to increase the energy levels of football celebrations,” says AB InBev, marketing director – India, Kartikeya Sharma, who believes that the partnership with FIFA World Cup will help the brand connect with its Indian fans. “For an F&amp;B brand or basically youth centric brands, it makes sense to ride the FIFA wave. But for an FMCG one, it doesn’t make much sense as FIFA, unlike IPL, doesn’t have a pan-India appeal,” observes Dheeraj Sinha, MD – India and chief strategy officer – South Asia, Leo Burnett. Having said that he adds that the football culture has gotten better over time in India and for a marketer here, it has its own functions.</p><span>\n</span><p>Adidas, one of the official sponsors for the tournament as well as the official supply partner, has created a consumer engagement space in Mumbai and Bangalore. Meanwhile, <a target=\"_blank\" href=\"http://www.financialexpress.com/auto/new-cars/hyundai/\">Hyundai</a> Motor, the official automotive partner of FIFA since 1999, is creating ‘Home Dug Out’ experiences for 15 lucky football fans across India at their homes to connect with the youth and sports enthusiasts. As per reports, FIFA expects to generate $ 6.1 billion in revenue from the World Cup happening in Moscow. The video streaming platform has roped in 15 advertisers so far. Of this five brands including Patanjali, Swiggy, Cadbury, Association of Mutual Funds in India (AMFI) and Nivea have come on board as sponsors.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "World",
        "Liv",
        "10",
        "sec",
        "going",
        "200",
        "top"
    ],
    "nouns": [
        "Cup",
        "World",
        "10",
        "sec",
        "going",
        "spots",
        "cr",
        "revenue",
        "As",
        "jostle",
        "space",
        "football",
        "Network",
        "video",
        "platform",
        "making",
        "top"
    ],
    "verbs": [
        "Cup",
        "jostle",
        "space",
        "Network",
        "top"
    ]
}