{
    "title": "Insurers want IT system for Ayushman Bharat scheme to check quality, fraud",
    "link": "https://www.business-standard.com/article/finance/insurers-want-it-system-for-ayushman-bharat-scheme-to-check-quality-fraud-118060600675_1.html",
    "pubDate": "Wed, 06 Jun 2018 16:11:00 +0530",
    "content": "Aadhaar cards will become insurance cards so that insurers and other participants can verify beneficiaries",
    "contentSnippet": "Aadhaar cards will become insurance cards so that insurers and other participants can verify beneficiaries",
    "guid": "https://www.business-standard.com/article/finance/insurers-want-it-system-for-ayushman-bharat-scheme-to-check-quality-fraud-118060600675_1.html",
    "isoDate": "2018-06-06T10:41:00.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.08333333333333333,
        "tokens": [
            "insurers",
            "want",
            "it",
            "system",
            "for",
            "ayushman",
            "bharat",
            "scheme",
            "to",
            "check",
            "quality",
            "fraud"
        ],
        "words": [
            "fraud",
            "quality",
            "want"
        ],
        "positive": [
            "quality",
            "want"
        ],
        "negative": [
            "fraud"
        ]
    },
    "article": {
        "title": "Insurers want IT system for Ayushman Bharat scheme to check quality, fraud",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=insurance\" target=\"_blank\">Insurance </a>companies want an integrated and real-time Information Technology (IT) network for the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=prime+minister+rashtriya+swasthya+suraksha+mission\" target=\"_blank\">Prime Minister </a><a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=rashtriya+swasthya+suraksha\" target=\"_blank\">Rashtriya Swasthya Suraksha </a>Mission (PMRSSM) or Ayushman Bharat scheme, so as to administer claims and check the quality of service patients receive. Additionally, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=aadhaar\" target=\"_blank\">Aadhaar </a>cards will become <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=insurance\" target=\"_blank\">insurance </a>cards so that insurers and other participants can verify beneficiaries.</p>\n<p>\n\tThe IT network which will connect <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=insurance\" target=\"_blank\">insurance </a>companies, state health agency(s) (SHA) appointed to implement and regulate PMRSSM and third-party administrators is needed so that problems of interoperability and portability that were faced under the Rashtriya Swasthrya Bima Yojana (RSBY) are not repeated.</p>\n<p>\n\tPMRSSM will launch on August 15 of 2018, and will provide a health insurance cover of Rs 500,000 to around 100 million families or 500 million individuals. The scheme is estimated to cost the Central government around Rs 120 billion each year.</p>\n<p>\n\tMayank Bathwal, CEO <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=aditya+birla\" target=\"_blank\">Aditya Birla </a>Health Insurance Company Limited, says. “As of now we know that portability will apply in PMRSSM however, the details of implementation are yet to come.  In case of Trust and Insurance mix, portability is going to be a challenge. We will wait for PMRSSM to offer clarity on this.”</p>\n<p>\n\tSeveral reports over the years have illustrated how patients were denied services in other RSBY empanelled hospitals (in different states and districts than of the patients’), despite portability being a core feature of the scheme.</p>\n<p>\n\tUnder RSBY, people were denied <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=healthcare+services\" target=\"_blank\">healthcare services </a>when they moved to another state and were also denied services when they went to another district to receive treatment.</p>\n<p>\n\tTwo factors affect the portability of any insurance scheme, like RSBY, the first is inter-state and intra-state differences in premium rates and underlying healthcare infrastructure, and the second is the lack of oversight on the different service providers and patients.</p>\n<p>\n\tThere are great differences in premiums between states, for example under RSBY in Kerala insurers charge a premium rate of Rs 738, whereas in Assam it is around Rs 320.  And the same extends to districts within a state, for example in Gujarat premiums in Banaskantha (distrcit) is Rs 640 and the rate drops to Rs 342 in Navsari.</p>\n<p>\n\t“Principally, keeping premiums as granular as possible on the basis of the location is a good idea. However, if the premium is to be based on the geographical location where the cost of the treatment is lower, the challenge this creates is when someone travels to another area - like a major city, the treatment costs would be higher,” says Anurag Rastogi, Member of Executive Management, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=hdfc+ergo+general+insurance\" target=\"_blank\">HDFC ERGO General Insurance.</a></p>\n<p>\n\tUnder PMRSSM one insurance company will be contracted to provide the cover for all beneficiaries in the state, so that the profitable districts balance out loss-making ones. This is why a core IT infrastructure that can match and monitor such behaviour is needed, but further details are being awaited, say insurers.</p>\n<p>\n\tThere can be difference in pricing based on location, so if an insurer is given one or two states or a few districts then the costs of running the scheme should even out. To make it less complex maybe we can have one-rate for one-state, says Dr. S. Prakash, Chief Operating Officer at <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=star+health+and+allied+insurance\" target=\"_blank\">Star Health and Allied Insurance.</a></p>\n<p>\n\tThis system would allow inter-operatability allowing a person who travels to another city, town or state, to avail of the PMSRSSM insurance cover at any hospital within the network.</p>\n<p>\n\tRastogi says “Certain restrictions would have to be imposed on treatments outside one's city, or there could be co-payments for treatments in certain geographies where the costs are higher.”</p>\n<p>\n\tAnother problem that was faced under RSBY was authenticating that the right patient received the right treatment, which requires transparency from both the patient and hospital.</p>\n<p>\n\t“The major pitfall in the [RSBY] scheme there was no authentication or proof of the procedure being done when the payment is done,” said Dr Prakash.</p>\n<p>\n\tBusiness Standard has learnt that patients are being enrolled onto PMRSSM on the basis of existing Socio-Economic Caste Surveys and the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=aadhaar\" target=\"_blank\">Aadhaar </a>database. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=aadhaar\" target=\"_blank\">Aadhaar </a>cards will be used by PMRSSM beneficiaries for accessing the requisite <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=healthcare+services\" target=\"_blank\">healthcare services.</a></p>\n<p>\n\tTherefore, the high enrolment costs incurred by companies under RSBY have virtually vanished. It cost around Rs 100 to Rs 130 to enrol patients and issue smart cards under RSBY.</p>\n<p>\n\t“The Aadhaar card will work as an insurance card,” confirmed three industry executives, stating that enrolment under the scheme is now automatic.</p>\n<p>\n\tWhile an integrated IT system for claims management and premium re-imbursement is highly desirable and effective, the linking of health records to Aadhaar numbers, an allegation which the UIDAI has refuted doing as recently as in April. This raises several concerns on privacy and data security of patients and of citizens. </p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "quality"
    ],
    "nouns": [
        "insurance",
        "system",
        "cards",
        "scheme",
        "want",
        "IT",
        "Bharat",
        "check",
        "quality",
        "fraud",
        "will",
        "so"
    ],
    "verbs": [
        "scheme",
        "want",
        "check",
        "will",
        "become",
        "verify"
    ]
}