{
    "creator": "FE Bureau",
    "title": "Working for corruption-free housing sector: PM Narendra Modi",
    "link": "https://www.financialexpress.com/industry/working-for-corruption-free-housing-sector-pm-narendra-modi/1195064/",
    "pubDate": "Wed, 06 Jun 2018 04:49:47 +05:30",
    "dc:creator": "FE Bureau",
    "content": "The government has also been able to reduce the time needed to build a house from 18 months to 12 months, thereby saving about 6 months, he said.",
    "contentSnippet": "The government has also been able to reduce the time needed to build a house from 18 months to 12 months, thereby saving about 6 months, he said.",
    "guid": "https://www.financialexpress.com/?p=1195064",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-05T23:19:47.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "working",
            "for",
            "corruption-free",
            "housing",
            "sector",
            "pm",
            "narendra",
            "modi"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Working for corruption-free housing sector: PM Narendra Modi",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1195070\" src=\"https://images.financialexpress.com/2018/06/modi-l-1-2-1.jpg\" alt=\"pm marendra modi, narendra modi, housing sector, corruption\" srcset=\"https://images.financialexpress.com/2018/06/modi-l-1-2-1.jpg 660w, https://images.financialexpress.com/2018/06/modi-l-1-2-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/modi-l-1-2-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/modi-l-1-2-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The government has been working to free the housing sector from middlemen, corruption and ensuring that the beneficiaries get their homes without hassles, Prime Minister Narendra Modi said.</figure>\n\t\t\t</section></div><span>\n</span><p>The government has been working to free the housing sector from middlemen, corruption and ensuring that the beneficiaries get their homes without hassles, Prime Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/narendra-modi/\">Narendra Modi</a> said. The PM on Tuesday interacted with the beneficiaries of affordable housing through video conferencing. He has been interacting with beneficiaries of various central schemes as “one gets to know various aspects of the scheme including some of the areas where we can improve”.</p><span>\n</span><p>He said the government is working on the goal to get every Indian home by 2022. “The NDA government is giving great importance to the housing sector. We are working towards ensuring that every Indian has a home by 2022, when India marks 75 years since Independence,” he said, adding that in the last four years, the government has taken a mission mode approach towards providing housing for all.</p><span>\n</span><p>He also said that use of latest technology is ensuring faster construction of affordable houses for the poor in towns and villages. “PMAY is linked with dignity of our citizens. Due to PMAY, there are employment opportunities being created for the people. At the same time, we are working on skill development to enable faster and better quality construction of the houses,” he said.</p><span>\n</span><p>Under the PMAY, the government plans to build around three crore houses in rural areas and one crore houses in urban areas. The government has so far given sanctions to build more than 47 lakh houses in urban areas, which is four times more than the sanctions given by the previous government in 10 years, he said. There have been sanctions to build more than one crore houses in the rural areas compared to 25 lakh sanctions by the previous government in its last 4 years, he added.</p><span>\n</span><p>The government has also been able to reduce the time needed to build a house from 18 months to 12 months, thereby saving about 6 months, he said. Emphasising on the changes brought by the present government in the PMAY, Modi said the size of houses built have been increased to 25 sq metre from 20 sq metres. The financial assistance for the scheme has also been enhanced up to Rs 1,25,000 from the earlier allocation of Rs 70,000-75,000, he said.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "Working",
        "free",
        "able",
        "needed",
        "18",
        "12",
        "saving"
    ],
    "nouns": [
        "Working",
        "corruption",
        "free",
        "housing",
        "house",
        "sector",
        "PM",
        "government",
        "time",
        "build",
        "18",
        "12",
        "saving"
    ],
    "verbs": [
        "free",
        "house",
        "reduce",
        "time",
        "build"
    ]
}