{
    "creator": "Bloomberg",
    "title": "This Chinese stock surged 9,500%, turned companies cooks, cleaners into millionaires",
    "link": "https://www.financialexpress.com/market/this-chinese-stock-surged-9500-turned-companies-cooks-cleaners-into-millionaires/1195691/",
    "pubDate": "Wed, 06 Jun 2018 14:54:18 +05:30",
    "dc:creator": "Bloomberg",
    "content": "Data showed that China’s Sunny Optical Technology Group’s unusual decision to hand out stakes to early employees, regardless of their position, has turned hundreds of them into millionaires. ",
    "contentSnippet": "Data showed that China’s Sunny Optical Technology Group’s unusual decision to hand out stakes to early employees, regardless of their position, has turned hundreds of them into millionaires.",
    "guid": "https://www.financialexpress.com/?p=1195691",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-06T09:24:18.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "this",
            "chinese",
            "stock",
            "surged",
            "9500",
            "turned",
            "companies",
            "cooks",
            "cleaners",
            "into",
            "millionaires"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "This Chinese stock surged 9,500%, turned companies cooks, cleaners into millionaires",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1177854\" src=\"https://images.financialexpress.com/2018/05/stock-market2.jpg\" alt=\"Stock Investment, stock market, stock market India, share market, how to determine financial health of stocks, how to invest in stocks, how to invest in stock market\" srcset=\"https://images.financialexpress.com/2018/05/stock-market2.jpg 660w, https://images.financialexpress.com/2018/05/stock-market2-300x200.jpg 300w, https://images.financialexpress.com/2018/05/stock-market2-620x413.jpg 620w, https://images.financialexpress.com/2018/05/stock-market2-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Sunny Optical is now a  billion behemoth that supplies lenses to the likes of Samsung and Xiaomi.</figure>\n\t\t\t</section></div><span>\n</span><p>At most big companies, it’s pretty clear who the millionaires are: top executives, rainmakers, science whizzes with PhDs. But at China’s Sunny Optical Technology Group — whose stock has climbed faster than any other in MSCI Inc.’s global indexes over the past decade — the richest employees are just as likely to be factory workers, janitors and cafeteria chefs. The lens maker’s unusual decision to hand out stakes to early employees, regardless of their position, has turned hundreds of them into millionaires, according to data compiled by Bloomberg.</p><span>\n</span><p>The previously unreported value of their holdings has ballooned as Sunny Optical’s shares surged more than 9,500 percent since June 2008, trouncing even Netflix Inc.’s 7,500 percent gain. Founded more than three decades ago by a former appliance-factory worker with a high school education and less than $10,000 of borrowed cash, Sunny Optical is now a $22 billion behemoth that supplies lenses to the likes of Samsung and <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/xiaomi/\">Xiaomi</a>. Growing demand for cameras in smartphones, cars and drones fueled a decade-long streak of rising profits at the company, helping propel the shares’ dizzying rally.</p><span>\n</span><p>“Possibly Sunny Optical is the most outstanding example in terms of the wealth generated for the workers,” Louis Putterman, a professor at Brown University who specializes in the Chinese economy, wrote in an email. While its approach toward employee stock rewards may be atypical, Sunny Optical’s rise is a prime example of the kind of high-tech success story Chinese policy makers are trying to nurture as they push the economy toward a more sustainable growth model. The company also underscores the changing face of wealth in China, where tech-industry players make up an increasing proportion of the country’s millionaires — a group that Credit Suisse Group AG estimates swelled to 2 million people last year.</p><span>\n</span><p>Sunny Optical’s affluent employees have benefited from the largesse of Wang Wenjian, who started the company in Yuyao, a small city on China’s eastern coast, in 1984. When Sunny Optical restructured from a so-called village and township enterprise into a joint-stock company in the 1990s, Wang took the rare step of distributing stakes beyond top management and later organizing the holdings into a trust that now has about 400 holders and owns 35 percent of the Hong Kong-listed company.</p><span>\n</span><p>“When money gathers, people will be apart; when money is scattered, people will gather,” Wang wrote in a book on Sunny Optical’s history published last year. The company, which confirmed that it still has about 400 people in its employee trust, declined to make Wang available for an interview.</p><span>\n</span><p><strong>Cooks, Cleaners</strong></p><span>\n</span><p>Leaving a 6.8 percent stake for himself in 1994, Wang allowed quality inspectors, company cooks and cleaners to subscribe for shares at a negligible cost based on their position and years of service. While Sunny Optical doesn’t break down how many shares each employee owns and it’s unclear how many of them are still working at the company, data from regulatory filings compiled by Bloomberg offer a partial glimpse of the extraordinary fortunes they’ve amassed.</p><span>\n</span><p>A mere 0.013 percent stake in the employee trust would be enough to mint a millionaire. Excluding the combined 16 percent ownership of four directors in the trust, the average holding would translate to about $17 million per employee. Wang, 70, who retired from his chairman role in 2012, still owns a 3.7 percent stake valued at more than $800 million, according to the Bloomberg Billionaires Index.</p><span>\n</span><p>Sunny Optical, which had an initial public offering in Hong Kong in 2007, now employs more than 28,000 full-time staff spread across four production sites in China, and offices in North America, Japan, South Korea, Singapore and Taiwan. The shares have continued their rally in 2018, climbing 66 percent to rank as the top performer in Hong Kong’s benchmark Hang Seng Index as of Wednesday. Sunny Optical shares surged 6.1 percent as of 10:36 a.m. in Hong Kong. Sunny Optical’s profit soared more than sixfold in the five years ended 2017 as selfie-obsessed smartphone users spurred demand for cameras with higher image resolutions.</p><span>\n</span><p>The company is also benefiting from the growing use of cameras in cars to support safety functions, as well as the use of optical components in drones. Sunny Optical “has leaped over the obstacles, transforming from a low-end lens maker into an innovative lens-solutions provider, which helps drive its share price,” said Phelix Lee, an analyst at Sunwah Kingsway Capital Holdings in Hong Kong, who rates the shares a buy.</p><span>\n</span><p>There are risks to Sunny Optical’s shares, including a valuation that’s almost four times that of the Hang Seng Index. It’s also vulnerable to any potential selloff from an escalating trade war between the U.S. and China, which has ensnared companies such as ZTE Corp., Elsie Sheng, an analyst at Orient Securities (Hong Kong) Ltd., wrote in a June 4 note to clients. Any disruptions at customers such as Huawei Technologies Co. could also hurt sales. In April, news that Huawei was being probed by U.S. authorities for possible violations of trade sanctions sent Sunny Optical shares down by the most in a month before rebounding.</p><span>\n</span><p>Sunny Optical says it still has room to expand: the company has set a target to boost sales by five-fold to 100 billion yuan ($15.6 billion) over the next decade. Most analysts still love the stock, with the average price target tracked by Bloomberg implying an 8 percent gain over the next 12 months. Wherever the shares go from here, many of Sunny Optical’s early employees are already millionaires — and billionaires in their local currency. They’re in a different league from other workers in Yuyao, where the average annual income was around 46,125 yuan last year.</p><span>\n</span><p>One of the lucky employees is 50-year-old Wang Wenjie, who was the first university graduate hired by Sunny Optical when he joined the company in 1989 (Wang isn’t related to the founder). Now a vice president, he owns a 4.9 percent slice of the employee trust and some additional shares awarded by the company, making him the owner of combined stock valued at more than $400 million, according to data compiled by Bloomberg.</p><span>\n</span><p>At a business forum in the city of Ningbo in May, Wang was very much a celebrity. Attendees took pictures of him non-stop as he delivered a presentation and people jostled for introductions as soon as he stepped off stage. In an interview on the sidelines of the conference, Wang said the founder’s move to open up his firm’s ownership was unique at a time when it was customary for the top leaders to keep tight control. “In our firm, a helper handing food to you in the canteen may as well be a billionaire” in yuan terms, Wang said. “We did one thing well — building a team and keeping them growing.”</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "Chinese",
        "stock",
        "500",
        "turned",
        "Sunny",
        "Optical",
        "early",
        "regardless",
        "unusual"
    ],
    "nouns": [
        "Chinese",
        "China",
        "stock",
        "500",
        "cleaners",
        "Data",
        "Technology",
        "Group",
        "decision",
        "hand",
        "stakes",
        "position"
    ],
    "verbs": [
        "stock",
        "Group",
        "hand",
        "position"
    ]
}