{
    "title": "Sensex shrugs off rate hike, up 276 pts; experts welcome RBI move",
    "link": "https://www.business-standard.com/article/specials/sensex-shrugs-off-rate-hike-up-276-pts-experts-welcome-rbi-move-118060601474_1.html",
    "pubDate": "Wed, 06 Jun 2018 23:48:00 +0530",
    "content": "Neutral stance by RBI allays fears of further tightening; experts say move warranted to stem outflows by foreign investors",
    "contentSnippet": "Neutral stance by RBI allays fears of further tightening; experts say move warranted to stem outflows by foreign investors",
    "guid": "https://www.business-standard.com/article/specials/sensex-shrugs-off-rate-hike-up-276-pts-experts-welcome-rbi-move-118060601474_1.html",
    "isoDate": "2018-06-06T18:18:00.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.16666666666666666,
        "tokens": [
            "sensex",
            "shrugs",
            "off",
            "rate",
            "hike",
            "up",
            "276",
            "pts",
            "experts",
            "welcome",
            "rbi",
            "move"
        ],
        "words": [
            "welcome"
        ],
        "positive": [
            "welcome"
        ],
        "negative": []
    },
    "article": {
        "title": "Sensex shrugs off rate hike, up 276 pts; experts welcome RBI move",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tEquity <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/markets\" target=\"_blank\">markets </a>gained about one per cent on Wednesday even as the Reserve Bank of India (RBI) raised policy rates by 25 basis points (bps) to 6.25 per cent.</p>\n<p>\n\tMost economists were expecting the central bank to keep the rates unchanged.</p>\n<p>\n\tThe surprise hiked didn’t dampen the market mood as the RBI stuck to its neutral stance, signalling that it doesn’t intend to embark on a tightening cycle. Market players said the hike was warranted to stem the foreign institutional investor (FII) outflow and rupee weakness.</p>\n<p>\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/sensex\" target=\"_blank\">Sensex </a>gained 276 points, or 0.8 per cent to 35,179, while the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=nifty+50+index\" target=\"_blank\"></a><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nifty\" target=\"_blank\">Nifty </a>50 index rose 0.9 per cent to 10,685. The Bank <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nifty\" target=\"_blank\">Nifty </a>index gained 0.4 per cent. The broader market <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nifty\" target=\"_blank\">Nifty </a>Midcap 100 and Smallcap 100 index rose 1.4 per cent and 1.7 per cent, respectively. Market players say short-covering and value buying following six straight days of losses also contributed to the gains.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/finance/rbi-monetary-policy-full-text-repo-rate-hiked-by-25-bps-after-4-years-118060600583_1.html\" target=\"_blank\">Full text of RBI Monetary policy: Repo rate hiked by 25 bps after 4 years</a></strong></p>\n\n<p>\n\t“The global backdrop has become more important in recent months. Emerging market economies are opting for interest rate hikes to defend their currencies at a time of strong portfolio outflows,” said Mahesh Singhi, managing director, Singhi Advisors.</p>\n<p>\n\tThe rupee closed at a one-month high of 66.92 against the dollar on Wednesday. The domestic currency has been one of the worst-performers in Asia having corrected nearly five per cent against the dollar this year. The slide in the rupee has been spooking overseas investors, who have pulled out around $7 billion from domestic equities and debt since April. <br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/finance/rbi-announces-hike-in-limits-for-cheaper-loan-for-affordable-housing-118060600824_1.html\" target=\"_blank\">RBI announces hike in limits for cheaper loan for affordable housing</a></strong></p>\n\n<p>\n\tNot just India, but most emerging <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/markets\" target=\"_blank\">markets </a>have seen a rout triggered by stronger dollar and higher US interest rates. Most central banks have resorted to policy tightening to calm the market.<br></p><p>\n\t\t<img align=\"left\" alt=\"Sensex shrugs off rate hike, up 276 pts; experts welcome RBI move\" class=\"imgCont\" height=\"280\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/06/full/1528308892-2399.jpg\" title=\"Sensex shrugs off rate hike, up 276 pts; experts welcome RBI move\" width=\"402\"></p>\n\n<p>\n\tExperts say the rate hike could provide only temporary relief if the US Federal Reserve raises rate next week and backs it with a hawkish outlook amid solid jobs growth.</p>\n<p>\n\tMotilal Oswal, chairman and MD, Motilal Oswal Financial Services, said the RBI has to tackle dichotomy.</p>\n<p>\n\t“Further tightening can hurt corporate earnings, which are at the cusp of expanding. Lowering rates are also not possible given the global volatility and oil price rise,” said Oswal.</p>\n<p>\n\tRecently, the beaten-down stocks were among the biggest gainers on Wednesday. Among the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/sensex\" target=\"_blank\">Sensex </a>components, Bharti Airtel went up the most at 4.5 per cent followed by Tata Motors and Sun Pharma which gained around 3.5 per cent each. State Bank of India (SBI) rose 2.4 per cent. Meanwhile, Asian Paints, ONGC and HDFC Bank were among the losers but declined less than one per cent each. The market breadth, however, was positive with 1,640 stocks advancing against 994, which declined.</p>\n<p>\n\tMarket players said buzz that the central government may do away with securities transaction tax (STT) added to the positive sentiment.</p>\n<p>\n\t“With recent macros and monsoon signals positive, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/markets\" target=\"_blank\">markets </a>took the rate hike in their stride. Last three days’ fall had also attracted bargain hunters, while rising potential to do away with STT helped raise the overall risk appetite,” said Anand James, chief market strategist, Geojit Financial Services.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Neutral",
        "foreign",
        "off",
        "welcome",
        "further"
    ],
    "verbs": [
        "hike",
        "rate",
        "say",
        "off",
        "welcome",
        "move",
        "further",
        "stem"
    ],
    "nouns": [
        "RBI",
        "hike",
        "rate",
        "Neutral",
        "stance",
        "say",
        "move",
        "tightening",
        "stem",
        "welcome"
    ]
}