{
    "title": "PM Awas Yojana: 33% increase in carpet area of houses under subsidy scheme",
    "link": "https://www.business-standard.com/article/economy-policy/pm-awas-yojana-33-increase-in-carpet-area-of-houses-under-subsidy-scheme-118061201453_1.html",
    "pubDate": "Wed, 13 Jun 2018 12:56:00 +0530",
    "content": "The decision is likely to benefit more people in tier three and four cities as housing cost is much lower there",
    "contentSnippet": "The decision is likely to benefit more people in tier three and four cities as housing cost is much lower there",
    "guid": "https://www.business-standard.com/article/economy-policy/pm-awas-yojana-33-increase-in-carpet-area-of-houses-under-subsidy-scheme-118061201453_1.html",
    "isoDate": "2018-06-13T07:26:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.07692307692307693,
        "tokens": [
            "pm",
            "awas",
            "yojana",
            "33",
            "increase",
            "in",
            "carpet",
            "area",
            "of",
            "houses",
            "under",
            "subsidy",
            "scheme"
        ],
        "words": [
            "increase"
        ],
        "positive": [
            "increase"
        ],
        "negative": []
    },
    "article": {
        "title": "PM Awas Yojana: 33% increase in carpet area of houses under subsidy scheme",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tIn a major boost to affordable housing, the government on Tuesday said it has raised the carpet area of houses eligible for subsidy under Credit Linked Subsidy Scheme (CLSS) by 33 per cent for the Middle-Income Group (MIG) segment.</p>\n<p>\n\t\"These enhancements will now enable more MIG customers to qualify for subsidy and avail the benefits provided under the ambitious flagship mission of Pradhan Mantri Awas Yojana (Urban),\" the Ministry of Housing and Urban Affairs said in a statement.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe carpet area has been raised from \"up to 120 square metre\" to \"up to 160 square metre\" for MIG I, which comprise families with household income between Rs 600,000 and Rs 1,200,000. For MIG II families, with annual income between Rs 1,200,000 and Rs 1,800,000, it has been raised from \"up to 150 square metre\" to \"up to 200 square metre\".</p>\n<p>\n\tFor MIG I, the interest subsidy is four per cent, eligible housing loan amount is Rs 9 lakh and the upfront amount for subsidy is Rs 2,35,068. For MIG II, the interest subsidy is three per cent, eligible loan amount is Rs 1,200,000 and the upfront amount for subsidy is Rs 2,30,156.</p>\n<p>\n\t\"This augurs well with the Reserve <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bank\" target=\"_blank\">Bank </a>of India (RBI) policy to revise the housing loan limits for Priority Sector lending (PSL) eligibility,\" it said.</p>\n<p>\n\tThe RBI has decided to revise the housing loan limits for PSL eligibility from existing Rs 2,800,000 to Rs 3,500,000 in metropolitan centres, and from Rs 2,000,000 to Rs 2,500,000 in other centres, provided the overall cost of the dwelling unit in metro and at other centres does not exceed Rs 4,500,000 and Rs 3,000,000, respectively.</p>\n<p>\n\tThe MIG segment is an aspirational class which is upwardly mobile and the intent of the CLSS for MIG is to support the dream of every family of owning a house, the ministry said. The decision to increase the carpet area was done after inputs from various stakeholders.</p>\n<p>\n\tOne key issue was denial of CLSS benefit to potential beneficiaries as they were buying flats or constructing houses, where the carpet area exceeded the cap of either 120 square metre or 150 square metre, thus rendering them ineligible for the interest subsidy under MIG.</p>\n<p>\n\t\"The increased construction activity in housing sector has a cascading effect on core sectors like cement, steel, machinery and other allied sectors. More construction activity in the urban areas would result in creation of more jobs for both skilled and unskilled workers,\" it said.</p>\n<p>\n\tThe CLSS for MIG scheme has gained momentum in the last couple of quarters and the offtake has picked up significantly. As on June 11, 2018, an amount of Rs 7.37 million has been disbursed to 35,204 beneficiaries belonging to the MIG category, said the ministry.</p>\n<p>\n\tThe number of CLSS beneficiaries for Economically Weaker Sections (EWS) and Low-Income Group (LIG) is 133,213 and subsidy released for this segment is Rs 28.90 million.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "four",
        "three",
        "33",
        "likely"
    ],
    "verbs": [
        "lower",
        "cost",
        "carpet",
        "scheme",
        "people",
        "increase",
        "benefit"
    ],
    "nouns": [
        "lower",
        "housing",
        "four",
        "three",
        "cost",
        "carpet",
        "scheme",
        "people",
        "increase",
        "subsidy",
        "area",
        "decision",
        "benefit",
        "tier",
        "PM"
    ]
}