{
    "title": "Pharma stocks on a booster dose; Nifty Pharma up 12% in six days",
    "link": "https://www.business-standard.com/article/markets/pharma-stocks-on-a-booster-dose-nifty-pharma-up-12-in-six-days-118061300484_1.html",
    "pubDate": "Wed, 13 Jun 2018 23:52:00 +0530",
    "content": "Analysts attribute the run-up in pharma stocks to positive corporate announcements on the US drug regulatory front",
    "contentSnippet": "Analysts attribute the run-up in pharma stocks to positive corporate announcements on the US drug regulatory front",
    "guid": "https://www.business-standard.com/article/markets/pharma-stocks-on-a-booster-dose-nifty-pharma-up-12-in-six-days-118061300484_1.html",
    "isoDate": "2018-06-13T18:22:00.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.15384615384615385,
        "tokens": [
            "pharma",
            "stocks",
            "on",
            "a",
            "booster",
            "dose",
            "nifty",
            "pharma",
            "up",
            "12",
            "in",
            "six",
            "days"
        ],
        "words": [
            "nifty"
        ],
        "positive": [
            "nifty"
        ],
        "negative": []
    },
    "article": {
        "title": "Pharma stocks on a booster dose; Nifty Pharma up 12% in six days",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tShares of pharmaceutical companies gained ground for the sixth consecutive day with the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nifty-pharma\" target=\"_blank\">Nifty </a><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/pharma\" target=\"_blank\">Pharma </a>index gaining 12 per cent during this period, as compared to a 2.6 per cent jump in the Nifty 50 index.</p>\n<p>\n\tAnalysts attribute the run-up in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/pharma-stocks\" target=\"_blank\"></a><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/pharma\" target=\"_blank\">pharma </a>stocks to positive corporate announcements on the US drug regulatory front, especially Sun Pharma, which infused a fresh life into these classic defensive plays.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\t“Positive <a class=\"storyTags\" href=\"https://www.business-standard.com/category/markets-news-1060101.htm\" target=\"_blank\">news </a>flow at the company / corporate level in terms of regulatory issues being resolved, pick-up in the mid-and small-caps and investors hunting for value buys in the beaten down stocks has seen the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/pharma-stocks\" target=\"_blank\"></a><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/pharma\" target=\"_blank\">pharma </a>stocks gain over the past few sessions,” explains G Chokkalingam, founder and managing director at Equinomics Research.</p>\n<p>\n\tWhile Sun Pharma (up nearly 18 per cent in past six sessions) announced the resolution of regulatory compliance issues at Halol plant, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/aurobindo-pharma\" target=\"_blank\">Aurobindo Pharma </a>gained on the back of US FDA approval for Omeprazole (used to treat certain stomach and esophagus problems).</p>\n<p>\n\t“Halol clearance is a positive development for Sun, as approvals from the facility have been delayed for the past three years. The company has 139 pending abbreviated new drug application (ANDA), of which the Halol site is a key contributor in terms of pending ANDA and some may be of limited competition in nature,” said analysts Elara Capital in a note. They believe the stock factors in most positives at the current levels and maintain a ‘reduce’ rating with a price target of Rs 482.</p>\n<p>\n\tReliance Securities, on the other hand, expects Aurobindo Pharma’s US business to clock 11 per cent compounded annual growth (CAGR) over FY18-20, led by new launches (30-40 in FY19 including few niche products) and a ramp-up in injectable business. The brokerage recommends buying the stock with a price target of Rs 712.</p>\n<p>\n\tDr Reddy’s Laboratories, Lupin, Cadila Healthcare, Wockhardt, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/aurobindo-pharma\" target=\"_blank\">Aurobindo Pharma </a>and Glenmark Pharmaceuticals from the frontline pharma pack have gained 12 per cent to 17 per cent in past six sessions.</p>\n<p>\n\tGoing ahead, Chokkalingam expects the rally to continue and sees an upside of 10 per cent – 15 per cent from here on, but suggests investors remain selective and look at the company’s future growth potential before investing. Of the lot, he likes <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/lupin\" target=\"_blank\">Lupin </a>at the current levels.</p>\n<p>\n\tDespite 12 per cent rally in past six trading sessions, the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nifty-pharma\" target=\"_blank\">Nifty Pharma </a>index has underperformed the market by falling 5.6 per cent thus far in the calendar year 2018 (CY18). In comparison, the benchmark index has gained up 3.2 per cent since then.</p>\n<p>\n\tBhavesh Gandhi, an analyst tracking the sector at IIFL remains cautious on the sector and suggests that the rebound in the stocks may not last long. The US market, he believes, still remains a key pivot for Indian pharma players.</p>\n<p>\n\t“We remain cognizant of the fall in frontline stocks, but the rebound, as and when it happens, would not lift all boats. Retain underweight stance with a liking for select stocks like IPCA Labs and Laurus Labs,” he says.<br></p><p>\n\t\t<img align=\"left\" alt=\"Pharma stocks on a booster dose; Nifty Pharma up 12% in six days\" class=\"imgCont\" height=\"348\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/13/full/1528914167-3234.jpg\" title=\"Pharma stocks on a booster dose; Nifty Pharma up 12% in six days\" width=\"620\"></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Nifty",
        "12",
        "six",
        "positive",
        "corporate",
        "regulatory",
        "front"
    ],
    "verbs": [
        "dose",
        "attribute",
        "run",
        "drug",
        "front"
    ]
}