{
    "title": "In-flight connectivity expected to be available within a year: Manoj Sinha",
    "link": "https://www.business-standard.com/article/economy-policy/in-flight-connectivity-expected-to-be-available-within-a-year-manoj-sinha-118061201207_1.html",
    "pubDate": "Wed, 13 Jun 2018 00:54:00 +0530",
    "content": "In-flight connectivity aims to enable calls and internet services during flights in the Indian airspace",
    "contentSnippet": "In-flight connectivity aims to enable calls and internet services during flights in the Indian airspace",
    "guid": "https://www.business-standard.com/article/economy-policy/in-flight-connectivity-expected-to-be-available-within-a-year-manoj-sinha-118061201207_1.html",
    "isoDate": "2018-06-12T19:24:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "in-flight",
            "connectivity",
            "expected",
            "to",
            "be",
            "available",
            "within",
            "a",
            "year",
            "manoj",
            "sinha"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "In-flight connectivity expected to be available within a year: Manoj Sinha",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tIn-flight connectivity is expected to be available within a year, Telecom Minister <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/manoj-sinha\" target=\"_blank\">Manoj Sinha </a>said today even as a joint meeting of DoT and civil aviation officials to discuss \"operational details\" is to be held in about 10 days.</p>\n<p>\n\tTelecom firms, airlines and in-flight connectivity providers are expected to attend the meeting, the date for which is yet to be finalised.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tIn-flight connectivity aims to enable calls and internet services during flights in the Indian airspace.</p>\n<p>\n\t\"There will a meeting with the Secretary Civil Aviation Ministry, me, and the operators. We are fixing the date...maybe in another 10 days or so, we will meet,\" Telecom Secretary Aruna Sundararajan told reporters here.</p>\n<p>\n\tEarlier, while speaking at the conference on four years of the government, Sinha said that 'in-flight services' could become operational in one year.</p>\n<p>\n\t\"The Telecom Commission has already decided on in-flight connectivity, and in the next one year, we may be in a position to provide in-flight connectivity,\" he said.</p>\n<p>\n\tThe Telecom Commission -- the highest policy making body of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/department-of-telecom\" target=\"_blank\">Department of Telecom </a>-- had on May 1 cleared a proposal for allowing in-flight connectivity, already available in most of the developed markets.</p>\n<p>\n\tWhile giving its nod, the Telecom Commission had agreed with most of the recommendations of the sector regulator on 'in-flight services' except one pertaining to foreign satellites and gateways.</p>\n<p>\n\tWhile telecom regulator Trai had recommended permitting use of foreign satellites and foreign gateways for mobile communication on aircraft too, the Telecom Commission went by the view of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=committee+of+secretaries\" target=\"_blank\">Committee of Secretaries </a>(CoS) that only Indian Satellites and Indian gateways be allowed.</p>\n<p>\n\tSundararajan said that the operational aspects still needed to be discussed in detail and the upcoming meeting will deliberate on the same.</p>\n<p>\n\t\"The discussions on the operational model will entail questions like who will be investing in infrastructure, who will be providing the services. There is no standard model...we will have to see what is suitable in the Indian context,\" Sundararajan said.</p>\n<p>\n\tLast week, Trai had stuck to its stance that foreign satellites and gateways should be used to provide such services.</p>\n<p>\n\tSundararajan said that since <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=cos\" target=\"_blank\">CoS </a>have favoured only Indian Satellites and Indian gateway, any change or review of the decision will have to be taken back to <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=cos\" target=\"_blank\">CoS.</a></p>\n<p>\n\t\"We will have to take a view,\" she said.</p>\n<p>\n\tGlobally, many airlines are already offering wi-fi for passengers, but they currently have to switch off the facility when they enter the Indian airspace. Availability of wi-fi is also expected to provide local airlines an additional source of revenues amid stiff competition in the fast-growing Indian aviation market.</p>\n<p>\n\tAirAsia, Air France, British Airways, Egypt Air, Emirates, Air New Zealand, Malaysia Airlines, Qatar Airways and Virgin Atlantic are among 30 airlines that already allow mobile phone use on aircraft.</p>\n<p>\n\tA separate category of licensees - in-flight service providers - will be created for offering such services, and licence fee for such niche providers will be pegged at Re 1.<br></p><p id=\"auto_disclaimer\">(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "In",
        "expected",
        "available",
        "Indian"
    ],
    "nouns": [
        "In",
        "flight",
        "connectivity",
        "year",
        "internet",
        "services",
        "Indian",
        "airspace"
    ],
    "verbs": [
        "flight",
        "enable"
    ]
}