{
    "creator": "Banikinkar Pattanayak",
    "title": "NIIF to be roped in for bailouts",
    "link": "https://www.financialexpress.com/industry/niif-to-be-roped-in-for-bailouts/1195100/",
    "pubDate": "Wed, 06 Jun 2018 05:57:40 +05:30",
    "dc:creator": "Banikinkar Pattanayak",
    "content": "Alternatively, it may rope in state-run companies like NTPC or other private firms to operate the stressed assets on contractual basis.",
    "contentSnippet": "Alternatively, it may rope in state-run companies like NTPC or other private firms to operate the stressed assets on contractual basis.",
    "guid": "https://www.financialexpress.com/?p=1195100",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-06T00:27:40.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "niif",
            "to",
            "be",
            "roped",
            "in",
            "for",
            "bailouts"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "NIIF to be roped in for bailouts",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1195107\" src=\"https://images.financialexpress.com/2018/06/NTPC.jpg\" alt=\"NIIF, NTPC, NPA,&nbsp;National Investment and Infrastructure Fund\" srcset=\"https://images.financialexpress.com/2018/06/NTPC.jpg 660w, https://images.financialexpress.com/2018/06/NTPC-300x200.jpg 300w, https://images.financialexpress.com/2018/06/NTPC-620x413.jpg 620w, https://images.financialexpress.com/2018/06/NTPC-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The government is weighing an option to rope in the National Investment and Infrastructure Fund (NIIF), apart from NTPC, to take over some stressed power assets, a senior official told FE.</figure>\n\t\t\t</section></div><span>\n</span><p>The government is weighing an option to rope in the National Investment and Infrastructure Fund (NIIF), apart from NTPC, to take over some stressed power assets, a senior official told FE. A detailed proposal is expected to be discussed at a meeting that will be soon convened by the finance ministry to resolve the issue of massive bad loans in power — estimated at Rs 1.77 lakh crore — following last week’s order by the Allahabad High Court.</p><span>\n</span><p>“The power ministry is readying a number of proposals on how to address the NPA (non-performing asset) issue in the power sector. Asking NIIF and companies like NTPC to pitch in could be one of the options, which needs further deliberations though,” said the official.</p><span>\n</span><p>As part of the proposals, which are still at the discussions stage, the bad assets would be rated by credit rating agencies and then a valuation of these will be arrived at, based on their revival prospects. Subsequently, they will be handed over to NIIF, which will invite bids for the assets, with a base price. Alternatively, it may rope in state-run companies like NTPC or other private firms to operate the stressed assets on contractual basis.</p><span>\n</span><p>State Bank of India, the largest lender that has gross bad loans at 19% of its advances to the power sector, has also been tasked with suggesting resolution plans for the stressed assets. NIIF is essentially a fund manager that is owned jointly by the government (49%) and investors from India and abroad. The NIIF and its sub-funds are supposed to invest in infrastructure projects — greenfield, brownfield and stalled.</p><span>\n</span><p>Power producers and lenders have said their problems are compounded by the Reserve Bank of India’s (<a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a>) February circular that requires banks to finalise a resolution plan in case of a default on large accounts of Rs 2,000 crore and above within 180 days (irrespective of sectors), failing which insolvency proceedings will have to be invoked against the defaulter. It also mandates treating a borrower who misses term loan repayments as a defaulter the very next day.</p><span>\n</span><p>Since the deadline for the resolution of the first set of such default cases is end-August, power producers approached the Allahabad High Court for relief. Last Friday, the court asked the finance ministry to convene a meeting of key stakeholders, including ministries of power and coal and RBI and insolvency regulator Insolvency and Bankruptcy Board of India, to see if the power sector issue can be resolved. The central bank had in April justified the one-day default rule, saying it was aimed at stoking a behavioural change at banks.</p><span>\n</span><p>Seeking relief from the RBI circular, the Association of Power Producers had written to Prime Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/narendra-modi/\">Narendra Modi</a> that more than 75,000 MW of assets (under operation or under construction) are severely stressed due to reasons — including lower availability of coal, pending receivables from discoms, among others — that are beyond their control.</p><span>\n</span><p>Earlier, the ministry had written to the RBI seeking some relief (to all sectors) from insolvency. The ministry, sources had said, was of the opinion that lenders be given a year to finalise the resolution plan, instead of just six months. The power producers had approached the HC for relief, arguing that the stress in the sector is often caused by factors beyond their control. Both the power ministry and producers had also petitioned the RBI for relief, but the central bank is learnt to have declined to offer any sector-specific relief.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "private",
        "contractual",
        "stressed"
    ],
    "nouns": [
        "state",
        "private",
        "basis",
        "assets",
        "may",
        "run",
        "rope"
    ],
    "verbs": [
        "state",
        "operate",
        "run",
        "rope"
    ]
}