{
    "creator": "Sumit Jha",
    "title": "Amendment to Act: Government planning to revamp GST AAR mechanism",
    "link": "https://www.financialexpress.com/economy/amendment-to-act-government-planning-to-revamp-gst-aar-mechanism/1195074/",
    "pubDate": "Wed, 06 Jun 2018 05:13:14 +05:30",
    "dc:creator": "Sumit Jha",
    "content": "Several states notified formations of AARs according to section 96 of respective State GST Act at the beginning of this year.",
    "contentSnippet": "Several states notified formations of AARs according to section 96 of respective State GST Act at the beginning of this year.",
    "guid": "https://www.financialexpress.com/?p=1195074",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-05T23:43:14.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "amendment",
            "to",
            "act",
            "government",
            "planning",
            "to",
            "revamp",
            "gst",
            "aar",
            "mechanism"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Amendment to Act: Government planning to revamp GST AAR mechanism",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1195079\" src=\"https://images.financialexpress.com/2018/06/GST-9-2-1-2.jpg\" alt=\"government, GST, GST AAR mechanism\" srcset=\"https://images.financialexpress.com/2018/06/GST-9-2-1-2.jpg 660w, https://images.financialexpress.com/2018/06/GST-9-2-1-2-300x200.jpg 300w, https://images.financialexpress.com/2018/06/GST-9-2-1-2-620x413.jpg 620w, https://images.financialexpress.com/2018/06/GST-9-2-1-2-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The Goods and Service Tax Council would likely amend the GST Act to make it mandatory for the Authority for Advance Rulings (AARs) in states to be manned by senior revenue officials.</figure>\n\t\t\t</section></div><span>\n</span><p>The Goods and Service Tax Council would likely amend the GST Act to make it mandatory for the Authority for Advance Rulings (AARs) in states to be manned by senior revenue officials. The idea is to avoid conflicting AAR rulings by its different benches and ensure orders based on sound legal principles.<br>AARs, however, might continue to function without former judicial officers, unlike the previous excise and service tax AARs which were headed by retired Supreme Court judges along with two technical members, officials said.</p><span>\n</span><p>Several states notified formations of AARs according to section 96 of respective State GST Act at the beginning of this year. But many of the rulings so far have shown a “revenue bias” and have not been robust on legal grounds, experts say. One reason for the trend, it is felt, these benches are without retired judges at the helm.</p><span>\n</span><p>Further, the sources said, the GST Council may recommend setting up a central body that would adjudicate on conflicting ruling from AARs based in two different states. For instance, ruling on a petition filed by a solar engineering, procurement and construction (EPC) contractor, Maharashtra AAR said such contracts would come under works contract and attract 18% GST while Karnataka AAR ruled that a 5% GST would be applicable for such contracts. A centralised AAR would break the logjam in similar cases, the official said.</p><span>\n</span><p>An AAR is a quasi-judicial body, and its rulings brings certainty in determining tax liability, which is binding on the applicant as well as government authorities. Further, it helps in avoiding long drawn and expensive litigation at a later date. Seeking an advance ruling is inexpensive and the procedure is simple and expeditious.</p><span>\n</span><p>Besides, the two member of these authorities include one official of central GST and another from state GST. Here too, the law doesn’t mandate appointment of officials of commissioner rank or above and many ruling have been delivered by much junior officials. In earlier regimes, one of the members of the Authority had to be an officer of the Indian Revenue Service (customs and central Excise), who must qualify to be a member of the Central Board of Indirect Taxes and Customs.</p><span>\n</span><p>“We may increase the designation threshold for the officials and only allow commissioner rank member in AAR. It’s acknowledged in the government that some of the rulings are poor in terms of applicability of law, mainly because the members of the AARs are not experienced enough in indirect tax laws,” a government official said on the condition of anonymity.</p><span>\n</span><p>Moreover, Gujarat HC last month admitted a petition and sent notices to central and state governments on setting up these quasi-judicial bodies without the express requirement of a judicial member. Experts have pointed to some ruling where members have relied on FAQs, which have no legal backing. Similarly, some other rulings have failed to take note of relevant documents including press releases from the tax department that already contain clarification on topics under consideration.</p><span>\n</span><p>“Reins of an erstwhile authority was in hands of a high powered quasi-judicial body headed by a retired judge of the Supreme Court, pronouncing legally sound and fearless rulings. Whereas the new AAR formed under GST, is in the hands of untried and revenue biased tax officer pronouncing rulings contrary to international business practices,” Rajat Mohan, partner, AMRG &amp; Associates said.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "respective",
        "Several",
        "according",
        "96",
        "beginning"
    ],
    "nouns": [
        "year",
        "Government",
        "section",
        "planning",
        "Act",
        "State",
        "Amendment",
        "AAR",
        "mechanism",
        "beginning"
    ],
    "verbs": [
        "section",
        "Act",
        "State",
        "revamp"
    ]
}