{
    "title": "RBI hikes repo rate after more than 4 years",
    "link": "https://timesofindia.indiatimes.com/business/india-business/rbi-hikes-repo-rate-after-more-than-4-years/articleshow/64477491.cms",
    "pubDate": "Wed, 06 Jun 2018 09:06:13 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/rbi-hikes-repo-rate-after-more-than-4-years/articleshow/64477491.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64477491.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/rbi-hikes-repo-rate-after-more-than-4-years/articleshow/64477491.cms",
    "isoDate": "2018-06-06T09:06:13.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "rbi",
            "hikes",
            "repo",
            "rate",
            "after",
            "more",
            "than",
            "4",
            "years"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "RBI hikes repo rate after more than 4 years",
        "content": "<div class=\"Normal\"><span>NEW DELHI: The Reserve Bank of India (</span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Reserve-Bank-of-India\">RBI</a><p>) on Wednesday decided to increase key rates following its June monetary policy meet. The Reserve Bank's six-member MPC (monetary policy committee), headed by governor Urjit Patel, hiked the repo rate by 25 bps (basis points) to 6.25 per cent.\n\n</p><p>The repo rate is the rate at which the RBI lends short-term money to the banks. The central bank has also increased the reverse repo rate -- the rate at which the RBI borrows from commercial banks -- to 6 per cent.\n</p><p>\"The decision of the MPC is consistent with the neutral stance of monetary policy in consonance with the objective of achieving the medium-term target for consumer price index (CPI) inflation of 4 per cent within a band of +/- 2 per cent, while supporting growth,\" the RBI said in a statement.\n</p><span> \n</span><p>The Reserve Bank Governor Urjit Patel, in a media briefing, said that the rates have been hiked after \"a prolonged pause\".\n</p><p>In the second bi-monthly monetary policy for the current fiscal, the RBI revised upwards the retail inflation range to 4.8-4.9 per cent in the first half of 2018-19, and 4.7 per cent in the second half. It includes the impact from HRA (House Rent Allowance) for central government employees, with risks tilted to the upside.\n</p><p>According to Anis Chakravarty, lead economist and partner, Deloitte India: “The MPC presented a balanced view of the emerging market economies (EMEs) and the domestic economy, while alerting on the rising risks from crude prices and the increasing financial market volatility. The RBI was cautious on the factors that could change the course of the underlying optimism, major among them being the projections on oil price movement and rising geopolitical tensions.”\n</p><p>\"Rate hike is pre-emptive and in line with the Reserve Bank of India's neutral-to-hawkish policy tone. The RBI has sounded more sanguine over growth prospects going forward, while flagging upside risks to inflation, particularly emanating from higher crude oil prices and the wage-price setting process due to closure of output gap,\" said Sumedh Deorukhkar, senior economist, BBVA, Hong Kong.\n</p><p>\"Expect one more rate hike before the end of calendar year 2018 if core inflation remains elevated despite some potential moderation in growth,\" he added.\n</p><p>The hike comes in contrast to what the Street had expected. A Reuters poll had predicted that the RBI is expected to hold key rates in its monetary policy meet. The poll suggested that though an increasing number of economists expect the Reserve Bank to raise interest rates but most still think the central bank will stay on hold and use this week’s meeting to prepare for an August hike.\n</p><span>\n</span><br><span>It was in January 2014 that the RBI had last raised the short-term lending rate (repo) to 8 per cent, since then it has either reduced it or maintained status quo.\n</span><br><span>\n</span><br><span>Radhika Rao, India Economist with DBS Group, had expected hike in the short-term lending rate in June itself.\n</span><br><span>\n</span><br><span>\"We expect the Monetary Policy committee to sound hawkish, with a rising probability that they will vote for a pre-emptive 25 bps rate hike in June, to maintain financial stability and contain second-round inflationary impact from higher oil prices and a weaker rupee,\" she had said ahead of the policy announcement.\n</span><br><span>\n</span><br><span>Indicating hardening of the interest rate scenario, several major lenders including SBI, PNB and ICICI Bank have already raised their lending rates from June 1. Some of the banks have also increased the deposit rates.\n</span><br><span>\n</span><em><br>(With inputs from Reuters)</em><span>\n</span></div>"
    },
    "adjectives": [
        "top",
        "10",
        "left",
        "right"
    ],
    "nouns": [
        "margin",
        "RBI",
        "rbi",
        "rate",
        "india",
        "top",
        "business",
        "years",
        "10",
        "border",
        "left",
        "style",
        "right",
        "photo"
    ],
    "verbs": [
        "rate",
        "top",
        "border",
        "align",
        "style",
        "right"
    ]
}