{
    "title": "Centre okays Rs 70 billion sugar package, MSP set at Rs 29 per kg",
    "link": "https://www.business-standard.com/article/economy-policy/centre-okays-rs-70-billion-sugar-package-msp-set-at-rs-29-per-kg-118060601462_1.html",
    "pubDate": "Wed, 06 Jun 2018 23:27:00 +0530",
    "content": "CCEA also announces creation of a buffer stock of 3 million tonnes for one year, which will be at an estimated expenditure of Rs 11.75 billion",
    "contentSnippet": "CCEA also announces creation of a buffer stock of 3 million tonnes for one year, which will be at an estimated expenditure of Rs 11.75 billion",
    "guid": "https://www.business-standard.com/article/economy-policy/centre-okays-rs-70-billion-sugar-package-msp-set-at-rs-29-per-kg-118060601462_1.html",
    "isoDate": "2018-06-06T17:57:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "centre",
            "okays",
            "rs",
            "70",
            "billion",
            "sugar",
            "package",
            "msp",
            "set",
            "at",
            "rs",
            "29",
            "per",
            "kg"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Centre okays Rs 70 billion sugar package, MSP set at Rs 29 per kg",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tThe Union government has approved a package of measures for the sugar industry, which is grappling falling prices and an inability to clear payment arrears to cane farmers.</p>\n<p>\n\tThe Cabinet Committee on Economic Affairs (CCEA) approved Rs 70 billion as an intervention package to address the immediate liquidity problems of the industry. It also fixed a minimum selling price of white (refined) sugar at Rs 29 a kg.</p>\n<p>\n\tAlso announced was creation of a buffer stock of three million tonnes for one year, at an estimated expenditure of Rs 11.75 billion. However, this might be reviewed by the department of food &amp; public distribution (DFPD) any time.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/markets/sugar-shares-fall-after-cabinet-nod-rs-85-billion-bailout-package-118060600506_1.html\" target=\"_blank\">Sugar shares fall after Cabinet gives nod for bailout package</a></strong></p>\n\n<p>\n\tReimbursement under the relief package would be on quarterly basis, with the money to be directly credited into farmers’ accounts on behalf of mills, against their cane price dues.</p>\n<p>\n\t“The minimum selling price of white/refined sugar is fixed based on the Fair and Remunerative Price (FRP, set by the central government each year) of cane and minimum conversion cost. With the revision in the FRP, however, the DFPD has been empowered to revise the minimum selling price of sugar as well,” went a press note issued by the CCEA.<br></p><p>\n\t\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/markets/renuka-sugars-to-use-network-of-adani-wilmar-to-revive-madhur-brand-118060600027_1.html\" target=\"_blank\">Renuka Sugars to use network of Adani Wilmar to revive Madhur brand</a></strong></p>\n<p>\n\tAlso, it decided to impose a stock holding limit on sugar mills for the current season (which goes up to September 30), to be later revised by DFPD.</p>\n<p>\n\t“The government of Utter Pradesh had requested the Centre to fix a minimum selling price of white sugar at Rs 34 a kg. Any price below the cost of production in Uttar Pradesh of Rs 35-36 a kg is a loss for sugar mills. The current package, therefore, would not help much to curtail the Rs 130 billion cane payment arrears in UP,” said Ajay Shriram, chairman, DCM Shriram Ltd.</p>\n<p>\n\tThe cost of sugar production is Rs 1.5-2 a kg higher in Maharashtra than in UP.</p>\n<p>\n\tThe central government has also decided to bear interest subvention of a maximum Rs 13.32 billion over a period of five years for the industry. Including a year’s moratorium on paying of a loan of Rs 44.4 billion to be sanctioned to mills by banks over three years for upgrading of distilleries or setting up new ones. CCEA has empowered DFPD to formulate a detailed scheme in this regard.<br></p><p>\n\t\t<img align=\"left\" alt=\"Centre okays Rs 70 billion sugar package, MSP set at Rs 29 per kg\" class=\"imgCont\" height=\"356\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/06/full/1528307662-3194.jpg\" title=\"Centre okays Rs 70 billion sugar package, MSP set at Rs 29 per kg\" width=\"227\"></p>\n\n<p>\n\t“This is a medium-term measure which would not solve immediate problems for the industry. In fact, the big problem is expected bumper production for the next season, 2018-19, on which the government should have announced some measures,” said Vijay Bank, chief financial officer at Dwarikesh Sugar Industries.</p>\n<p>\n\tWhile welcoming the overall measures, Abinash Verma, director-general of the Indian Sugar Mills Association, said: “The decision to impose stock holding limits on mills is tantamount to control on sugar sales, which is not the right way to move into the future. Creation of buffer stocks of three mt will reduce some surplus sugar from the market, though only for a year, and will improve market sentiment to support domestic prices. What is concerning us is that there is no idea or proposal on rationalisation of the cane pricing policy, which is actually the main reason for all the problems of the industry today.”</p>\n<p>\n\tSabyasachi Majumdar, senior vice-president at ratings agency ICRA, says the buffer stock’s creation would help the demand-supply imbalance. Further, the direct impact of the carrying cost alone would amount to a benefit of Rs 400-450/tonne of sugar, translating into a higher pre-tax profit margin of 1-1.5 per cent, he felt.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "one",
        "stock",
        "70",
        "billion",
        "set",
        "29",
        "million",
        "11",
        "75"
    ],
    "nouns": [
        "one",
        "stock",
        "Centre",
        "70",
        "billion",
        "sugar",
        "package",
        "set",
        "29",
        "kg",
        "creation",
        "buffer",
        "million",
        "year",
        "will",
        "expenditure",
        "11"
    ],
    "verbs": [
        "stock",
        "Centre",
        "sugar",
        "package",
        "set",
        "buffer",
        "will"
    ]
}