{
    "creator": "PTI",
    "title": "Oil Minister Dharmendra Pradhan says petrol, diesel will not be allowed to go out of reach of common man",
    "link": "https://www.financialexpress.com/market/commodities/oil-minister-dharmendra-pradhan-says-petrol-diesel-will-not-be-allowed-to-go-out-of-reach-of-common-man/1196226/",
    "pubDate": "Wed, 06 Jun 2018 21:09:18 +05:30",
    "dc:creator": "PTI",
    "content": "Oil Minister Dharmendra Pradhan today vowed to not allow petrol and diesel prices go out of reach of the common man, saying the government is working on a holistic solution to price volatility without going back on reforms. ",
    "contentSnippet": "Oil Minister Dharmendra Pradhan today vowed to not allow petrol and diesel prices go out of reach of the common man, saying the government is working on a holistic solution to price volatility without going back on reforms.",
    "guid": "https://www.financialexpress.com/?p=1196226",
    "categories": [
        "Commodities",
        "Market"
    ],
    "isoDate": "2018-06-06T15:39:18.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.05263157894736842,
        "tokens": [
            "oil",
            "minister",
            "dharmendra",
            "pradhan",
            "says",
            "petrol",
            "diesel",
            "will",
            "not",
            "be",
            "allowed",
            "to",
            "go",
            "out",
            "of",
            "reach",
            "of",
            "common",
            "man"
        ],
        "words": [
            "reach"
        ],
        "positive": [
            "reach"
        ],
        "negative": []
    },
    "article": {
        "title": "Oil Minister Dharmendra Pradhan says petrol, diesel will not be allowed to go out of reach of common man",
        "content": "<p>Oil Minister Dharmendra Pradhan today vowed to not allow petrol and diesel prices go out of reach of the common man, saying the government is working on a holistic solution to price volatility without going back on reforms. </p><div class=\"fe-post-content main-story-content\"><span>\n\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1196230\" src=\"https://images.financialexpress.com/2018/06/cats-327.jpg\" alt=\"Dharmendra Pradhan,&nbsp;Oil Minister, petrol hike, diesel hike,&nbsp;diesel prices,&nbsp;ONGC,&nbsp;VAT on petrol\"> Pradhan parried questions on centre cutting excise tax to offer relief to common man. (PTI)</figure></section></div><span>\t\t\t\t\n</span><p>Oil Minister Dharmendra Pradhan today vowed to not allow petrol and diesel prices go out of reach of the common man, saying the government is working on a holistic solution to price volatility without going back on reforms. Blaming geopolitics of oil, exchange rate fluctuations and local taxes for petrol and diesel prices touching a record high, he said the government is sensitive and will ensure that “poor, middle class are not pained.” “We will deal with the issue,” he said at a news conference called to highlight his government’s achievement in four years. “The government will take a holistic view (of the situation) so that petro prices do not pinch them. Government will do all that is possible.”</p><span>\n</span><p>Asked if the solutions under consideration include partial roll-back of fuel price deregulation, he said, “Not at all.” “This question doesn’t arise. This government is a pro-reform government and we cannot go back on what we have reformed,” he said. The government had deregulated or freed petrol pricing from its control in June 2010 and diesel in October 2014. It allowed revision of prices on daily basis since mid-June last year to reflect changes in cost instantly.</p><span>\n</span><p>“We will not allow prices to go out of reach of the common man,” he said. Pradhan refused to say if the solution being considered includes asking oil producers like ONGC cough-up some money so that fuel can be subsidised, like it used to do till 2015. “I cannot discuss the solutions being considered,” he said.</p><span>\n</span><p>After hitting an all-time high of Rs 78.43 a litre for petrol and Rs 69.31 for diesel on May 29, rates have been cut on subsequent days on softening international oil prices and rupee strengthening against the US dollar. <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/petrol/\">Petrol price</a> has dropped by 71 paise a litre and diesel by 51 paise. This compares to Rs 3.8 a litre hike in petrol and Rs 3.38 a litre hike in diesel rates in Delhi in the fortnight beginning May 14 when state-owned oil firms ended a 19-day pre-Karnataka poll hiatus to resume daily price revision.</p><span>\n</span><p>Petrol in Delhi today costs Rs 77.96 and diesel Rs 68.72. Prices in Delhi are the lowest among all metro cities and most state capitals due to lower sales tax or VAT. Retail prices are still higher than the peak touched during the previous UPA regime. Petrol had touched Rs 76.06 on September 14, 2013.</p><span>\n</span><p>The peak price for diesel during previous UPA government was hit on May 13, 2014, when rates touched Rs 56.71 a litre. Since January 1, 2018, petrol prices have risen by Rs 7.75 a litre and diesel by Rs 9.16. Petrol price in Delhi was Rs 71.41 a litre and diesel was priced at Rs 56.71 when the present <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/bharatiya-janata-party/\">BJP</a>-government took office.</p><span>\n</span><p>Pradhan parried questions on centre cutting excise tax to offer relief to common man. He said taxes on petrol and diesel are made up of excise duty charged by the centre, and sales tax (VAT) charged by state governments. The taxes charged by states should be “reasonable and responsible,” he said refusing to be drawn into debate on most BJP states refusing to cut VAT. Left-ruled Kerala had last week taken a lead in cutting VAT on petrol and diesel by Re 1 per litre. The minister said states have different economic needs and one solution cannot fit all.</p><span>\n</span><p>The BJP-led government at the centre had raised excise duty on petrol by Rs 11.77 a litre and that on diesel by Rs 13.47 a litre in nine instalments between November 2014 and January 2016 to shore up finances as global oil prices fell, but then cut the tax just once in October last year by Rs 2 a litre. Only four states — Maharashtra, Gujarat, Madhya Pradesh and Himachal Pradesh — reduced VAT following the October 3, 2017 cut in excise duty.</p><span>\n\t\t\t\t</span><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div><span>\n\t\t\t\t\t\t\t\t\t</span><span>\n\t\t\t\t\t</span><span>\n\t\t\t\t\t\t\t\t\t\t\t\t</span><span>\n\t\t\t\t\t\t\t\t\t\t\t\t</span></div>"
    },
    "adjectives": [
        "go",
        "common",
        "working",
        "holistic",
        "going",
        "back"
    ],
    "nouns": [
        "Oil",
        "Minister",
        "saying",
        "petrol",
        "diesel",
        "will",
        "go",
        "reach",
        "common",
        "man",
        "today",
        "price",
        "government",
        "working",
        "solution",
        "volatility",
        "going",
        "back"
    ],
    "verbs": [
        "Oil",
        "Minister",
        "will",
        "allow",
        "go",
        "reach",
        "man",
        "price",
        "back"
    ]
}