{
    "title": "Why Urjit Patel could go for another repo rate hike in August review",
    "link": "https://www.business-standard.com/article/economy-policy/why-urjit-patel-could-go-for-another-25-bp-repo-rate-hike-in-august-review-118061300299_1.html",
    "pubDate": "Wed, 13 Jun 2018 11:57:00 +0530",
    "content": "The Reserve Bank of India last week raised interest rates for the first time since 2014 and also revised its inflation forecast for the fiscal year 2019",
    "contentSnippet": "The Reserve Bank of India last week raised interest rates for the first time since 2014 and also revised its inflation forecast for the fiscal year 2019",
    "guid": "https://www.business-standard.com/article/economy-policy/why-urjit-patel-could-go-for-another-25-bp-repo-rate-hike-in-august-review-118061300299_1.html",
    "isoDate": "2018-06-13T06:27:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "why",
            "urjit",
            "patel",
            "could",
            "go",
            "for",
            "another",
            "repo",
            "rate",
            "hike",
            "in",
            "august",
            "review"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Why Urjit Patel could go for another repo rate hike in August review",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p> Inflation picked up in India for a second straight month, giving ammunition to the central bank to further tighten monetary policy and squeezing returns for bond investors.</p> <p> Consumer prices rose 4.87 percent in May from a year earlier, the statistics ministry said in a statement in New Delhi on Tuesday. That was broadly in line with the 4.9 percent median estimate of 41 economists surveyed by Bloomberg. It was the highest reading since January and comes on the back of rising food and fuel prices.\n\n\n</p>\n<!-- INPAGE_BANNER --> <p> “The inflation numbers will keep the RBI on its toes and may take us closer to a rate hike as early as in August when the central bank meets next,” said Rupa Rege Nitsure, chief economist of L&amp;T Finance Holdings Ltd. in Mumbai. The six-member monetary policy committee is scheduled to meet next on July 31 and August 1.</p> <p> The central bank expects oil averaging around $78 a barrel to stoke inflation by 30 basis points, complicating its job of keeping inflation at the 4 percent mid-point of its target band over the medium term.</p> <p> Policy makers have been expressing their discomfort about underlying price pressures and rising input costs, which companies are passing on to consumers. Deutsche Bank AG chief India economist Kaushik Das puts core inflation, which strips out volatile fuel and food prices, at 6.2 percent in May, up from 5.9 percent in April.</p> <blockquote class=\"blockquoteBG styleQ1\"> <p> <strong>How rising price pressures are playing out in India:</strong></p> <p> It joined other emerging markets in increasing interest rates</p> <p> Consumer outlook on price rises is grim</p> <p> Government forgoing some taxes on fuel can pressure budget gap</p> <p> Core inflation too has been sticky</p> <p> Foreigners are dumping its bonds at a record pace</p> </blockquote> <span></span> <p> The Reserve Bank of India last week raised interest rates for the first time since 2014 and also revised its inflation forecast for the fiscal year 2019, with the second-half estimate raised to 4.7 percent from 4.4 percent. </p><p>Higher food grain procurement prices which the government is set to give farmers in coming months is set to push headline inflation higher in the second half, economists say.</p> <p> Tuesday's data will do little to comfort bond investors who are sitting on one of the worst returns in Asia. The pick-up in inflation and a depreciating currency have squeezed returns for foreign investors. Even though India's benchmark 10-year bond yield jumped to more than 8 percent last week for the first time in three years, that isn’t enough to lure some of the world’s biggest money managers.</p> <p> Overseas funds pulled $4.6 billion from the domestic debt market since January 1, the most in any year-to-date period in data going back to 1999. While valuations appear attractive, risks from higher oil prices, rising debt supply and a weakening currency are among reasons Pacific Investment Management Co. and Schroder Investment Management Ltd. say they’re wary of adding to holdings in Asia’s highest-yielding major market.</p> <p> Rising US interest rates are another big risk as the Federal Reserve moves to tighten policy again on Wednesday. Emerging markets from Argentina to Indonesia are struggling to contain the fallout on their currencies as foreign investors pull money out of riskier assets.</p> <p> India's rupee has been one of Asia's worst performing currencies this year. It was down 0.1 percent to 67.5850 against the dollar at 10:30 a.m., bringing its decline this year to 5.5 percent.</p> <p> “Overall, we think data points related to – core inflation, growth, rupee, minimum support prices announcement – will all support another 25 basis point rate hike from the RBI when it meets next on August 1,” said Deutsche Bank’s Das.</p> <blockquote class=\"blockquoteBG styleQ1\"> <p> <strong>Key Points from the CPI release</strong></p> <p> Food price index rose 3.1 percent after last month’s 2.8 percent rise</p> <p> Separate data showed factory output increased 4.9 percent in April versus a 5.7 percent survey estimate</p> </blockquote>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "go",
        "August",
        "revised",
        "last",
        "raised",
        "first",
        "fiscal"
    ],
    "nouns": [
        "Why",
        "rate",
        "rates",
        "hike",
        "review",
        "Reserve",
        "Bank",
        "India",
        "last",
        "week",
        "August",
        "go",
        "interest",
        "first",
        "time",
        "inflation",
        "forecast",
        "year"
    ],
    "verbs": [
        "go",
        "rate",
        "hike",
        "review",
        "Reserve",
        "Bank",
        "last",
        "interest",
        "time",
        "forecast"
    ]
}