{
    "title": "Air India fiasco to Macquarie-NHAI pact: A tale of two privatisations",
    "link": "https://www.business-standard.com/article/news-ians/a-tale-of-two-privatisations-column-behind-infra-lines-118060600314_1.html",
    "pubDate": "Wed, 06 Jun 2018 21:03:00 +0530",
    "content": "For privatisation to pick up momentum, it is essential to start with \"less complex\" assets",
    "contentSnippet": "For privatisation to pick up momentum, it is essential to start with \"less complex\" assets",
    "guid": "https://www.business-standard.com/article/news-ians/a-tale-of-two-privatisations-column-behind-infra-lines-118060600314_1.html",
    "isoDate": "2018-06-06T15:33:00.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.2727272727272727,
        "tokens": [
            "air",
            "india",
            "fiasco",
            "to",
            "macquarie-nhai",
            "pact",
            "a",
            "tale",
            "of",
            "two",
            "privatisations"
        ],
        "words": [
            "fiasco"
        ],
        "positive": [],
        "negative": [
            "fiasco"
        ]
    },
    "article": {
        "title": "Air India fiasco to Macquarie-NHAI pact: A tale of two privatisations",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tCharles Dickens' famous line \"It was the best of times, it was the worst of times\" in his novel \"A Tale of Two Cities\" aptly describes the recent <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=privatisation\" target=\"_blank\">privatisation </a>scenario in India.</p>\n<p>\n\tWhile the bid from <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=macquarie\" target=\"_blank\">Macquarie </a>to acquire a bundle of nine highways from the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=national+highways+authority+of+india\" target=\"_blank\">National Highways Authority of India </a>(NHAI) exceeded NHAI's expectations by 50 percent, the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=air+india+privatisation\" target=\"_blank\"></a><a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=air+india\" target=\"_blank\">Air India </a><a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=privatisation\" target=\"_blank\">privatisation </a>effort, in sharp contrast, failed to attract even a single bidder. Both experiences, with varying degrees of complexity, teach us valuable lessons.</p>\n<p>\n\tInvestors with capital to allocate are looking at assets in India -- one of the fastest-growing economies in the world -- with an eye on the growth in the coming decades. It is important to realise that investors, in general, are primarily looking for assets with similar qualities to what the bundle of highways offered, namely (1) Cash-flow profile clarity (2) Positive cash-flow asset (3) Consumption growth story to back the asset (4) Total management control.</p>\n<p>\n\tIt is essential first to understand the nature of investors who would be interested in a <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=privatisation\" target=\"_blank\">privatisation </a>or asset monetisation in India. There are primarily four types of investors that we must look at (1) Indian corporations (2) Foreign institutional investors such as pension, sovereign and insurance funds (3) Private equity firms (4) Trade buyers.</p>\n<p>\n\tOf these, the Indian corporates will have quite a few significant players with strategic interests in the privatisation, but by and large, given their stressed balance sheets, their involvement will be limited. If anything, cash-flow clarity will be an absolute essential for them to invest in privatisation.</p>\n<p>\n\tLarge pension, sovereign and insurance funds that have started to invest in Indian assets especially over the last few years would be interested in the asset monetisation process. Such funds look for infrastructure assets with positive cash-flow profiles. Because, in general, they have long-dated liabilities, they focus on assets that can utilise long-dated debt financing to yield stable positive cash-flows. Clarity around cash-flow profiles and positive cash-flow assets will generally be the investments such funds find attractive.</p>\n<p>\n\tThe third type of investor is the private equity funds operating in India. A recent report by Institutional Investor puts the total un-invested capital, or \"dry powder\", held by such funds at above $1 trillion. Money is, thus, not the issue. For them, privatisation can be an attractive proposition if they find assets where they can add value beyond just providing capital and have control of the business.</p>\n<p>\n\tTrade buyers are the fourth type, looking at acquisitions that can help their companies expand into new markets. Indian assets are an attractive proposition for such buyers also, with the same caveats of attractive cash-flow profile and complete management control.</p>\n<p>\n\tIn an Indian privatisation context, assets that will be attractive to potential bidders, at least initially, will have to meet the conditions mentioned earlier. The <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=nhai\" target=\"_blank\">NHAI </a>highway bundle met the requirements, and the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=air+india+privatisation\" target=\"_blank\"></a><a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=air+india\" target=\"_blank\">Air India </a>privatisation wasn't quite there.</p>\n<p>\n\tFor privatisation to pick up momentum, it is essential to start with \"less complex\" assets. When investors see a consistent flow of privatisations and the Indian public sees a transparent process delivering value, the more complex privatisations are a little easier to execute. Also, there might be the case that certain loss-making companies which the government does not consider to be of vital importance might need strategic divestment. For such companies, there is merit in looking at selling attractive assets to generate capital with which to create new infrastructure.</p>\n<p>\n\tThree facts must be borne in mind as India moves ahead with divestments. Firstly, they are crucial to finance the infrastructure gap -- predicted to be $526 billion by 2040 (according to the Economic Survey 2017-2018). Asset monetisation through privatisation will play a substantial role in financing the deficit.</p>\n<p>\n\tSecondly, it is important that critics of privatisation are engaged with, to allay their fears around public assets being sold off cheap. The government must find the right balance between creating an efficient privatisation mechanism that is attractive to private investors and removing public apprehension revolving around privatisation. A transparent process will go a long way in winning over critics.</p>\n<p>\n\tThirdly, we must realise that India's need to finance the infrastructure gap is no more than the need for global investors to invest in attractive opportunities. Such a situation is one that makes a market in economics. An efficient and well-structured privatisation process will help find the clearing price much more efficiently.</p>\n<hr>\n<p>\n\t(Taponeel Mukherjee heads Development Tracks, an infrastructure advisory firm. Views expressed are personal. He can be contacted at taponeel.mukherjee@development-tracks.com or @Taponeel on Twitter)</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "less",
        "complex",
        "two",
        "essential"
    ],
    "verbs": [
        "start",
        "Air",
        "pick"
    ],
    "nouns": [
        "start",
        "complex",
        "India",
        "two",
        "Air",
        "pact",
        "A",
        "tale",
        "privatisation",
        "pick",
        "momentum",
        "essential",
        "assets",
        "fiasco"
    ]
}