{
    "title": "Full text of RBI Monetary policy: Repo rate hiked by 25 bps after 4 years",
    "link": "https://www.business-standard.com/article/finance/rbi-monetary-policy-full-text-repo-rate-hiked-by-25-bps-after-4-years-118060600583_1.html",
    "pubDate": "Wed, 06 Jun 2018 15:19:00 +0530",
    "content": "The six-member Monetary Policy Committee (MPC) kept its stance neutral, despite a repo rate increase",
    "contentSnippet": "The six-member Monetary Policy Committee (MPC) kept its stance neutral, despite a repo rate increase",
    "guid": "https://www.business-standard.com/article/finance/rbi-monetary-policy-full-text-repo-rate-hiked-by-25-bps-after-4-years-118060600583_1.html",
    "isoDate": "2018-06-06T09:49:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "full",
            "text",
            "of",
            "rbi",
            "monetary",
            "policy",
            "repo",
            "rate",
            "hiked",
            "by",
            "25",
            "bps",
            "after",
            "4",
            "years"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Full text of RBI Monetary policy: Repo rate hiked by 25 bps after 4 years",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>The <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=reserve+bank+of+india\" target=\"_blank\">Reserve Bank of India </a>(RBI) on Wednesday announced a 25-basis-point hike in the repo rate to 6.25 per cent, in line with market expectations. The six-member <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=monetary+policy\" target=\"_blank\">Monetary Policy </a>Committee (MPC) kept its stance neutral, despite a repo rate increase. All of the six members of the MPC, including Governor and MPC Chairman <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=urjit+patel\" target=\"_blank\">Urjit Patel </a>voted in favour of a rate hike.</p><p>\n<em><strong>Here is the full text of RBI’s Second Bi-monthly <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=monetary+policy\" target=\"_blank\">Monetary Policy </a>Statement: </strong></em><br>On the basis of an assessment of the current and evolving macroeconomic situation at its meeting today, the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=monetary+policy\" target=\"_blank\">Monetary Policy </a>Committee (MPC) decided to:<br>• increase the policy repo rate under the liquidity adjustment facility (LAF) by 25 basis points to 6.25 per cent.</p><p>\nConsequently, the reverse repo rate under the LAF stands adjusted to 6.0 per cent, and the marginal standing facility (MSF) rate and the Bank Rate to 6.50 per cent.</p><p>\nThe decision of the MPC is consistent with the neutral stance of monetary policy in consonance with the objective of achieving the medium-term target for consumer price index (CPI) <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=inflation\" target=\"_blank\">inflation </a>of 4 per cent within a band of +/- 2 per cent, while supporting growth. The main considerations underlying the decision are set out in the statement below.</p><p>\n<strong>Assessment</strong><br>2. Since the last meeting of the MPC in April, global economic activity has continued to expand, though there has been some easing of momentum. Among advanced economies (AEs), the US economy began the year on a weak note on soft private spending and reduced residential investment; however, there seems to be a rebound in Q2:2018 with strong retail sales and improved employment data. The Euro Area growth decelerated in Q1; recent industrial production data as well as weak consumer and business sentiment suggest a loss of pace. The Japanese economy contracted in Q1, though it is expected to turn around in Q2 as indicated by recent data prints on exports and the manufacturing purchasing managers’ index (PMI).</p><p>\n3. Economic activity in major emerging market economies (EMEs) remained largely resilient. The Chinese economy maintained a strong momentum in Q1; more recent data on industrial production and PMI suggest that growth is likely to hold steady in Q2. The Russian economy appears to have picked up in recent months after a soft end to 2017; both manufacturing and services PMI rose in April. In South Africa, growth prospects have improved with the return of political stability as reflected in consumer confidence, manufacturing PMI and retail sales. In contrast, a stream of poor data from Brazil on high unemployment and soft industrial production show that the effects of recession linger.</p><p>\n4. Global trade growth has continued to strengthen, though geo-political tensions have contributed recently to declining export orders and air freight. Crude <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=oil+prices\" target=\"_blank\">oil prices </a>rose sharply till May 24 on heightened geo-political tensions, but moderated thereafter on expectations of easing of supplies by the Organisation of Petroleum Exporting Countries (OPEC) and Russia. Base metal prices, especially aluminium, have risen on account of US sanctions on Russia. Gold has witnessed selling pressure on a stronger dollar, but the metal gained last week on political uncertainty in the Euro Area. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=inflation\" target=\"_blank\">Inflation </a>pressures have emerged in some key advanced and emerging economies, driven in part by rising commodity prices.</p><p>\n4. Global trade growth has continued to strengthen, though geo-political tensions have contributed recently to declining export orders and air freight. Crude <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=oil+prices\" target=\"_blank\">oil prices </a>rose sharply till May 24 on heightened geo-political tensions, but moderated thereafter on expectations of easing of supplies by the Organisation of Petroleum Exporting Countries (OPEC) and Russia. Base metal prices, especially aluminium, have risen on account of US sanctions on Russia. Gold has witnessed selling pressure on a stronger dollar, but the metal gained last week on political uncertainty in the Euro Area. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=inflation\" target=\"_blank\">Inflation </a>pressures have emerged in some key advanced and emerging economies, driven in part by rising commodity prices.</p><p>\n5. Financial markets have been driven mainly by monetary policy expectations and geopolitical developments. Equity market performance has varied across regions with modest gains in the AEs on strong Q1 earnings and abating of trade tensions, while stocks in major EMEs have faced sell offs on a rising dollar and expectations of further rate hikes by the Fed. The 10- year sovereign yield in the US crossed 3 per cent in mid-May on strong economic data as well as expectations of tighter monetary policy and fiscal expansion, but softened subsequently on safe haven demand; yields softened in other key AEs as well. In most EMEs, however, bond yields have risen on reduced foreign appetite for their debt due to growing dollar shortage in the global market and on prospects of higher <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=interest+rates\" target=\"_blank\">interest rates </a>in AEs. In currency markets, the US dollar touched its highest level in May since December 2017. The euro depreciated significantly against the dollar reflecting a combination of factors, including soft growth data for the Euro Area, which suggested that monetary policy normalisation by the European Central Bank could be delayed, and political uncertainty in its southern periphery. EME currencies have, by and large, depreciated against the US dollar.</p><p>\n6. On the domestic front, the Central Statistics Office (CSO) released on May 31 the quarterly estimates of national income accounts for Q4:2017-18 and provisional estimates for 2017-18. Gross domestic product (GDP) growth for 2017-18 has been estimated at 6.7 per cent, up by 0.1 percentage point from the second advance estimates released on February 28. This increase in growth has been underpinned by a significant upward revision in private final consumption expenditure (PFCE) due especially to improved rural demand on the back of a bumper harvest and the government’s thrust on rural housing and infrastructure. Quarterly data suggest that the economy grew at 7.7 per cent in Q4:2017-18 – the fastest pace in the last seven quarters. Gross fixed capital formation (GFCF) growth accelerated for three consecutive quarters up to Q4.</p><p>\n7. On the supply side, estimates of agriculture and allied activities have been revised upwards, supported by an all-time high production of foodgrains and horticulture during the year. On a quarterly basis, agriculture growth increased sharply in Q4:2017-18. On April 16, the India Meteorological Department (IMD) forecast a normal south-west monsoon rainfall, which was reaffirmed on May 30. This augurs well for the agricultural sector.</p><p>\n8. Industrial growth also strengthened, reflecting the robust performance of manufacturing, which accelerated for three consecutive quarters in Q4. Capacity utilisation by manufacturing firms increased significantly in Q4:2017-18 as revealed in the latest round of the Reserve Bank’s order books, inventories and capacity utilisation survey (OBICUS). The output of eight core industries accelerated in April on account of a sharp expansion in coal production, which reached a 42-month peak. Cement output also posted double-digit growth for the sixth consecutive month in April. However, electricity generation slowed down. As per the early results of the Reserve Bank’s April-June round of the industrial outlook survey (IOS), activity is expected to expand at a lower rate in Q1:2018-19 due to a significant rise in input prices and perceptions of softening domestic and external demand conditions. However, the manufacturing PMI remained in an expansionary mode for the tenth consecutive month in May on the back of new domestic orders and exports.</p><p>\n9. Although services sector growth was revised downwards on account of lower growth in some constituents such as trade, hotels, transport &amp; communication, and financial services, it remained robust. Construction activity recorded the highest growth in Q4 in the new series (base 2011-12). Various high frequency indicators also suggest resilient performance of the services sector. Improving sales of tractors and two-wheelers suggest strengthening of rural demand. Commercial vehicle sales also accelerated in April. Revenue-earning freight traffic of railways picked up, driven by improved movement in coal, fertilisers, and cement. Growth in passenger vehicle sales accelerated but port traffic decelerated for the third successive month in April. Domestic air passenger traffic rose significantly in April. Two key indicators of construction activity showed improvement – cement production growth accelerated and steel consumption turned around. Services PMI moved slightly into contraction in May, reflecting decline in business activity and stagnation in new orders.</p><p>\n10. Retail inflation, measured by the year-on-year change in the CPI, rose sharply to 4.6 per cent in April, driven mainly by a significant increase in inflation excluding food and fuel. Excluding the estimated impact of an increase in house rent allowances (HRAs) for central government employees, headline inflation was at 4.2 per cent in April, up from 3.9 per cent in March. Food inflation moderated for the fourth successive month, pulled down by vegetables due to lower than the usual seasonal increase in their prices, and pulses and sugar which continued to experience deflation. However, within the food group, inflation increased in respect of cereals, fruits, prepared meals, meat and fish.</p><p>\n11. Fuel group inflation declined for the fifth month in a row in April mainly on account of a fall in the inflation of liquefied petroleum gas in line with international prices, and electricity. However, inflation in other major items of fuel such as firewood and chips, dung cake, kerosene and coal inched up. Inflation in the transport and communication sub-group accelerated due to the firming up of international crude oil prices, even though the domestic pass-through to petrol and diesel was incomplete. Inflation also picked up in clothing, household goods and services, health, recreation, education, and personal care and effects.</p><p>\n12. The May 2018 round of the Reserve Bank’s survey of households reported a significant rise in households’ inflation expectations of 90 basis points (bps) and 130 bps, respectively, for three-month and one-year ahead horizons. Manufacturing firms polled in the Reserve Bank’s IOS reported input price pressures and an increase in selling prices in Q1:2018-19. Firms polled for the manufacturing PMI in May also showed a sharp increase in input and output prices. Farm inputs and industrial raw material costs have risen sequentially. Wage pressures in the rural sector moderated; however, those in the organised sectors remained firm.</p><p>\n13. Liquidity in the system remained generally in surplus during April-May 2018. During April, the Reserve Bank absorbed surplus liquidity of ₹496 billion on a daily net average basis due to increased government spending, especially in the second half of the month. Reflecting easy liquidity conditions, the weighted average call rate (WACR) softened to 5.89 per cent in April (from 5.96 per cent in March). However, surplus liquidity in the system moderated considerably in the first half of May and the system moved into deficit in the third week of May mainly due to inflows on account of the goods and services tax (GST). The Reserve Bank conducted an open market operation purchase auction on May 17, 2018 to inject liquidity of ₹100 billion into the system. The system again turned into surplus in the last week of May reflecting mainly the payment of food subsidies. Surplus liquidity absorbed under the LAF on a daily net average basis declined to ₹142 billion in May. The WACR in May at 5.88 per cent remained broadly at the April 2018 level.</p><p>\n14. India’s exports grew in April 2018 after a marginal dip in the preceding month, supported mainly by non-oil exports, particularly engineering goods and chemicals. Import growth decelerated sequentially in April 2018; a significant decline in imports of gold as well as pearl and precious stones more than offset the impact of rising crude <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=oil+prices\" target=\"_blank\">oil prices.</a> Nevertheless, the trade deficit expanded in March and April from its level a year ago. External financing remained comfortable in 2017-18. While net foreign direct investment in 2017-18 was broadly comparable with the previous year, net foreign portfolio flows were stronger due to a sharp turnaround in debt inflows. However, foreign portfolio investors withdrew US$ 6.7 billion on a net basis from the domestic capital market in 2018-19 (up to June 4) reflecting volatility in global financial markets. India’s foreign exchange reserves were at US$ 412 billion on June 1, 2018.</p><p>\n<strong>Outlook</strong><br>15. The first bi-monthly resolution of 2018-19 in April projected CPI inflation in the range of 4.7-5.1 per cent in H1:2018-19 and 4.4 per cent in H2, including the HRA impact for central government employees with risks tilted to the upside. Excluding the impact of HRA revisions, CPI inflation was projected at 4.4-4.7 per cent in H1:2018-19 and 4.4 per cent in H2. Actual inflation outcomes since the April policy have evolved broadly on the lines of the projected trajectory. However, there has been an important compositional shift. While the summer momentum in vegetable prices was weaker than the usual pattern, there was an abrupt acceleration in CPI inflation excluding food and fuel.</p><p>\n16. The headline inflation outlook is driven primarily by two countervailing effects. On the one hand, CPI inflation excluding food and fuel rose sharply in April over March by 80 basis points to reach an ex-HRA level of 5.3 per cent, suggesting a hardening of underlying inflationary pressures. Furthermore, since the MPC’s meeting in early April, the price of Indian basket of crude surged from US$ 66 a barrel to US$ 74. This, along with an increase in other global commodity prices and recent global financial market developments, has resulted in a firming up of input cost pressures, as also confirmed in the Reserve Bank’s IOS for manufacturing firms in Q2:2018-19. The resulting pick-up in the momentum of inflation excluding food, fuel and HRA has imparted persistence into higher CPI projections for 2018-19. On the other hand, food inflation has remained muted over the past few months and the usual seasonal pickup delayed, softening the projections in the short run. Taking these effects into account, projected CPI inflation for 2018-19 is revised to 4.8-4.9 per cent in H1 and 4.7 per cent in H2, including the HRA impact for central government employees, with risks tilted to the upside (Chart 1). Excluding the impact of HRA revisions, CPI inflation is projected at 4.6 per cent in H1 and 4.7 per cent in H2.</p><p>\n17. Turning to the growth outlook, the CSO’s provisional estimates have placed GDP growth for Q4:2017-18 at 7.7 per cent – 70 basis points higher than that in Q3 – given the sharp acceleration in investment and construction activity. With improving capacity utilisation and credit offtake, investment activity is expected to remain robust even as there has been some tightening of financing conditions in recent months. Global demand has also been buoyant, which should encourage exports and provide a further thrust to investment. The sharp rise in petroleum product prices, however, is likely to impact disposable incomes. Consumption, both rural and urban, remains healthy and is expected to strengthen further. According to the early results of the Reserve Bank’s IOS, activity in the manufacturing sector is expected to moderate marginally in Q2:2018-19 on account of deterioration in the overall business situation and order book. On the basis of an overall assessment, GDP growth for 2018-19 is retained at 7.4 per cent as in the April policy. GDP growth is projected in the range of 7.5-7.6 per cent in H1 and 7.3-7.4 per cent in H2, with risks evenly balanced (Chart 2).</p><div><span>\n\t</span><img align=\"left\" alt=\"Full text of RBI Monetary policy: Repo rate hiked by 25 bps after 4 years\" class=\"imgCont\" height=\"298\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/06/full/1528278211-9504.jpg\" title=\"Full text of RBI Monetary policy: Repo rate hiked by 25 bps after 4 years\" width=\"620\"></div>\n<br>18. A major upside risk to the baseline inflation path in the April resolution has materialised, viz., 12 per cent increase in the price of Indian crude basket, which was sharper, earlier than expected and seems to be durable. Crude oil prices have been volatile recently and this imparts considerable uncertainty to the inflation outlook – both on the upside and the downside. Several other risks remain. First, global financial market developments have emerged as another important source of uncertainty. Second, the significant rise in households’ inflation expectations as gathered in the May 2018 round of the Reserve Bank’s survey could feed into wages and input costs in the coming months. However, the pass-through to output prices remains muted presently. Third, the staggered impact of HRA revisions by various state governments may push headline inflation up. While the statistical impact of HRA revisions will be looked through, there is a need to watch out for any second round impact on inflation. Fourth, the impact of the revision in the MSP formula for kharif crops is not possible to assess at this stage in the absence of adequate details. Fifth, as forecast by the IMD, if the monsoon is normal and well-distributed temporally and spatially, it may help keep food inflation benign.<p>\n19. Against the above backdrop, the MPC decided to increase the policy repo rate by 25 basis points and keep the stance neutral. The MPC reiterates its commitment to achieving the medium-term target for headline inflation of 4 per cent on a durable basis.</p><p>\n20. The MPC notes that domestic economic activity has exhibited sustained revival in recent quarters and the output gap has almost closed. Investment activity, in particular, is recovering well and could receive a further boost from swift resolution of distressed sectors of the economy under the Insolvency and Bankruptcy Code. Geo-political risks, global financial market volatility and the threat of trade protectionism pose headwinds to the domestic recovery. It is important that public finances do not crowd out private sector investment activity at this crucial juncture. Adherence to budgetary targets by the Centre and the States – which appears to be the case thus far – will also ease upside risks to the inflation outlook considerably.</p><p>\n21. Dr. Chetan Ghate, Dr. Pami Dua, Dr. Ravindra H. Dholakia, Dr. Michael Debabrata Patra, Dr. Viral V. Acharya and Dr. Urjit R. Patel voted in favour of the decision. The minutes of the MPC’s meeting will be published by June 20, 2018.</p><p>\n22. The next meeting of the MPC is scheduled on July 31 and August 1, 2018<br></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Full",
        "Monetary",
        "25",
        "six",
        "kept",
        "neutral"
    ],
    "nouns": [
        "years",
        "RBI",
        "Full",
        "text",
        "policy",
        "Policy",
        "rate",
        "25",
        "bps",
        "six",
        "member",
        "Committee",
        "stance",
        "neutral",
        "despite",
        "increase"
    ],
    "verbs": [
        "Full",
        "rate",
        "increase"
    ]
}