{
    "title": "NSE launches 'Tri-Party Repo Market' platform for corporate bonds",
    "link": "https://www.business-standard.com/article/markets/nse-launches-tri-party-repo-market-platform-for-corporate-bonds-118061300017_1.html",
    "pubDate": "Wed, 13 Jun 2018 00:42:00 +0530",
    "content": "In the corporate bond market so far, transactions take place on a bi-lateral basis but a trust factor is still lacking",
    "contentSnippet": "In the corporate bond market so far, transactions take place on a bi-lateral basis but a trust factor is still lacking",
    "guid": "https://www.business-standard.com/article/markets/nse-launches-tri-party-repo-market-platform-for-corporate-bonds-118061300017_1.html",
    "isoDate": "2018-06-12T19:12:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "nse",
            "launches",
            "'tri-party",
            "repo",
            "market'",
            "platform",
            "for",
            "corporate",
            "bonds"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "NSE launches 'Tri-Party Repo Market' platform for corporate bonds",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>The <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/national-stock-exchange\" target=\"_blank\">National Stock Exchange </a>(NSE) has launched a ‘Tri-Party Repo Market’ platform that will give a fillip to the demand for <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/corporate-bonds\" target=\"_blank\">corporate bonds </a>and provide liquidity boost to the debt segment of the bourse.</p><p>\nA tri-party repo contract is where a third entity or a tri-party agent, other than the borrower and lender, acts as an intermediary for two parties dealing in repo transactions. <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nse\" target=\"_blank\">NSE </a>will act as the tri-party agent and through an online web-based platform, facilitate trading anonymously and order matching along with services like collateral selection, payment and settlement, custody and management during the life cycle of the transaction.\n\n\n</p>\n<!-- INPAGE_BANNER --><p>\nThe repo rate is the rate at which the central bank lends to commercial banks in the event of any shortfall of funds. It is the main tool the apex bank uses to change interest rates and influence inflation.</p><p>\nIn the corporate bond market so far, transactions take place on a bi-lateral basis but a trust factor is still lacking. Under the tri-party repo market platform, a company can pledge bonds and borrow against the security, with a tri-party agent acting as a guarantor. Managing director and chief executive officer of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nse\" target=\"_blank\">NSE </a>Vikram Limaye said, “The corporate bond market in India needs improved liquidity as a holder typically ends up keeping the security till maturity. Repo on corporate debt provides an opportunity to borrow against securities and offers short-term liquidity to its participants.”<br>The National Securities Clearing Corporation will perform collateral services like valuation, margining and guarantee the settlement of repo transactions. So far, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/axis-bank\" target=\"_blank\">Axis Bank </a>and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=icici+securities+primary+dealership\" target=\"_blank\">ICICI Securities Primary Dealership </a>have been participants on the platform while all RBI licensed entities like banks, primary dealers, non-banking financial companies, mutual funds, housing finance companies and insurance firms are permitted to participate in the Tri-Party Repo market platform.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "corporate",
        "In",
        "far",
        "lateral",
        "lacking"
    ],
    "verbs": [
        "Market",
        "market",
        "bond",
        "Party",
        "place",
        "trust",
        "factor"
    ]
}