{
    "creator": "FE Bureau",
    "title": "Stressed Power Assets: No distress sale, says Centre",
    "link": "https://www.financialexpress.com/industry/stressed-power-assets-no-distress-sale-says-centre/1195110/",
    "pubDate": "Wed, 06 Jun 2018 06:04:34 +05:30",
    "dc:creator": "FE Bureau",
    "content": "According to official sources, other power projects, apart from the 11 shortlisted, can also be considered under Samadhan.",
    "contentSnippet": "According to official sources, other power projects, apart from the 11 shortlisted, can also be considered under Samadhan.",
    "guid": "https://www.financialexpress.com/?p=1195110",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-06T00:34:34.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.375,
        "tokens": [
            "stressed",
            "power",
            "assets",
            "no",
            "distress",
            "sale",
            "says",
            "centre"
        ],
        "words": [
            "distress",
            "no",
            "assets",
            "stressed"
        ],
        "positive": [
            "assets"
        ],
        "negative": [
            "distress",
            "no",
            "stressed"
        ]
    },
    "article": {
        "title": "Stressed Power Assets: No distress sale, says Centre",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1195112\" src=\"https://images.financialexpress.com/2018/06/powe-2.jpg\" alt=\"Stressed Power Assets, centre, SBI consortium,&nbsp;Samadhan scheme, NPA\" srcset=\"https://images.financialexpress.com/2018/06/powe-2.jpg 660w, https://images.financialexpress.com/2018/06/powe-2-300x200.jpg 300w, https://images.financialexpress.com/2018/06/powe-2-620x413.jpg 620w, https://images.financialexpress.com/2018/06/powe-2-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Stressed assets in the power sector would not be “sold for a song” as these projects would become viable with an upcoming surge in demand, power minister RK Singh said on Tuesday.</figure>\n\t\t\t</section></div><span>\n</span><p>Stressed assets in the power sector would not be “sold for a song” as these projects would become viable with an upcoming surge in demand, power minister RK Singh said on Tuesday. A State Bank of India-led consortium of banks had identified as many as 11 stressed power projects with a combined capacity of 12,460 MW for possible takeover by new promoters under the so-called Samadhan scheme (see chart).</p><span>\n</span><p>Addressing the media, Singh said state-run Rural Electrification Corporation has also come up with a plan to revive stressed power assets and the finance ministry would consider this proposal as well.<br>Under the Samadhan scheme, the identified power projects would be assigned to rating agencies to determine their “sustainable debt” levels. Thereafter, banks would put 51% equity of these projects up for auction to gauge the industry’s interest for such projects, while the remaining would be held back by banks and existing promoters so that they get a chance to redeem their stakes when demand revives.</p><span>\n</span><p>According to official sources, other power projects, apart from the 11 shortlisted, can also be considered under Samadhan. Non-performing assets (NPAs) in the power generation sector have more than doubled to around Rs 70,000 crore from Rs 34,244 crore a year ago. Also, about 10,000 MW of power generation assets with a total debt of over Rs 34,600 crore are now before National Company Law Tribunal, constituting 18% of the sector’s exposure to lenders. Out of these assets, 8,800 MW (debt of Rs 24,000 crore) are in early stages of construction with major milestones yet to be achieved.</p><span>\n</span><p>The stressed asset situation in the power sector is seen to worsen after the the Reserve Bank of India (<a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a>) issued a circular on February 12 directing banks to finalise a resolution plan in case of a default on large accounts of Rs 2,000 crore and above within 180 days, failing which insolvency proceedings will have to be invoked against the defaulter.</p><span>\n</span><p><img class=\"alignnone size-full wp-image-1195114\" src=\"https://images.financialexpress.com/2018/06/power-3.jpg\" alt=\"\" width=\"394\" height=\"434\" srcset=\"https://images.financialexpress.com/2018/06/power-3.jpg 394w, https://images.financialexpress.com/2018/06/power-3-182x200.jpg 182w, https://images.financialexpress.com/2018/06/power-3-375x413.jpg 375w, https://images.financialexpress.com/2018/06/power-3-242x267.jpg 242w\" sizes=\"(max-width: 394px) 100vw, 394px\"></p><span>\n</span><p>The RBI refused to provide any special dispensation to the power industry, after it pleaded that the stress in the sector was largely beyond the control of the power companies. In a move welcomed by lenders, the Allahabad High Court offered temporary relief to a clutch of such vulnerable power projects by ordering that no action be taken in their cases under the RBI circular till the finance ministry called a meeting of relevant stakeholders in June to see if the issues could be resolved.</p><span>\n</span><p>Singh said that the power ministry is yet to receive any communication from the finance ministry regarding the schedule of any meeting on this issue. As of February, receivables to independent power producers (IPPs) stood at Rs 13,446 crore. Additionally, IPPs claim that Rs 7,800 crore is stuck due to various delays in receiving orders from regulators, and they are not compensated for the extra money they have to shell out to buy coal at higher prices due to insufficient supply (only 60% of requirement) by Coal India.</p><span>\n</span><p>Rampant power capacity addition in recent years coupled with less-than-expected growth in demand have been attributed as the main factors behind the sector’s current woes. The FY13-17 plan period saw private players commissioning 53,660 MW of thermal capacity, which was 23% more than the target. Overall capacity addition of 99,210 MW in the period was 12% ahead of the target. Meanwhile, electricity demand grew at a CAGR of 4.93%. Meanwhile, utilisation levels of power plants decreased from 78.9% in FY08 to 60.5% in FY18.</p><span>\n</span><p>Total loans by banks to the power sector stood at Rs 5.18 lakh crore as on April 27, 2018. Power sector loans of as much as $38 billion (around Rs 2.5 lakh crore) have the potential of being written off as bad loans, Bank of America-Merrill Lynch said in a report in April. The overall gross NPAs of all banks touched Rs 8.41 lakh crore by December 2017.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "Stressed",
        "11",
        "considered",
        "No",
        "According",
        "official",
        "apart"
    ],
    "nouns": [
        "11",
        "Power",
        "power",
        "distress",
        "No",
        "official",
        "Assets",
        "Centre",
        "sale"
    ],
    "verbs": [
        "Power",
        "power",
        "distress",
        "Centre"
    ]
}