{
    "creator": "PTI",
    "title": "India mulls customs duty hike on 30 US products",
    "link": "https://www.financialexpress.com/economy/india-mulls-customs-duty-hike-on-30-us-products/1208080/",
    "pubDate": "Fri, 15 Jun 2018 23:59:28 +05:30",
    "dc:creator": "PTI",
    "content": "India has submitted a revised list of 30 items to the WTO on which it proposes to raise customs duty by up to 50 per cent. ",
    "contentSnippet": "India has submitted a revised list of 30 items to the WTO on which it proposes to raise customs duty by up to 50 per cent.",
    "guid": "https://www.financialexpress.com/?p=1208080",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-15T18:29:28.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "india",
            "mulls",
            "customs",
            "duty",
            "hike",
            "on",
            "30",
            "us",
            "products"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "India mulls customs duty hike on 30 US products",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"wp-image-1208081 size-full\" src=\"https://images.financialexpress.com/2018/06/hike.jpg\" alt=\"india, us, tariff, economy, trade, import, export, custom duty, custom duty hike\" srcset=\"https://images.financialexpress.com/2018/06/hike.jpg 660w, https://images.financialexpress.com/2018/06/hike-300x200.jpg 300w, https://images.financialexpress.com/2018/06/hike-620x413.jpg 620w, https://images.financialexpress.com/2018/06/hike-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The additional duty proposed to be hiked on these items ranges from 10 per cent to 100 per cent.</figure>\n\t\t\t</section></div><span>\n</span><p>India has now submitted a revised list of 30 items — including motor cycle, certain iron and steel goods, boric acid and lentils — to the WTO on which it proposes to raise customs duty by up to 50 per cent. As duties hiked by the US on certain steel and aluminium products would have implications of about USD 241 million on India, the raise in tariffs proposed by New Delhi too would have an equal implication on America.</p><span>\n</span><p>“The US would be collecting $241 million worth of duties by hiking tariffs on certain steel and aluminium items from India, we also proposed to withdraw concessions of similar amount from these 30 products imported by India from the US,” a source said.</p><span>\n</span><p>Earlier in May, India proposed to raise duties by up to 100 per cent on 20 products such as almonds, apple and specific motorcycles imported from the US.</p><span>\n</span><p>The additional duty proposed to be hiked on these items ranges from 10 per cent to 100 per cent.</p><span>\n</span><p>“The revision is being provided to adjust the products and the tariff rates in accordance with India’s rights reserved vide its notification to the Council for Trade in Goods contained in the WTO document…of May 18, 2018.</p><span>\n</span><p>“India hereby reiterates its decision to suspend concessions or other obligations notified to the Council for Trade in Goods on May 18, 2018…of the General Agreement on Tariffs and Trade 1994 and Article 8.2 of the Agreement on Safeguards, that are substantially equivalent to the amount of trade affected by the measures imposed by the United States,” according to a communication by India to WTO.</p><span>\n</span><p>It said that the proposed suspension of concessions or other obligations takes the form of an increase in tariffs on selected products originating in the US, based on the measures of the America.</p><span>\n</span><p>“India reserves its right to further suspend substantially equivalent concessions and other obligations based on the trade impact resulting from the application of the measures of the US,” it added.</p><span>\n</span><p>The country has proposed this move under the WTOs Agreement on Safeguards.</p><span>\n</span><p>On March 9, US President Donald Trump imposed heavy tariffs on imported steel and aluminium items, a move that has sparked fears of a global trade war.</p><span>\n</span><p>Trump signed two proclamations that levied a 25 per cent tariff on steel and a 10 per cent tariff on aluminium imported from all countries except Canada and Mexico.</p><span>\n</span><p>Earlier India had stated that these suspension will come into effect earlier than June 21, 2018, in case the US decides to continue the period of application of the measures.</p><span>\n</span><p>It said that the duty imposed by America has affected steel exports by USD 198.6 million, while the same on aluminium was USD 42.4 million.</p><span>\n</span><p>The other items include chickpeas, fresh apple, walnut, refined palmolein, motor cycle with engine capacity over 800 cc, diagnostic reagents and threaded nuts.</p><span>\n</span><p>India has also dragged the US to the World Trade Organisations dispute settlement mechanism over the imposition of import duties on steel and aluminium.</p><span>\n</span><p>India’s exports of steel and aluminium products to America stood at about USD 1.5 billion every year. Its exports to the US in 2016-17 stood at USD 42.21 billion, while imports were USD 22.3 billion.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "30",
        "revised",
        "50"
    ],
    "nouns": [
        "US",
        "hike",
        "India",
        "customs",
        "duty",
        "30",
        "list",
        "WTO",
        "raise",
        "50",
        "cent"
    ],
    "verbs": [
        "hike",
        "list",
        "raise"
    ]
}