{
    "title": "A China-India-Pakistan trilateral: Both a red herring and wake-up call",
    "link": "https://www.business-standard.com/article/economy-policy/a-china-india-pakistan-trilateral-both-red-herring-and-a-wake-up-call-118062200145_1.html",
    "pubDate": "Fri, 22 Jun 2018 08:53:00 +0530",
    "content": "If the Indian Prime Minister can go for a so-called 'reset' with China, why not also with Pakistan",
    "contentSnippet": "If the Indian Prime Minister can go for a so-called 'reset' with China, why not also with Pakistan",
    "guid": "https://www.business-standard.com/article/economy-policy/a-china-india-pakistan-trilateral-both-red-herring-and-a-wake-up-call-118062200145_1.html",
    "isoDate": "2018-06-22T03:23:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "a",
            "china-india-pakistan",
            "trilateral",
            "both",
            "a",
            "red",
            "herring",
            "and",
            "wake-up",
            "call"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "A China-India-Pakistan trilateral: Both a red herring and wake-up call",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tAt an event earlier this week organized at the initiative of the Chinese Embassy in New Delhi, China’s envoy, Amb. Luo Zhaohui noting that India and Pakistan had become full member of the Shanghai Cooperation Organization mooted the idea of a ‘China-India-Pakistan Leaders Meeting … under the SCO framework’.</p>\n<p>\n\tThe last time the Chinese envoy came up with a trilateral idea for cooperation was at a speech at the United Service Institution of India in May 2017 where he suggested that the name of the China-Pakistan Economic Corridor (CPEC) could be changed to accommodate Indian sensitivities. That speech can no longer be found on the Chinese Embassy website indicating that he possibly spoke out of turn or at least ruffled some feathers in Beijing and/or across the border.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tNevertheless, Amb. Luo’s latest speech is unlikely to disappear if for nothing else because the trilateral idea is not a new one. The Chinese have long engaged with the question of how to bring on board the SCO two countries with frequently adversarial ties as India and Pakistan while not letting the Organisation’s meetings descend into name-calling and frequent disruptions. Now that India and Pakistan are members however, some of the possible reasons behind Chinese support can be outlined.</p>\n<p>\n\t<strong>China’s Reasons</strong></p>\n<p>\n\tFor one, Chinese scholars have pointed out that the SCO’s initial purpose was to deal with ‘complicated issues’, including the border dispute with Russia that was eventually settled. Thus, the ‘spirit of SCO’ helped in resolving difficult problems through dialogue and discussion. The implication is that the SCO offers a platform also to help resolve Indo-Pak issues through not just the heads-of-government meetings but also by developing commercial and other linkages.</p>\n<p>\n\tFor another, it is important, if the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/cpec\" target=\"_blank\">CPEC </a>is to succeed and find more backers, for Pakistan itself to be able to shed the image of being an irresponsible or weak state and be seen as active in multilateral organisations. In other words, the SCO membership is to ensure the socialization of Pakistan in the wider region and if this requires India, too, to be a member of the SCO, this is a small price to pay.</p>\n<p>\n\tMany of India’s reasons for joining the SCO such as reviving ties with Central Asian countries and increasing trade opportunities also apply to Pakistan. Also note that it is only the latter that has the physical connections through a friendly neighbour in China to make the most of the SCO’s trade and infrastructure connectivity opportunities.</p>\n<p>\n\tWhile India has the greater goodwill in Central Asia in terms of its soft power, this is often hard to convert into any practical gains and Pakistan’s Muslim identity works, perhaps, equally well in many areas.</p>\n<p>\n\tWhile the Chinese will deny it, there is little doubt that they will be happy to offer themselves as mediators on the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/kashmir\" target=\"_blank\">Kashmir </a>issue if the parties so desire. Pakistan will probably have no problem and separatists in the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/kashmir\" target=\"_blank\">Kashmir </a>Valley, too, have previously called for China to be a party to the dispute. India’s position on this issue is, of course, one of unequivocal opposition to third-party involvement.</p>\n<p>\n\t<strong>An Indian Counter</strong></p>\n<p>\n\tMeanwhile, it might also be noted that even if <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/kashmir\" target=\"_blank\">Kashmir </a>were an important issue that the Chinese would like to get involved in, they also simultaneously refuse to see it from anything but an India-Pakistan paradigm. Given that India and Pakistan are now members of the SCO, New Delhi should ask the Chinese, if they bring up Kashmir, why limit the issue to a three-cornered triangle with China and not view this from a larger Central Asian perspective?</p>\n<p>\n\tOne part of this perspective would be to officially get the Pakistanis to invite India to join the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/cpec\" target=\"_blank\">CPEC.</a> The Chinese ambassador can talk about changing names all he wants but it is from Islamabad (and Rawalpindi) that the invitation will have to come. Besides a suitable change of nomenclature, if the Chinese and Pakistanis wish to join in connectivity projects with India, they should also be willing to take on board Indian standards – of accountability and transparency, for example – for these projects.</p>\n<p>\n\tAnother part of an expanded definition of the trilateral is for China to also agree to connectivity through the Line of Actual Control between Ladakh, including Kargil, and Xinjiang and Tibet. These are regions that are very much part of Central Asia in terms of history, culture and trade connectivity. Beijing has, however, so far refused to consider reviving such links, including the reopening of Indian consulates in Lhasa and in Kashgar in southern Xinjiang.</p>\n<p>\n\tShort of a Chinese willingness to activate such links, China’s call for China-India-Pakistan trilateral is merely intended to showcase its senior role in bringing two adversaries together and to burnish its credentials as a supposedly responsible Asian and global power.</p>\n<p>\n\t<strong>A Pakistan ‘Reset’</strong></p>\n<p>\n\tFor New Delhi, meanwhile, the Chinese envoy’s suggestion should also provide fresh impetus if that were needed, to reconsider its own Pakistan policy. At the moment, the slightest hint of provocation – a riot, border shelling, terrorist ingress or attack – is enough to upend any initiative with Pakistan suggesting that the initiative is not serious to start with. If the Indian Prime Minister can go for a so-called ‘reset’ with China, why not also with Pakistan? Short of boldness of action and vision vis-à-vis Pakistan, it is, for all practical purposes, the case that India has outsourced its Pakistan policy to China.</p>\n<hr>\n\t<em><strong>Jabin T. Jacob is a China analyst based in New Delhi. He tweets <a href=\"https://twitter.com/jabinjacobt?lang=en\" target=\"_blank\">@jabinjacobt</a></strong></em>\t\t\t\t\n\t\t\t\t    \t\t\t\t     <p>\n\t\t\t\t\t\t\t\t<em>Disclaimer: Views expressed are personal. They do not reflect the view/s of Business Standard.</em></p>\n\t\t\t\t\t\t</span>"
    },
    "adjectives": [
        "Indian",
        "red",
        "trilateral",
        "Prime",
        "go",
        "Both"
    ],
    "nouns": [
        "India",
        "Indian",
        "call",
        "reset",
        "red",
        "trilateral",
        "Minister",
        "Prime",
        "A",
        "go",
        "China",
        "Pakistan",
        "herring",
        "wake",
        "so",
        "why"
    ],
    "verbs": [
        "call",
        "reset",
        "Minister",
        "Prime",
        "go",
        "wake"
    ]
}