{
    "title": "Tata group profit rises 35% under Chandra; importance of TCS, JLR declines",
    "link": "https://www.business-standard.com/article/companies/tata-group-profit-rises-35-under-chandra-importance-of-tcs-jlr-declines-118062200054_1.html",
    "pubDate": "Fri, 22 Jun 2018 01:48:00 +0530",
    "content": "While Tata Motors' domestic business contributed with a 33 per cent year-on-year jump in net sales last financial year, the story at JLR was disappointing",
    "contentSnippet": "While Tata Motors' domestic business contributed with a 33 per cent year-on-year jump in net sales last financial year, the story at JLR was disappointing",
    "guid": "https://www.business-standard.com/article/companies/tata-group-profit-rises-35-under-chandra-importance-of-tcs-jlr-declines-118062200054_1.html",
    "isoDate": "2018-06-21T20:18:00.000Z",
    "sentiment": {
        "score": 5,
        "comparative": 0.4166666666666667,
        "tokens": [
            "tata",
            "group",
            "profit",
            "rises",
            "35",
            "under",
            "chandra",
            "importance",
            "of",
            "tcs",
            "jlr",
            "declines"
        ],
        "words": [
            "importance",
            "rises",
            "profit"
        ],
        "positive": [
            "importance",
            "rises",
            "profit"
        ],
        "negative": []
    },
    "article": {
        "title": "Tata group profit rises 35% under Chandra; importance of TCS, JLR declines",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tIn the first full financial year under Chairman N Chandrasekaran, the adjusted net profit of listed Tata group companies rose 35 per cent in 2017-18 against a 0.5 per cent decline in the previous year.</p>\n<p>\n\tGroup revenues, too, were up 9.2 per cent, growing at the fastest pace in the last four years.</p>\n<p>\n\tTata Steel was the star performer in 2017-18, with revenue from the domestic business rising 23 per cent last financial year. Its impact at the net profit level was significant — if Tata Steel were to be excluded, the net profit growth of the group would have been 10.3 per cent.</p>\n<p>\n\tOn the other hand, the group's two traditional cash cows, Tata Consultancy Services (TCS) and Tata Motors' subsidiary Jaguar Land Rover (JLR), are slowing as other businesses pick up pace. Besides steel, the group’s domestic consumer businesses have helped in improving revenue and profits.</p>\n<p>\n\tThe analysis is based on the annual financials of the Tata group's listed non-financial companies, excluding listed subsidiaries of Tata Steel, Tata Motors, Indian Hotels, Tata Chemicals and Tata Power, among others.</p>\n<p>\n\tIn all, the sample has 16 Tata companies. However, the three biggest — Tata Motors, Tata Steel and TCS — accounted for 85 per cent of the group's revenues last financial year. Exceptional gains and losses have been excluded from net profit.</p>\n<p>\n\tWhile Tata Motors’ domestic business contributed with a 33 per cent year-on-year jump in net sales last financial year, the story at JLR was disappointing.</p>\n<p>\n\tThe contribution of TCS and JLR to the group's combined net profit declined to a seven-year low of 70.4 per cent in 2017-18, down from 98.5 per cent a year ago. TCS reported its first year-on-year decline in net profit last financial year, while JLR's net profit was down for the third consecutive year last financial year.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/companies/former-foreign-secretary-subrahmanyam-jaishankar-set-to-join-tata-group-118042300269_1.html\" target=\"_blank\">Former foreign secretary Subrahmanyam Jaishankar set to join Tata group</a></strong></p>\n<p>\n\tAnalysts expect the trend to continue in the near-to-medium term, given the poor growth outlook for the information technology (IT) services business and regulatory headwinds for diesel-powered vehicles. \"Volume growth in IT services fell to low single-digits and it is likely to stay like that for some more time, while JLR sales and margins were under pressure following an European clampdown on diesel-powered vehicles,\" says G Chokkalingam, founder and managing director, Equinomics Research &amp; Advisory Services.</p>\n<p>\n\tThere has been a pick-up in growth in the group's domestic consumer goods business — Titan, Tata Global Beverage and Tata Motors' domestic passenger business. This has been supplemented by a turnaround in the global steel cycle that has benefitted Tata Steel, the group's second-largest company by revenue behind Tata Motors, but ahead of TCS.</p>\n<p>\n\t\t<img align=\"left\" alt=\"graph\" class=\"imgCont\" height=\"412\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/22/full/1529612657-5374.jpg\" title=\"graph\" width=\"620\"></p>\n\tTata Steel accounted for one-fifth of the group's consolidated net profit in 2017-18, up from 2.5 per cent a year ago, and nearly 70 per cent of the group's incremental net profit growth (adjusted for exceptional gains and losses) last financial year.\n<p>\n\t\"In the coming months, we have to see what kind of return on investments Tata Steel earns from its acquisition of Bhushan Steel,\" corporate lawyer H P Ranina said. \"There is also a question mark over Tata Steel Europe's merger with Thyssenkrupp,\" he added.</p>\n<p>\n\tTata Steel Europe turned profitable during January-March 2018, after posting losses in the previous two quarters. In all, Tata Steel Europe has made losses in 30 out of the last 37 quarters.</p>\n<p>\n\tTata Motors' domestic business reported profits during the second half of 2017-18 after losing money for five consecutive quarters. This was due to a sharp uptick in sales of both passenger and commercial vehicles, and a rise in the company's market share last financial year, reversing the trend of the previous few years. <br></p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/companies/tata-group-s-trent-revamps-online-grocery-operations-launches-portal-118011500051_1.html\" target=\"_blank\">Tata group's Trent revamps online grocery operations, launches portal</a></strong></p>\n<p>\n\tRobust earnings growth at other companies such as Tata Power, Tata Communications, Tata Chemicals and Indian Hotels will put the group's growth trajectory higher.</p>\n<p>\n\tSince Chandrasekaran took charge, the group took several important decisions to get rid of legacy issues raised by former chairman Cyrus Mistry. The group has sold its loss-making wireless telephony business to Bharti Airtel for free and plans to merge Tata Teleservices' enterprise business with Tata Communications. Tata Sons is also buying out the cross-holdings among various listed entities.</p>\n<p>\n\t“The group should focus on return on equity to reward shareholders as Chandra had outlined earlier. He took many small steps in this regard but shareholders were still waiting for better returns,” said Shriram Subramanian, founder and managing director of Ingovern Research Services, a proxy advisory firm.</p>\n<p>\n\tUnder Chandra’s leadership, the group companies' return on equity (RoE) improved to 17.6 per cent in 2017-18, from 16.7 per cent a year ago. Excluding TCS, the RoE improvement was a respectable 11.8 per cent last financial year, from a record low of 7.4 per cent a year ago.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "last",
        "net",
        "domestic",
        "financial",
        "disappointing",
        "35",
        "33"
    ],
    "nouns": [
        "last",
        "year",
        "group",
        "profit",
        "sales",
        "story",
        "net",
        "business",
        "cent",
        "importance",
        "domestic",
        "While",
        "jump"
    ],
    "verbs": [
        "last",
        "group",
        "profit",
        "net",
        "jump"
    ]
}