{
    "title": "How this small ad might provide an easier route to India's civil services",
    "link": "https://www.business-standard.com/article/economy-policy/how-this-small-ad-might-provide-an-easier-route-to-india-s-civil-services-118061500680_1.html",
    "pubDate": "Fri, 15 Jun 2018 16:39:00 +0530",
    "content": "In 2016, 1.1 million people sat for the first stage of the selection process; all knew that only 180 of them would make it into the service. Success is about as likely as a tossed nickel landing on it",
    "contentSnippet": "In 2016, 1.1 million people sat for the first stage of the selection process; all knew that only 180 of them would make it into the service. Success is about as likely as a tossed nickel landing on it",
    "guid": "https://www.business-standard.com/article/economy-policy/how-this-small-ad-might-provide-an-easier-route-to-india-s-civil-services-118061500680_1.html",
    "isoDate": "2018-06-15T11:09:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "how",
            "this",
            "small",
            "ad",
            "might",
            "provide",
            "an",
            "easier",
            "route",
            "to",
            "india's",
            "civil",
            "services"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "How this small ad might provide an easier route to India's civil services",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tIt was the most carefully examined little square of newsprint in recent Indian history. Last week, a small job ad appeared on the inside pages of some newspapers looking for candidates for the post of \"joint secretary\" in the Indian government. Within a few hours, the ad had gone viral: Opposition politicians had weighed in, Twitter was agog and hundreds of thousands of 40ish Indians wondered if they had one last, unexpected opportunity to make their parents proud.</p>\n<p>\n\tAnyone unfamiliar with the Indian state would have been mystified by the uproar. After all, just 10 positions were being advertised, and successful applicants would get a three-year contract -- at government salaries. What was the big deal?\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tQuicktakeIndia’s Aspirations</p>\n<p>\n\tIndians, on the other hand, immediately recognized that in opening up the ranks of the civil service to qualified outsiders, one of their country's stoutest walls had been breached. India has the most closed and hierarchical government of any major democracy. In fact, India's bureaucracy is more removed from its people than those in many authoritarian countries. Our politicians may get all the attention, but everyone knows that mid-level <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bureaucrats\" target=\"_blank\">bureaucrats </a>such as joint secretaries -- there are about 350 of them in all -- are India's real policy-makers.</p>\n<p>\n\tA tiny cadre of generalists, known as the Indian Administrative Service, currently monopolizes these posts. Members of the IAS are selected in their 20s, after a fiendishly difficult entrance examination. In 2016, 1.1 million people sat for the first stage of the selection process; all knew that only 180 of them would make it into the service. Success is about as likely as a tossed nickel landing on its edge. You have better odds of becoming an astronaut if you apply to NASA. Ten times better, in fact.</p>\n<p>\n\tBut, if you make it through the exam, you are guaranteed to be one of India's rulers for life. Constitutionally, you can't be fired without a time-consuming and troublesome legal process. At most, elected politicians can transfer you from one post to another.</p>\n<p>\n\tBefore your 30th birthday, you’ll be given an Indian district to run, answerable to no local politician or council, and with near-absolute power over millions of people. You’ll collect their taxes, sit in judgment over their land disputes, control the local police and disburse pensions and scholarships and welfare. You’ll travel everywhere with a retinue of junior officials and favor-seekers, live in the nicest house in the district and be the guest of honor at every social function. Unsurprisingly, after awhile it can become quite hard to remember that you are, after all, just another public servant. In fact, you might begin to suspect you are a superior breed of human.</p>\n<p>\n\tThus, when you’re called to New Delhi and made a joint secretary in, say, the shipping ministry, you’re confident that you will be able to devise complex new rules for berthing super-tankers in Indian ports on your second day at work. Of course, given that transfers and postings are almost random, next year you might be deciding on a trade agreement in the Ministry of Commerce. Or perhaps predicting the course of the monsoon at the Ministry of Earth Sciences. Naturally, you know you will do so correctly. Your degree might have been in 13th-century poetry or something, but training and expertise are for lesser mortals. You passed a very difficult examination 30 years ago and are thus fully qualified to rule one-fifth of humanity.</p>\n<p>\n\tThis unaccountable, walled-off governance structure helps answer a question that outsiders often ask: If India's state is served by such intelligent and confident officers, why is it so lazy, incompetent and backward-looking? Policy is ill-conceived, rules are detached from economic reality, laws are poorly drafted and regulations gush forth from government offices to drown India’s billion-plus citizens in paperwork.</p>\n<p>\n\tAnd this is why many of us see that little newspaper advertisement as not just another job posting, but the first draft of a declaration of independence. We can begin to believe that, one day, positions in New Delhi's corridors of power -- positions with real responsibility -- will be given to people with demonstrated ability in the fields they are supposed to supervise.</p>\n<p>\n\tI'm not declaring independence just yet. There are many reasons to be wary. The opposition is justly suspicious that the government of Prime Minister Narendra Modi wants to stock the bureaucracy with individuals sympathetic to his party's Hindu nationalist ideology. Others worry that a revolving door between government and the private sector is being installed, which will lead to greater corporate power over the state. Marginalized groups wonder if India's affirmative-action policies are going to be ignored.</p>\n\n<p>\n\tI myself worry that many of these positions will not be filled by world-class experts but by, for example, officers from India's inefficient public sector. Even so, those of us who have long despaired of India reforming its byzantine administration can perhaps be permitted a smidgen of hope.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "million",
        "likely",
        "first",
        "In",
        "small",
        "civil",
        "180"
    ],
    "nouns": [
        "India",
        "million",
        "people",
        "stage",
        "process",
        "first",
        "Success",
        "In",
        "services",
        "service",
        "small",
        "ad",
        "route",
        "sat",
        "selection",
        "nickel",
        "landing"
    ],
    "verbs": [
        "people",
        "stage",
        "provide",
        "process",
        "service",
        "route",
        "nickel"
    ]
}