{
    "creator": "Rajesh Ravi",
    "title": "Black tiger shrimps to help diversify seafood export basket",
    "link": "https://www.financialexpress.com/market/commodities/black-tiger-shrimps-to-help-diversify-seafood-export-basket/1215466/",
    "pubDate": "Fri, 22 Jun 2018 00:56:28 +05:30",
    "dc:creator": "Rajesh Ravi",
    "content": "India will focus on aquaculture farming of black tiger shrimps in order to de-risk and diversify the seafood export basket, Marine Products Export Development Authority (MPEDA) chairman A Jayathilak said on Thursday. ",
    "contentSnippet": "India will focus on aquaculture farming of black tiger shrimps in order to de-risk and diversify the seafood export basket, Marine Products Export Development Authority (MPEDA) chairman A Jayathilak said on Thursday.",
    "guid": "https://www.financialexpress.com/?p=1215466",
    "categories": [
        "Commodities",
        "Market"
    ],
    "isoDate": "2018-06-21T19:26:28.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.2222222222222222,
        "tokens": [
            "black",
            "tiger",
            "shrimps",
            "to",
            "help",
            "diversify",
            "seafood",
            "export",
            "basket"
        ],
        "words": [
            "help"
        ],
        "positive": [
            "help"
        ],
        "negative": []
    },
    "article": {
        "title": "Black tiger shrimps to help diversify seafood export basket",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1215491\" src=\"https://images.financialexpress.com/2018/06/shrimp.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/shrimp.jpg 660w, https://images.financialexpress.com/2018/06/shrimp-300x200.jpg 300w, https://images.financialexpress.com/2018/06/shrimp-620x413.jpg 620w, https://images.financialexpress.com/2018/06/shrimp-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Black tiger shrimps to help diversify seafood export basket</figure>\n\t\t\t</section></div><span>\n</span><p>India will focus on aquaculture farming of black tiger shrimps in order to de-risk and diversify the seafood export basket,&nbsp;Marine Products Export Development Authority (MPEDA) chairman A Jayathilak said on Thursday. Vannamei, or white shrimps, dominate Indian exports with nearly 70% share in dollar earnings , which comes to $ 5.64 billion for the April-January 2018 period.</p><span>\n</span><p>Jayathilak said that India was known for the export of black tiger shrimps (P. monodon) and focusing on the farming of the species is vital for the seafood export sector. He was speaking to reporters at the soon-to-be-commissioned multi-species aquaculture complex at Vallarpadam in Kochi.<br>Jayathilak said that the unique feature of the facility will be its tiger shrimp hatchery with a production capacity of 20 million disease-free high-health seeds per annum.</p><span>\n</span><p>“This effort will revive the black tiger shrimp farming after a gap of two decades and will certainly bring about huge returns, as demand and price for good quality tiger shrimp is very high in the international markets, especially Japan and the European Union,” he pointed out. Vannamei dominates the aquaculture production in India with black tiger shrimp limited to a minimum share in small pockets. Earlier, black tiger shrimp was mostly captured from sea and not farmed. Vannamei, which is easy and economical to farm, became the dominant species in the last 10 years.</p><span>\n</span><p>In 1996, MPEDA, in collaboration with the Oceanic Institute of Hawaii in the US, began the first Broodstock Multiplication Centre for vannamei in Andhra Pradesh, which sells broodstock to hatcheries across the country. One of the major impediments while undertaking black tiger prawn farming is the lack of healthy, disease-free seeds. Serving as a model, the facility at Kochi will pave the way to establish similar facilities in other parts of the country, MPEDA sources said.</p><span>\n</span><p>Black tiger shrimp is in demand as the best species for culture in the traditional farming systems of Kerala, named pokkali padashekarams, during the off-season of paddy cultivation. Jayathilak said the hatchery would soon produce disease-free seeds of tiger shrimps by using SPF broodstock. Spread over 8.5 acres, the facility will produce seeds and fingerlings of six-seven commercially important species, which are of high export demand. The species include tiger shrimp, Asian seabass, pompano, cobia and genetically-improved farmed tilapia, among others. FAO’s GLOBEFISH recently reported that Indian shrimp production is estimated to rise 10 % in 2018, provided the climate doesn’t create major problems.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "Black",
        "black",
        "Marine",
        "farming"
    ],
    "nouns": [
        "tiger",
        "Black",
        "black",
        "help",
        "seafood",
        "export",
        "Export",
        "basket",
        "will",
        "India",
        "focus",
        "aquaculture",
        "farming",
        "Marine",
        "order",
        "risk",
        "de",
        "Development",
        "Authority",
        "chairman",
        "A",
        "Thursday"
    ]
}