{
    "title": "Steel units seek easier norms for expeditious auction of mineral blocks",
    "link": "https://www.business-standard.com/article/economy-policy/steel-units-seek-easier-norms-for-expeditious-auction-of-mineral-blocks-118061401133_1.html",
    "pubDate": "Fri, 15 Jun 2018 01:42:00 +0530",
    "content": "Want G2 exploration norms relaxed; 75% of India's steel producers don't have captive iron ore blocks as opposed to China where 70% have captive blocks",
    "contentSnippet": "Want G2 exploration norms relaxed; 75% of India's steel producers don't have captive iron ore blocks as opposed to China where 70% have captive blocks",
    "guid": "https://www.business-standard.com/article/economy-policy/steel-units-seek-easier-norms-for-expeditious-auction-of-mineral-blocks-118061401133_1.html",
    "isoDate": "2018-06-14T20:12:00.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.09090909090909091,
        "tokens": [
            "steel",
            "units",
            "seek",
            "easier",
            "norms",
            "for",
            "expeditious",
            "auction",
            "of",
            "mineral",
            "blocks"
        ],
        "words": [
            "blocks"
        ],
        "positive": [],
        "negative": [
            "blocks"
        ]
    },
    "article": {
        "title": "Steel units seek easier norms for expeditious auction of mineral blocks",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tSteel units have asked for relaxing the mandatory <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=g2+level+exploration\" target=\"_blank\">G2 level exploration </a>norms for conduct of mineral blocks auctions. Strict adherence to the G2 exploration norm is slowing the pace of auctions, they feel.</p>\n<p>\n\t“At present, auctions of mineral blocks are contingent on meeting the G2 exploration norms. But, these norms are indicative and there is provision for relaxation of the exploration norms under Rule 8 of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/minerals\" target=\"_blank\">Minerals </a>(Evidence of Mineral Contents) Rules, 2015.<br>Mineral blocks of adequate dimensions can be put up for auctions by complying with G1 exploration level”, said an official with a steel company.</p>\n<p>\n\tFlagging some of the issues before the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=union+steel+minister+chaudhary+birender+singh\" target=\"_blank\">Union steel minister Chaudhary Birender Singh </a>during his recent Odisha visit, the steel players pointed out that the minimum stipulation of G2 level of exploration was proving to be detrimental to holding mineral auctions in a time frame.<br></p>\n<!-- INPAGE_BANNER -->\n\t<br>They suggested that iron ore blocks could be reserved for iron and steel industry under provisions of sub-Rule 3 under Rule 6 of Mineral Auction Rules, 2015.\n<p>\n\tIron ore blocks auctioned in the country have been witness to intense competition.<br>Of the 10 auctioned blocks, the final bid value was above 100 per cent in five blocks. Steel makers, especially those without captive resources, are intensely competing at mineral block auctions to secure raw material for current and future operations.<br>About 75 per cent of the steel producers in the country are sans captive iron ore blocks as opposed to China where 70 per cent have captive blocks.</p>\n<p>\n\tThe steel units revisited the sore point of high royalty rates on iron ore in the country, stressing on the need to rationalize it.<br>Currently, royalty is levied at 15 per cent ad valorem on iron ore, making it the steepest rate anywhere in the world.<br>Australia charges 6.5-7.5 per cent royalty on iron ore, Brazil two per cent, South Africa 0.5-7 per cent and China 0.5-4 per cent.<br>At a rate of 15 per cent in India, the cumulative impact of royalty is 25.79 per cent of the Indian Bureau of Mines (IBM) price at mine heads despatch and 50.10 per cent of the IBM price on steel plant despatch. If pellets are used instead of scarcely available lumps, the impact comes to 70 per cent.<br>Moreover, the country's advantage of being a large repository of iron ore resources is lost when premium payment for mines allocated through the auctions route touches more than 100 per cent.<br>The premium payment is over and above the royalty amount and contributions made to <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/district-mineral-foundation\" target=\"_blank\">District Mineral Foundation </a>(DMF) and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=national+mineral+exploration+trust\" target=\"_blank\">National Mineral Exploration Trust </a>(NMET).</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "relaxed",
        "expeditious",
        "mineral",
        "captive",
        "opposed",
        "75",
        "iron",
        "70"
    ],
    "nouns": [
        "India",
        "exploration",
        "mineral",
        "captive",
        "Want",
        "seek",
        "Steel",
        "steel",
        "auction",
        "don",
        "iron",
        "ore",
        "China",
        "70"
    ],
    "verbs": [
        "Want",
        "seek",
        "Steel",
        "steel",
        "auction",
        "don",
        "iron"
    ]
}