{
    "title": "Airbus warns could leave UK if no Brexit deal",
    "link": "https://timesofindia.indiatimes.com/business/international-business/airbus-warns-could-leave-uk-if-no-brexit-deal/articleshow/64696401.cms",
    "pubDate": "Fri, 22 Jun 2018 09:20:25 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/international-business/airbus-warns-could-leave-uk-if-no-brexit-deal/articleshow/64696401.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64696401.cms\" /></a>The European group, which directly employs nearly 15,000 people in Britain, warned that crashing out of the bloc would be \"catastrophic\" and force it to consider its investments.",
    "contentSnippet": "The European group, which directly employs nearly 15,000 people in Britain, warned that crashing out of the bloc would be \"catastrophic\" and force it to consider its investments.",
    "guid": "https://timesofindia.indiatimes.com/business/international-business/airbus-warns-could-leave-uk-if-no-brexit-deal/articleshow/64696401.cms",
    "isoDate": "2018-06-22T09:20:25.000Z",
    "sentiment": {
        "score": -4,
        "comparative": -0.4444444444444444,
        "tokens": [
            "airbus",
            "warns",
            "could",
            "leave",
            "uk",
            "if",
            "no",
            "brexit",
            "deal"
        ],
        "words": [
            "no",
            "leave",
            "warns"
        ],
        "positive": [],
        "negative": [
            "no",
            "leave",
            "warns"
        ]
    },
    "article": {
        "title": "Airbus warns could leave UK if no Brexit deal",
        "content": "<div class=\"Normal\"><span>LONDON: Aviation giant </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Airbus\">Airbus</a><span> has warned it could pull out of Britain if it leaves the </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/European-Union\">European Union</a><span> without a deal, upping the pressure Friday on Prime Minister </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Theresa-May\">Theresa May</a><p> to make progress in negotiations with Brussels.\n\n</p><p>The European group, which directly employs nearly 15,000 people in Britain, warned that crashing out of the bloc would be \"catastrophic\" and force it to consider its investments.\n</p><p>\"Put simply, a 'no deal' scenario directly threatens Airbus' future in the UK,\" said chief operating officer Tom Williams, almost two years since Britain voted to leave the EU.\n</p><p>May's government insists it must hold out the possibility of walking away as a negotiating tactic, but says it expects to get a deal before it exits the bloc on March 29, 2019.\n</p><p>\"We have made significant progress towards agreeing a deep and special partnership with the EU to ensure trade remains as free and frictionless as possible, including in the aerospace sector,\" a spokeswoman said.\n</p><p>However, talks are stalled on the issue of the Irish border and Britain's indecision over the deal it wants.\n</p><span>EU leaders, who will meet May at a </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Brussels-summit\">Brussels summit</a><p> next week, have warned that time is running out.\n</p><p>\"While Airbus understands that the political process must go on, as a responsible business we require immediate details on the pragmatic steps that should be taken to operate competitively,\" Williams said.\n</p><p>In a Brexit risk assessment, Airbus said leaving the EU's single market and customs union immediately with no agreed transition deal \"would lead to severe disruption and interruption of UK production\".\n</p><p>Delays and disruptions to its production could cost it up to one billion euros ($1.2 billion) a week in lost turnover and would be \"catastrophic\".\n</p><p>\"This scenario would force Airbus to reconsider its investments in the UK, and its long-term footprint in the country,\" the report published late Thursday said.\n</p><p>Airbus builds wings and landing gear for commercial aircraft at 25 centres in Britain and also has a space technology centre.\n</p><p>It directly employs nearly 15,000 people and also supports more than 100,000 further jobs in the supply chain. The prospect of losing so many jobs has sparked widespread alarm.\n</p><p>In Wales, where Airbus supports around 11,700 jobs, the devolved government run by the UK opposition Labour party said its report was \"extremely worrying\".\n</p><p>\"We have repeatedly warned that the UK cannot take the huge economic risk of cutting ourselves adrift from the single market and the customs union,\" a spokesman said.\n</p><p>A string of airlines, banks and other corporate household names have already activated their contingency plans to move jobs or restructure because of Brexit.\n</p><p>The government has agreed a post-Brexit transition period that will last until December 2020, to allow time for a new economic partnership to be struck with the EU.\n</p><p>But Airbus said this was \"too short\" for a new agreement to be made and \"too short for Airbus to implement the required changes with its extensive supply chain\".\n</p><p>\"In this scenario, Airbus would carefully monitor any new investments in the UK and refrain from extending the UK suppliers/partners base,\" it said.\n</p><p>Williams admitted that \"in any scenario, Brexit has severe negative consequences for the UK aerospace industry and Airbus in particular\".\n</p><span>\n</span><br><span>He called for more clarity on the situation, adding: \"We have sought to highlight our concerns over the past 12 months, without success.\"\n</span><br><span>\n</span><br><span>The government spokesman said it was \"working closely with companies to understand their concerns\".\n</span><br><span>\n</span><br><span>\"Alongside industry (it) will invest almost £4 billion by 2026 to ensure the UK remains a world leader in civil aerospace,\" he said.\n</span><br><span>\n</span><br><span>Parliament finally approved the government's flagship EU (Withdrawal) Bill this week, ensuring that Britain can now legally leave the bloc, deal or no deal.\n</span><br><span>\n</span></div>"
    },
    "adjectives": [
        "no",
        "European",
        "15",
        "crashing",
        "catastrophic",
        "international",
        "10",
        "left",
        "top",
        "right"
    ],
    "nouns": [
        "no",
        "leave",
        "UK",
        "uk",
        "group",
        "15",
        "people",
        "Britain",
        "Airbus",
        "airbus",
        "deal",
        "European",
        "force",
        "bloc",
        "business",
        "international",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo"
    ],
    "verbs": [
        "leave",
        "deal",
        "group",
        "people",
        "force",
        "consider",
        "border",
        "align",
        "style",
        "top",
        "right"
    ]
}