{
    "title": "Legal challenge to 360-degree appraisal of IAS officers fizzles out",
    "link": "https://www.business-standard.com/article/economy-policy/legal-challenge-to-360-degree-appraisal-of-ias-officers-fizzles-out-118062200983_1.html",
    "pubDate": "Fri, 22 Jun 2018 20:04:00 +0530",
    "content": "Officer who challenged it in court again found unfit to serve at Centre, but made Himachal Pradesh chief secretary",
    "contentSnippet": "Officer who challenged it in court again found unfit to serve at Centre, but made Himachal Pradesh chief secretary",
    "guid": "https://www.business-standard.com/article/economy-policy/legal-challenge-to-360-degree-appraisal-of-ias-officers-fizzles-out-118062200983_1.html",
    "isoDate": "2018-06-22T14:34:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "legal",
            "challenge",
            "to",
            "360-degree",
            "appraisal",
            "of",
            "ias",
            "officers",
            "fizzles",
            "out"
        ],
        "words": [
            "challenge",
            "legal"
        ],
        "positive": [
            "legal"
        ],
        "negative": [
            "challenge"
        ]
    },
    "article": {
        "title": "Legal challenge to 360-degree appraisal of IAS officers fizzles out",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tThe first and only legal challenge so far, to the 360-degree review process that the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=prime+minister\" target=\"_blank\">Prime Minister </a>instituted to appraise IAS officers for top positions at the Centre, has fizzled out.</p>\n<p>\n\tIn response to an order of Central Administrative Tribunal’s orders to review its decision, the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=union+government\" target=\"_blank\">Union government </a>has stuck to its review process, show documents. Using it, the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=union+government\" target=\"_blank\">union government </a>has yet again found the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=senior+ias+officer\" target=\"_blank\">senior IAS officer </a>who challenged his negative appraisal, Vineet Chawdhry, unfit to serve as a secretary at the Centre.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tChawdhry, who the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=union+government\" target=\"_blank\">Union government </a>repeatedly found unfit for the top position at the Centre, has instead been appointed to the top position by the BJP-ruled government in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/himachal-pradesh\" target=\"_blank\">Himachal Pradesh </a>as the state’s chief secretary. His case against the Union government has fallen, show records of the tribunal.</p>\n<p>\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/360-degree-appraisal\" target=\"_blank\">360-degree appraisal </a>system was instituted in 2015. It supplemented the existing appraisal process by putting in place a discreet, informal and subjective review of each applicant on top of the objective review that seniors usually carried out of applicants under set rules.</p>\n<p>\n\tThe first challenge to this 360-degree review process came from a Parliamentary Standing Committee. The committee in August 2017 found the appraisal process to be “illegal, arbitrary, non-transparent and susceptible to manipulation.” But the committee’s views are only recommendatory in nature and the union government did not budge.</p>\n<p>\n\tChawdhry had been named in several cases of alleged corruption when working at the Union health ministry. In at least one case, he was found complicit but let off after a warning. When he applied for the rank of a secretary, he was denied the elevation in 2015 using the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/360-degree-appraisal\" target=\"_blank\">360-degree appraisal </a>system. He filed a petition before the Central Administrative Tribunal. He claimed that the process, instituted on the instructions of the Prime Minister, was “a tool of discrimination, neither reasonable nor rational, a whimsical exercise of arbitrary executive authority far in excess of any delegated legislation, neither resting on any legislation nor any rules and neither transparent nor fair”. He cited the Parliamentary Standing Committee report in his case.</p>\n<p>\n\tThe tribunal, addressing his plea, did not directly address the illegality of the appraisal process. It instead asked the Union government to consider the officer’s case yet again. On December 22, 2017 noted that it had assessed the officer at four different times since 2015 and the Prime Minister-led Appointments Committee of the Cabinet continued to find him unfit to serve as secretary in the Union government. Records show, after orders of the tribunal it carried out yet another appraisal. It yet again found Chawdhry unfit for the top slot because of his ‘general reputation’, the vigilance reports on him and the views of the experts on the internal review panel.</p>\n<p>\n\tBut soon after in December itself, Chawdhry was selected by the newly-elected BJP state government in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/himachal-pradesh\" target=\"_blank\">Himachal Pradesh </a>to be its top bureaucrat, the chief secretary. Records show Chawdhry has also withdrawn another case he had filed against the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=himachal+pradesh+government\" target=\"_blank\"></a><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/himachal-pradesh\" target=\"_blank\">Himachal Pradesh </a>government for not being given the rank of chief secretary once he moved back to his state cadre. With this, the first legal challenge to Prime Minister’s <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/360-degree-appraisal\" target=\"_blank\">360-degree appraisal </a>of IAS officers has failed. </p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "chief",
        "Legal",
        "found",
        "made",
        "unfit"
    ],
    "nouns": [
        "serve",
        "secretary",
        "chief",
        "challenge",
        "appraisal",
        "Officer",
        "degree",
        "court",
        "found",
        "Centre"
    ],
    "verbs": [
        "serve",
        "challenge",
        "Officer",
        "court",
        "found",
        "unfit",
        "Centre"
    ]
}