{
    "title": "Modi seeks double-digit growth for India's entry into $5-trn economy club",
    "link": "https://www.business-standard.com/article/economy-policy/modi-seeks-double-digit-growth-for-india-s-entry-into-5-trn-economy-club-118062200356_1.html",
    "pubDate": "Fri, 22 Jun 2018 14:50:00 +0530",
    "content": "The world, he said, is watching as to when India will break into the $5 trillion economy club by doubling its economy",
    "contentSnippet": "The world, he said, is watching as to when India will break into the $5 trillion economy club by doubling its economy",
    "guid": "https://www.business-standard.com/article/economy-policy/modi-seeks-double-digit-growth-for-india-s-entry-into-5-trn-economy-club-118062200356_1.html",
    "isoDate": "2018-06-22T09:20:00.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.18181818181818182,
        "tokens": [
            "modi",
            "seeks",
            "double-digit",
            "growth",
            "for",
            "india's",
            "entry",
            "into",
            "5-trn",
            "economy",
            "club"
        ],
        "words": [
            "growth"
        ],
        "positive": [
            "growth"
        ],
        "negative": []
    },
    "article": {
        "title": "Modi seeks double-digit growth for India's entry into $5-trn economy club",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tPrime Minister <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/narendra-modi\" target=\"_blank\">Narendra Modi </a>on Friday called for targeting double-digit GDP growth for breaking into the $5 trillion economy club and said India's share in world trade has to more than double to 3.4 per cent.</p>\n<p>\n\tSpeaking after laying the foundation stone of Vanijya Bhawan, a new office complex of the Ministry of Commerce here, he said his government has in four years taken steps to ease the process of doing business in India while maintaining macroeconomic indicators like inflation, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/current-account-deficit\" target=\"_blank\">current account deficit </a>(CAD) and fiscal deficit within limits.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tAfter scaling these positive macroeconomic indicators, what next, the Prime Minister asked.</p>\n<p>\n\tHe said GDP growth touched 7.7 per cent in the last quarter of 2017-18 financial year but now the time has come to look beyond 7-8 per cent growth and target double-digit expansion.</p>\n<p>\n\t\"The need of the hour is that we should work towards achieving the target of double-digit growth from 7-8 per cent,\" Modi said, adding the world is watching as to when India will break into the $5 trillion economy club by doubling its economy.</p>\n<p>\n\tThe Prime Minister emphasised the need for increasing exports and said that states must be made active partners in this effort.</p>\n<p>\n\tHe said the Department of Commerce must resolve to raise India's share in total global exports to at least 3.4 per cent, from the current 1.6 per cent.</p>\n<p>\n\tSimilarly, he said, efforts must be made to raise domestic <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/manufacturing\" target=\"_blank\">manufacturing </a>output to reduce the dependence on imports. In this context, he gave the example of electronics <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/manufacturing\" target=\"_blank\">manufacturing.</a></p>\n<p>\n\tThe Commerce Ministry, as well as trade and industry, should take up the challenge of double-digit GDP growth and doubling India's share in global trade, he said.</p>\n<p>\n\tListing out the achievements of his government, he said the country has moved away from a culture of delaying work through 'atkana, latkana and bhatkana' (obstructing, delaying and misguiding).</p>\n<p>\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/goods-and-services-tax\" target=\"_blank\">Goods and Services Tax </a>(GST), which replaced over a dozen indirect taxes from July 1 last year, has led to not just <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/ease-of-doing-business\" target=\"_blank\">ease of doing business </a>but also an increase in the tax base, he said.</p>\n<p>\n\tModi said 5.4 million new taxpayers have sought registration under the new regime, taking the number of indirect tax payers to over one crore.</p>\n<p>\n\tThis compares to 6 million indirect tax payers in the pre-<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gst\" target=\"_blank\">GST </a>era, the Prime Minister said.</p>\n<p>\n\tForeign direct investment, as well as foreign exchange reserves are at record highs, he added.</p>\n<p>\n\tModi also expressed confidence that Vanijya Bhawan will be completed well within the stipulated time.</p>\n<p>\n\tHe emphasised that this would be in keeping with the spirit of 'New India' and moving away from old practices, under which important building projects, even in the capital, had been inordinately delayed.</p>\n<p>\n\tIn this context, Modi mentioned the Dr. Ambedkar International Centre, Dr. Ambedkar National Memorial, the Pravasi Bharatiya Kendra and the new office building for the Central Information Commission.</p>\n<p>\n\tThis, Modi said, is also the result of breaking silos within the working of the government.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "world",
        "double",
        "trillion"
    ],
    "nouns": [
        "economy",
        "India",
        "growth",
        "world",
        "double",
        "doubling",
        "digit",
        "entry",
        "club",
        "will",
        "watching",
        "break",
        "trillion"
    ],
    "verbs": [
        "double",
        "club",
        "will",
        "break"
    ]
}