{
    "creator": "FE Bureau",
    "title": "Sebi tweaks rules for IPOs, buybacks and takeovers",
    "link": "https://www.financialexpress.com/market/sebi-tweaks-rules-for-ipos-buybacks-and-takeovers/1215500/",
    "pubDate": "Fri, 22 Jun 2018 01:26:54 +05:30",
    "dc:creator": "FE Bureau",
    "content": "The Securities and Exchange Board of India (Sebi) on Thursday eased several rules relating to Initial Public Offers (IPO), rights issues, buybacks and takeovers. The regulator&#8217;s board approved these changes as also those relating tenures of managing directors of market intermediaries. The capital markets watchdog reduced the time for announcing the price band of initial [&#8230;]",
    "contentSnippet": "The Securities and Exchange Board of India (Sebi) on Thursday eased several rules relating to Initial Public Offers (IPO), rights issues, buybacks and takeovers. The regulator’s board approved these changes as also those relating tenures of managing directors of market intermediaries. The capital markets watchdog reduced the time for announcing the price band of initial […]",
    "guid": "https://www.financialexpress.com/?p=1215500",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-21T19:56:54.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "sebi",
            "tweaks",
            "rules",
            "for",
            "ipos",
            "buybacks",
            "and",
            "takeovers"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Sebi tweaks rules for IPOs, buybacks and takeovers",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1215507\" src=\"https://images.financialexpress.com/2018/06/sebi-8.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/sebi-8.jpg 660w, https://images.financialexpress.com/2018/06/sebi-8-300x200.jpg 300w, https://images.financialexpress.com/2018/06/sebi-8-620x413.jpg 620w, https://images.financialexpress.com/2018/06/sebi-8-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Sebi tweaks rules for IPOs, buybacks and takeovers</figure>\n\t\t\t</section></div><span>\n</span><p>The Securities and Exchange Board of India (Sebi) on Thursday eased several rules relating to Initial Public Offers (IPO), rights issues, buybacks and takeovers.<br>The regulator’s board approved these changes as also those relating tenures of managing directors of market intermediaries. The capital markets watchdog reduced the time for announcing the price band of initial public offers (IPO) from five working days before the opening of the issue to two working days. This will give companies more time to fix the price band.</p><span>\n</span><p>Companies now need to provide investors with financial disclosures — for public issues and rights issues — for only three years. Currently, information is provided in the offer documents for five years. Also, companies need to provide only consolidated audited financial disclosures in the IPO offer document; audited standalone financials of the issuer and subsidiaries must be disclosed on the company website.</p><span>\n</span><p>Following a board meeting on Thursday, the capital markets regulator tweaked the buyback norms. The buyback period has been defined as the time between the board resolution or the date of declaration of results for a special resolution authorizing the buyback of shares and the day on which the shares are paid.<br>Also, Sebi has amended the takeover rules. It has given companies additional time to revise the open offer price upwards till one working day before the start the tendering period.</p><span>\n</span><p>The Sebi board also approved some recommendations of R Gandhi committee on regulations relating to market infrastructure institutions (MIIs). For rights issues the threshold for submission of the draft letter of offer to Sebi has been increased to `10 crore as against the earlier prescribed Rs 50 lakh. The regular also tweaked the rules relating to the underwriting of all non-SME public issues. If 90% of the fresh issue of share is subscribed, the underwriting will be restricted to that portion only. Accordingly, the requirement to underwrite 100% of the issue without regard to the minimum subscription requirements has been deleted.</p><span>\n</span><p>Sebi also reduced minimum anchor investor size to Rs 2 crore from the existing Rs 10 crore, for SME issuances. This will allow companies to attract more anchor investors for an issue.</p><span>\n</span><p>The board has permitted eligible domestic and foreign entities to hold up to 15% shareholding in case of Depository and Clearing Corporation. Moreover, multilateral and bilateral financial institutions, as notified by the government, have also been recommended to hold up to 15% in an MII. Moreover, Sebi has decided to limit the tenure of managing directors of an MII for a for a maximum of two terms of up to 5 years each or up to 65 years of age, whichever is earlier. The requirement would also apply to incumbent MDs of MIIs.</p><span>\n</span><p>The regulator is also looking into the issues regarding IPO ICICI Securities in ICIC AMC bought the large stake.The regulator had sought details of a significant investment made by ICICI Prudential Mutual Fund in the IPO of ICICI Securities. “Yes we are looking into that, and we have sought some information from them, and we are yet to get their replies,” Tyagi said.</p><span>\n</span><p><strong><a target=\"_blank\" href=\"http://www.financialexpress.com/tag/whatsapp/\">WhatsApp</a> leak matter: </strong><br><strong>Sebi receives 4 reports</strong><br>Sebi has received four reports in the matter pertaining to leak of price-sensitive information of companies through WhatsApp and is carrying out further investigations, chairman Ajay Tyagi said on Thursday. In the high profile case, the Securities and Exchange Board of India (Sebi) has passed preliminary orders against HDFC Bank, <a target=\"_blank\" href=\"http://www.financialexpress.com/auto/new-cars/tata/\">Tata</a> Motors, Axis Bank and Bata India. These companies were also asked to conduct internal probes and report back to the regulator.<br>“We have received four reports,” Tyagi said here. The companies were “asked to do their own internal investigation”, he said, adding that the regulator is examining the reports and doing further investigation.</p><span>\n</span><p>In the matter, Tyagi said it would do “whatever is required to be done”. Soon after the preliminary orders were passed by Sebi, the four companies had said that they would comply with the directions from the regulator. Sebi’s preliminary probe found that the firms’ quarterly financial results were matching with the figures that were in circulation on WhatsApp groups prior to the official announcement.</p><span>\n</span><p>Around a dozen listed firms are under the scanner of Sebi. Sebi began a probe in November 2017 after a media report surfaced with respect to circulation of unpublished price sensitive information in various private WhatsApp groups about certain companies before their official announcements.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "approved",
        "capital",
        "eased",
        "several",
        "Initial",
        "initial",
        "Public",
        "reduced"
    ],
    "nouns": [
        "India",
        "band",
        "market",
        "Board",
        "board",
        "capital",
        "price",
        "IPO",
        "Exchange",
        "Thursday",
        "Initial",
        "initial",
        "Public",
        "regulator",
        "watchdog",
        "time"
    ],
    "verbs": [
        "band",
        "market",
        "Board",
        "board",
        "price",
        "Exchange",
        "Initial",
        "initial",
        "time"
    ]
}