{
    "title": "Markets snap 2-day rally; post 3rd weekly gains",
    "link": "https://timesofindia.indiatimes.com/business/india-business/markets-snap-2-day-rally-post-3rd-weekly-gains/articleshow/64509566.cms",
    "pubDate": "Fri, 08 Jun 2018 11:47:30 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/markets-snap-2-day-rally-post-3rd-weekly-gains/articleshow/64509566.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64509566.cms\" /></a>Mumbai, Jun 8 () Stocks took a breather today after two sessions of robust gains as investors booked profit in recent winners amid uncertainty over global trade relations ahead of a key G7 meeting.",
    "contentSnippet": "Mumbai, Jun 8 () Stocks took a breather today after two sessions of robust gains as investors booked profit in recent winners amid uncertainty over global trade relations ahead of a key G7 meeting.",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/markets-snap-2-day-rally-post-3rd-weekly-gains/articleshow/64509566.cms",
    "isoDate": "2018-06-08T11:47:30.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.25,
        "tokens": [
            "markets",
            "snap",
            "2-day",
            "rally",
            "post",
            "3rd",
            "weekly",
            "gains"
        ],
        "words": [
            "gains"
        ],
        "positive": [
            "gains"
        ],
        "negative": []
    },
    "article": {
        "title": "Markets snap 2-day rally; post 3rd weekly gains",
        "content": "<div class=\"Normal\"><p>MUMBAI: Stocks took a breather on Friday after two sessions of robust gains as investors booked profit in recent winners amid uncertainty over global trade relations ahead of a key G7 meeting. \n\n</p><p>Healthcare counters were the session's biggest gainers following a clutch of USFDA approvals for Indian drugmakers. \n</p><p>Overseas, European stocks followed Asian peers lower after a mixed close on Wall Street overnight. \n</p><p>Global investors are keeping a keen eye on the upcoming G7 meeting against the backdrop of the US slapping tariffs on a wide range of imports from allies like the EU and Canada \n</p><span>The 30-share </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/business/india-business\">Sensex</a><p> opened lower and stayed in the negative terrain for the major part of the session, hitting a low of 35,260. It staged a mild recovery towards the end to touch a high of 35,484.94, before finally finishing at 35,443.67, down by 19.41 points, or 0.05 per cent. \n</p><p>The index had gained 559.87 points in the past two sessions after the RBI hiked the policy rate on inflation concerns but maintained its neutral stance and growth outlook. \n</p><span>The 50-share NSE </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/nifty-50\">Nifty</a><p> settled 0.70 points, or 0.01 per cent, lower at 10,767.65. During the session, it moved between 10,709.05 and 10,779.45. \n</p><p>Both the key indices finished with gains for the third week in a row. The BSE Sensex recorded a rise of 216.41 points, or 0.61 per cent, while the NSE Nifty advanced 71.45 points, or 0.67 per cent, this week. \n</p><p>Meanwhile, on a net basis, foreign portfolio investors (FPIs) sold shares worth Rs 525.40 crore yesterday, while domestic institutional investors (DIIs) bought equities to the tune of Rs 1,197.89 crore, as per provisional data. \n</p><p> \"Market reversed from low despite weak global sentiment as positive cues on pharma stocks and prospects of government measures on PSU banks supported the market to end flat. \n</p><p>\"Weakening rupee and favourable USFDA outcomes on domestic pharma helped to regain positive sentiment in the sector. Volatility in oil price and mixed earnings in the fourth quarter may lead the market to stay on the consolidation path,\" said Vinod Nair, Head of Research, Geojit Financial Services. \n</p><p> Sun Pharma was by far the biggest gainer in the Sensex pack, surging 8.13 per cent, followed by Dr Reddy's at 4.92 per cent. \n</p><p>Aurobindo Pharma rose 4.42 per cent after the company said it has received final approval from the US health regulator to manufacture Omeprazole tablets, used in the treatment of frequent heartburn. \n</p><p>Lupin also rose by 5.66 per cent, Cadila healthcare 2.48 per cent and Glenmark Pharma 3.82 per cent. \n</p><p>However, Power Grid lost the most among Sensex constituents, declining 2.12 per cent, followed by HDFC Ltd 1.42 per cent, ITC 0.98 per cent, Asian Paints 0.97 per cent, M&amp;M 0.91 per cent, L&amp;T 0.78 per cent and Bharti Airtel 0.75 per cent, among others. \n</p><span>Banking stocks ended lower. Axis Bank lost 1.05 per cent, </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/ICICI-Bank\">ICICI Bank</a><p> 0.91 per cent, IndusInd Bank 0.77 per cent, HDFC Bank 0.71 per cent and Yes Bank 0.59 per cent. \n</p><p>Oil marketing companies drifted lower after global crude prices crossed USD 77 per barrel as Venezuela struggled to meet its supply obligations amid the ongoing voluntary output cuts led by producer cartel OPEC. \n</p><span>Bharat Petroleum Corp Ltd fell 1.62 per cent, OIL 1.35 per cent and </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Hindustan-Petroleum\">Hindustan Petroleum</a><p> Corp Ltd 1.17 per cent. \n</p><span>\n</span><br><span>Sectorally, the BSE Power index fell 0.74 per cent, followed by metal 0.43 per cent, FMCG 0.36 per cent, bankex 0.24 per cent, capital goods 0.24 per cent and auto 0.12 per cent. \n</span><br><span>\n</span><br><span>Bucking the trend, healthcare spurted 3.62 per cent, IT 0.77 per cent, teck 0.73 per cent, oil and gas 0.60 per cent, PSU 0.38 per cent, consumer durables 0.38 per cent and realty 0.38 per cent. \n</span><br><span>\n</span><br><span>Broader markets too showed a firm trend, with the BSE small-cap index rising 0.58 per cent and mid-caps gaining 0.42 per cent. \n</span><br><span>\n</span><br><span>In Asia, Singapore fell 0.99 per cent and Hong Kong's Hang Seng lost 1.76 per cent. Japan's Nikkei dipped 0.56 per cent and China's Shanghai Composite Index fell 1.36 per cent. Taiwan too drifted lower by 0.85 per cent. \n</span><br><span>In Europe, Frankfurt's DAX fell 1.46 per cent, while Paris CAC shed 0.59 per cent in early deals. London too fell 0.70 per cent. \n</span></div>"
    },
    "adjectives": [
        "10",
        "left",
        "top",
        "right",
        "booked",
        "recent",
        "3rd",
        "weekly",
        "two",
        "robust",
        "global",
        "ahead",
        "key"
    ],
    "nouns": [
        "india",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo",
        "today",
        "profit",
        "recent",
        "snap",
        "day",
        "rally",
        "post",
        "weekly",
        "Mumbai",
        "Stocks",
        "breather",
        "two",
        "sessions",
        "uncertainty",
        "trade",
        "relations",
        "key",
        "meeting"
    ],
    "verbs": [
        "border",
        "align",
        "style",
        "top",
        "right",
        "profit",
        "snap",
        "rally",
        "post",
        "trade",
        "key"
    ]
}