{
    "title": "Bank of Maharashtra shareholders stand by CEO; shares slide 2%",
    "link": "https://www.business-standard.com/article/finance/dsk-group-fraud-bom-shareholders-repose-faith-in-bank-management-118062101084_1.html",
    "pubDate": "Fri, 22 Jun 2018 01:32:00 +0530",
    "content": "Of total scam amount, deposit and loan fraud is to tune of Rs 10.83 bn banking and non-financial institutions-related fraud of Rs 7.11 bn debentures fraud of Rs 1.11 bn.",
    "contentSnippet": "Of total scam amount, deposit and loan fraud is to tune of Rs 10.83 bn banking and non-financial institutions-related fraud of Rs 7.11 bn debentures fraud of Rs 1.11 bn.",
    "guid": "https://www.business-standard.com/article/finance/dsk-group-fraud-bom-shareholders-repose-faith-in-bank-management-118062101084_1.html",
    "isoDate": "2018-06-21T20:02:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.1,
        "tokens": [
            "bank",
            "of",
            "maharashtra",
            "shareholders",
            "stand",
            "by",
            "ceo",
            "shares",
            "slide",
            "2"
        ],
        "words": [
            "shares"
        ],
        "positive": [
            "shares"
        ],
        "negative": []
    },
    "article": {
        "title": "Bank of Maharashtra shareholders stand by CEO; shares slide 2%",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tThe shareholders of Bank of Maharashtra (BoM), whose Managing Director (MD) &amp; Chief Executive Officer (CEO) Ravindra Marathe and senior officers were arrested for loans to a real estate company, expressed confidence in the leadership team for working to turn around the ailing lender.</p>\n<p>\n\tOn June 20, 2018, the Economic Offences Wing of Pune police had arrested six persons in a cheating case lodged against city-based real estate developer D S Kulkarni and his wife.</p>\n<p>\n\tThe bank’s present MD &amp; CEO, Executive Director R K Gupta, Zonal Manager Nityanand Deshpande, the bank’s former CMD Sushil Muhnot, Kulkarni’s CA Sunil Ghatpande, and Vice-President Rajiv Newaskar of the engineering department of Kulkarni’s firm, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=d+s+kulkarni+developers\" target=\"_blank\">D S Kulkarni Developers </a>(DSKDL), were arrested.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/markets/bank-of-maharashtra-hits-record-low-as-cmd-arrested-in-dsk-group-scam-118062100145_1.html\" target=\"_blank\">Bank of Maharashtra hits record low as CMD gets arrested in DSK Group scam</a></strong></p>\n<p>\n\tThe Pune-based public sector lender, in a statement after its annual general meeting held in Pune, said while adopting the balance sheet as on March 31, 2018, shareholders expressed their faith and confidence in the bank and its leadership team. The bank is at present under the Reserve Bank of India’s prompt corrective action framework due to high non-performing assets.</p>\n<p>\n\tThe shareholders expressed their deep anguish over the manner in which Marathe, Gupta and other officials of the bank were taken into custody for interrogation in connection with the bank’s lending to a real estate company.</p>\n<p>\n\tAccording to the charge-sheet filed by the police, the total scam is worth Rs 20.43 billion, wherein the accused floated nine different firms to siphon off funds collected from 33,000 investors and fixed deposit (FD) holders who were promised good returns on their FDs.<br></p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t<img align=\"left\" alt=\"chart\" class=\"imgCont\" height=\"241\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/21/full/1529599924-9728.jpg\" title=\"chart\" width=\"620\"></p>\n<p>\n\tOf the total scam amount, the deposit and loan fraud is to the tune of Rs 10.83 billion banking and non-financial institutions-related fraud of Rs 7.11 billion debentures fraud of Rs 1.11 billion.</p>\n<p>\n\tReplying to shareholder concerns with regards to the amount advanced to D S Kulkarni Developers, A C Rout, executive director, BoM, said the bank’s present outstanding exposure to the group is Rs 945.2 million, which is fully secured.</p>\n<p>\n\tThe bank has already declared M/s DSK Developers and its promoters as wilful defaulters. Recovery processes like SARFAESI (Securitisation and Reconstruction of Financial Assets and Enforcement of Securities Interest) have already been initiated by the bank and some of the properties of the firm have been put under auction.</p>\n<p>\n\tMeanwhile, All India Bank Employees Association (AIBEA) General-Secretary C H Venkatachalam in a statement said the executives of the <a class=\"storyTags\" href=\"https://www.business-standard.com/category/finance-news-banks-1030101.htm\" target=\"_blank\">banks </a>are not connected with the cheating by DSK and hence, arresting them at this stage in connection with this was unwarranted.  <br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/companies/bank-of-maharashtra-cmd-ravindra-marathe-arrested-in-30-bn-dsk-group-scam-118062000678_1.html\" target=\"_blank\">Bank of Maharashtra CMD Ravindra Marathe arrested in Rs 30bn DSK Group scam</a></strong></p>\n<p>\n\tIf there is any involvement of these officials in the DSK scam, they should be taken to task, but according to information available, they are not involved in the same, he said.  “We feel that the Pune police has overstepped in this regard and the government should intervene in the matter,” said Venkatachalam.</p>\n<p>\n\tIf, according to the government, the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=bom\" target=\"_blank\">BoM </a>executives are involved in the DSK scam and are part of any fraudulent activity, their arrest is justifiable, he added.</p>\n<p>\n\tThe Union <a class=\"storyTags\" href=\"https://www.business-standard.com/finance\" target=\"_blank\">finance </a>ministry should step in and take up the matter with the Government of Maharashtra and Pune police for necessary correction and remedy, the AIBEA said.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "10",
        "total",
        "financial",
        "11",
        "related",
        "83"
    ],
    "verbs": [
        "Bank",
        "stand",
        "scam",
        "loan",
        "deposit",
        "total",
        "amount",
        "slide",
        "tune"
    ],
    "nouns": [
        "Bank",
        "banking",
        "stand",
        "Maharashtra",
        "scam",
        "fraud",
        "loan",
        "deposit",
        "10",
        "total",
        "11",
        "CEO",
        "amount",
        "slide",
        "tune"
    ]
}