{
    "creator": "PTI",
    "title": "India’s economy to double to $5 trillion in 7-8 years; Suresh Prabhu explains how it will happen",
    "link": "https://www.financialexpress.com/economy/indias-economy-to-double-to-5-trillion-in-7-8-years-suresh-prabhu-explains-how-it-will-happen/1198949/",
    "pubDate": "Fri, 08 Jun 2018 17:57:29 +05:30",
    "dc:creator": "PTI",
    "content": "India's GDP growth is likely to cross 8 per cent in the next two years and the government is taking a number of steps including formulation of a new industrial policy to double the economy's size to USD 5 trillion in 7-8 years, Commerce Minister Suresh Prabhu said today.",
    "contentSnippet": "India's GDP growth is likely to cross 8 per cent in the next two years and the government is taking a number of steps including formulation of a new industrial policy to double the economy's size to USD 5 trillion in 7-8 years, Commerce Minister Suresh Prabhu said today.",
    "guid": "https://www.financialexpress.com/?p=1198949",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-08T12:27:29.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "india’s",
            "economy",
            "to",
            "double",
            "to",
            "5",
            "trillion",
            "in",
            "7-8",
            "years",
            "suresh",
            "prabhu",
            "explains",
            "how",
            "it",
            "will",
            "happen"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "India’s economy to double to $5 trillion in 7-8 years; Suresh Prabhu explains how it will happen",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1198953\" src=\"https://images.financialexpress.com/2018/06/suresh-prabhu-pti.jpeg\" alt=\"India's economy to double to  trillion in 7-8 years; Suresh Prabhu explains how it will happen\" srcset=\"https://images.financialexpress.com/2018/06/suresh-prabhu-pti.jpeg 660w, https://images.financialexpress.com/2018/06/suresh-prabhu-pti-300x200.jpeg 300w, https://images.financialexpress.com/2018/06/suresh-prabhu-pti-620x413.jpeg 620w, https://images.financialexpress.com/2018/06/suresh-prabhu-pti-401x267.jpeg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> We are working on few strategies to boost economic growth, Says Suresh Prabhu</figure>\n\t\t\t</section></div><span>\n</span><p>India’s GDP growth is likely to cross 8 per cent in the next two years and the government is taking a number of steps including formulation of a new industrial policy to double the economy’s size to USD 5 trillion in 7-8 years, Commerce Minister Suresh Prabhu said today. “We are working on few strategies to boost economic growth. We are now seeing an upsurge,” he told reporters here while talking about the achievements of the government during the last four years.</p><span>\n</span><p>Prabhu exuded confidence that the growth in 2018-19 will be better than the preceding fiscal. “I should not be surprised that in the next few quarters, say next 2 years for sure, we will be very close to or cross 8 per cent growth and that is coming out of strong performance of so many sectors,” he said.</p><span>\n</span><p>India’s GDP grew at the fastest pace in seven quarters at 7.7 per cent in the January-March quarter of last fiscal, retaining the fastest growing major economy tag on robust performance by manufacturing and service sectors as well as good farm output. On yearly basis, however, it grew at a four-year low of 6.7 per cent in 2017-18, down from 7.1 per cent in the previous fiscal.</p><span>\n</span><p>Prabhu said that to facilitate the 8 per cent potential growth, the government is working on several areas including formulation of a new industrial policy, “which is going to make India ready for the fourth industrial revolution and beyond”.</p><span>\n</span><p>“We have created a vision for USD 5 trillion economy in which USD one trillion will come from manufacturing, USD 3 trillion from services and USD one trillion agriculture and allied sector,” he added. When asked about the impact of the <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a>’s decision this week to raise the benchmark lending rate by 0.25 per cent, the minister said: “I do not think it should hamper investments”.</p><span>\n</span><p>On his US visit next week, Prabhu said that he would meet his counterpart and industry leaders and raise India’s concerns about tightening visa regime in the US and its impact on Indian IT sector. “We will be raising the visa issue because we feel that Indians and their spouses are facing some issues there,” he said, adding, “we will explaining our position. It is not a formal trade talk..there is no huge expectations”.</p><span>\n</span><p>On the US challenging India’s export support programmes, Prabhu said he would explain that those measures are not subsidies and instead ways to partially offset various additional costs incurred by them. “Our export support regime is not violating any of the WTO rules,” he said.</p><span>\n</span><p>“We are also working to make sure that there is a proper clarity on this. But what we are doing today is not violating any WTO rule,” he added. On the proposed mega trade deal – Regional Comprehensive Economic Partnership (RCEP), Prabhu said India is actively engaged in the negotiations and also holding bilateral talks with member countries including China, Australia and New Zealand.</p><span>\n</span><p>“What we are saying in RCEP is that it is a comprehensive economic partnership pact and in this services should be an integral part of the agreement,” he added.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "industrial",
        "new",
        "two",
        "taking",
        "double",
        "trillion",
        "likely",
        "cross",
        "next",
        "size"
    ],
    "nouns": [
        "India",
        "Commerce",
        "cent",
        "Minister",
        "growth",
        "government",
        "years",
        "will",
        "formulation",
        "two",
        "steps",
        "policy",
        "taking",
        "economy",
        "double",
        "trillion",
        "GDP",
        "cross",
        "number",
        "size",
        "today"
    ],
    "verbs": [
        "Minister",
        "will",
        "double",
        "happen",
        "cross",
        "number",
        "size"
    ]
}