{
    "title": "Digital India is fight against touts: PM Modi",
    "link": "https://timesofindia.indiatimes.com/business/india-business/digital-india-is-fight-against-touts-pm/articleshow/64597999.cms",
    "pubDate": "Fri, 15 Jun 2018 06:12:29 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/digital-india-is-fight-against-touts-pm/articleshow/64597999.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64597999.cms\" /></a>From booking rail tickets to paying bills and availing government services like pensions by giving proof of existence digitally, people are being empowered, he said. \"Kisi ko dikhe ya na dikhe, par desh badal raha hai (people may or may not see, but the country is changing),\" PM Modi said.",
    "contentSnippet": "From booking rail tickets to paying bills and availing government services like pensions by giving proof of existence digitally, people are being empowered, he said. \"Kisi ko dikhe ya na dikhe, par desh badal raha hai (people may or may not see, but the country is changing),\" PM Modi said.",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/digital-india-is-fight-against-touts-pm/articleshow/64597999.cms",
    "isoDate": "2018-06-15T06:12:29.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.375,
        "tokens": [
            "digital",
            "india",
            "is",
            "fight",
            "against",
            "touts",
            "pm",
            "modi"
        ],
        "words": [
            "touts",
            "fight"
        ],
        "positive": [],
        "negative": [
            "touts",
            "fight"
        ]
    },
    "article": {
        "title": "Digital India is fight against touts: PM Modi",
        "content": "<div class=\"Normal\"><span>NEW DELHI: Prime Minister Narendra Modi on Friday said his pet </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Digital-India\">Digital India</a><p> initiative is a war against touts and middlemen, helping check blackmoney and black marketing while creating immense job opportunities in small towns and rural areas. \n\n</p><p>Interacting with beneficiaries of the various Digital India efforts, Modi pushed for use of RuPay, the Indian version of credit/debit card, saying when other similar cards are used the transaction or processing fee goes to foreign companies. However, when RuPay is used, the money remains in India and is used for development works and infrastructure projects. \n</p><p>The Prime Minister said people made fun of him when he first spoke of digital payments in the country where people were used to stashing money underneath the pillow and ration could not be availed without middlemen. \n</p><p> But experiences narrated by beneficiaries of how services are reaching people directly are a befitting reply to such naysayers, he said. \n</p><p> Now, some people are spreading rumours that money is not safe when used digitally, he said, adding such conspiracies will be hatched as he has created problems for middlemen. \n</p><p>\"Digital India is a fight with dalali (touts),\" he said. \"Digital India has checked blackmoney and black marketing and uprooted middlemen.\" \n</p><p>From booking rail tickets to paying bills and availing government services like pensions by giving proof of existence digitally, people are being empowered, he said. \"Kisi ko dikhe ya na dikhe, par desh badal raha hai (people may or may not see, but the country is changing),\" Modi said. \n</p><p> Digital India is about education, employment, entrepreneurship and empowerment. \"It will help realise the objective of reform, perform, transform,\" he said. \n</p><p> \"The movement towards more digital payments is linked to eliminating middlemen,\" he said. \n</p><p> Modi associated use of RuPay card with nationalism. \n</p><p> \"Not everyone can go and fight on the borders. Using RuPay is also a kind of national service,\" he said, adding more than 50 crore RuPay cards have been issued in less than four years of its launch. \n</p><p>RuPay, he said, is bringing a revolutionary change in digital payments. The card is not just being used in India but abroad as well, he said, narrating how he used RuPay to buy some goods during his recent visit to Singapore. \n</p><p> Digital India is a campaign launched to ensure the government services are made available to citizens electronically by improved online infrastructure, increasing internet connectivity and by making the country digitally empowered in the field of technology. \n</p><p>Complementing it has been the launch of large-scale digital payment processing platforms like the Unified Payments Interface (UPI), Bharat Interface for Money (BHIM), Immediate Payment Service (IMPS) and India's home-grown card network RuPay. \n</p><p> Modi said while the National Knowledge Network has linked over 1,700 educational and research institutions, libraries, academicians, government officials and more than 5 crore students, citizen engagement platform 'mygov' has 60 lakh volunteers. \n</p><p> \"We can now fight for our rights,\" he said. \n</p><p> He said the push for domestic electronic manufacturing has seen setting up of 23 electronic manufacturing centres in 15 states and the number of units manufacturing mobile handsets and their components multiply from just two in 2014 to over 120 now, providing direct and indirect employment to 4.5 lakh people. \n</p><p> Also, the Rs 550 crore BPO promotion scheme has led to the creation of two lakh job opportunities as it took business process outsourcing centres to smaller cities and towns by providing financial assistance of up to Rs 1 lakh for every seat. \n</p><p> \"Along with digital empowerment, we also want technology to boost innovation,\" he said. \n</p><p> Modi said the network of about three lakh Common Service Centres (CSCs), which act as access points for delivery of digital services, have bolstered employment and entrepreneurship opportunities, thus empowering citizens. \n</p><p> He said the initiative was launched with an objective of bringing benefits of technology to people, especially in rural areas. \"We ensured that the advantages of technology are not restricted to a select few but are there for all sections of society. We strengthened the network of CSCs.\" \n</p><p> The initiative is creating a group of village level entrepreneurs, he added. \n</p><p>Addressing the Village Level Entrepreneurs (VLEs), who run these centres, via video conferencing, Modi said Digital India was launched with an aim to connect India's villages and youth. \n</p><span>\n</span><br><span> Over the last four years it has brought a slew of services to the doorsteps of the common man, he said. \"Every aspect of digital empowerment has been worked on, from rolling out fibre optics in villages to digital literacy,\" Modi said. \n</span><br><span>\n</span><br><span> Some of the beneficiaries narrated their experience of Digital India. \n</span><br><span>\n</span><br><span> Jitender Solanki from Gautam Budh Nagar stated that after his village got internet access, children are availing online coaching. \n</span><br><span>\n</span><br><span> Also, digital literacy is rising and pension-related issues for elderly are now getting resolved through technology. \n</span><br><span> Modi asked the beneficiaries to press traders and shopkeepers to install BHIM app to facilitate paying for goods and services digitally.\n</span></div>"
    },
    "adjectives": [
        "proof",
        "changing",
        "empowered",
        "10",
        "left",
        "top",
        "right",
        "Digital",
        "digital",
        "paying",
        "giving"
    ],
    "nouns": [
        "margin",
        "proof",
        "rail",
        "India",
        "india",
        "may",
        "business",
        "border",
        "10",
        "left",
        "style",
        "top",
        "right",
        "photo",
        "fight",
        "PM",
        "pm",
        "booking",
        "government",
        "services",
        "giving",
        "existence",
        "people",
        "ko",
        "na",
        "par",
        "country"
    ],
    "verbs": [
        "proof",
        "rail",
        "border",
        "align",
        "style",
        "top",
        "right",
        "fight",
        "people",
        "par"
    ]
}