{
    "title": "'Damaging' vacancy puts India statistics reputation at risk",
    "link": "https://www.business-standard.com/article/economy-policy/statistics-ministry-without-a-chief-has-india-s-economic-reputation-at-risk-118061400590_1.html",
    "pubDate": "Fri, 15 Jun 2018 01:53:00 +0530",
    "content": "The Central Statistics Office was without a boss when it released figures last month",
    "contentSnippet": "The Central Statistics Office was without a boss when it released figures last month",
    "guid": "https://www.business-standard.com/article/economy-policy/statistics-ministry-without-a-chief-has-india-s-economic-reputation-at-risk-118061400590_1.html",
    "isoDate": "2018-06-14T20:23:00.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.25,
        "tokens": [
            "'damaging'",
            "vacancy",
            "puts",
            "india",
            "statistics",
            "reputation",
            "at",
            "risk"
        ],
        "words": [
            "risk"
        ],
        "positive": [],
        "negative": [
            "risk"
        ]
    },
    "article": {
        "title": "'Damaging' vacancy puts India statistics reputation at risk",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tGathering reliable economic data in India is challenging enough. It’s been made more difficult in the more than four months that the nation has been without a chief statistician.<br></p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/tca-anant\" target=\"_blank\">TCA Anant </a>retired from the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=central+statistics+office\" target=\"_blank\">Central Statistics Office </a>on Jan. 31 and the government has been looking for a replacement ever since. Bureaucratic processes have delayed the appointment, and while a few candidates have been interviewed for the job, a final decision is yet to be made by Prime Minister Narendra Modi’s office.<br></p>\n<p>\n\tAt stake is the reputation of an institution that’s been working hard to rectify the image that India has deficient and unreliable economic data. With a population of 1.3 billion and an economy of $2.3 trillion -- a large part of which is rural and informal -- collecting timely and accurate information is a gargantuan effort, made harder by the fact that the statistics office is without a leader.<br></p>\n<!-- INPAGE_BANNER -->\n\t \n<p>\n\t“The delay affects the reputation, and worse it affects the working because the chief statistician’s post has a lot of responsibilities that are not easy to delegate to a bureaucrat,” said Pronab Sen, India’s first chief statistician who was appointed in 2007. “That is quite damaging.”<br></p>\n<p>\n\tA spokesman for the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=statistics+ministry\" target=\"_blank\">statistics ministry </a>wasn’t immediately able to comment on the selection process.<br></p>\n<p>\n\t<strong>Potential Delays</strong><br></p>\n<p>\n\tIt’s an action-packed year on the statistics calendar, with the government working to revise base years for key economic data and publish a new <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=labour+survey\" target=\"_blank\">labour survey.</a> And with only months to go before the next election, the data is also coming under increased scrutiny as Modi’s political rivals question his claims about key campaign pledges, such as jobs.<br></p>\n<p>\n\tThe chief statistician has to give the final sign-off on new data series, so there is potential for delays.<br></p>\n<p>\n\t“The damage is where new data sets are being created and that can be very large,” said Sen, who is now a country director at the New Delhi-based International Growth Centre. “For instance, how do we integrate goods and services tax into national accounts. Because of this gap, that process may simply get held up.”<br></p>\n<p>\n\tThe nationwide sales tax was introduced in July 2017 and its full impact on the economy is yet to be seen in the data.</p>\n<p>\n\tThe government also plans to start a Time Use survey -- a breakdown of how people spend their time. It will, among other things, help assess contribution of women in non-marketed economic and social activities, including at home.<br></p>\n<p>\n\t<strong>Defending its work</strong><br></p>\n<p>\n\tThe job vacancy notice, which was posted more than three weeks after Anant retired, says the government is looking for a person “with proven statistical and managerial experience in a large statistical organisation.” He or she will have a tenure of three years that can be extended by another two years, and get a salary, allowances and other facilities similar to a senior bureaucrat.<br></p>\n<p>\n\tAnother key role, which isn’t listed in the advertisement, is needing to defend the CSO’s work when it makes changes to data methodology. Like in 2015, when the statistics office published a new series for a gross domestic product that put India’s growth rate on par with China. Economists said at the time that the data didn’t match up with high-frequency indicators showing more subdued expansion.<br></p>\n<p>\n\tThe CSO was without a boss when it released figures last month showing the economy regained its position once again of being the fastest-expanding major economy in the world, with the growth of 7.7 per cent in the fourth-quarter of the fiscal year ended March 31.<br></p>\n<p>\n\tA search-and-selection panel headed up by India’s top bureaucrat, Cabinet Secretary Pradeep Kumar Sinha, is tasked with finding a new chief statistician before making a recommendation to Modi’s office. That’s a shift from the past, when the deputy chairman of the government’s planning body, aided by experts, would select the head of the statistics office.<br></p>\n<p>\n\tThe government should have started the process earlier since it can take six to eight months to select a replacement, said Yoginder K. Alagh, chancellor of the Central University of Gujarat and a former federal minister.<br></p>\n<p>\n\tThe chief statistician’s job is a specialised one and the selection process shouldn’t be left to bureaucrats, he said, recommending instead that the government think-tank NITI Aayog should do it with the help of experts.<br></p><hr>\n\t<em><strong>@2018Bloomberg</strong></em>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Damaging",
        "Central",
        "boss",
        "last"
    ],
    "nouns": [
        "India",
        "reputation",
        "vacancy",
        "statistics",
        "Statistics",
        "risk",
        "Central",
        "Office",
        "boss",
        "last",
        "month"
    ],
    "verbs": [
        "risk",
        "boss",
        "last"
    ]
}