{
    "title": "After hasty withdrawal Ramdev's Kimbho app set for a comeback",
    "link": "https://timesofindia.indiatimes.com/business/india-business/after-hasty-withdrawal-ramdevs-kimbho-app-set-for-a-comeback/articleshow/64502926.cms",
    "pubDate": "Fri, 08 Jun 2018 04:12:15 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/after-hasty-withdrawal-ramdevs-kimbho-app-set-for-a-comeback/articleshow/64502926.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64502926.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/after-hasty-withdrawal-ramdevs-kimbho-app-set-for-a-comeback/articleshow/64502926.cms",
    "isoDate": "2018-06-08T04:12:15.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.3,
        "tokens": [
            "after",
            "hasty",
            "withdrawal",
            "ramdev's",
            "kimbho",
            "app",
            "set",
            "for",
            "a",
            "comeback"
        ],
        "words": [
            "withdrawal"
        ],
        "positive": [],
        "negative": [
            "withdrawal"
        ]
    },
    "article": {
        "title": "After hasty withdrawal, Ramdev's Kimbho app set for a comeback",
        "content": "<div class=\"Normal\"><span>NEW DELHI: After hastily \n</span><span class=\"newsincontext nic_handler\" id=\"nic64407617\" pg=\"NIC#PARENT-business/india-business/after-hasty-withdrawal-ramdevs-kimbho-app-set-for-a-comeback:64502926-CHILD-:64407617~OPEN-Article\" data-id=\"nic64502926\" data-nic_msid=\"64407617\" data-nic_mstype=\"2\" data-nic_mssubtype=\"0\" data-nic_host=\"83\">\n  withdrawing their new messaging app\n <span>+</span></span><span> amid glaring security flaws, yoga guru Baba </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/baba-ramdev\">Ramdev</a><span> and his billionaire partner Acharya </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Balkrishna\">Balkrishna</a><p> are about to have another go at it.\n\n</p><span>Balkrishna, who collaborated with Ramdev to build an Indian consumer goods empire, plans a formal release of the </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Kimbho\">Kimbho</a><span> messenger app within weeks as he tries to create a challenger to dominant </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/whatsapp\">WhatsApp</a><p>. But first he has to fix it.\n</p><p>“We pledge not to launch the app until a team of expert hackers and security specialists plug all the security and privacy loopholes,” Balkrishna said in a phone interview as he promised more advanced features than his rival.\n</p><p>The hurried withdrawal of the app, whose name translates as “what’s up” in Sanskrit, a day after its release in May was a rare setback for Balkrishna and Ramdev. The pair built Patanjali Ayurved into a business with $1.6 billion of annual revenue by selling soap, skin cream and instant noodles that embrace the swadeshi, or home-grown, all-natural-and-wholesome creed. Still, in the short time it was available the app racked up 3 lakh downloads, the billionaire said.\n</p><p>Ramdev rose to fame in India from appearances on TV, where he demonstrated the cobra, the downward dog and hundreds of other yoga poses. He used his prominence to make Patanjali Ayurved a household name, giving global players such as Nestle and Unilever a run for their money when it comes to Indian consumer spending. Balkrishna owns most of the stock, while Ramdev holds a minuscule share, in keeping with his adopted life as a ‘sanyasi’ ascetic free of material possessions.\n</p><p>The home-grown character that helped its consumer products succeed is a core proposition behind the messaging app. WhatsApp already dominates India, amassing more than 23 crore users and pushing into electronic payments, a rapidly expanding sector in the world’s fastest-growing major economy.\n</p><p>“We respect WhatsApp,” Balkrishna, a user of WhatsApp, said by phone from his base in the ancient city of Haridwar in the foothills of the Himalayas. “But when we have 1.3 billion people, many of them talented software developers, why can’t we build our own messenger with superior features, one that people can trust and which keeps user’s data within India?”\n</p><p>While the initial release proved popular in terms of downloads, the company’s first foray into technology was quickly criticized online by experts as a “joke” and “security disaster.” It was swiftly pulled from stores to be re-tooled.\n</p><p>“The technology could be a work in progress right now, but Patanjali and Baba Ramdev have a strong brand appeal and consumer connection that’ll help drive users to the app,” said Neha Dharia, the Bangalore-based founder and chief executive of technology consultancy Warp Speed Reads Pvt. “Sustainable growth will be their challenge and that’ll depend on the technology they put into the app and the partnerships they drive.”\n</p><p>Kimbho was released on app stores so that a limited number of users could test features such as text messaging, stickers and video calling, said Balkrishna. Fueled by the brand appeal of its high profile backers - Ramdev has more than 10 million followers across social networks - the app proved so popular that Balkrishna said its cloud servers crashed.\n</p><p>“We never dreamed it could catch fire and have 3 lakh downloads within hours,” Balkrishna said.\n</p><span>\n</span><br><span>With the upcoming formal release, the initial focus will be on messaging even as WhatsApp prepares to roll out digital payments across the country after an earlier trial run with 10 lakh users. Despite the competition, India is a massive market and the nation’s internet user base is expected to reach 50 crore this summer, most of them doing so via smartphones.\n</span><br><span>\n</span><br><span>Kimbho adds to an ever expanding array of products from Patanjali, including its own branded SIM cards in partnership with a local carrier. Ramdev has talked of getting into ready-made apparel and recently spoke about building a swadeshi food chain to compete with McDonald’s.\n</span><br><span>\n</span><br><span>After revenue stagnated in the year ended March amid new taxes and disruptions caused by India’s demonetization, Balkrishna expects the company to resume growth. For the moment, his focus is on getting Kimbho back up.\n</span><br><span>\n</span><br><span>“People need an alternative,\" he said, predicting it would be used by “all types and levels of Indians.”\n</span><br><span>\n</span></div>"
    },
    "adjectives": [
        "10",
        "left",
        "top",
        "right",
        "After",
        "hasty",
        "set"
    ],
    "verbs": [
        "border",
        "align",
        "style",
        "top",
        "right",
        "set"
    ]
}