{
    "title": "States revenue may be up by Rs 37,400 crore in FY19",
    "link": "https://timesofindia.indiatimes.com/business/india-business/higher-oil-gst-may-boost-states-revenue-by-rs-37400-crore-in-fy19/articleshow/64601437.cms",
    "pubDate": "Fri, 15 Jun 2018 10:01:14 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/higher-oil-gst-may-boost-states-revenue-by-rs-37400-crore-in-fy19/articleshow/64601437.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64601437.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/higher-oil-gst-may-boost-states-revenue-by-rs-37400-crore-in-fy19/articleshow/64601437.cms",
    "isoDate": "2018-06-15T10:01:14.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "states",
            "revenue",
            "may",
            "be",
            "up",
            "by",
            "rs",
            "37400",
            "crore",
            "in",
            "fy19"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Higher oil, GST may boost states revenue by Rs 37,400 crore in FY19",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>MUMBAI: States are likely to gain an additional Rs 37,426 crore in revenue in the current fiscal on the back of surge in oil prices and better tax collection due to the </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/business/gst\">GST</a><p>, says a report.\n\n</p><p>According to SBI Research, the impact of GST on tax revenue is minimal except in a few states.\n</p><span>As many as 16 of the 24 states, have seen thier revenue increasing over and above the 14 percent baseline/ mutually accepted minimum tax growth rate between the </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Centre\">Centre</a><p> and the states post-GST rollout below which the states have to be compensated.\n</p><p>\"We have found that on an aggregate lever, the states have gained by Rs 18,698 crore in additional revenue in FY18. If we combine this figure with the gains that the states have made due to increase in crude prices, the overall figure will be Rs 37,426 crore,\" the report said.\n</p><span>The amount will be sufficient to neutralize the Rs 34,627 crore of revenue forgone if the states impose </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/VAT\">VAT</a><p> only on base the price of crude.\n</p><span>Post-GST implementation in July last year, the tax revenue of the states has gone up in FY18 due to increased tax compliance and broader tax base.\n</span><br><span>\n</span><br><span>While Gujarat, Haryana, Maharashtra, Chhattisgarh, Jharkhand and Punjab have gained the maximum from GST, Karnataka, Bengal, UP, MP and Assam have reported a decline in tax collection post-GST.\n</span><br><span>\n</span><br><span>These states were impacted due to the changes in the nature of taxation as GST has subsumed indirect taxes such as service tax, VAT, excise duty, entry tax, entertainment tax into one, including the taxes under the Centre and the states which contribute to an aggregate of over 55 per cent of tax revenue of these states.\n</span><br><span>\n</span><br><span>\"We expect that while there is a need to optimise tax revenue, for funding social security programmes, there is also a need to insulate consumers from adverse price shocks,\" the report said.\n</span><br><span>\n</span><p>From that perspective, states could come forward and rationalise their VAT rates. After all, crude price falling much below USD 70 a barrel looks uncertain now, the report concluded. \n</p><span>\n</span></div></div>"
    },
    "adjectives": [
        "higher",
        "10",
        "37",
        "400",
        "left",
        "top",
        "right"
    ],
    "nouns": [
        "india",
        "crore",
        "may",
        "oil",
        "boost",
        "revenue",
        "margin",
        "10",
        "business",
        "border",
        "left",
        "style",
        "top",
        "right",
        "photo"
    ],
    "verbs": [
        "oil",
        "boost",
        "border",
        "align",
        "style",
        "top",
        "right"
    ]
}