{
    "title": "Govt may create 'bad bank' to take over PSB's NPAs",
    "link": "https://timesofindia.indiatimes.com/business/india-business/govt-may-create-bad-bank-to-take-over-psbs-npas/articleshow/64514423.cms",
    "pubDate": "Fri, 08 Jun 2018 22:30:00 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/govt-may-create-bad-bank-to-take-over-psbs-npas/articleshow/64514423.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64514423.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/govt-may-create-bad-bank-to-take-over-psbs-npas/articleshow/64514423.cms",
    "isoDate": "2018-06-08T22:30:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "govt",
            "may",
            "create",
            "'bad",
            "bank'",
            "to",
            "take",
            "over",
            "psb's",
            "npas"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Govt may create ‘bad bank’ to take over 'troubled loans' of public sector banks",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>MUMBAI: The concept of having a ‘bad bank’ to take over the troubled loans of </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/public-sector-banks\">public sector banks</a><span> (PSBs) is being considered by the government to enable them to get back to business. Finance minister </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Piyush-Goyal\">Piyush Goyal</a><span> on Friday announced that a bankers’ panel would look at the feasibility of setting up a new asset reconstruction company (ARC) or asset management company (AMC) to take over bad loans of </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/PSBs\">PSBs</a><p>.\n\n</p><p>A committee headed by Punjab National Bank chairman Sunil Mehta would not only look at the need for an ARC or an AMC, but would also go into the modalities of setting up the same if felt necessary. Addressing newspersons after a meeting with bank chiefs from west and south India, Goyal said that another group of bankers led by Bank of Baroda MD P S Jayakumar will look at formulating a strategy regarding a consortium of PSBs taking over good loans of banks under the RBI’s Prompt Corrective Action (PCA). \n</p><p>Goyal promised that the government would ensure that all vacancies in PSBs will be filled within 30 days. “There is also a proposal that banks may consider oversight committees comprising retired judges, vigilance officials and regulators, and bring in some expertise to help faster decision-making in Indian banks,” said Goyal.\n</p><span> \n</span><div class=\"image\" data-msid=\"64514422\"><img src=\"https://timesofindia.indiatimes.com/img/64514422/Master.jpg\" alt=\"Govt may create &amp;#8216;bad bank&amp;#8217; to take over PSBs&amp;#8217; NPAs\"></div><p>On bank consolidation, Goyal denied that the government was planning any merger of banks. “We believe in autonomy of banks and the banks will have to take a final call if at all they wish to,” said Goyal. However, in the meeting, SBI did make a presentation to other banks on how its own merger process played out.\n</p><span>\n</span><br><span>SBI chairman Rajnish Kumar said, “One of the topics of the meeting was how to achieve global scale for Indian banks — there we made a presentation. There is a fragmentation as far as banks are concerned in India. Here, we shared our experience with SBI when we merged five banks in one go.”\n</span><br><span>\n</span><br><span>Goyal said that the focus of the meeting was not bad loans but how to ensure that credit continued to flow despite restriction faced by the bank. He said, “There are many borrowers facing restrictive covenants because of restrictions placed by some banks on lending. A process has been devised by the bankers themselves to ensure that credit flow to good borrowers of banks under prompt corrective action of banks will not face any problems.”\n</span><br><span>\n</span><br><span>Bank of Baroda’s Jayakumar said, “The idea is that banks with the capital and liquidity to lend will step up their share. The issue is to how to operationally make it happen seamlessly. How to ensure that the board will support such proposals.”\n</span><br><span>\n</span><br><span>On the issue of providing capital to banks to facilitate growth, Goyal said that banks would need to assess the recoveries that they will make under IBC and look at the possibility of transferring loans to the </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/ARCs\">ARCs</a><span>.\n</span><br><span>\n</span></div></div>"
    },
    "adjectives": [
        "10",
        "left",
        "top",
        "right",
        "bad"
    ],
    "nouns": [
        "india",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo",
        "bank",
        "may",
        "bad"
    ],
    "verbs": [
        "border",
        "align",
        "style",
        "top",
        "right",
        "bank",
        "create"
    ]
}