{
    "title": "Opec meet in Vienna: Oil ministers back output hike despite Iran's walkout",
    "link": "https://www.business-standard.com/article/markets/opec-meet-in-vienna-oil-ministers-back-output-hike-despite-iran-s-walkout-118062200292_1.html",
    "pubDate": "Fri, 22 Jun 2018 11:41:00 +0530",
    "content": "While the OPEC+ panel has recommended raising supply by a nominal 1 million barrels a day, the actual rise is likely to be smaller as some nations are unable to pump more",
    "contentSnippet": "While the OPEC+ panel has recommended raising supply by a nominal 1 million barrels a day, the actual rise is likely to be smaller as some nations are unable to pump more",
    "guid": "https://www.business-standard.com/article/markets/opec-meet-in-vienna-oil-ministers-back-output-hike-despite-iran-s-walkout-118062200292_1.html",
    "isoDate": "2018-06-22T06:11:00.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.16666666666666666,
        "tokens": [
            "opec",
            "meet",
            "in",
            "vienna",
            "oil",
            "ministers",
            "back",
            "output",
            "hike",
            "despite",
            "iran's",
            "walkout"
        ],
        "words": [
            "walkout"
        ],
        "positive": [],
        "negative": [
            "walkout"
        ]
    },
    "article": {
        "title": "Opec meet in Vienna: Oil ministers back output hike despite Iran's walkout",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tOpec and its allies reached a preliminary agreement in the face of strong opposition from Iran to boost production by a theoretical 1 million barrels a day -- the actual increase will be smaller as several countries are unable to raise output.</p>\n<p>\n\tIn a night of drama in Vienna, the Joint Ministerial Monitoring Committee, which recommends policy to the group, reached an agreement despite Bijan Zanganeh, the Iranian oil minister, walking out of the meeting and predicting Opec won't reach a final deal when it meets formally on Friday.</p>\n<p>\n\t\"One million barrels a day is nominal. The actual effect will be something less because not every country can respond,\" Saudi Arabia <a class=\"storyTags\" href=\"https://www.business-standard.com/category/markets-commodities-energy-1060802.htm\" target=\"_blank\">Energy </a>Minister <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=khalid+al+falih\" target=\"_blank\">Khalid Al-Falih </a>said. \"What actually is delivered to the market is going to be a smaller number.\"</p>\n<p>\n\tThe real production increase would be around 600,000 barrels a day, a delegate familiar with Opec's internal calculations said. Among Opec countries, Venezuela is all but certain to be unable to boost output with its industry suffering because of an economic crisis. Among those outside the group, Mexico is unlikely to be able to pump more.</p>\n<p>\n\tThe Organization of Petroleum Exporting Countries would need to ratify the recommendation on Friday at its formal meeting. It's not uncommon for the cartel to deviate from the preliminary agreement, and Iran can still scupper the deal as the group's decisions typically have to be unanimous. Still, Riyadh can bypass the veto by assembling a coalition of countries ready to pump more.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/international/opec-meet-us-china-trade-spat-make-oil-prices-climb-as-uncertainty-looms-118062200109_1.html\" target=\"_blank\">Opec meet, US-China trade spat make oil prices climb as uncertainty looms</a></strong></p>\n\n<p>\n\tThe cartel will on Saturday also meet with the other countries, including Russia, that are part of the original deal to curb supplies.</p>\n<p>\n\t<strong>Historic agreement</strong></p>\n<p>\n\tIn an historic agreement in late 2016 the OPEC+ group of 24 nations decided to cut 1.8 million barrels of production to revive the oil market from its biggest slump in a generation. Outages in some nations and deeper-than-agreed cuts by others have made the actual reduction larger by about 1 million barrels a day.</p>\n<p>\n\tThe Iran walk-out shows the tension within OPEC after the US, China and India put pressure on the cartel to boost production to ease the pain of high <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/oil-prices\" target=\"_blank\">oil prices.</a> Brent crude last month surged to a more than three-year high above $80 a barrel. It was up 1.2 per cent at $73.95 a barrel at 1:13 pm in Singapore on Friday.<br></p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/current-affairs/india-urges-opec-to-fill-supply-gap-and-ensure-sustainable-oil-prices-118062000698_1.html\" target=\"_blank\">India urges Opec to fill supply gap and ensure sustainable oil prices</a></strong></p>\n\n<p>\n\t\"Our customers have spoken loudly and we must listen to them,\" Al-Falih said before the ministerial talks on Thursday. He warned his fellow oil producers about rising consumer anxiety and the potential for high prices to have a negative impact on demand.</p>\n<p>\n\tThe upbeat Saudi comments contrasted with the somber tone from the Iranian delegation. \"It wasn't a good meeting,\" Zanganeh told reporters after walking out little more than 30 minutes after the gathering got under way. \"There were proposals but I don't think we can reach an agreement.\"</p>\n<p>\n\tThe talks in the Austrian capital were the latest steps in a process that has whipsawed oil <a class=\"storyTags\" href=\"https://www.business-standard.com/markets\" target=\"_blank\">markets </a>for weeks. Saudi Arabia and Russia's desire to roll back production cuts has encountered fierce opposition from Iran and Venezuela, while US President Donald Trump has lobbed the occasional rhetorical bomb on Twitter at the cartel on behalf of consumers.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/international/opec-s-biggest-challenge-to-pump-more-oil-and-keep-deal-in-place-118062100987_1.html\" target=\"_blank\">Opec's biggest challenge: To pump more oil and keep deal in place</a></strong></p>\n\n<p>\n\t\"This is the most geopolitically complex meeting that Opec has ever had,\" said Daniel Yergin, vice-chairman of consultant IHS Markit Ltd.  </p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "million",
        "back",
        "smaller",
        "raising",
        "unable",
        "meet",
        "nominal",
        "actual",
        "likely"
    ],
    "nouns": [
        "million",
        "Opec",
        "OPEC",
        "day",
        "Oil",
        "back",
        "output",
        "raising",
        "meet",
        "Vienna",
        "hike",
        "despite",
        "Iran",
        "walkout",
        "While",
        "supply",
        "nominal",
        "barrels",
        "rise",
        "pump",
        "panel"
    ],
    "verbs": [
        "Oil",
        "back",
        "output",
        "meet",
        "hike",
        "panel",
        "supply",
        "rise",
        "pump"
    ]
}