{
    "title": "People spend 13 hours to access direct benefit transfers in Ranchi",
    "link": "https://www.business-standard.com/article/economy-policy/people-spend-13-hours-to-access-direct-benefit-transfers-in-ranchi-118062101305_1.html",
    "pubDate": "Fri, 22 Jun 2018 06:55:00 +0530",
    "content": "As a matter of fact, the study found that people are so unsatisfied with the DBT system being piloted by the government that they want to return to the previous system of grains distribution",
    "contentSnippet": "As a matter of fact, the study found that people are so unsatisfied with the DBT system being piloted by the government that they want to return to the previous system of grains distribution",
    "guid": "https://www.business-standard.com/article/economy-policy/people-spend-13-hours-to-access-direct-benefit-transfers-in-ranchi-118062101305_1.html",
    "isoDate": "2018-06-22T01:25:00.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.18181818181818182,
        "tokens": [
            "people",
            "spend",
            "13",
            "hours",
            "to",
            "access",
            "direct",
            "benefit",
            "transfers",
            "in",
            "ranchi"
        ],
        "words": [
            "benefit"
        ],
        "positive": [
            "benefit"
        ],
        "negative": []
    },
    "article": {
        "title": "People spend 13 hours to access direct benefit transfers in Ranchi",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tPeople in Nagri Block in Jharkhand have to wait for around 13 hours on average to be able to withdraw cash received through the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/direct-benefit-transfer\" target=\"_blank\">direct benefit transfer </a>(DBT) scheme and buy rice from the public distribution system (PDS), a new government study released on Thursday found.</p>\n<p>\n\tThe study, conducted by social audit unit of the Jharkhand government analysed the performance of the DBT system from October 2017 to March 2018. It found that overall 91,756 hours were spent by 6,993 beneficiaries in the withdrawal of DBT and purchase of rice from the PDS.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tEven as a vast majority of people had to spend less than 24 hours, the average time spent by each person is high, partly because some people had to spend up to 96 hours in the wait to claim the benefits that are guaranteed to them under the National Food Security Act.</p>\n<p>\n\tAs a matter of fact, the study found that people are so unsatisfied with the DBT system being piloted by the government that they want to return to the previous system of grains distribution through PDS at Rs1 per kg.</p>\n<p>\n\tAlmost 96.9 per cent of people said that they would prefer the previous system as opposed to DBT, while only 2.4 per cent of respondents said that they like DBT instead.</p>\n<p>\n\tIn a direct indictment of the government’s efforts to boost direct transfers by carrying out pilots in states like Jharkhand, the study found that all 38 surveyed gram sabhas out of a total 46 villages unanimously rejected DBT, while the other eight were not surveyed. Only two gram sabhas said that DBT could be acceptable, but only after a complete operational overhaul.</p>\n<p>\n\tThis is not the first time that the government has faced opposition from citizens in rolling out DBT. Activists and citizens have been complaining of starvation deaths happening in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/ranchi\" target=\"_blank\">Ranchi </a>ever since the pilot was launched and the government’s own report now shows that its pilot isn’t working as expected.</p>\n<p>\n\t“Over the past 10 months, at least 12 people have succumbed to hunger in Jharkhand,” the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=right+to+food+campaign\" target=\"_blank\">Right to Food campaign </a>wrote in a statement issued to the media. “Instead of taking action against functionaries whose lapses have led to these deaths and measures to improve the situation of food security in the state, the Jharkhand government has denied hunger as the cause of any of these deaths and absolved itself of any blame.”</p>\n<p>\n\tThe survey, meanwhile, found that 23.1 per cent beneficiaries have received direct transfers five times in the last six months, whereas 13 per cent didn’t receive their transfers even once. Only 5.9 per cent of beneficiaries received DBT once in the last six months from the date of survey.</p>\n<p>\n\tThe big issue behind DBT failing, according to an activist working on the ground, is that there’s a lack of functioning ATMs in the region and the supporting debit card infrastructure. Thus, 66.5 per cent of withdrawals happen through bank branches, which increases transaction times, while ATM withdrawals happened only in 2.3 per cent cases, the survey stated. </p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "13",
        "direct",
        "found",
        "previous",
        "unsatisfied"
    ],
    "nouns": [
        "People",
        "people",
        "13",
        "hours",
        "access",
        "benefit",
        "As",
        "matter",
        "fact",
        "study",
        "found",
        "system",
        "government",
        "want",
        "return",
        "so",
        "distribution"
    ],
    "verbs": [
        "People",
        "people",
        "spend",
        "access",
        "direct",
        "benefit",
        "matter",
        "study",
        "found",
        "want",
        "return"
    ]
}