{
    "title": "With no money, Air India says cabin crew will share rooms; unions up in arms",
    "link": "https://timesofindia.indiatimes.com/business/india-business/with-no-money-air-india-says-cabin-crew-will-share-rooms-unions-up-in-arms/articleshow/64604532.cms",
    "pubDate": "Fri, 15 Jun 2018 13:29:24 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/with-no-money-air-india-says-cabin-crew-will-share-rooms-unions-up-in-arms/articleshow/64604532.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64604532.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/with-no-money-air-india-says-cabin-crew-will-share-rooms-unions-up-in-arms/articleshow/64604532.cms",
    "isoDate": "2018-06-15T13:29:24.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "with",
            "no",
            "money",
            "air",
            "india",
            "says",
            "cabin",
            "crew",
            "will",
            "share",
            "rooms",
            "unions",
            "up",
            "in",
            "arms"
        ],
        "words": [
            "share",
            "no"
        ],
        "positive": [
            "share"
        ],
        "negative": [
            "no"
        ]
    },
    "article": {
        "title": "With no money, Air India says cabin crew will share rooms; unions up in arms",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>NEW DELHI: Fund-starved </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Air-India\">Air India</a><p> will make its cabin crew members share hotel rooms as a cost-cutting measure. And airhostess and flight pursers will now be put up in three and four star hotels wherever possible instead of five stars. While the airline hopes to save Rs 10 crore annually with these moves, the unions are up in arms.\n\n</p><p>The twin sharing, which has to be done in a gender sensitive manner (meaning women not being asked to share rooms with men), will begin with cabin crew members who joined the airline from last year and progressively be extended to all cabin crew. AI has about 3,000 cabin crew, of which 1,400 are permanent employees when the rest are on contract, said a union leader. \n</p><p>The airline did not say how much it spends annually on hotel accommodation of cabin crew, till the time this story was filed. It will be updated if AI gives that figure.\n</p><span>Air India is facing a severe fund crunch due to the promised equity infusion being kept on hold by the government as the latter felt it will be able to sell the airline. Banks also withdrew Rs 1000-crore loan when the failed divestment bid began last year. AI is yet to pay last month's flying allowance to its pilots, which forms up to 75% of their total pay.\n</span><br><span>\n</span><br><span>AI's order to the effect by its ED (industrial relations and integration) Amrita Sharan says: \"With regard to hotel accommodation to cabin crew, it has been decided that with immediate effect:- 1. Cabin Crew will be provided hotel rooms in 3/4 Star Hotels as far as possible. 2. The booking will be on twin sharing basis. The above is to be immediately implemented for all the Cabin Crew who have been recruited in 2017 onwards. 3. The gender sensitivity issue is to be kept in mind while allotting rooms to the Cabin Crew.\"\n</span><br><span>\n</span><br><span>AI will renegotiate contracts with hotels now to implement this order. Crew rostering \"will provide the details of deployed Crew who are appointed in 2017/2018 and roster them to facilitate the above. the arrangements will be gradually extended to all crew. The above is for immediate compliance and all Executive Directors of the regions are requested to re-visit the Hotel accommodation agreements to ensure the above compliance,\" Sharan's order adds.\n</span><br><span>\n</span><br><span>The unions are up in arms. All India Cabin Crew Association general secretary Sanjay Lazar has written to the management, saying: \"The matter (Notice of Change) is pending before the larger bench of the honourable Supreme Court. This order violates Section 9A as it is also in breach of our agreements/ settlements / awards and seeks to disturb settled Service Conditions. The Cabin Crew of Air India are at the forefront of Passenger service and forms the backbone of the revival of our Airline. Lest it be misconstrued, the Cabin Crew have made umpteen sacrifices above and beyond the call of duty, and will continue to work towards our turnaround, however it cannot be perceived as inequitable targeting.\n</span><br><span>\n</span><p>The Crew have been seen as soft targets whether it be 'denial of 25% for almost the last 5 years' or 'withholding 10% flying allowances from 2007' or the decade long wait for arrears, or even now being one of the only categories of employees in the company to be denied timely payment of flying allowances etc (our crew have just got March payments and have yet to get April, May Allowances) and yet we all continue to serve the Company with pride, honour and a smile and shall continue to do so.\"\n</p><span>\n</span></div></div>"
    },
    "adjectives": [
        "10",
        "left",
        "top",
        "right",
        "no"
    ],
    "verbs": [
        "crew",
        "border",
        "align",
        "style",
        "top",
        "right",
        "will",
        "Air",
        "air",
        "cabin",
        "share"
    ]
}