{
    "title": "WPI inflation soars to 14-mth high; rises to 4.43% in May from 3.18% in Apr",
    "link": "https://www.business-standard.com/article/economy-policy/wpi-inflation-soars-to-14-mth-high-rises-to-4-43-in-may-from-3-18-in-apr-118061401379_1.html",
    "pubDate": "Fri, 15 Jun 2018 01:03:00 +0530",
    "content": "Wholesale inflation had been on a downward curve since November, closely imitating food inflation which had crashed over the period",
    "contentSnippet": "Wholesale inflation had been on a downward curve since November, closely imitating food inflation which had crashed over the period",
    "guid": "https://www.business-standard.com/article/economy-policy/wpi-inflation-soars-to-14-mth-high-rises-to-4-43-in-may-from-3-18-in-apr-118061401379_1.html",
    "isoDate": "2018-06-14T19:33:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.06666666666666667,
        "tokens": [
            "wpi",
            "inflation",
            "soars",
            "to",
            "14-mth",
            "high",
            "rises",
            "to",
            "443",
            "in",
            "may",
            "from",
            "318",
            "in",
            "apr"
        ],
        "words": [
            "rises"
        ],
        "positive": [
            "rises"
        ],
        "negative": []
    },
    "article": {
        "title": "WPI inflation soars to 14-mth high; rises to 4.43% in May from 3.18% in Apr",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tA rebound in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/food-inflation\" target=\"_blank\">food </a><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/inflation\" target=\"_blank\">inflation </a>and a jump in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/fuel-prices\" target=\"_blank\">fuel prices </a>in May led to wholesale <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/inflation\" target=\"_blank\">inflation </a>in the country rising to 4.43 per cent, from 3.18 per cent in April, its fastest uptick in 14 months.</p>\n<p>\n\tFigures released by the commerce ministry on Thursday showed that rising <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/inflation\" target=\"_blank\">inflation </a>in the wholesale price index (WPI) was mainly led by double-digit inflation in petrol prices, while food prices rose by 1.6 per cent after low growth or deflation for the last three months.</p>\n<p>\n\tPressure on inflation as a whole is mounting. On the other hand, retail inflation - measured by the widely-tracked <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=consumer+price+index\" target=\"_blank\">consumer price index </a>(CPI) - had jumped to a four-month high of 4.87 per cent in May. “Perhaps anticipating this trend in core inflation, the Reserve Bank of India (RBI) did not wait till August and went for a 25-basis point (bps) rate hike in the June review of the 2018-19 monetary policy. We expect one more rate hike by the RBI during the current fiscal,” Sunil Kumar Sinha, principal economist at India Ratings and Research, said.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/retail-inflation-jumps-to-4-month-high-of-4-87-in-may-from-4-58-in-april-118061201277_1.html\" target=\"_blank\">Retail inflation jumps to 4-month high of 4.87% in May from 4.58% in April</a></strong></p>\n<p>\n\tWholesale inflation had been on a downward curve since November, closely imitating <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/food-inflation\" target=\"_blank\">food inflation </a>which had crashed over the period. But the price rise in the food segment accelerated in May, with <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/food-inflation\" target=\"_blank\">food inflation </a>at 1.6 per cent, up from 0.87 per cent in April. <br></p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t<img align=\"left\" alt=\"WPI inflation soars to 14-mth high; rises to 4.43% in May from 3.18% in Apr\" class=\"imgCont\" height=\"420\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/15/full/1529004793-7465.jpg\" title=\"WPI inflation soars to 14-mth high; rises to 4.43% in May from 3.18% in Apr\" width=\"236\"></p>\n<p>\n\tReports of farm distress and subsequent protests by <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/farmers\" target=\"_blank\">farmers </a>in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/madhya-pradesh\" target=\"_blank\">Madhya Pradesh </a>and Maharashtra, among other places, had pointed out acute loss in farm income due to continuing drop in food prices across the country.</p>\n<p>\n\tThe WPI is more relevant than the CPI in gauging farmers’ distress, though it also has its own inadequacies because there are middlemen between <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/farmers\" target=\"_blank\">farmers </a>and the mandis. So, Thursday’s figures are set to come as a relief for <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/farmers\" target=\"_blank\">farmers </a>across the country.</p>\n<p>\n\tMay saw the prices of most food commodities rising at a faster clip. After two straight months of price fall, vegetable prices rose by 2.31 per cent in May. The same was true for wheat, which saw inflation of 3.05 per cent after sustained deflation for more than six months. Potato prices rose by 81.93 per cent in May, up from the 67.94 per cent rise in April. This continued the five-month long trend whereby the wholesale prices of the tuber have skyrocketed.</p>\n<p>\n\tBut prices of milk and fruits rose at a slower pace in May than the month before. Also, prices of pulses continued to remain deflationary. While pulses have been witnessing deflation for the longest period among all food items, the rate of deflation fell in May to 21.13 per cent, from 22.46 per cent in April. <br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/riding-on-fuel-core-inflation-wpi-jumps-to-14-month-high-in-may-118061401141_1.html\" target=\"_blank\">Riding on fuel, core inflation, WPI jumps to 14-month high in May</a></strong></p>\n<p>\n\tInflation in the energy category rose sharply to 11.22 per cent in May, up from the 7.85 per cent in the previous month. This was mostly due to the rising cost of petrol. Petrol prices rose by 13.90 per cent, up from the 9.45 per cent in the previous month. Prices of high-speed diesel also continued to rise at a fast clip, with inflation accelerating to 17.34 per cent, up from 13.01 per cent in April, when it had risen by more than double the previous rate.</p>\n<p>\n\tHowever, liquefied petroleum gas (cooking fuel) prices continued to drop for the third straight month, although the rate of deflation reduced sharply to 0.74 per cent, down from 11 per cent in the previous month.</p>\n<p>\n\tInflation in manufactured products stood at 3.73 per cent, slightly higher than the 3.11 per cent in April. Continuing drop in sugar prices indicated that the crisis in the sector is far from over. Sugar prices fell for the fifth straight month, with deflation remaining at 19.46 per cent, up from 15 per cent in April.</p>\n<p>\n\t“The <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/wpi-inflation\" target=\"_blank\">WPI inflation </a>is expected to harden by up to 80 bps in the ongoing month before easing somewhat in the second quarter of FY19. Key factors that would influence the inflation trajectory include the level at which global crude oil prices stabilise and the extent to which they are transmitted to domestic fuel prices, the trend in the monsoon dispersion, and the extent of change in MSPs,” said Aditi Nayar, principal economist, Icra.</p>\n<p>\n\tThe inflation data for March was revised upwards to 2.74 per cent, from the provisional estimate of 2.47 per cent.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "high",
        "14",
        "43",
        "18",
        "Wholesale",
        "downward"
    ],
    "nouns": [
        "curve",
        "high",
        "May",
        "14",
        "inflation",
        "18",
        "Apr",
        "Wholesale",
        "November",
        "food",
        "period"
    ],
    "verbs": [
        "curve",
        "Wholesale"
    ]
}