{
    "creator": "FE Bureau",
    "title": "Stressed assets: No special relief to the power sector, says RBI",
    "link": "https://www.financialexpress.com/economy/stressed-assets-no-special-relief-to-the-power-sector-says-rbi/1215617/",
    "pubDate": "Fri, 22 Jun 2018 03:53:28 +05:30",
    "dc:creator": "FE Bureau",
    "content": "The Reserve Bank of India (RBI) on Thursday held its ground and refused to give any special relief to the power sector from its February circular that mandates early detection and time-bound resolution of stressed assets. ",
    "contentSnippet": "The Reserve Bank of India (RBI) on Thursday held its ground and refused to give any special relief to the power sector from its February circular that mandates early detection and time-bound resolution of stressed assets.",
    "guid": "https://www.financialexpress.com/?p=1215617",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-21T22:23:28.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.09090909090909091,
        "tokens": [
            "stressed",
            "assets",
            "no",
            "special",
            "relief",
            "to",
            "the",
            "power",
            "sector",
            "says",
            "rbi"
        ],
        "words": [
            "no",
            "assets",
            "stressed"
        ],
        "positive": [
            "assets"
        ],
        "negative": [
            "no",
            "stressed"
        ]
    },
    "article": {
        "title": "Stressed assets: No special relief to the power sector, says RBI",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><span>\n</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1215514\" src=\"https://images.financialexpress.com/2018/06/rbi-12.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/rbi-12.jpg 660w, https://images.financialexpress.com/2018/06/rbi-12-300x200.jpg 300w, https://images.financialexpress.com/2018/06/rbi-12-620x413.jpg 620w, https://images.financialexpress.com/2018/06/rbi-12-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> No special relief to the power sector, says RBI</figure>\n\t\t\t</section></div><span>\n</span><p>The Reserve Bank of India (<a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a>) on Thursday held its ground and refused to give any special relief to the power sector from its February circular that mandates early detection and time-bound resolution of stressed assets. In a meeting of stakeholders convened by the finance ministry following a directive of the Allahabad High Court, the central bank, instead, favoured expeditious resolution by the government and the firms concerned of sector-specific issues that have led to the huge pile-up of stressed assets in the sector. RBI executive director Sudarshan Sen is understood to have also indicated that the circular does not bar banks from restructuring the stressed assets and provides enough leeway for the resolution of such bad loans.</p><span>\n</span><p>The banking regulator highlighted that apart from financial issues, the stress in the regulated power sector also stems from externalities such as irregular payments from electricity distribution companies, shortage in fuel supplies and regulators delay in raising power tariffs. The RBI’s February circular requires banks to finalise a resolution plan in case of a default on large accounts of Rs 2,000 crore and above within 180 days (irrespective of sector), failing which insolvency proceedings will have to be invoked against the defaulter. Since the deadline for the resolution of the first set of such cases is end-August, power producers have been seeking urgent relief. The circular also stipulates a one-day default rule on term loans, which mandates treating a borrower who misses repayments as a defaulter the very next day.</p><span>\n</span><p>A fifth of Rs 10.3 lakh crore gross non-performing assets in the banking system belong to the power sector. The finance ministry had earlier written to the RBI seeking a relaxation of the circular for all sectors. Financial services secretary Rajiv Kumar — who convened the stakeholders’ meeting to facilitate a resolution — said another meeting could be held before a report is submitted to the Allahabad HC. The meeting was attended by the representatives from the departments of financial services, power, coal, petroleum and natural gas and from the RBI as well as the power industry.</p><span>\n</span><p><img class=\"alignnone size-full wp-image-1215624\" src=\"https://images.financialexpress.com/2018/06/Untitled-2.png\" alt=\"\" width=\"435\" height=\"401\" srcset=\"https://images.financialexpress.com/2018/06/Untitled-2.png 435w, https://images.financialexpress.com/2018/06/Untitled-2-217x200.png 217w, https://images.financialexpress.com/2018/06/Untitled-2-290x267.png 290w\" sizes=\"(max-width: 435px) 100vw, 435px\"></p><span>\n</span><p>Power secretary Ajay Kumar Bhalla said that any resolution plan that is to be worked out should keep in mind the electricity supply-demand dynamics for the next 10 years. The power sector is going through a transition from the phase of low demand and low supply to the current moderate-demand, high-supply phase, stakeholders said. The representatives of the coal ministry stated that there is 75% coal availability to run power plants, as per the supply agreements, and distribution plans have been made accordingly. The coal ministry would submit its views formally with the department of financial services (DFS) on June 25. “We will examine all the submissions made till Monday and decide the next course of action, taking into account all the concerns of the parties concerned,” said the DFS secretary.</p><span>\n</span><p>The Association of Power Producers (APP) wanted an extension of the August, 2018 deadline for formulation, approval and implementation of resolution plans to February 2019 by expanding the 180 day period to 365 days. Power minister RK Singh has earlier said that time frame to implement a resolution plan was “impractical”. APP says the new RBI guidelines have invalidated the erstwhile joint lenders’ forum and introduced the lenders’ forum that warrants unanimous agreement of all lenders to ratify any resolution plan, making matters more time-consuming.</p><span>\n</span><p>It also demanded that the voting threshold for approval be reduced to 66%, in sync with the Insolvency and Bankruptcy Code. The power producers also wanted the RBI to allow restructuring of accounts that have repaid 5% of the loan. Currently, RBI norms disincentivise restructuring accounts, as the asset-owner’s profitability is hurt by making 100% debt provision in balance sheets till 20% of the loan is paid back.</p><span>\n</span><p>“The relaxations would provide a window for chalking out a time-bound action plan for regulatory and policy required to salvage a significant portion of power portfolio,” said APP director general Ashok Kumar Khurana. The Allahabad High Court on May 31 had given a reprieve to a clutch of power projects under severe financial stress and facing the threat of being pushed into insolvency proceedings by ordering that no action be taken in their cases under the RBI circular till the finance ministry called a meeting of relevant stakeholders in June to see if the issues could be resolved.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "Stressed",
        "stressed",
        "No",
        "special",
        "held",
        "circular",
        "early",
        "bound"
    ],
    "nouns": [
        "Bank",
        "Reserve",
        "resolution",
        "assets",
        "No",
        "special",
        "relief",
        "power",
        "sector",
        "RBI",
        "India",
        "Thursday",
        "ground",
        "give",
        "February",
        "circular",
        "time",
        "bound",
        "detection"
    ],
    "verbs": [
        "Bank",
        "Reserve",
        "power",
        "ground",
        "give",
        "time",
        "bound"
    ]
}