{
    "title": "Sebi tweaks norms to aid fund-raising, caps tenure of MD & CEO of exchanges",
    "link": "https://www.business-standard.com/article/companies/sebi-tweaks-norms-to-aid-fund-raising-caps-tenure-of-md-ceo-of-exchanges-118062200051_1.html",
    "pubDate": "Fri, 22 Jun 2018 01:35:00 +0530",
    "content": "Sebi also allowed mutual funds and insurers related to the investment banker handling an IPO to participate in the anchor investor category, where shares are allotted on a discretionary basis",
    "contentSnippet": "Sebi also allowed mutual funds and insurers related to the investment banker handling an IPO to participate in the anchor investor category, where shares are allotted on a discretionary basis",
    "guid": "https://www.business-standard.com/article/companies/sebi-tweaks-norms-to-aid-fund-raising-caps-tenure-of-md-ceo-of-exchanges-118062200051_1.html",
    "isoDate": "2018-06-21T20:05:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "sebi",
            "tweaks",
            "norms",
            "to",
            "aid",
            "fund-raising",
            "caps",
            "tenure",
            "of",
            "md",
            "",
            "ceo",
            "of",
            "exchanges"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Sebi tweaks norms to aid fund-raising, caps tenure of MD & CEO of exchanges",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p> The Securities and Exchange Board of India (Sebi) has made major changes in rules governing fund-raising, to provide flexibility to issuers and to boost <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=capital+formation\" target=\"_blank\">capital formation.</a></p> <p> The regulator tweaked norms governing stock exchanges, clearing corporations and depositories —known as <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=market+infrastructure+institutions\" target=\"_blank\">market infrastructure institutions </a>(MIIs) — capping the tenure of top officials and bringing in more accountability to the board structure.\n\n\n</p>\n<!-- INPAGE_BANNER --> <p> Going ahead, a company will have to make public the pricing for its <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=initial+public+offering\" target=\"_blank\">initial public offering </a>(IPO) just two days before the opening as distinct from five days earlier. According to experts, this will help issuers handle market volatility better.</p> <p> Also, a public issue will require financial disclosures to be made for three years against the current five.</p> <p> <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/sebi\" target=\"_blank\">Sebi </a>also allowed mutual funds and insurers related to the investment banker handling an IPO to participate in the anchor investor category, where shares are allotted on a discretionary basis. The regulator, however, reduced shares available for anchor investors to Rs 20 million from Rs 100 million for so-called SME IPOs.</p> <p> It also tweaked the definition of ‘promoter group’ to include immediate relatives, and revised the threshold for identifying promoter groups from 10 per cent to 20 per cent. The definition of group <a class=\"storyTags\" href=\"https://www.business-standard.com/companies\" target=\"_blank\">companies </a>was also widened.</p> <p> “The changes get rid of a lot of archaic disclosure requirements and help make disclosures in an offer document more meaningful for an investor. A reduction in the time period between advertising the price band and the opening of the issue will help issuers price deals better in a volatile market,” said Aditya Cheriyan, partner, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=khaitan+co\" target=\"_blank\">Khaitan &amp; Co.</a> <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/sebi\" target=\"_blank\">Sebi </a>has also capped the tenure of managing directors at MIIs to a maximum of three terms, with not more than two terms at a single institution. This could mean that BSE Managing Director and Chief Executive Officer Ashish Chauhan may have to step down when his second term ends in November 2022. The regulator also issued an age cap of 75 years and said a second term would only be granted \"subject to a satisfactory performance review.\"</p> <p> <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/sebi\" target=\"_blank\">Sebi </a>has synchronised shareholding norms for all MIIs. So the higher 15 per cent shareholding cap allowed for stock exchanges will now be extended to depositories. The move could be positive for the country's only listed depository CDSL. The regulator also removed the concept of sponsor in case of depositories and gave existing sponsors up to five years to reduce their shareholding to 15 per cent. </p><p>Rules regarding composition of the governing Board and regulatory committees of MIIs have also been tightened to increase transparency. <span></span> <span></span> </p><p> <strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/markets/sebi-tweaks-ipo-norms-intends-to-rationalise-fpi-mf-regulations-118062100678_1.html\" target=\"_blank\">Sebi tweaks IPO norms, intends to rationalise FPI, MF regulations</a></strong></p> <p> <img align=\"left\" alt=\"Sebi Chairman Ajay Tyagi (centre) with Whole Time members G Mahalingam and Madhabi Puri Buch during a press conference in Mumbai on Thursday Photo: Kamlesh Pednekar\" class=\"imgCont\" height=\"382\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/22/full/1529617304-9057.jpg\" title=\"Sebi\" width=\"620\" data-pagespeed-url-hash=\"3607868496\" onload=\"pagespeed.CriticalImages.checkImageForCriticality(this);\"> </p><p> Sebi Chairman Ajay Tyagi (centre) with Whole Time members G Mahalingam and Madhabi Puri Buch during a press conference in Mumbai on Thursday Photo: Kamlesh Pednekar</p> Sebi has modified the definition of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=key+management+personnel\" target=\"_blank\">key management personnel </a>(KMP) of a MII to any person who directly reports to the managing director or the director of the governing board. The move follows recent instances were certain individuals joined in senior positions but in consulting roles to escape the KMP tag. Sebi also changed the minimum net worth requirement for clearing corporations, bringing it down to Rs 1 billion from Rs 3 billion. Besides, Sebi also reviewed the takeover code and buyback regulations to make the language simpler, remove redundant provisions and sync it with the new <a class=\"storyTags\" href=\"https://www.business-standard.com/companies\" target=\"_blank\">Companies </a>Act 2013. The new rules grant additional time for upward revision of the open offer price till one day before the commencement of the tendering period. <p> \"Over the last several years, the capital market saw many changes not only on the regulatory front but also in the structure and size of the market,\"said Prithvi Haldea, founder, Prime Database.</p> <p> The market regulator said it would soon float a discussion paper on governing entities such as chartered accountants (CAs), company secretaries (CS), cost accountants and monitoring agencies that undertake third-party fiduciary assignments under securities law. Sebi has been trying to gain a hold on these entities, which deal with listed <a class=\"storyTags\" href=\"https://www.business-standard.com/companies\" target=\"_blank\">companies </a>involving billions of rupees of public funds.</p> <p> \"The issuance of the consultation paper for amendment of various Sebi regulations in respect to entities undertaking third-party assignments under securities laws was startling. It had been a contentious issue whether Sebi has jurisdiction over such service providers,\" said Yogesh Chande, partner, Shardul Amarchand Mangaldas. <span></span> <span></span> </p><p> <strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/markets/after-near-three-year-probe-sebi-action-in-nse-colo-case-in-a-few-days-118062101082_1.html\" target=\"_blank\">After near three-year probe, Sebi action in NSE colo case in a 'few days'</a></strong></p> <p> Sebi also announced the establishment of the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=national+centre+for+financial+education\" target=\"_blank\">National Centre for Financial Education </a>(NCFE). It will be promoted by Sebi, the Reserve Bank of India (RBI) and other financial sector regulators. The regulator also approved its annual report for 2017-18 and submitted it to the government.</p> <p> The decisions were taken at Sebi's board meeting held on Thursday. The changes to MII regulations were based on a report submitted by a panel headed by R Gandhi, former deputy governor of the Reserve Bank of India, while the tweaks to <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=fund+raising\" target=\"_blank\">fund-raising </a>norms were based on recommendations made by a committee headed by Prime Database's Haldea.</p> <blockquote class=\"blockquoteBG styleQ1\"> <p> <strong>IN A NUTSHELL<span></span> A look at the key decisions</strong><span></span> <span></span> <strong>Raising Funds</strong></p> <ul> <li> IPO pricing announcement to be made two days before issue, against 5 days earlier</li> <li> Promoter definition tweaked</li> </ul> <p> <strong>Taking stock</strong></p> <ul> <li> Recommendations of Gandhi panel on stock exchanges, depositories accepted</li> <li> Shareholding norms eased</li> <li> Cap imposed on tenure of MD and CEO of stock exchanges</li> </ul> <p> <strong>Buyback matters</strong></p> <ul> <li> Takeover code, buyback regulations reviewedLanguage simplifiedRedundant provisions removed</li> <li> Other rules to be looked at</li> </ul> <p> <strong>Licence regime</strong></p> <ul> <li> Sub-broker licences discontinued</li> <li> Existing sub-brokers can choose to be brokers or authorised persons</li> <li> Consultation to regulate entities (CAs, CS and lawyers) undertaking third-party fiduciary assignments under securities law</li> </ul> <p> <strong>Others</strong></p>  </blockquote> <span></span>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "discretionary",
        "raising",
        "related",
        "allotted",
        "mutual"
    ],
    "verbs": [
        "fund",
        "participate",
        "tenure",
        "aid",
        "anchor"
    ]
}