{
    "title": "Insolvency process may boost producer margins, raise capital flow: EY Study",
    "link": "https://www.business-standard.com/article/economy-policy/insolvency-process-may-boost-producer-margins-raise-capital-flow-ey-study-118062101119_1.html",
    "pubDate": "Fri, 22 Jun 2018 06:50:00 +0530",
    "content": "The IBC process has so far seen successful resolution of Bhushan Steel, taken over by Tata Steel and Electrosteel Steels which Vedanta bought over",
    "contentSnippet": "The IBC process has so far seen successful resolution of Bhushan Steel, taken over by Tata Steel and Electrosteel Steels which Vedanta bought over",
    "guid": "https://www.business-standard.com/article/economy-policy/insolvency-process-may-boost-producer-margins-raise-capital-flow-ey-study-118062101119_1.html",
    "isoDate": "2018-06-22T01:20:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.09090909090909091,
        "tokens": [
            "insolvency",
            "process",
            "may",
            "boost",
            "producer",
            "margins",
            "raise",
            "capital",
            "flow",
            "ey",
            "study"
        ],
        "words": [
            "boost"
        ],
        "positive": [
            "boost"
        ],
        "negative": []
    },
    "article": {
        "title": "Insolvency process may boost producer margins, raise capital flow: EY Study",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>The insolvency resolution process currently on in the steel sector will see the exit of some owner management and consolidation in the industry, according to a new report. While the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=committee+of+creditors\" target=\"_blank\">committee of creditors </a>(CoC) seeks to maximize value through higher upfront cash commitments and infusion, current incumbents having financial resources and credibility will be able to consolidate their position in the industry.</p><p>\nIn a report on the Indian metal and mining industry, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ey\" target=\"_blank\">EY </a>and the Indian Chamber of Industry said the advantage of size and scale, the source-to-market networks and supplier-customer relationships will be redrawn, boosting producer margins. “We believe this (the insolvency resolution process) will be transformative for the steel industry. It will trigger wave of consolidation. While domestic players will look for synergy benefits, global players would want a footprint,” said Anjani Kumar, partner and global steel leader, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ey\" target=\"_blank\">EY.</a>\n\n\n</p>\n<!-- INPAGE_BANNER --><p>\nThe <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/ibc\" target=\"_blank\">IBC </a>process for major companies has so far seen successful resolution of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bhushan-steel\" target=\"_blank\">Bhushan Steel </a>that has been taken over by <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/tata-steel\" target=\"_blank\">Tata Steel </a>and Electrosteel Steels which Vedanta has bought over.</p><p>\nThe report said for the global players hitherto struggling to enter India, the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/ibc\" target=\"_blank\">IBC </a>presents a rare opportunity significant enough to re-engage and expand their footprint here relatively quickly, with an already operating business. “Most of them would seek to leverage the asset for further expansion and also play to their sectors of strength. Constantly, evolving material needs of customer segments such as automotive, can be fulfilled by domestic production. The experience of servicing global automotive customers will be quite useful for new entrants in extending their global supply chain arrangements to India,” said the report.</p><p>\nThe report, however, notes that a certain degree of relative imbalance amongst the players will probably emerge. The assets undergoing resolution would emerge stronger with a sustainable financial structure due to significant debt reduction. As compared to this, the businesses which are not in any such financial restructuring would continue with the full debt burden. Given the high interest rates in India and low capital turnover ratios in the industry, this cost differential between the two set of business units is likely to be material differentiator in their profitability going forward<br>Kumar, however, said if the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/ibc\" target=\"_blank\">IBC </a>process played out well, it will augur well for the steel sector. Even for lenders, the unsustainable part of the loan will be reduced or restructured in a manner that it matches the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/cash-flow\" target=\"_blank\">cash flow.</a></p><p>\nThe producing company’s focus will likely be back on research and development, new product development, import substitution, etc. leading to expanded product portfolio produced locally. This will impart stability to sourcing by their customers particularly for import substitutes. Factors like consolidation, stronger set of producers and renewed focus on margins will play out on the producer prices (costs to their customers).</p><p>\nAccording to the report, the intense competition amongst bidders also bodes well for potential write backs of the provisions by lenders. A healthier banking industry, with unlocked flow of capital, will now be in a position to fund the huge investments required to build new capacity for meeting future metals demand for the country.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "capital",
        "taken",
        "successful",
        "far"
    ],
    "verbs": [
        "process",
        "Study",
        "raise",
        "boost",
        "flow",
        "Steel"
    ],
    "nouns": [
        "capital",
        "Insolvency",
        "process",
        "producer",
        "Study",
        "resolution",
        "raise",
        "may",
        "so",
        "boost",
        "far",
        "Steel",
        "Vedanta",
        "flow"
    ]
}