{
    "creator": "Axis Capital",
    "title": "Retain ‘hold’ on HCL Tech; revenue to reverse in FY19",
    "link": "https://www.financialexpress.com/market/retain-hold-on-hcl-tech-revenue-to-reverse-in-fy19/1215496/",
    "pubDate": "Fri, 22 Jun 2018 01:12:53 +05:30",
    "dc:creator": "Axis Capital",
    "content": "HCL Tech continues to invest in new opportunities like IP, niche acquisition and S&#038;M to strengthen client relationship. ",
    "contentSnippet": "HCL Tech continues to invest in new opportunities like IP, niche acquisition and S&M to strengthen client relationship.",
    "guid": "https://www.financialexpress.com/?p=1215496",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-21T19:42:53.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "retain",
            "‘hold’",
            "on",
            "hcl",
            "tech",
            "revenue",
            "to",
            "reverse",
            "in",
            "fy19"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Retain ‘hold’ on HCL Tech; revenue to reverse in FY19",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1215501\" src=\"https://images.financialexpress.com/2018/06/hcl-2.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/hcl-2.jpg 660w, https://images.financialexpress.com/2018/06/hcl-2-300x200.jpg 300w, https://images.financialexpress.com/2018/06/hcl-2-620x413.jpg 620w, https://images.financialexpress.com/2018/06/hcl-2-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Retain ‘hold’ on HCL Tech; revenue to reverse in FY19</figure>\n\t\t\t</section></div><span>\n</span><p>We met the management of HCL Tech to take an update on the business. HCL Tech continues to invest in new opportunities like IP, niche acquisition and S&amp;M to strengthen client relationship. We believe these investments have a gestation of 6-12 months; however, the bottoming out of challenges in IMS, improving deal pipeline, supportive currency, and pedestrian valuation cushion the downside risk. We expect revenue trajectory to improve steadily over H2CY18/H2FY19.<br>HCL Tech’s earnings troughed in Q4FY18, and we expect trajectory to improve led by improved revenue visibility from H2FY19. The possibility of share buyback provides further upside. We retain our HOLD rating but see favourable risk-reward at the current price.</p><span>\n</span><p>The management has increased focus on client mining. The company has put in “Client Partner” responsible for each client above $10 mn bucket. The client partner would be responsible to sell multiple services to the same clients. The company may add ~200 client partners out of total 1,200 sales professionals. The account manager would report to client partner. The focus of client partner would be to increase engagement with clients across service segments. We see the new approach to business would improve the client mining. However, we believe gestation period of this initiative is 6-12 months.</p><span>\n</span><p>We believe stronghold of HCL Tech in IMS integrated with ADM will strengthen SaaS/PaaS services. The company’s strength in IMS has helped win many new logos over 2010-14, but inability to cross sell other services resulted in poor account mining. Integrated services would be critical for cloud migration (taking custom applications to cloud or migrating to SaaS). Moreover, we expect company to work on vertical-led focus to improve client mining. We believe HCL Tech is uniquely positioned to improve on Cloud offerings to clients with integrated service offerings.</p><span>\n</span><p>HCL Tech reported strong growth in IMS early in the cycle (2010-14); however, IMS service line is facing challenges: (i) most exposed to Cloud disruption, (ii) significant pricing pressure on deal renewals, (iii) increasing competitive intensity creates problem for incumbents, (iv) competition from smaller players, given HCLT has little technological edge in segment.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "reverse",
        "new",
        "M"
    ],
    "verbs": [
        "Retain",
        "hold",
        "reverse",
        "invest",
        "strengthen"
    ]
}