{
    "title": "RBI relief unlikely for stressed power sector; govt to work on reform plan",
    "link": "https://www.business-standard.com/article/companies/no-relief-to-power-sector-under-ibc-rbi-s-stand-on-stressed-assets-firm-118062101083_1.html",
    "pubDate": "Fri, 22 Jun 2018 01:59:00 +0530",
    "content": "The Centre is likely to push for debt restructuring and reform schemes to resolve issues plaguing private power producers",
    "contentSnippet": "The Centre is likely to push for debt restructuring and reform schemes to resolve issues plaguing private power producers",
    "guid": "https://www.business-standard.com/article/companies/no-relief-to-power-sector-under-ibc-rbi-s-stand-on-stressed-assets-firm-118062101083_1.html",
    "isoDate": "2018-06-21T20:29:00.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.23076923076923078,
        "tokens": [
            "rbi",
            "relief",
            "unlikely",
            "for",
            "stressed",
            "power",
            "sector",
            "govt",
            "to",
            "work",
            "on",
            "reform",
            "plan"
        ],
        "words": [
            "stressed",
            "unlikely"
        ],
        "positive": [],
        "negative": [
            "stressed",
            "unlikely"
        ]
    },
    "article": {
        "title": "RBI relief unlikely for stressed power sector; govt to work on reform plan",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tThe Reserve Bank of India (RBI) is unlikely to soften its stand on <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/stressed-assets\" target=\"_blank\">stressed assets </a>in the power sector, which is asking for a special dispensation under the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/insolvency-and-bankruptcy-code\" target=\"_blank\">Insolvency and Bankruptcy Code </a>(IBC).</p>\n<p>\n\tThe Centre is likely to push for debt restructuring and reform schemes to resolve issues plaguing private power producers.</p>\n<p>\n\tAfter chairing a meeting with stakeholders in the power sector, along with officials of the ministries of coal and power and an <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rbi\" target=\"_blank\">RBI </a>representative, Rajiv Kumar, secretary, Department of Financial Services, said the central bank had reiterated that its February circular provided enough room to restructure stressed power assets and no special dispensation was needed.</p>\n<p>\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rbi\" target=\"_blank\">RBI </a>in February this year mandated banks to classify even one day’s delay in debt servicing as default. The notification mandates resolution proceedings against stressed accounts to be completed in 180 days.</p>\n<p>\n\t“The <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rbi\" target=\"_blank\">RBI </a>said the circular did not not stop restructuring of stressed power assets even if there was a default, and restructuring is possible within the timeframe,” Kumar told the media after the meeting.</p>\n<p>\n\tThe Union power ministry had earlier urged the RBI to provide extension to the sector after R K Singh, Minister of State for Power and New &amp; Renewable Energy, had called the RBI resolution for bad loans “impractical” and demanded changes.</p>\n<p>\n\tRepresentatives of the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/power-sector\" target=\"_blank\">power sector </a>asked the government to consider the time frame needed for any reform plan for <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/stressed-assets\" target=\"_blank\">stressed assets.</a>  <br><a href=\"https://mybs.in/2VndADS\" target=\"_blank\"><strong>ALSO READ: Government to ensure coal availability to power plants: Piyush Goyal</strong></a></p>\n<p>\n\t“The heavily regulated nature of the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/power-sector\" target=\"_blank\">power sector </a>and the fact that the present crisis is caused more by externalities, the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/power-sector\" target=\"_blank\">power sector </a>would need a differential resolution path. The relaxations would provide a window for chalking out a time-bound action plan required to salvage a significant portion of the power portfolio,” said A K Khurana, director general, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=association+of+power+producers\" target=\"_blank\">Association of Power Producers </a>(APP).</p>\n<p>\n\tCurrently, three plans are being worked out for resolving stress in the power sector.</p>\n<p>\n\tState Bank of India (SBI), which has the highest exposure to the sector, is planning to select assets for its pilot scheme wherein it, along with a funding agency, will take over the debt, hire an operations and management (O&amp;M) company, and sell them later.</p>\n<p>\n\tSBI has shortlisted 11 power projects to which it has lent to start the process.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/power-finance-corporation\" target=\"_blank\">Power Finance Corporation </a>(PFC), on the other hand, has invited an expression of interest (EoI) for three assets and has received an initial interest from marquee global investors.</p>\n<p>\n\tApart from this, PFC has also invited bids for a pilot scheme to procure 2,500 megawatt (Mw) from <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/stressed-assets\" target=\"_blank\">stressed assets </a>at pooled rates. <br></p>\n<!-- INPAGE_BANNER -->\n\t<br><a href=\"http://mybs.in/2VmshMF\" target=\"_blank\"><strong>ALSO READ: Bankers, beware! India stares at a power debacle 20 times bigger than Enron</strong></a>\n<p>\n\tAnother sector lender, REC, which has a minimal exposure to power generation assets, is also planning a bail-out scheme at the behest of the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/ministry-of-power\" target=\"_blank\">Ministry of Power.</a></p>\n<p>\n\tIt is learnt that REC will form a special purpose vehicle to take over the debts of stressed assets and issue bonds against the same.</p>\n<p>\n\tOf the 40,000 Mw identified by the finance ministry as stressed, around 10,000 Mw are without any power-purchase agreements. Stressed assets of around 8,500 Mw have made no significant progress, raising questions over their award process. Resolution is possible in another 11,000 Mw.<br></p><p>\n\t\t<strong>IPPAI petitions against RBI circular</strong></p>\n\t<p>\n\t\tIndependent Power Producers Association of India (IPPAI), which petitioned in the Allahabad High Court against the RBI February circular, was also one of the participants in the meeting. The industry lobby group had a stretched list of demands from the government – from creating a corpus for bailing out private players to creating a task force, removing cost plus regime under which state owned NTPC is awarded projects. IPPAI also blamed NTPC for gold plating their tariff and “backdoor entry” in the sector through government support. It asked the government to make room for private players by removing “unterminable PPA” of NTPC.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "stressed",
        "likely",
        "private",
        "unlikely"
    ],
    "nouns": [
        "sector",
        "resolve",
        "work",
        "plan",
        "Centre",
        "reform",
        "power",
        "private",
        "RBI",
        "relief",
        "push",
        "debt"
    ],
    "verbs": [
        "resolve",
        "work",
        "plan",
        "Centre",
        "reform",
        "power",
        "push"
    ]
}