{
    "title": "Bajaj Finance surpasses Axis Bank in market-cap ranking",
    "link": "https://www.business-standard.com/article/markets/bajaj-finance-surpasses-axis-bank-in-market-cap-ranking-118062200490_1.html",
    "pubDate": "Fri, 22 Jun 2018 14:42:00 +0530",
    "content": "At 02:37 pm; with market-cap of Rs 1,345.85 billion, Bajaj Finance, the non-banking finance company, overtook the Axis Bank, which has market-cap of Rs 1,340.18 billion, the BSE data shows",
    "contentSnippet": "At 02:37 pm; with market-cap of Rs 1,345.85 billion, Bajaj Finance, the non-banking finance company, overtook the Axis Bank, which has market-cap of Rs 1,340.18 billion, the BSE data shows",
    "guid": "https://www.business-standard.com/article/markets/bajaj-finance-surpasses-axis-bank-in-market-cap-ranking-118062200490_1.html",
    "isoDate": "2018-06-22T09:12:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "bajaj",
            "finance",
            "surpasses",
            "axis",
            "bank",
            "in",
            "market-cap",
            "ranking"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Bajaj Finance surpasses Axis Bank in market-cap ranking",
        "content": "<div><span>\n\t\n\tBajaj Finance, which hit a new high of Rs 2,330, up 3% on the BSE in late noon deal on Friday, has surpasses private sector lender Axis Bank in market capitalisation (market-cap) ranking.</span><p>\n\tAt 02:37 pm; with market-cap of Rs 1,345.85 billion, Bajaj Finance, the non-banking finance company, overtook the Axis Bank, which has market-cap of Rs 1,340.18 billion, the BSE data shows. Axis Bank was trading 2% higher at Rs 522, as compared to 0.37% rise in the S&amp;P BSE Sensex.\n\n\n</p><span>\n</span><!-- INPAGE_BANNER --><p>\n\tThus far in the calendar year 2018 (CY18), Bajaj Finance has outperformed the market by surging 33% as compared to 4% rise in the S&amp;P BSE Sensex. Axis Bank has underperformed the market by falling 8% during the period.</p><p>\n\tCurrently, Bajaj Finance stood at number 18 position in overall market-cap ranking, has climbed 11 positions thus far in CY18. It surpassed Power Grid Corporation, Asian Paints, Bharat Petroleum Corporation, UltraTech Cement, Vedanta, HCL Technologies, Tata Motors, Hindustan Zinc, Sun Pharmaceutical Industries and Wipro during the period.</p><p>\n\tSince May 16, post Q4FY18 results, Bajaj Finance has surged 21% against a marginal 0.13% rise in the Sensex. The company had reported a better than expected 60% year on year jumped in its standalone net profit at Rs 7.21 billion in March quarter (Q4FY18). Assets quality of the company improves during the quarter with gross non-performing assets (NPA) and net NPA as of March 31, 2018 stood at 1.48% and 0.38% respectively.</p><p>\n\tThe analysts remain constructive on the stock considering robust growth visibility emanating from superior management and diversified product franchise. Any pressure on margins from competition and asset mix should get mitigated by gains derived from better cost productivity, according to brokerage firm IIFL Wealth Research.</p><p>\n\tDuring the same period, post Q4FY18 results, Axis Bank was down 5%, after the bank reported its first net loss of Rs 21.8 billion for Q4FY18, as NPAs soared and provisions for bad loans surged three times over the corresponding quarter last year.</p><p>\n\tHowever, most of the local brokerage houses maintain ‘buy’ or ‘accumulate’ rating on the Axis Bank on expectation of sustained return on assets (ROA) expansion over the next 24 months to drive a multiple expansion as asset quality distractions recede.</p></div>"
    },
    "adjectives": [
        "billion",
        "ranking",
        "37",
        "85",
        "18"
    ],
    "nouns": [
        "Bank",
        "banking",
        "Finance",
        "finance",
        "billion",
        "market",
        "ranking",
        "Axis",
        "cap",
        "At",
        "pm",
        "company",
        "18",
        "BSE",
        "data"
    ],
    "verbs": [
        "Bank",
        "Finance",
        "finance",
        "market",
        "cap",
        "company"
    ]
}