{
    "creator": "PTI",
    "title": "Sweltering heat pushes peak power demand in Delhi to all time high of 6,934 MW",
    "link": "https://www.financialexpress.com/industry/sweltering-heat-pushes-peak-power-demand-in-delhi-to-all-time-high-of-6934-mw/1198950/",
    "pubDate": "Fri, 08 Jun 2018 18:43:40 +05:30",
    "dc:creator": "PTI",
    "content": "Amid sweltering heat, the peak electricity demand in the national capital soared to an all time high of 6,934 MW today, Delhi Power Minister Satyendar Jain said. ",
    "contentSnippet": "Amid sweltering heat, the peak electricity demand in the national capital soared to an all time high of 6,934 MW today, Delhi Power Minister Satyendar Jain said.",
    "guid": "https://www.financialexpress.com/?p=1198950",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-08T13:13:40.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.06666666666666667,
        "tokens": [
            "sweltering",
            "heat",
            "pushes",
            "peak",
            "power",
            "demand",
            "in",
            "delhi",
            "to",
            "all",
            "time",
            "high",
            "of",
            "6934",
            "mw"
        ],
        "words": [
            "demand"
        ],
        "positive": [],
        "negative": [
            "demand"
        ]
    },
    "article": {
        "title": "Sweltering heat pushes peak power demand in Delhi to all time high of 6,934 MW",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1199003\" src=\"https://images.financialexpress.com/2018/06/cats-539.jpg\" alt=\"Satyendar Jain, demand of electricity, power demand in delhi,&nbsp;Delhi Power Minister,&nbsp;BSES discom\" srcset=\"https://images.financialexpress.com/2018/06/cats-539.jpg 660w, https://images.financialexpress.com/2018/06/cats-539-300x200.jpg 300w, https://images.financialexpress.com/2018/06/cats-539-620x413.jpg 620w, https://images.financialexpress.com/2018/06/cats-539-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The power department and distribution companies of the Delhi government had expected the peak demand to breach 7,000 MW mark in June this year. (PTI)</figure>\n\t\t\t</section></div><span>\n</span><p>Amid sweltering heat, the peak electricity demand in the national capital soared to an all time high of 6,934 MW today, Delhi Power Minister Satyendar Jain said. On June 1, the peak power demand had soared to 6,651 MW breaking the record of 6,526 MW on June 6, 2017. “Highest electricity load ever of 6934 MW At 15:28:33 Hrs today in Delhi. May cross 7000 MW this year (sic),” Delhi’s Power Minister Satyendar Jain tweeted. This is the fourth time in the current month that last year’s all-time high record of peak power demand of 6,526 MW has been broken, a spokesperson of power discom BSES said.</p><span>\n</span><p>It was 6,562 MW on June 5 and 6,568 MW on June 7, other than today’s highest level of 6,934 MW and previous high of 6,651 MW on June 1, he said. According to Delhi State Load Despatch Centre figures, the maximum load today reached 6,934 MW at 3.28 pm. Yesterday, the peak electricity demand was 6,568 MW.</p><span>\n</span><p>The power department and distribution companies of the Delhi government had expected the peak demand to breach 7,000 MW mark in June this year. Jain had earlier predicted 7,000 MW power demand saying enough electricity was available to meet the rising demand.</p><span>\n</span><p>Announcing the action plan for electricity supply arrangements in summer months, Jain had in March said, “We have enough backhand arrangements to meet the power demand that is expected to soar up to a historic 7,000 MW level in June this year.” This year, the peak power demand crossed the 6,000 MW mark eight times, the BSES spokesperson said.</p><span>\n</span><p>Power demand had crossed the 6,000 MW only twice (6,021 MW on May 16 and 6,001 on May 26, in 2017. In 2016 too, the peak power demand had crossed the 6,000 MW twice (6,044 on May 19 and 6,188 on May 20). The fact that the city’s power demand crossed the 6,600 MW shows the robustness of the capital’s distribution and transmission system, which has been able to measure up, the spokesperson said.</p><span>\n</span><p>The peak power demand in BSES discom BRPL areas — South and West Delhi — had reached 2,745 MW during the summers of 2017 and is expected to cross 2,880 MW this year. In BYPL’s areas of East and Central Delhi, the peak power demand which had reached 1,469 MW last year is expected to touch around 1,670 MW, he said. The <a target=\"_blank\" href=\"http://www.financialexpress.com/auto/new-cars/tata/\">Tata</a> Power DDL, which supplies to north and northwest Delhi, expects peak demand to touch 1,850 MW and said it has prior arrangements of meeting up to 2,200 MW power demand.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "high",
        "Sweltering",
        "sweltering",
        "national",
        "capital",
        "Jain"
    ],
    "nouns": [
        "high",
        "heat",
        "demand",
        "electricity",
        "peak",
        "power",
        "Power",
        "Delhi",
        "time",
        "national",
        "capital",
        "today",
        "Minister"
    ],
    "verbs": [
        "heat",
        "demand",
        "peak",
        "power",
        "Power",
        "time",
        "Minister"
    ]
}