{
    "title": "IDBI, LIC boards to decide stake deal, won't micromanage: FinMin official",
    "link": "https://www.business-standard.com/article/finance/idbi-lic-stake-deal-finmin-official-says-boards-to-take-a-call-118062500463_1.html",
    "pubDate": "Mon, 25 Jun 2018 15:38:00 +0530",
    "content": "The media reports also said the government had sought the views of insurance regulator IRDAI and markets watchdog Sebi on the move",
    "contentSnippet": "The media reports also said the government had sought the views of insurance regulator IRDAI and markets watchdog Sebi on the move",
    "guid": "https://www.business-standard.com/article/finance/idbi-lic-stake-deal-finmin-official-says-boards-to-take-a-call-118062500463_1.html",
    "isoDate": "2018-06-25T10:08:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "idbi",
            "lic",
            "boards",
            "to",
            "decide",
            "stake",
            "deal",
            "won't",
            "micromanage",
            "finmin",
            "official"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "IDBI, LIC boards to decide stake deal, won't micromanage: FinMin official",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tThe government on Monday sounded evasive about the media reports that it was planning to ask LIC to take a controlling stake in the crippled IDBI Bank, saying the boards of the respective entities will take a call on the matter.</p>\n<p>\n\t\"Both IDBI Bank and LIC are independent organisations. We have left all the decisions to bank boards and we are not going to micromanage them,\" a senior finance ministry official told reporters on the sidelines of the two-day annual summit of the Asian Infrastructure Investment Bank.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tWhen pressed that both the entities are government- owned, the official quipped does that mean there cannot have business relationship between two government entities?</p>\n\n<p>\n\tThere have been reports that having failed to a get a buyer for its stake in IDBI Bank, the government might ask LIC, which already owns over 10 per cent in the infra-lender turned commercial bank, to take at least 40 per cent more in it, something it had done with Axis Bank in the past.</p>\n<p>\n\tThe media reports also said the government had sought the views of insurance regulator IRDAI and markets watchdog Sebi on the move. IRDAI does not allow LIC or any other insurer to own more than 15 per cent in any company.</p>\n<p>\n\tOn the Sunil Mehta committee, set up to draft guidelines for a bad bank, the official said within a short period the panel has \"come up with a fantastic report\".</p>\n<p>\n\tInterim finance minister Piyush Goyal on June 8 had announced setting up of a committee under the chairmanship of Punjab National Bank's non-executive chairman Sunil Mehta to make a draft on setting up an asset reconstruction or an asset management company for faster resolution of bad loans.</p>\n<p>\n\tOn the special dispensation that power companies have been demanding to tide over the bad debt problem, the official said there is an Allahabad High Court judgement and we have to respect that but added quickly that the banking secretary will sit down to find a solution.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "official",
        "sought",
        "won"
    ],
    "verbs": [
        "stake",
        "decide",
        "deal",
        "move"
    ],
    "nouns": [
        "stake",
        "government",
        "insurance",
        "regulator",
        "boards",
        "official",
        "deal",
        "watchdog",
        "move",
        "won"
    ]
}