{
    "title": "Mining woes: Karnataka iron ore companies unable to clear stocks",
    "link": "https://www.business-standard.com/article/economy-policy/iron-ore-accumulates-at-karnataka-mines-as-steel-cos-opt-for-imported-ore-118061000402_1.html",
    "pubDate": "Mon, 11 Jun 2018 01:16:00 +0530",
    "content": "Mining industry's apex body, Federation of Indian Mineral Industries (FIMI), has decided to move the Supreme Court with an app",
    "contentSnippet": "Mining industry's apex body, Federation of Indian Mineral Industries (FIMI), has decided to move the Supreme Court with an app",
    "guid": "https://www.business-standard.com/article/economy-policy/iron-ore-accumulates-at-karnataka-mines-as-steel-cos-opt-for-imported-ore-118061000402_1.html",
    "isoDate": "2018-06-10T19:46:00.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.1,
        "tokens": [
            "mining",
            "woes",
            "karnataka",
            "iron",
            "ore",
            "companies",
            "unable",
            "to",
            "clear",
            "stocks"
        ],
        "words": [
            "clear",
            "unable"
        ],
        "positive": [
            "clear"
        ],
        "negative": [
            "unable"
        ]
    },
    "article": {
        "title": "Mining woes: Karnataka iron ore companies unable to clear stocks",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tMining industry’s apex body, Federation of Indian Mineral Industries (FIMI), has decided to move the Supreme Court with an appeal to allow Karnataka’s iron mining industry to sell ore to more players apart from manufacturers to clear their stock. The decision comes after it was found that some large steel companies in the state prefer to buy from Odisha or even import it at a higher price, rather than buying through auctions conducted in the state.</p>\n<p>\n\tAs the apex court has started relaxing norms for <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=iron+ore\" target=\"_blank\">iron ore </a>mining in <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=karnataka\" target=\"_blank\">Karnataka </a>after banning exports from state to check malpractices, the mining industry is not able to raise production despite a good demand because many steel mills in the state are not listing their requirements. Now the state's mines want to broaden their base for selling ore without which they find it difficult to sell all their output to steel mills. The main problem is that steel manufacturers in <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=karnataka\" target=\"_blank\">Karnataka </a>do not have any restrictions and can procure raw material for steel from any part of the country, or even have it imported. However, according to the current Supreme Court directives, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=karnataka\" target=\"_blank\">Karnataka </a><a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=iron+ore\" target=\"_blank\">iron ore </a>miners are allowed to sell only via the e-auction platform.</p>\n<p>\n\tFIMI, the apex body which promotes interests of mining and mineral-based industries, will be going to the Supreme Court, asking for a relaxation of norms for <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=iron+ore\" target=\"_blank\">iron ore </a>miners of Karnataka to sell directly outside the state. <br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/statsguru-construction-activity-rises-sharply-in-fy18-agri-mining-fall-118060300615_1.html\" target=\"_blank\">Statsguru: Construction activity rises sharply in FY18; agri, mining fall</a></strong></p>\n<p>\n\t“Karnataka iron ore miners do not have a level playing field. Due to Supreme Court directives which do not allow selling of ore directly (without e-auction platform), the customer base is poor for miners. We will, therefore, approach the court asking them to allow exports of ore,” said H N Khayyumali, Director, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=fimi\" target=\"_blank\">FIMI </a>(South).</p>\n<p>\n\tMeanwhile, industry officials said that despite a strong demand for ore, Karnataka was facing a glut at mine sites as more and more manufacturers were opting to procure ore from outside the state.<br></p>\n<!-- INPAGE_BANNER -->\n\t<br>In December last year, the Supreme Court raised the iron ore output cap to 35 million tonnes from 30 million tonnes it had imposed in 2011. The ruling was aimed at helping steel mills across Karnataka to receive more raw material and raising operating capacity. According to recent e-auction data, both NMDC and Anil Agarwal-led <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=vedanta\" target=\"_blank\">Vedanta </a>were unable to sell sizeable quantities in April as well as May - the peak consumption period of iron ore when steel making is in full swing.<p>\n\t\t<img align=\"left\" alt=\"Mining woes: Karnataka iron ore companies unable to clear stocks\" class=\"imgCont\" height=\"265\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/11/full/1528660090-9043.jpg\" title=\"Mining woes: Karnataka iron ore companies unable to clear stocks\" width=\"399\"></p>\n<p>\n\t“There is no enough buying happening at e-auction from major players. At this rate, we will have to stop production as there is already a lot of accumulation at the mine site and no room to keep the ore,” said <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=vedanta\" target=\"_blank\">Vedanta </a>sources close to the development.</p>\n<p>\n\tSajjan Jindal-led <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=jsw+steel\" target=\"_blank\">JSW Steel </a>is the largest buyer of Karnataka iron ore as its 12 million tonne steel plant is located at Vijaynagar, said industry officials.</p>\n<p>\n\t“We usually pick up about 60-80 percent of e-auctioned iron ore of Karnataka,” said Dr. Vinod Nowal, Deputy Managing Director of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=jsw+steel\" target=\"_blank\">JSW Steel.</a> “We are hoping that the entire 35 million tonne production starts from FY20. Currently, it is only 29-30 million tonne so we are importing and also getting ore from Odisha,” explained Nowal.</p>\n<p>\n\tIron ore procured from within Karnataka would cost steel manufacturers close to Rs 3,000 per tonne as against imported ore which costs between Rs 4,000-4,500 per tonne, said industry officials.</p>\n<p>\n\tThirteen mining lease-holders in Karnataka had filed a petition before the Supreme Court in May 2016, seeking an enhancement of the permissible annual iron ore production limit. Based on instructions issued by a court-appointed body, the state government in August 2017 asked its department of mines and geology to evaluate the proposals.</p>\n<p>\n\tAccording to industry sources, the total potential for iron ore mining in Karnataka is 50-60 million tonnes a year.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "verbs": [
        "move",
        "Court",
        "clear",
        "iron",
        "body"
    ]
}