{
    "title": "Monsoon effect: Farm input companies seen improving performance",
    "link": "https://www.business-standard.com/article/markets/monsoon-effect-farm-input-companies-seen-improving-performance-118061100032_1.html",
    "pubDate": "Mon, 11 Jun 2018 07:03:00 +0530",
    "content": "The consumption of agrochemicals in the domestic market remained subdued during the fourth quarter of 2017-18",
    "contentSnippet": "The consumption of agrochemicals in the domestic market remained subdued during the fourth quarter of 2017-18",
    "guid": "https://www.business-standard.com/article/markets/monsoon-effect-farm-input-companies-seen-improving-performance-118061100032_1.html",
    "isoDate": "2018-06-11T01:33:00.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.25,
        "tokens": [
            "monsoon",
            "effect",
            "farm",
            "input",
            "companies",
            "seen",
            "improving",
            "performance"
        ],
        "words": [
            "improving"
        ],
        "positive": [
            "improving"
        ],
        "negative": []
    },
    "article": {
        "title": "Monsoon effect: Farm input companies seen improving performance",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tThe financial performance of agri input companies is likely to improve during the first half of 2018-19 owing to forecasts that the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/monsoon\" target=\"_blank\">monsoon </a>this year will be normal.</p>\n<p>\n\tTheir sales and profits were under pressure in the fourth quarter of 2017-18 because of a sharp increase in the prices of raw material and weak lean season demand.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tCompanies such as Dhanuka Agritech, PI Industries and Rallis India posted declines in their sales and profits during January-March 2017-18.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=united+phosphorus\" target=\"_blank\">United Phosphorus </a>reported a 35 per cent decline in its profit after tax in the January-March 2018 quarter.</p>\n<p>\n\tBoth dealers and consumers have stayed away so far from building inventories because they apprehend a decline in the prices of agri inputs. Now, with the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/monsoon\" target=\"_blank\">monsoon </a>round the corner, the top line and bottom line of agri input companies are set to improve, with the September quarter expected to be better than April-June.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/india-s-agriculture-growth-slips-to-4-5-in-q4-on-higher-base-118053101649_1.html\" target=\"_blank\">India's agriculture growth slips to 4.5% in Q4 on higher base</a></strong></p>\n<p>\n\t“During the demand season, agri input companies will be able to pass on the raw material price hike to consumers. Also, rain in the current <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/monsoon\" target=\"_blank\">monsoon </a>is expected to spread towards the end of June. Hence, the June quarter is considered to be lean.</p>\n<p>\n\tThe weather scenario becomes clear during the September quarter with increased demand for agri input. Hence, the September quarter is expected to better in terms of sales and profitability,” said M K Dhanuka, managing director, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/dhanuka-agritech\" target=\"_blank\">Dhanuka Agritech.</a></p>\n<p>\n\tNormally the demand for seeds, fertilisers and agro chemicals depends on the extent of floods, drought or pest attacks. Also, the demand for agri inputs increases in a normal monsoon in anticipation of a rise in the sowing area.</p>\n<p>\n\tPaddy, cotton, pulses, soya bean, maize, etc are kharif crops sown when the rains start.</p>\n<p>\n\tMeanwhile, the consumption of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/agrochemicals\" target=\"_blank\">agrochemicals </a>in the domestic market remained subdued during the fourth quarter of 2017-18. This was because of fewer pest attacks on account of favourable weather conditions.</p>\n<p>\n\t\t<img align=\"left\" alt=\"Chart\" class=\"imgCont\" height=\"342\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/11/full/1528662250-5573.jpg\" title=\"Chart\" width=\"555\"></p>\n\tAlso, the bumper kharif harvest kept prices of many crops low and consequently hit farmers’ profitability, which restricted their ability to purchase high-end specialty <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/agrochemicals\" target=\"_blank\">agrochemicals.</a>\n<p>\n\t“Most agrochemical companies reported contraction in EBITDA (earnings before interest, taxation, depreciation and amortisation) margins during the March quarter due to inflationary pressure on raw material.</p>\n<p>\n\tThe cost of raw material continued to increase in the first quarter of this financial year and is likely to stabilise only from the middle of the second quarter,” said Pratik Tholiya, an analyst with Emkay Global Financial Services.</p>\n<p>\n\tFor the fertiliser sector, however, rising prices of phosphoric acid and natural gas, coupled with rupee depreciation, are likely to put pressure on margins. Consequently, most companies have hiked prices of complex fertilisers by Rs 2,000-3,000 a tonne.</p>\n<p>\n\t“Subsidy disbursement was quick in 2017-18. However, under the new direct benefit transfer (DBT) regime, we expect healthy volume growth in 2018-19,” said Tholiya in a report.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "improving",
        "domestic",
        "subdued",
        "fourth",
        "18"
    ],
    "nouns": [
        "consumption",
        "performance",
        "effect",
        "Monsoon",
        "market",
        "quarter",
        "Farm",
        "input",
        "domestic",
        "fourth",
        "18"
    ],
    "verbs": [
        "effect",
        "market",
        "quarter",
        "Farm",
        "input"
    ]
}