{
    "title": "Short-term outlook for the market remains positive: Devang Shah",
    "link": "https://www.business-standard.com/article/markets/short-term-outlook-for-the-market-remains-positive-devang-shah-118061800070_1.html",
    "pubDate": "Mon, 18 Jun 2018 06:41:00 +0530",
    "content": "Nifty outlook and top trading ideas by Devang Shah",
    "contentSnippet": "Nifty outlook and top trading ideas by Devang Shah",
    "guid": "https://www.business-standard.com/article/markets/short-term-outlook-for-the-market-remains-positive-devang-shah-118061800070_1.html",
    "isoDate": "2018-06-18T01:11:00.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.2222222222222222,
        "tokens": [
            "short-term",
            "outlook",
            "for",
            "the",
            "market",
            "remains",
            "positive",
            "devang",
            "shah"
        ],
        "words": [
            "positive"
        ],
        "positive": [
            "positive"
        ],
        "negative": []
    },
    "article": {
        "title": "Short-term outlook for the market remains positive: Devang Shah",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\t<strong><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nifty\" target=\"_blank\">NIFTY </a>     </strong></p>\n<p>\n\t<strong>CLOSE- 10,817.70 (15.06.2018)</strong></p>\n<p>\n\tMarket closed 4th concecutive week in positive territory. It further consolidated in narrow range during the week. <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nifty\" target=\"_blank\">Nifty </a>is still consolidating in narow range of 10,400-10,900 levels in short term &amp; we are trading near upper end of range. Able to break this range on upside will fianlly confirm rally towards short term targets levels as mentioned below.Any kind of decline or short term consolidation is stock specific buying opportunity till short term reverses. One can expect higher levels targets as mentioend below in short to medium term.</p>\n<p>\n\tIt looks like wave-II Consolidation as per daily chart. One should wait for upper end of range on <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nifty\" target=\"_blank\">nifty </a>around 10,900 levels to finally conclude as breakout &amp; begining of wave-III upward rally towards higher levels targets as mentioned below in short to medium term. Till that it may spend some more time in this range till it reverses.</p>\n<p>\n\tShort-term outlook for the market remains positive till Nifty trades above 10417 levels and expecting targets in the range of 10,900-11,000 levels in short term. Medium term outlook for the market remains positive till Nifty trades above 8,968 levels and expecting targets in the range of 120,00-12,200 levels in medium term.</p>\n<p>\n\tBroader market particularly Midcap &amp; small cap Indices, finally hold lower end support levels as mentioned earlier &amp; it started to rally from these levels. Sustainability with positive mometum  of broadermarket rally will be an additional confirmation of short term trend. One should watchout its behavior at this crucial levels of market.</p>\n<p>\n\tNifty Bank closed weekly in negative territory. Its also consolidated in narrow rnage after 5 wave advance rally in short term.One can expect higher levels targets around 27,700 levels till it holds crucial support of 25550 levels in short term &amp; further above 29,600-30,000 levels in medium term. Any kind of decline is also buying opportunity for bank nifty for short to medium term perspectives.</p>\n<p>\n\t10,600-10,700 &amp; 11,000 levels is strong support &amp; resistance levels range respectively based on option open interest data for current month series. By looking at current structure, I feel market is going to surpass all time high soon on main indices &amp; this rally will have time wise consolidation rather than price wise correction in short term. Any kind of such short term correction or consolidation is buying opportunity for medium to long term Investment perspectives till medium term reverses.</p>\n<p>\n\tMomentum indicators Daily KST are in BUY &amp; DAILY MACD both are in BUY supporting short term trend. One should be stock specific &amp; follow the trend with trail stop loss levels till it reverses. Close below short term reversal levels will lead to sharp correction till 10,300-10,200 levels on nifty &amp; 33600 levels on Sensex in short term.</p>\n<p>\n\t<strong>Stock Picks: </strong></p>\n<p>\n\t<strong>BATA INDIA- BUY</strong></p>\n<p>\n\t<strong>CLOSE – Rs- 781</strong></p>\n<p>\n\t<strong>TARGET – Rs 815-830</strong><br></p>\n<p>\n\tBATA closed the weekly in positive territory. Its at the verge of brakout from raneg on upside. It’s trading above 20 DMA. Its daily momentum indicators are in BUY. Risk reward is favorable to BUY at current levels. One can BUY with a stop loss of Rs-740 for the target of Rs 815/830 levels in short-term.</p>\n<p>\n\t<strong>TATA CHEMICALS- BUY</strong></p>\n<p>\n\t<strong>CLOSE – Rs- 739.55</strong></p>\n<p>\n\t<strong>TARGET – Rs 770/780</strong><br></p>\n<p>\n\tTATA CHEM closed the weekly in positive territory. It’s consolidating in narrow range. Its daily momentum indicators are in BUY. Its trading above 20 DMA.Risk reward is favorable to BUY at current levels. One can BUY with a stop loss of Rs-710 for the target of Rs 770/780 levels in short-term.</p>\n<p>\n\t<strong>PIDILITE- BUY</strong></p>\n<p>\n\t<strong>CLOSE – Rs- 1086</strong></p>\n<p>\n\t<strong>TARGET – Rs 1125-1150</strong><br></p>\n<!-- INPAGE_BANNER -->\n\t \n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/pidilite\" target=\"_blank\">PIDILITE </a>closed the weekly in positive territory. Its looks like end of short term correction. Its daily momentum indicators are in BUY. Its trading above 20 DMA.Risk reward is favorable to BUY at current levels. One can BUY with a stop loss of Rs-1047 for the target of Rs 1125-1150 levels in short-term.</p>\n<p>\n\t<strong>GODREJ INDUSTRIES- BUY</strong></p>\n<p>\n\t<strong>CLOSE – Rs- 613.80</strong></p>\n<p>\n\t<strong>TARGET – Rs 630-640</strong><br></p>\n<p>\n\tGODREJ IND closed the weekly in positive territory. Its outperforming in short term. Its daily momentum indicators are in BUY. Its trading above 20 DMA.Risk reward is favorable to BUY at current levels. One can BUY with a stop loss of Rs-597 for the target of Rs 630-640 levels in short-term.</p>\n<p>\n\tDevang Shah: The author of www.trendtechno.com (Trade with Trend) and an independent market analyst.</p>\n<p>\n\tDisclaimer: The analyst may / may not have a position in the scrips mentioned above</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "top",
        "Short",
        "positive",
        "Nifty"
    ],
    "nouns": [
        "market",
        "top",
        "trading",
        "Shah",
        "Short",
        "term",
        "outlook",
        "remains",
        "positive"
    ],
    "verbs": [
        "market",
        "top",
        "Short",
        "term"
    ]
}