{
    "creator": "Sudhir Chowdhary",
    "title": "Building a safe ride experience is a shared responsibility",
    "link": "https://www.financialexpress.com/industry/building-a-safe-ride-experience-is-a-shared-responsibility/1200861/",
    "pubDate": "Mon, 11 Jun 2018 02:54:38 +05:30",
    "dc:creator": "Sudhir Chowdhary",
    "content": "App-based cab companies may have revolutionised city transport by combining modern technology with flexible payment and pricing strategies, but there are growing concerns around passenger safety.",
    "contentSnippet": "App-based cab companies may have revolutionised city transport by combining modern technology with flexible payment and pricing strategies, but there are growing concerns around passenger safety.",
    "guid": "https://www.financialexpress.com/?p=1200861",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-10T21:24:38.000Z",
    "sentiment": {
        "score": 3,
        "comparative": 0.3333333333333333,
        "tokens": [
            "building",
            "a",
            "safe",
            "ride",
            "experience",
            "is",
            "a",
            "shared",
            "responsibility"
        ],
        "words": [
            "responsibility",
            "shared",
            "safe"
        ],
        "positive": [
            "responsibility",
            "shared",
            "safe"
        ],
        "negative": []
    },
    "article": {
        "title": "Building a safe ride experience is a shared responsibility",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1200864\" src=\"https://images.financialexpress.com/2018/06/uber-3.jpg\" alt=\"uber, uber auto, uber auto services, uber launches auto, uber new service, uber cabs, uber taxis, uber new feature, uber update, uber upgrade, uber india, uber new ride, uber latest ride, uber app update\" srcset=\"https://images.financialexpress.com/2018/06/uber-3.jpg 660w, https://images.financialexpress.com/2018/06/uber-3-300x200.jpg 300w, https://images.financialexpress.com/2018/06/uber-3-620x413.jpg 620w, https://images.financialexpress.com/2018/06/uber-3-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Pradeep Parameswaran, Head, Operations, Uber India &amp; South Asia.</figure>\n\t\t\t</section></div><span>\n</span><p>App-based cab companies may have revolutionised city transport by combining modern technology with flexible payment and pricing strategies, but there are growing concerns around passenger safety. In recent times, there have been growing incidents concerning the safety of passengers, especially women. Building a safe ride experience is a shared responsibility and requires concerted efforts, said Pradeep Parameswaran, head of operations at Uber India &amp; South Asia. He spoke to Sudhir Chowdhary on the steps the San Francisco-based firm has taken to keep riders in India safe. Excerpts:</p><span>\n</span><p><strong>What steps have been taken by Uber to ensure rider safety?</strong></p><span>\n</span><p>Technologies like Uber provide an opportunity to improve the safety of riders and driver partners before, during and after every ride. Before the ride begins, a rider can double-check the licence plate, driver partner’s name and photo shown in the app. Riders are able to see a driver partner’s rating to determine if they wish to proceed with a journey. Drivers partners are also periodically required to take a selfie before going online to drive with Uber to make sure the driver partner on the account matches the one behind the wheel. If the face doesn’t match, we block the driver partner from accepting rides.</p><span>\n</span><p>During the trip, a rider can share trip details with friends and family, including estimated time of arrival and the specific route taken. The Uber rider app also features an ‘Emergency’ button that can be used while on an Uber ride to connect with the local police. After the ride ends, two-way feedback is another way for us to pre-empt and resolve potential issues. If riders or drivers have any questions about their trip, or if they need to report an incident, our 24×7 support team is available to respond to any issues.</p><span>\n</span><p>While we continue to invest in technology to improve the safety of riders, we firmly believe that building a safe ride experience is a shared responsibility and requires concerted efforts from riders, driver partners, Uber, law enforcement agencies, policymakers and India Inc. at large. With this in mind, we are working closely with the law enforcement agencies, NGOs and the government, at both city and national level, through a series of partnerships and programmes that will help pre-empt and prevent any untoward incidents.</p><span>\n</span><p><strong>How does Uber ensure that only legitimate driver partners come on board?</strong></p><span>\n</span><p>We have a zero-tolerance policy towards any abusive or inappropriate behaviour on our app. We are equally conscious about onboarding driver-partners with valid documents, after a comprehensive background check and soft skill training that enables them to offer riders a great experience. In addition to an extensive onboarding process, initiatives like “Real Time ID Check”, driver de-duplication further helps eliminate account sharing incidents.</p><span>\n</span><p><strong>What are the present technical challenges in enabling rider safety in a highly populated and developing market such as India?</strong></p><span>\n</span><p>A major technological challenge is poor network connectivity and low smartphone penetration. Fluctuation in internet connectivity is a deterrent for riders to get in touch with us in an emergency situation. The fact that not all mobile users have smartphones is a challenge during any emergency. In such cases, riders can call 100 where they will be connected to local police to provide them assistance.</p><span>\n</span><p><strong>Are there any new product and tech innovations to uplift the existing safety mechanism?</strong></p><span>\n</span><p>At every step, Uber is maximising the use of technology to bring transparency and accountability through features such as two-way feedback and ratings, telematics and GPS, among others. With the existing safety features, the in-app emergency button is another effective measure towards improving rider safety. This feature on Uber app was another India first initiative which has been appreciated by riders across India and now been adopted by other Uber markets as well. We continue to evaluate more such features that will help us improve the safety of riders and offer a comfortable ride.</p><span>\n</span><p><strong>What role can authorities and private players play to ensure rider safety?</strong></p><span>\n</span><p>We have recently partnered with MoRTH to launch safety campaigns around Driving Under Influence (DUI) and both hands on wheels. Under this partnership, we will also develop learning aids on road safety for budding drivers enrolled in driving schools including the government’s Drivers Training Institutes (DTIs) across the country.</p><span>\n</span><p>Last year, we partnered with Delhi Police to offer riders quick access to Himmat —a women safety <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/mobile-app/\">mobile app</a>, through the rider app. This initiative was Delhi Police’s first partnership with a technology company to intensify its focus on the safety of women in the city. With this partnership, the Himmat app is accessible to lakhs of women riders in one go.</p><span>\n</span><p>We also partnered with Kolkata Police to offer riders quick access to Bondhu—a citizen safety mobile app, through the Uber app. The Bondhu app allows users to connect directly to Kolkata Police’s control room in case of an emergency. We have also rolled out city-wise partnerships with local authorities to spread awareness of drunk driving incidents and promote road safety. We believe that technology-led solutions to overcoming safety challenges are vital to making cities and countries safer for riders.</p><span>\n</span><p><strong>What features are available to ensure the safety of the driver partners?</strong></p><span>\n</span><p>Once the trip is on, the in-app navigation on the driver partner’s app automatically provides turn-by-turn directions. Since GPS data is logged for every trip, Uber also has access to this information, while the ride is in progress. This promotes accountability while adding another layer of security to the ride. To further enhance the safety features, last year we launched ‘Share Trip’ feature for driver partners, which allows them to share the details of the trip, including route and ETA, in real time with family or friends. The driver partner can also see the first name and rating of the rider before the trip.</p><span>\n</span><p>We also take the driver feedback very seriously. We constantly review the ratings given to the riders by the driver partners. Riders reported to violate our terms of service and/or community guidelines may be prevented from accessing the Uber app. To ensure rapid response in case of a crisis, our specially-trained incident response teams are available around the clock to handle any urgent safety concerns that arise.</p><span>\n</span><p>We also launched the first-of-its-kind insurance programme in partnership with ICICI Lombard General Insurance. The policy provides driver partners (aged 18 to 65) of four-wheeled vehicles with free coverage for accidental death and disablement, hospitalisation, and outpatient medical treatment in case of an accident while online on the Uber app and available for trip requests, en route or on a trip with Uber.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "shared",
        "modern",
        "based",
        "safe",
        "growing",
        "flexible"
    ],
    "nouns": [
        "experience",
        "pricing",
        "combining",
        "Building",
        "responsibility",
        "city",
        "may",
        "technology",
        "transport",
        "modern",
        "cab",
        "passenger",
        "safe",
        "safety",
        "payment",
        "growing",
        "ride"
    ],
    "verbs": [
        "experience",
        "transport",
        "cab",
        "ride"
    ]
}