{
    "creator": "Bloomberg",
    "title": "Elon Musk challengers turn billionaires as Chinese battery giant CATL soars 44% on debut",
    "link": "https://www.financialexpress.com/industry/technology/elon-musk-challengers-turn-billionaires-as-chinese-battery-giant-catl-soars-44-on-debut/1201938/",
    "pubDate": "Mon, 11 Jun 2018 18:19:33 +05:30",
    "dc:creator": "Bloomberg",
    "content": "The Chinese founder of the world’s biggest maker of electric-vehicle batteries and his top lieutenant became billionaires Monday after their company’s shares soared during the first day of trading in Shenzhen.",
    "contentSnippet": "The Chinese founder of the world’s biggest maker of electric-vehicle batteries and his top lieutenant became billionaires Monday after their company’s shares soared during the first day of trading in Shenzhen.",
    "guid": "https://www.financialexpress.com/?p=1201938",
    "categories": [
        "Industry",
        "Technology"
    ],
    "isoDate": "2018-06-11T12:49:33.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "elon",
            "musk",
            "challengers",
            "turn",
            "billionaires",
            "as",
            "chinese",
            "battery",
            "giant",
            "catl",
            "soars",
            "44",
            "on",
            "debut"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Elon Musk challengers turn billionaires as Chinese battery giant CATL soars 44% on debut",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1201946\" src=\"https://images.financialexpress.com/2018/06/cats-710.jpg\" alt=\"Elon Musk,&nbsp; CATL,&nbsp;Panasonic Corp,&nbsp;Volkswagen AG,&nbsp;IPO,&nbsp;Nissan Motor Co,&nbsp; Warren Buffett, news on elon musk, latest news on Elon Musk\" srcset=\"https://images.financialexpress.com/2018/06/cats-710.jpg 660w, https://images.financialexpress.com/2018/06/cats-710-300x200.jpg 300w, https://images.financialexpress.com/2018/06/cats-710-620x413.jpg 620w, https://images.financialexpress.com/2018/06/cats-710-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The government’s generous subsidies for new-energy vehicles and restrictions on gasoline cars in some cities will help battery demand quadruple in the next four years in China, Bloomberg New Energy Finance said in a report Monday. (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>The Chinese founder of the world’s biggest maker of electric-vehicle batteries and his top lieutenant became billionaires Monday after their company’s shares soared during the first day of trading in Shenzhen. Contemporary Amperex Technology Co. Ltd. jumped by the maximum 44 percent allowed by the exchange, valuing the company at about $12.3 billion. That cemented the position of Zeng Yuqun, CATL’s founder and top shareholder, on China’s rich list with an estimated net worth of about $3.4 billion, according to the Bloomberg Billionaires Index.</p><span>\n</span><p>Investors are confident that CATL can fend off rivals Panasonic Corp., which makes power packs with Tesla Inc.; Warren Buffett-backed BYD Co.; and LG Chem Ltd. as the increasing popularity of EVs boosts demand for the batteries that move them. CATL, whose customers include <a target=\"_blank\" href=\"http://www.financialexpress.com/auto/new-cars/volkswagen/\">Volkswagen</a> AG, previously cut the size of its IPO by more than half, compared with its original ambitions, because of declining margins and a cap imposed by Chinese authorities on price-earnings ratios in IPOs.</p><span>\n</span><p>The IPO made CATL the biggest company on China’s Nasdaq-style ChiNext list. Zeng, a 50-year-old engineer who started CATL seven years ago, owns a 26 percent stake. Vice Chairman Huang Shilin holds 12 percent and has an estimated net worth of $1.7 billion. Macquarie Bank Ltd. in Hong Kong rated CATL outperform on Monday and set a price target of 90 yuan, more than double the current price of 36.20 yuan.</p><span>\n</span><p>CATL, which also supplies <a target=\"_blank\" href=\"http://www.financialexpress.com/auto/new-cars/nissan/\">Nissan</a> Motor Co., <a target=\"_blank\" href=\"http://www.financialexpress.com/auto/new-cars/hyundai/\">Hyundai</a> Motor Co. and <a target=\"_blank\" href=\"http://www.financialexpress.com/auto/new-cars/bmw/\">BMW</a> AG, last year overtook Panasonic as the world’s largest supplier of EV batteries by sales thanks to increasing domestic demand. The government’s generous subsidies for new-energy vehicles and restrictions on gasoline cars in some cities will help battery demand quadruple in the next four years in China, Bloomberg New Energy Finance said in a report Monday. CATL is best-positioned to benefit because of its advantages in capacity and customer base, BNEF said.</p><span>\n</span><p>Zeng was born in a mountain village an hour away from CATL’s headquarters in Ningde city, Fujian province, and sometimes organizes employee excursions to his birthplace. For most of his career, he worked on lithium-ion batteries for consumer electronics, including the iPhone, at a subsidiary of Japan’s TDK Corp. that he helped set up.</p><span>\n</span><p>Zeng’s decision to found CATL in 2011 marked a gamble on Chinese policy. Just 1,014 alternative-energy vehicles were sold in China that year, according to Bloomberg Intelligence, but Zeng’s prediction that the government’s push for alternative-energy cars would boost demand for lithium-ion batteries proved correct. Still, challenges lie ahead. CATL lowered battery prices to gain market share after the government reduced EV subsidies, and that weighed on profitability, Zeng said last month during an online roadshow.</p><span>\n</span><p>CATL will, during the next three years, “grasp the opportunities of the fast growth in the global lithium-ion battery market, and maintain our leading position in technologies, manufacturing, capacity and talents,’’ Zeng said.</p><span>\n</span><p>CATL will use the IPO proceeds to help finance a new 24 gigawatt-hour factory in Ningde and to develop more-advanced battery technologies. CATL is supplying cells to a slew of new cars being introduced by global automakers in China, including Hyundai’s plug-in version of the Sonata and <a target=\"_blank\" href=\"http://www.financialexpress.com/auto/new-cars/toyota/\">Toyota</a> Motor Corp.’s ix4, a rebadged pure EV developed by its Chinese partner Guangzhou Automobile Group Co. The company also is nearing a decision to build a battery factory in Germany, planting a flag on the home turf of car giants Volkswagen, BMW and Daimler AG as part of a push into Europe, people familiar with the matter said last week.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "Chinese",
        "giant",
        "44",
        "world",
        "electric",
        "top",
        "first"
    ],
    "verbs": [
        "turn",
        "debut",
        "founder",
        "top",
        "company"
    ]
}