{
    "creator": "Bloomberg",
    "title": "Cryptocurrencies lose $46 billion after South Korean bourse hack",
    "link": "https://www.financialexpress.com/market/cryptocurrencies-lose-46-billion-after-south-korean-bourse-hack/1201256/",
    "pubDate": "Mon, 11 Jun 2018 12:23:22 +05:30",
    "dc:creator": "Bloomberg",
    "content": "A cryptocurrency exchange hack in South Korea jolted holders of digital assets, fueling a $46 billion selloff and extending this year’s Bitcoin slump to more than 50 percent. ",
    "contentSnippet": "A cryptocurrency exchange hack in South Korea jolted holders of digital assets, fueling a $46 billion selloff and extending this year’s Bitcoin slump to more than 50 percent.",
    "guid": "https://www.financialexpress.com/?p=1201256",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-11T06:53:22.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "cryptocurrencies",
            "lose",
            "46",
            "billion",
            "after",
            "south",
            "korean",
            "bourse",
            "hack"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Cryptocurrencies lose $46 billion after South Korean bourse hack",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1201289\" src=\"https://images.financialexpress.com/2018/06/cats-654.jpg\" alt=\"Cryptocurrencies,&nbsp;South Korea,&nbsp;cryptocurrency exchange,&nbsp;digital assets, news on&nbsp;Cryptocurrencies&nbsp;\" srcset=\"https://images.financialexpress.com/2018/06/cats-654.jpg 660w, https://images.financialexpress.com/2018/06/cats-654-300x200.jpg 300w, https://images.financialexpress.com/2018/06/cats-654-620x413.jpg 620w, https://images.financialexpress.com/2018/06/cats-654-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The hack brought an abrupt end to two weeks of calm for the biggest virtual currency and reignited concerns about the security of lightly regulated crypto exchanges. (PTI)</figure>\n\t\t\t</section></div><span>\n</span><p>A cryptocurrency exchange hack in South Korea jolted holders of digital assets, fueling a $46 billion selloff and extending this year’s Bitcoin slump to more than 50 percent. The hack brought an abrupt end to two weeks of calm for the biggest virtual currency and reignited concerns about the security of lightly regulated crypto exchanges. The venues have come under growing scrutiny in South Korea, the U.S. and other large economies in recent months amid a range of issues including thefts, market manipulation and money laundering.</p><span>\n</span><p>Bitcoin has dropped 11 percent since 5 p.m. New York time on Friday and was trading at $6,781.19 as of 11:43 a.m. in Hong Kong on Monday, bringing its year-to-date loss to 53 percent. Most other major virtual currencies also slumped, sending the market value of digital assets tracked by Coinmarketcap.com to a nearly two-month low of $294 billion. At the height of the global crypto-mania in early January, they were worth about $830 billion.</p><span>\n</span><p>Enthusiasm for virtual currencies has waned partly due to a string of cyber heists, including the nearly $500 million theft from Japanese exchange Coincheck Inc. in late January. While the latest hacking target — a South Korean venue called Coinrail — is much smaller, the news triggered knee-jerk selling by investors, according to Stephen Innes, head of Asia Pacific trading at Oanda Corp. in Singapore. “This is ‘If it can happen to A, it can happen to B and it can happen to C,’ then people panic because someone is selling,” Innes said.</p><span>\n</span><p>The slump may have been exacerbated by low market liquidity during the weekend, Innes added. “The markets are so thinly traded, primarily by retail accounts, that these guys can get really scared out of positions,” he said. “It actually doesn’t take a lot of money to move the market significantly.”</p><span>\n</span><p>Coinrail said in a statement on its website that some of the exchange’s digital currency appears to have been stolen by hackers, but it didn’t disclose how much. The venue added that 70 percent of the cryptocurrencies it holds are being kept safely in a cold wallet, which isn’t connected to the Internet and is less vulnerable to theft. Two-thirds of the stolen assets — which the exchange identified as NPXS, NPER and ATX coins — have been frozen or collected, while the remaining one third is being examined by investigators, other exchanges and cryptocurrency development companies, it said.</p><span>\n</span><p>Coinrail trades more than 50 cryptocurrencies and was among the world’s Top 100 most active venues, with a 24-hour volume of about $2.65 million, according to data compiled by Coinmarketcap.com before news of the hack. The Korean National Police Agency didn’t immediately reply to a request for comment. Some Asia-listed stocks with exposure to digital currencies fell on Monday. South Korea’s Omnitel Inc. and Vidente Co. both retreated at least 3.9 percent, while Japan’s Remixpoint Inc. slumped about 5 percent.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "Korean",
        "digital",
        "46",
        "billion",
        "South",
        "jolted",
        "50"
    ],
    "nouns": [
        "percent",
        "year",
        "exchange",
        "Korean",
        "Korea",
        "billion",
        "South",
        "bourse",
        "hack",
        "A",
        "assets",
        "fueling",
        "selloff",
        "slump",
        "50"
    ],
    "verbs": [
        "exchange",
        "lose",
        "hack",
        "slump"
    ]
}