{
    "creator": "Shinmin Bali",
    "title": "Raymond: Spinning a modern tale?",
    "link": "https://www.financialexpress.com/industry/raymond-spinning-a-modern-tale/1209828/",
    "pubDate": "Mon, 18 Jun 2018 00:37:47 +05:30",
    "dc:creator": "Shinmin Bali",
    "content": "With e-commerce and more competition now than in its glory days, Raymond is taking steps to be contemporary for the man of today.",
    "contentSnippet": "With e-commerce and more competition now than in its glory days, Raymond is taking steps to be contemporary for the man of today.",
    "guid": "https://www.financialexpress.com/?p=1209828",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-17T19:07:47.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "raymond",
            "spinning",
            "a",
            "modern",
            "tale?"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Raymond: Spinning a modern tale?",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1209838\" src=\"https://images.financialexpress.com/2018/06/raymond-fb1.png\" alt=\"Raymond, raymond brand,&nbsp;All Black collection,&nbsp;communication\" srcset=\"https://images.financialexpress.com/2018/06/raymond-fb1.png 660w, https://images.financialexpress.com/2018/06/raymond-fb1-300x200.png 300w, https://images.financialexpress.com/2018/06/raymond-fb1-620x413.png 620w, https://images.financialexpress.com/2018/06/raymond-fb1-401x267.png 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> With e-commerce and more competition now than in its glory days, Raymond is taking steps to be contemporary for the man of today.</figure>\n\t\t\t</section></div><span>\n</span><p>The mention of Raymond automatically elicits recollection of The Complete Man imagery. While the garment major has carefully crafted an aspirational image over decades, it isn’t an image the customer of today necessarily wants to look up to or can afford to. And the brand has realised that. The difference between the brand’s communications from the good ol’ days to what was rolled out across 2017 up till now has been considerable. For its All Black collection, the campaign features storytelling from a visually impaired protagonist. For its Khadi collection, the brand found a communication balance between leveraging India’s Khadi heritage and giving the fabric a contemporary twist.</p><span>\n</span><p>The changing Raymond man</p><span>\n</span><p>Raymond, for decades, has been an occasion-led brand with purchases fuelled by milestones such as festivals, graduations, weddings, etc in a consumer’s life. The pricing reflects this, which restricts purchase opportunities. Shantiswarup Panda, CMO, Raymond emphasises that the brand is a quality investment at a premium price. “I don’t think there would be a lot of people who would have a wardrobe full of Raymond,” he says. “But if Raymond’s crisp shirts form a 20-30% share of the wardrobe, sharing space with shirts from other brands for not-so-important days like Thursdays and Fridays, it is fine. Even 20-30% is a good share for us because India is a huge market.” As disposable incomes rise, consumers themselves develop occasions for which they wish to make purchases.</p><span>\n</span><p>Raymond is banking on this consumer tendency supplemented by an experimental consumer profile. To leverage this, Raymond is testing its custom tailoring service wherein its trained personnel visits the customer’s home post an online appointment, takes their measurement, helps them pick out fabric from swatches followed by the eventual delivery of the final product. This pilot, having rolled out in Pune in October, 2017, is currently also being run in Mumbai. Typically, the target audience for premium custom tailoring falls between the 35-40 year age bracket. However, there are also takers that are far younger, say 24 or 25 year-olds.</p><span>\n</span><p>Will Raymond be able to steer clear of being a mass brand while at the same time trying to capture a wider, hopefully younger, base of customers? Harish Bijoor, founder, Harish Bijoor Consults shares, “Raymond keeps its distance from the rest of the masses, as it wants to, which translates that it is not for everyone; it is for a select audience. At the same time, it needs to battle other retail players in big cities and tier II towns, local brands and desi brands.”</p><span>\n</span><p>Wearing the right strategy?</p><span>\n</span><p>Raymond’s communication strategy, thus, is to craft a contemporary image for itself. To that end, its outlay in ATL alone for this year has been 40% for TV, 30% for digital, and 15% each for print/magazine and OOH. So if The Complete Man persona becomes too distant a personality to aspire to, how relevant is it for the brand’s future journey? Navonil Chatterjee, CSO, Rediffusion Y&amp;R says, “When the Raymond campaign was originally conceived, men were known for the ‘arrogance of singularity’ while women were connected to life by many threads. As long as the collection ads are done in a distinctive Raymond way, the equity of the brand shouldn’t get adversely affected.”</p><span>\n</span><p>After years of stoking the sizzle or the emotional component, maybe it is time to focus on the sausage or the product/rational part of the brand, he says. Raymond is actively looking at online marketplaces in addition to its own online presence. Heavy discounting, however, is out of question for the brand. Panda elaborates, “The biggest proposition online is discount, followed by range and free returns. While I understand that the latter two are non-negotiable, we don’t agree with the kind of discounts that brands indulge in and give online.” For Raymond, the brand being present online gives people a choice and makes it accessible beyond the number of towns that it is present in. “But the online medium is giving us steady growth and a very sizeable business actually,” he shares.</p><span>\n</span><p>While the equity of being the go-to brand for special occasions that require suiting and shirting will remain largely untouched, keeping in mind the changing consumer sensibility, Raymond is hoping for jackets to be a bridge between formal and casual work wear attire. The brand is also experimenting with various colours, cuts, styles and fabrics to make its products more relevant in a consumer’s daily life.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "contemporary",
        "modern",
        "taking"
    ],
    "verbs": [
        "glory",
        "man"
    ],
    "nouns": [
        "tale",
        "contemporary",
        "commerce",
        "competition",
        "modern",
        "glory",
        "days",
        "taking",
        "steps",
        "man",
        "today",
        "Spinning"
    ]
}