{
    "title": "Building the future of HR for digital natives",
    "link": "https://www.financialexpress.com/industry/technology/building-the-future-of-hr-for-digital-natives/1200854/",
    "pubDate": "Mon, 11 Jun 2018 02:50:15 +05:30",
    "content": "From personalised updates via a newsfeed-style interface, to automated chatbots that offer quick answers to HR questions, the next wave of workplace technology is set to revolutionise how firms attract, retain and engage talent.",
    "contentSnippet": "From personalised updates via a newsfeed-style interface, to automated chatbots that offer quick answers to HR questions, the next wave of workplace technology is set to revolutionise how firms attract, retain and engage talent.",
    "guid": "https://www.financialexpress.com/?p=1200854",
    "categories": [
        "Industry",
        "Technology"
    ],
    "isoDate": "2018-06-10T21:20:15.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "building",
            "the",
            "future",
            "of",
            "hr",
            "for",
            "digital",
            "natives"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Building the future of HR for digital natives",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1200859\" src=\"https://images.financialexpress.com/2018/06/tech-3.jpg\" alt=\"HR, human resource, business, HR in 2018\" srcset=\"https://images.financialexpress.com/2018/06/tech-3.jpg 660w, https://images.financialexpress.com/2018/06/tech-3-300x200.jpg 300w, https://images.financialexpress.com/2018/06/tech-3-620x413.jpg 620w, https://images.financialexpress.com/2018/06/tech-3-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Enterprise technology inspired by social media, with AI at its core, will be particularly key to winning over high-value and millennial talent.</figure>\n\t\t\t</section></div><span>\n</span><p>When people in Asia-Pacific (Apac) want to buy a pair of shoes, book a holiday abroad or catch up with friends and family, they turn to social media. The 2018 Global Digital suite of reports from We Are Social and Hootsuite shows that the region is home to 1.8 billion social media users. Social media’s ubiquity comes from how global networks like Facebook and Instagram, not to mention homegrown Asian platforms like Line and WeChat, are fun and easy to use; increasingly leverage AI and other emerging technology to serve users with the content that’s most relevant to their needs and interests; and provide a seamless gateway to online retail, travel, entertainment and more.</p><span>\n</span><p>However, when people in Apac countries step into the office, it’s a different story. HR and career path tools are frequently outdated in their user experience, making it complicated for employees to connect, collaborate and get the job done. However, a number of companies in the Apac region embrace emerging HR technologies in order to make workplace processes easier, more fun and more intuitive, and drive deeper employee engagement. In the Philippines, UnionBank is modernising HR practices with cloud technology. UST Global, which provides technology and innovation services to businesses across 25 different countries, has improved process efficiency by 30-40% since modernising human capital management.</p><span>\n</span><p>As social media continues to dominate the personal lives of people in Apac, businesses can boost employee satisfaction by making HR processes more similar to social media. From personalised updates via a newsfeed-style interface, to proactive training recommendations derived from data, to automated chatbots that offer quick answers to HR questions, the next wave of workplace technology is set to revolutionise how businesses attract, retain and engage talent in countries across the Apac region.</p><span>\n</span><p>Artificial intelligence (AI) is key to bringing social media qualities to HR solutions. Imagine, for example, a redesigned user interface for employees that calls attention to upcoming tasks in an easy-to-read, newsfeed-style format. With AI capabilities that learn and determine what’s most important to each individual user, relevant company news and business insights can be added to the feed in real-time—giving workers a personalised snapshot of everything they need to know, without having to dig through hundreds of emails.</p><span>\n</span><p>AI makes HR not only more personalised, but also more proactive. Get ready for training systems which utilise a broad range of data to provide employees with tailored training and development recommendations, before you even have a chance to ask for it. These proactive training alerts could entice employees to take advantage of training opportunities which are suited to their general role and specific upcoming tasks; their burgeoning skills and stubborn challenge areas; and their performance objectives and long-term goals.</p><span>\n</span><p>Of course, it’s impossible to talk about social media and AI without mentioning chatbots. Automating customer service for the mutual benefits of customers and brands, chatbots have transformed the world of customer service on social media, and new HR solutions are likewise leveraging automated bots to make life easier for HR managers and employees. With an office chatbot, workers can get their basic questions answered instantly. How do I file a health insurance claim? How many days of leave do I have left this year? The right bot can provide instant answers to these sorts of routine queries; saving time for everyone, getting new joiners up to speed more quickly, and freeing up HR and general staff alike to focus on the higher value work they’ve been hired to do.</p><span>\n</span><p>Enterprise technology inspired by social media, with AI at its core, will be particularly key to winning over high-value and millennial talent. In a world where social media makes our lives more fun and simple at every turn, the “avocado toast” generation won’t stick around an office that can’t make everyday processes as quick, easy and intuitive as logging on to their favourite social network. Looking into the future, we will no doubt see AI and the social media experience continue to influence the best HR technology. As emerging technologies based in AI continue to make HR processes faster, simpler and more joyful to use, businesses will have an exciting new way to attract and engage candidates—driving the future of the employee experience across Apac.</p><span>\n</span><p><strong>By Prasad Rai</strong></p><span>\n</span><p><em>The writer is vice president – Applications, Oracle India</em></p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "personalised",
        "quick",
        "digital",
        "next",
        "future",
        "automated",
        "set"
    ],
    "nouns": [
        "technology",
        "workplace",
        "quick",
        "talent",
        "interface",
        "style",
        "offer",
        "Building",
        "future",
        "HR",
        "wave",
        "set"
    ],
    "verbs": [
        "style",
        "offer",
        "revolutionise",
        "wave",
        "set",
        "attract",
        "retain",
        "engage"
    ]
}