{
    "title": "Saradha case: ED summons Chidambaram's wife again",
    "link": "https://timesofindia.indiatimes.com/business/india-business/saradha-case-ed-summons-p-chidambarams-wife-nalini-again/articleshow/64632363.cms",
    "pubDate": "Mon, 18 Jun 2018 08:52:32 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/saradha-case-ed-summons-p-chidambarams-wife-nalini-again/articleshow/64632363.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64632363.cms\" /></a>The ED had first issued the summons to Nalini on September 7, 2016 asking her to appear at its Kolkata office as a witness in the Saradha chit fund scam. She was allegedly paid a legal fee of Rs 1.26 crore by the Saradha group for her appearances in court.",
    "contentSnippet": "The ED had first issued the summons to Nalini on September 7, 2016 asking her to appear at its Kolkata office as a witness in the Saradha chit fund scam. She was allegedly paid a legal fee of Rs 1.26 crore by the Saradha group for her appearances in court.",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/saradha-case-ed-summons-p-chidambarams-wife-nalini-again/articleshow/64632363.cms",
    "isoDate": "2018-06-18T08:52:32.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "saradha",
            "case",
            "ed",
            "summons",
            "chidambaram's",
            "wife",
            "again"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Saradha case: ED summons P Chidambaram's wife Nalini again",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>NEW DELHI: The Enforcement Directorate (ED) has issued fresh summons to </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Nalini-Chidambaram\">Nalini Chidambaram</a><span>, wife of former finance minister </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/P-Chidambaram\">P Chidambaram</a><p>, in connection with its money laundering probe into the Saradha ponzi scam.\n\n</p><p>Officials said Nalini has been summoned at the Kolkata office of the central probe agency on June 20.\n</p><p>She was last summoned by the agency for May 7 but she appealed against the summonses before the Madras High Court.\n</p><p>In her appeal, Nalini, a senior advocate, has challenged the April 24 order of Justice S M Subramaniam dismissing her petition against the ED's summons asking her to appear as a witness in its money laundering probe in the Saradha chit fund scam case.\n</p><p>He had rejected her contention that women cannot be called for investigation out of their place of residence under CrPC Sec 160, saying such exemptions are not mandatory and are subject to facts and circumstances of a case.\n</p><p>The judge had also directed the ED to issue fresh summons, following which the agency had on April 30 issued the summons asking Nalini to appear before it on May 7.\n</p><p>The agency, they said, wants to record her statement under the Prevention of Money Laundering Act (PMLA) with regard to a specific link of her in this case, they said.\n</p><p>The ED had first issued the summons to Nalini on September 7, 2016 asking her to appear at its Kolkata office as a witness in the Saradha chit fund scam.\n</p><p>She was allegedly paid a legal fee of Rs 1.26 crore by the Saradha group for her appearances in court and the Company Law Board over a television channel purchase deal.\n</p><p>She had earlier been questioned by the ED and CBI in this regard but agency sources had claimed that she was being summoned in the \"light of new evidence\".\n</p><span>During the hearings at the Madras HC, Nalini had contended that the summons was \"purely politically motivated to damage her reputation.\"\n</span><br><span>\n</span><br><span>Pointing out that receiving fee by a counsel for representing an accused was not an offence, she had said every lawyer who appears for a suspect in criminal cases charges professional fee.\n</span><br><span>\n</span><br><span>The ED had filed a charge sheet in this case in a special PMLA court in Kolkata in 2016.\n</span><br><span>\n</span><br><span>Nalini's son Karti is already being investigated by the ED in two separate money laundering cases of the Aircel-Maxis deal and the INX Media case and he has been questioned multiple times by the agency in context of these cases.\n</span><br><span>\n</span><p>A charge sheet was recently filed by the ED against Karti in the Aircel-Maxis case.\n</p><span>\n</span></div></div>"
    },
    "adjectives": [
        "10",
        "left",
        "top",
        "right",
        "first",
        "paid",
        "legal",
        "26"
    ],
    "nouns": [
        "india",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo",
        "asking",
        "court",
        "witness",
        "office",
        "case",
        "ED",
        "ed",
        "chit",
        "wife",
        "first",
        "September",
        "Kolkata",
        "fund",
        "fee",
        "26",
        "crore",
        "group",
        "summons",
        "scam"
    ],
    "verbs": [
        "border",
        "align",
        "style",
        "top",
        "right",
        "court",
        "witness",
        "appear",
        "case",
        "summons",
        "fund",
        "scam",
        "fee",
        "group"
    ]
}