{
    "title": "Will EM investors bet on India again? A lot depends on RBI policy this week",
    "link": "https://www.business-standard.com/article/economy-policy/will-em-investors-bet-on-india-again-a-lot-depends-on-rbi-policy-this-week-118060400470_1.html",
    "pubDate": "Mon, 04 Jun 2018 15:13:00 +0530",
    "content": "Emerging markets also face near-term risks from US protectionism, according to NatWest Markets",
    "contentSnippet": "Emerging markets also face near-term risks from US protectionism, according to NatWest Markets",
    "guid": "https://www.business-standard.com/article/economy-policy/will-em-investors-bet-on-india-again-a-lot-depends-on-rbi-policy-this-week-118060400470_1.html",
    "isoDate": "2018-06-04T09:43:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "will",
            "em",
            "investors",
            "bet",
            "on",
            "india",
            "again?",
            "a",
            "lot",
            "depends",
            "on",
            "rbi",
            "policy",
            "this",
            "week"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Will EM investors bet on India again? A lot depends on RBI policy this week",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tCentral bankers won’t have it easy this week. They’ll need to weigh a rising dollar, renewed fears of a <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=global+trade+war\" target=\"_blank\">global trade war </a>and a robust <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=us+jobs\" target=\"_blank\">US jobs </a>report that prompted traders to rebuild bets for four rates hikes this year.</p>\n<p>\n\tAnd that’s under the watchful eye of investors who’ve suffered declines in <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=emerging+market\" target=\"_blank\">emerging-market </a>stocks and currencies for all but two weeks this quarter.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tLira traders will be eyeing inflation data due Monday to assess whether Turkey’s central bank will raise rates again. Meanwhile, a surprising hawkish tilt revealed in the Reserve Bank of India’s April policy minutes, and the recent spike in oil, boosted speculation the authority may lift rates as soon as Wednesday.</p>\n<p>\n\t“For now the Central Bank of Turkey appears to have stabilized the lira, but the market will still closely follow their meeting on Thursday for any additional adjustments to policy,” said Maximillian Lin, a Singapore-based emerging markets Asia strategist at NatWest Markets. “Rupee weakness is factoring into expectations for this RBI meeting, with a minority of forecasters expecting a hike. I think the statement will be less hawkish than market expectations.”</p>\n<p>\n\tEmerging markets also face near-term risks from US protectionism, according to NatWest Markets. China said Sunday that all commitments made so far in talks with the U.S. over trade will be withdrawn if President Donald Trump carries out his threat to impose tariffs. The U.S. last week opened a multi-front trade assault on allies and adversaries alike, imposing metal duties on the EU, Canada and Mexico.</p>\n<p>\n\tA JPMorgan Chase &amp; Co. gauge of expected swings in developing-nation currencies climbed last week to the highest level since April 2017 after Italy’s political crisis roiled global markets. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=emerging+market\" target=\"_blank\">Emerging-market </a>stocks declined for a fourth month in May, the longest run since 2016, while currencies extended losses from April. Local-currency bonds fell for second month in May.</p>\n<p>\n\t<strong>Rate Hikes?</strong></p>\n<ul>\n\t<li>\n\t\tThe lira may come under pressure as economists predict consumer-price increases quickened to 12.15 percent in May. Turkey is prepared to raise interest rates again if inflation accelerates, according to two money managers who met Turkey’s central bank Governor Murat Cetinkaya and Deputy Prime Minister Mehmet Simsek in London</li>\n\t<li>\n\t\tMoody’s Investors Service is also considering downgrading Turkey on uncertainty surrounding the direction of the nation’s macroeconomic policy, three months after lowering its rating to Ba2. Options traders remain the most bearish on the lira among <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=emerging+market\" target=\"_blank\">emerging-market </a>peers</li>\n\t<li>\n\t\tAfter central bank moves seemed to have guided Asian currencies’ performances in May, attention will be on the RBI’s policy meeting on Wednesday. The pickup in economic growth to 7.7 percent in the fourth quarter of the financial year ended March 31, the fastest pace of any major economy, could also set the stage for a rate increase. The rupee advanced more than 1 percent last week, the top Asian performer after Indonesia’s rupiah.</li>\n\t<li>\n\t\tPoland’s central bank is set to maintain its key interest rate on Wednesday. All ears will be attuned to policy-maker comments on the emerging-market sell-off, the impact of the political crisis in Italy and the outlook for inflation</li>\n\t<li>\n\t\tPeru is expected to keep benchmark rates at 2.75 percent for a third straight month after signaling the easing cycle is over as the economy gains traction. Inflation, the lowest in Latin America, remains below target</li>\n\t<li>\n\t\tOther rate decisions: Kazakhstan on Monday; Serbia on Thursday</li>\n</ul>\n\n<p>\n\t<strong>Inflation, Inflation, Inflation</strong></p>\n<ul>\n\t<li>\n\t\tBrazil, the largest Latin American economy, releases inflation data on Friday that will show any potential impact from the truckers’ strike that led to food and fuel shortages; traders have been pricing in higher interest rates as the nation’s assets took a beating during the strike</li>\n\t<li>\n\t\tMexico’s release of consumer price data will guide expectations for the central bank’s June 21 meeting. Swap traders expect Banxico to raise borrowing costs over the next three months -- even though inflation has subsided. The Mexican peso was the worst performing emerging-market currency last week after Brazil’s real</li>\n\t<li>\n\t\tColombia’s annual inflation rate, due for release Tuesday, may have quickened to 3.2 percent in May from a year earlier, within the central bank’s range of 2-4 percent. The peso was the only Latin American currency to gain last week</li>\n\t<li>\n\t\tChile may say that it posted the fastest growth since 2013 in May. The release may be followed by an announcement by Finance Minister Felipe Larrain of additional austerity measures to address the fiscal deficit. On Friday, authorities are likely to report that consumer prices rose 2 percent in May from a year earlier</li>\n\t<li>\n\t\tIn Asia, Taiwan and the Philippines are also set to report CPI data. The latter will be closely watched as its central bank predicted inflation may have quickened to a five-year high in May and had previously suggested it may raise the policy rate “some more depending on the data.” Indonesia reported on Monday consumer-price gains slowed to 3.23 percent in May from a year earlier, compared with a 3.41 percent increase in April.</li>\n</ul>\n\n<p>\n\t<strong>China Data</strong></p>\n<ul>\n\t<li>\n\t\tChina will report a set of key indicators, which include foreign reserves on June 7, trade balance on June 8 and inflation on June 9. The yuan rose on Friday against a basket of peers for the first time in 10 days as the PBOC strengthened the currency’s daily reference rate</li>\n</ul>\n\n<p>\n\t<strong>Negotiations</strong></p>\n<ul>\n\t<li>\n\t\tArgentina’s President Mauricio Macri said last week he expects to reach a deal with the International Monetary Fund in the next few days, after this year’s currency plunge conjured up fears of a financial crisis. The government is said to be seeking an IMF credit line of at least $30 billion to shore up finances and restore confidence in the peso</li>\n\t<li>\n\t\tAny deal will probably come with a government commitment to quicken the pace of fiscal consolidation. The peso weakened for a sixth week, its worst streak since 2016</li>\n\t<li>\n\t\tEnergy ministers from Saudi Arabia, the United Arab Emirates and Kuwait meet in Kuwait City to discuss OPEC plans, after a Saudi-Russia accord on reviving oil production caused oil prices to fall</li>\n</ul>\n<hr>\n<em>Bloomberg</em><br>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Emerging",
        "near",
        "according"
    ],
    "nouns": [
        "India",
        "policy",
        "Will",
        "EM",
        "bet",
        "A",
        "lot",
        "RBI",
        "week",
        "face",
        "term",
        "US",
        "protectionism"
    ],
    "verbs": [
        "Will",
        "bet",
        "lot",
        "face",
        "near",
        "term"
    ]
}