{
    "creator": "Morgan Stanley",
    "title": "Reliance industries: Morgan Stanley rates ‘overweight’, says stage set for a turnaround in earnings",
    "link": "https://www.financialexpress.com/market/reliance-industries-morgan-stanley-rates-overweight-says-stage-set-for-a-turnaround-in-earnings/1209862/",
    "pubDate": "Mon, 18 Jun 2018 01:10:56 +05:30",
    "dc:creator": "Morgan Stanley",
    "content": "RIL stock has been range-bound year-to-date, but we see the stars aligning for it to break toward our price target as diesel, polyester and retail margins step up to a new normal, telecom subscriber growth sets new benchmarks and capex unwinds. ",
    "contentSnippet": "RIL stock has been range-bound year-to-date, but we see the stars aligning for it to break toward our price target as diesel, polyester and retail margins step up to a new normal, telecom subscriber growth sets new benchmarks and capex unwinds.",
    "guid": "https://www.financialexpress.com/?p=1209862",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-17T19:40:56.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "reliance",
            "industries",
            "morgan",
            "stanley",
            "rates",
            "‘overweight’",
            "says",
            "stage",
            "set",
            "for",
            "a",
            "turnaround",
            "in",
            "earnings"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Reliance industries: Morgan Stanley rates ‘overweight’, says stage set for a turnaround in earnings",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1209871\" src=\"https://images.financialexpress.com/2018/06/Ril-620x413.jpg\" alt=\"Reliance industries, ril, mukesh ambani,&nbsp;Morgan Stanley, capex, reliance earnings\" srcset=\"https://images.financialexpress.com/2018/06/Ril-620x413.jpg 620w, https://images.financialexpress.com/2018/06/Ril-620x413-300x200.jpg 300w, https://images.financialexpress.com/2018/06/Ril-620x413-401x267.jpg 401w\" sizes=\"(max-width: 620px) 100vw, 620px\"> RIL stock has been range-bound year-to-date, but we see the stars aligning for it to break toward our price target as diesel, polyester and retail margins step up to a new normal, telecom subscriber growth sets new benchmarks and capex unwinds.</figure>\n\t\t\t</section></div><span>\n</span><p>RIL stock has been range-bound year-to-date, but we see the stars aligning for it to break toward our price target as diesel, polyester and retail margins step up to a new normal, telecom subscriber growth sets new benchmarks and capex unwinds. This should energise a front-loaded 80% Ebitda rise in three years. Overweight.</p><span>\n</span><p>RIL’s profitability appears to be transitioning to a new normal as all businesses are experiencing once-in-a-decade step-ups in margins. As is usually seen with such transitions, there has been investor skepticism and some earnings volatility in the past three quarters, and hence the stock has been range-bound at Rs 900-1,000. However, we think the stage is set for earnings inflection with upside triggers every quarter until end-FY19, driving 12% upside surprise to consensus earnings.</p><span>\n</span><p>What could drive a breakout to&nbsp;Rs 1,241?</p><span>\n</span><p>Once the market appreciates a (i) breakout in energy margins being the new normal (and sustainable); (ii) telecom subscriber adds remaining high, (iii) broadband business clarity rising, (iv) retail remaining on a hyper-growth path, and (v) capex showing increasing signs of slowing, we see a 20% earnings CAGR for the next three years.</p><span>\n</span><p>Diesel, IMO and complexity</p><span>\n</span><p>Diesel, IMO and complexity are the three key ingredients for a potential 40% rise in refining margins by FY21, i.e., an $1 bn in additional cash flows, in our view. We view RIL as among the best positioned global refiners to benefit from what we expect to be a doubling of diesel margins (up 30% YTD) and 2020 IMO implementation as it has 55% diesel output, benefits from cheaper light and heavy crudes, and has zero fuel oil output.</p><span>\n</span><p>Mobile, content, and broadband</p><span>\n</span><p>With a focus on wireless subscriber market share, Reliance has been able to raise monthly subscriber additions to 9 mn, and we see the run rate remaining high and averaging 7.5mn/month in FY19 (6 mn in FY18). Clarity on broadband monetisation should also act as a trigger.</p><span>\n</span><p>Isn’t the new normal priced in?</p><span>\n</span><p>At 6.2x EV/Ebitda (FY20e), the stock is discounting a 10ppt decline in energy margins with limited upside from higher telecom subscriber market share/retail margins and 10% rise in debt, in our view. We reiterate our OW on RIL and see a new normal in profitability across its divisions driving the stock beyond the past three quarters’ range of Rs 900-1000 to our PT of Rs 1,241. We see the overhangs on project execution, telecom subscriber growth, petrochemical margins and oil prices turning into tailwinds, and increasing clarity on refining and polyester margins should raise investor confidence on medium-term earnings. We believe consensus is not fully appreciating the upside potential from these energy businesses.</p><span>\n</span><p>Refining — what’s driving the new normal?</p><span>\n</span><p>The underlying shift in global oil supply toward light oil and regulations to control pollution should drive outsized returns for complex refiners, as they not only have high flexibility in crude sourcing, but are also able to vary product yields to cater to tighter fuel specifications and leverage on the demand surge in middle distillates. Considering RIL’s complex refinery, 50%+ middle distillate output and ability to process even extra-heavy crudes, we see potential gains of $2.5-4/bbl from higher diesel demand and IMO regulations. This, combined with the upside potential from lower utility costs should boost margins to nearly $13/bbl by the end of FY19 and $15-16/bbl by FY21, vs. the historical range of $8-10/bbl for FY09-16.</p><span>\n</span><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "stock",
        "overweight",
        "new",
        "set",
        "bound",
        "aligning",
        "normal"
    ],
    "nouns": [
        "stock",
        "overweight",
        "target",
        "date",
        "Morgan",
        "break",
        "earnings",
        "step",
        "retail",
        "Stanley",
        "stage",
        "subscriber",
        "price",
        "year",
        "growth",
        "Reliance",
        "diesel",
        "rates",
        "set",
        "turnaround",
        "bound",
        "range",
        "telecom",
        "normal",
        "polyester"
    ],
    "verbs": [
        "stock",
        "target",
        "date",
        "break",
        "step",
        "retail",
        "stage",
        "price",
        "bound",
        "range",
        "set"
    ]
}