{
    "title": "India gets cheapest LNG as Russia's Gazprom begins supplies of worth $25 bn",
    "link": "https://www.business-standard.com/article/economy-policy/india-gets-cheapest-lng-as-russia-s-gazprom-begins-supplies-of-worth-25-bn-118060400660_1.html",
    "pubDate": "Mon, 04 Jun 2018 18:06:00 +0530",
    "content": "At current oil prices, the Russian rate is $1.5 per mmBtu less than the price at which Qatar, India's oldest supplier, delivered liquefied natural gas",
    "contentSnippet": "At current oil prices, the Russian rate is $1.5 per mmBtu less than the price at which Qatar, India's oldest supplier, delivered liquefied natural gas",
    "guid": "https://www.business-standard.com/article/economy-policy/india-gets-cheapest-lng-as-russia-s-gazprom-begins-supplies-of-worth-25-bn-118060400660_1.html",
    "isoDate": "2018-06-04T12:36:00.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.15384615384615385,
        "tokens": [
            "india",
            "gets",
            "cheapest",
            "lng",
            "as",
            "russia's",
            "gazprom",
            "begins",
            "supplies",
            "of",
            "worth",
            "25",
            "bn"
        ],
        "words": [
            "worth"
        ],
        "positive": [
            "worth"
        ],
        "negative": []
    },
    "article": {
        "title": "India gets cheapest LNG as Russia's Gazprom begins supplies of worth $25 bn",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tIndia on Monday received its cheapest <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=lng\" target=\"_blank\">LNG </a>under a long-term deal as Russia began shipping natural gas at a delivered price of close to $7 per million British thermal unit.</p>\n<p>\n\tAt current oil prices, the Russian rate is $1.5 per mmBtu less than the price at which Qatar, India's oldest supplier, delivered liquefied natural gas (LNG).</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=russian+supplies\" target=\"_blank\">Russian supplies </a>are also cheaper by $1-1.5 per mmBtu than the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=lng\" target=\"_blank\">LNG </a>sourced from Australia and the US.</p>\n<p>\n\tOil Minister Dharmendra Pradhan, who flew in here to witnessed arrival of first <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=lng\" target=\"_blank\">LNG </a>ship under a 20-year import deal with Gazprom, termed the event as Golden Day in the India's energy pursuit.</p>\n<p>\n\tState-owned gas utility <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=gail+india\" target=\"_blank\">GAIL India </a>Ltd had in January taken advantage of Russian company's inability to deliver LNG from the previously agreed Schtokman project in the Barents Sea, to renegotiate price agreed in 2012.</p>\n<p>\n\tGAIL also deferred taking deliveries of full 2.5 million tonnes a year LNG. The contract period was extended by three years to accommodate the supplies not taken in initial years as well as get an additional 2 million tonnes over-and-above the 50 million tonnes it had agreed to take in 2012 over the 20 year contract period.</p>\n<p>\n\tLNG carrier 'LNG Kano ', bringing cargo from Russian supplier Gazprom, docked at <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=petronet+lng\" target=\"_blank\">Petronet LNG </a>Ltd's import facility here this morning.</p>\n<p>\n\tGazprom supplied the 3.4 trillion British thermal unit (TBtu) of cargo from Nigeria. \"First we renegotiated price of LNG from Qatar, then reworked Australian supplies and now gas from Russia under renegotiated terms has started to flow, Pradhan said after receiving the LNG cargo.</p>\n<p>\n\tIndia will import LNG worth an estimated $25 billion over the contract period from Russia, he said. \"Gazprom price (after being reworked) is very competitive.\"<br>While he did not give details, sources with direct knowledge of the development said the reworked price at current oil rate comes to close to $7 per mmBtu, which is cheaper than the delivered price of LNG under the 25-year deal with RasGas of Qatar.</p>\n<p>\n\tAlso it is cheaper than Gorgon LNG from Australia and Henry-hub linked US LNG, supplies of which started only a few weeks back.</p>\n<p>\n\tIndia, Pradhan said, is pushing towards a gas-based economy by raising the share of environment friendly fuel in the energy basket to 15 per cent from current 6.2 per cent.</p>\n<p>\n\tThere exists huge scope for gas usage in Indian economy -- from generating power to producing quality steel, he said, adding that increasing gas share would also help the country meet its <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=cop21+commitment\" target=\"_blank\">COP21 commitment </a>to cutting carbon emission.</p>\n<p>\n\tIndia is dependent on imports to meet 45 per cent of its gas needs.</p>\n<p>\n\tBeginning of supplies from Russia comes within weeks of India importing its first ever LNG cargo from US under a long-term import deal.</p>\n<p>\n\tPradhan said the starting of LNG imports from Russia has added a new dimension to the Indo-Russian bilateral relations, particularly in the oil &amp; gas sector.&nbsp;<br></p>\n<!-- INPAGE_BANNER -->\n\t<br>Russia has emerged as a long-term source for India's hydrocarbon imports, he said.\n<p>\n\tStating that the government is committed to transforming India into a gas-based economy, he said investments are being made for augmenting natural gas infrastructure, including pipelines, LNG import terminals and City Gas Distribution networks. ?<br>In the last few years, Indian companies have made investment of more than USD 10 billion in acquiring varying stakes in strategic Russian projects including Sakhalin-1, Vankorneft and Taas-Yuryakh. On the other hand, Russian company led consortium has committed an investment of USD 13 billion in Esaar Oil in 2016.</p>\n<p>\n\tRussia is currently, world's largest crude oil &amp; second largest gas producer in the world. India is world's third largest energy consumer and fourth largest importer of LNG. ?<br>GAIL has renegotiated with Russian supplier Gazprom the terms of the 20-year deal to import 2.5 million tonnes a year of LNG. Both price and volume ramp up have been renegotiated.</p>\n<p>\n\tGAIL Chairman and Managing Director B C Tripathi said the contracted volume has been lowered from 2.5 million tonnes to 0.5 MT in the first year 2018-19; 0.75 MT in 2019-20; 1.5 MT in the third year 2020-21.</p>\n<p>\n\tThe company has committed to importing the full 2.5 MT a year by the fourth year and make up for the initial volume reduction over the remaining length of the contract.</p>\n<p>\n\tAlso, the price indexation has been changed from the Japan Customs-cleared Crude to Brent, and the oil-linked slope of the contract formula lowered, and therefore the final price.</p>\n<p>\n\tSources said the renegotiated contract provides for diverting a part of the volume, originally contracted on a delivered ex-ship basis, to other markets.</p>\n<p>\n\tUnder the re-worked deal with Gazprom, the duration of the contract has been extended by three years and the Indian company has agreed to buy an additional six million tonnes of LNG volumes.</p>\n<p>\n\tThe pricing of the super-cooled fuel has been changed from 9 month linkage to Japanese Customs cleared crude to three months average of Brent, sources said.&nbsp;<br>The deferral will allow GAIL more time to find customers for the imported gas.</p>\n<p>\n\tGAIL had signed the original deal on August 29, 2012 with Gazprom Marketing and Trading Singapore Pte Ltd (GMTS), Singapore.</p>\n<p>\n\tThe deal was renegotiated in January this year. Gazprom will supply LNG from Yamal LNG project in the Arctic peninsula.</p>\n<p>\n\tIndia has been making the most of its position as one of the world's biggest energy consumers to strike better bargains for its companies.</p>\n<p>\n\tLast year, India got US energy major Exxon Mobil Corp to lower price of 1.5 MT a year of LNG from Gorgon project in Australia, saving Rs 4,000 crore in import bill.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Russian",
        "worth",
        "25",
        "current",
        "less",
        "liquefied",
        "natural"
    ],
    "nouns": [
        "India",
        "Russia",
        "Russian",
        "supplier",
        "worth",
        "25",
        "At",
        "current",
        "oil",
        "price",
        "rate",
        "Qatar",
        "natural",
        "gas"
    ],
    "verbs": [
        "oil",
        "price",
        "rate",
        "gas"
    ]
}