{
    "title": "India's gold import is likely to fall at least 15% in 2018",
    "link": "https://www.business-standard.com/article/economy-policy/gold-import-likely-to-fall-by-15-118061100031_1.html",
    "pubDate": "Mon, 11 Jun 2018 07:02:00 +0530",
    "content": "High prices, weaker rupee and tighter credit may dampen demand; but this might come as a relief for policymakers, RBI",
    "contentSnippet": "High prices, weaker rupee and tighter credit may dampen demand; but this might come as a relief for policymakers, RBI",
    "guid": "https://www.business-standard.com/article/economy-policy/gold-import-likely-to-fall-by-15-118061100031_1.html",
    "isoDate": "2018-06-11T01:32:00.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.16666666666666666,
        "tokens": [
            "india's",
            "gold",
            "import",
            "is",
            "likely",
            "to",
            "fall",
            "at",
            "least",
            "15",
            "in",
            "2018"
        ],
        "words": [
            "gold"
        ],
        "positive": [
            "gold"
        ],
        "negative": []
    },
    "article": {
        "title": "India's gold import is likely to fall at least 15% in 2018",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p> After a steep rise last year, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gold\" target=\"_blank\">gold </a>import is likely to fall at least 15 per cent in 2018.</p> <p> This might come as a relief for policymakers and the Reserve Bank of India (RBI). In the monetary policy review presented on June 6, the central bank had said a significant decline in import of gold, pearls and precious stones had offset the impact of rising crude oil prices in April.\n\n\n</p>\n<!-- INPAGE_BANNER --> <p> The RBI was worried about a high oil import bill, which could have an adverse impact on the currency and fiscal position. <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gold\" target=\"_blank\">Gold </a>import projection is expected to be lower for the second half of the year. The bullion market is rife with rumours of the government putting more restriction on import.<span></span> <span></span> </p><p> <strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/markets/gold-may-hit-rs-34-000-mark-by-diwali-on-weak-rupee-geo-political-concerns-118061000238_1.html\" target=\"_blank\">Gold may hit Rs 34,000 mark by Diwali on weak rupee, geo-political concerns</a></strong></p> <p> \"Our expectation is that gross import this year is to be 720 to 750 tonnes, as against 880 tonnes last year,\" said Sudheesh Nambiath, a lead analyst, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=gfms+thomson+reuters\" target=\"_blank\">GFMS Thomson Reuters.</a></p> <p> Bankers and market participants suggest tighter credit after the Punjab National Bank scam, higher <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gold\" target=\"_blank\">gold </a>prices and a weak rupee would dampen demand.</p> <p> \"Demand is low on account of poor investment, firming up of US interest rates and increased prices. Equity is still a preferred asset,\" said Shekhar Bhandari, senior executive vice-president, Kotak Mahindra Bank.</p> <p> <img align=\"left\" alt=\"Chart\" class=\"imgCont\" height=\"485\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/11/full/1528661725-0543.jpg\" title=\"Chart\" width=\"359\"></p> Import has been falling since January and remained low in April. There was a 32.6 per cent year-on-year decline to 63 tonnes. In May, import is estimated to touch 48 tonnes. <p>The trend for June and July is also expected to be subdued.</p> <p> Before implementation of the goods and services tax, many traders were restocking. They had replaced unaccounted gold with officially imported ones. Demand was robust then because of lower prices. Due to the absence of restocking demand, prices are now high.</p> <p> \"With the tightening of credit, planned store additions might slow down this year,\" said Nambiath. High prices will continue to dampen retail consumption and it is likely that a high proportion of old jewellery will get exchanged for new ones (instead of buying fresh).</p> <p> Kotak's Bhandari expects demand to pick up in the second half. \"A good monsoon will result in rise in demand. So, September-November is expected to be good.\"</p> <p> A bullion trader said if demand from the rural sector improves due to a normal monsoon, unofficial and rampant import would easily fill the gap.</p> <span></span>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "gold",
        "likely",
        "least",
        "High",
        "15"
    ],
    "verbs": [
        "credit",
        "import",
        "fall",
        "dampen",
        "demand"
    ]
}