{
    "title": "UCBs with deposits of Rs 1bn should have Boards of Management, says RBI",
    "link": "https://www.business-standard.com/article/economy-policy/ucbs-with-deposits-of-rs-1bn-should-have-boards-of-management-says-rbi-118062500980_1.html",
    "pubDate": "Mon, 25 Jun 2018 21:40:00 +0530",
    "content": "BoM will be in addition to the Board of Directors (BoD), said the RBI's draft guidelines on which it has invited public comments by July 24.",
    "contentSnippet": "BoM will be in addition to the Board of Directors (BoD), said the RBI's draft guidelines on which it has invited public comments by July 24.",
    "guid": "https://www.business-standard.com/article/economy-policy/ucbs-with-deposits-of-rs-1bn-should-have-boards-of-management-says-rbi-118062500980_1.html",
    "isoDate": "2018-06-25T16:10:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "ucbs",
            "with",
            "deposits",
            "of",
            "rs",
            "1bn",
            "should",
            "have",
            "boards",
            "of",
            "management",
            "says",
            "rbi"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "UCBs with deposits of Rs 1bn should have Boards of Management, says RBI",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rbi\" target=\"_blank\">RBI </a>on Monday proposed that all Urban Co-operative Banks (UCBs) having deposits of over Rs 100 crore will have to set up a <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=board+of+management\" target=\"_blank\">Board of Management </a>within one year to promote professional management in the banks.</p>\n<p>\n\tBoM will be in addition to the Board of Directors (BoD), said the RBI's draft guidelines on which it has invited public comments by July 24.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tAn expert committee on licensing of new Urban Cooperative Banks (2010) set up under the chairmanship of Y H Malegam had recommended, inter alia, that a BoM in every UCB, in addition to the BoD, which was reiterated by the High Powered Committee on Urban Cooperative Banks (Chairman R Gandhi) constituted in January 2015.</p>\n<p>\n\tAfter considering the feedback of the stakeholders, it has been decided to implement the suggestion of the Malegam Committee on putting in place a BoM in addition to BoD in UCBs, the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rbi\" target=\"_blank\">RBI </a>said.<br></p>\n\n<p>\n\tCurrently, the BoD of a <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ucb\" target=\"_blank\">UCB </a>perform both the executive and supervisory roles and has the responsibility to oversee the functioning of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ucb\" target=\"_blank\">UCB </a>as a co-operative society as well as its functions as a bank.</p>\n<p>\n\tSince UCBs are accepting public deposits, it is imperative that a separate mechanism be put in place to protect the interests of depositors, the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rbi\" target=\"_blank\">RBI </a>said while proposing to implement a BoM consisting of members with special knowledge and practical experience in banking to facilitate professional management and focussed attention to banking related activities of UCBs.</p>\n<p>\n\t\"There shall be a BoM in every <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ucb\" target=\"_blank\">UCB </a>in addition to the Board of Directors. BoM shall be constituted by the Board of Directors (BoD). Existing UCBs having deposit size exceeding Rs 100 crore shall put in place the BoM within a period of one year. Other banks may constitute the BoM within a period of two years,\" the draft said.<br></p>\n\n<p>\n\tThe proposed BoM will have a minimum of three members in UCBs having deposit size up to Rs 100 crore and five members in UCBs having deposit size above Rs 100 crore.</p>\n<p>\n\tThe maximum number of members in BoM should not exceed 12.</p>\n<p>\n\tAs per the draft, the BoD, however, will continue to be the apex policy setting body and constitute various committees of the Board, including the BoM to assist the Board in carrying out its responsibilities.</p>\n<p>\n\tIt will delegate powers to the various committees as considered appropriate.</p>\n<p>\n\tOn the functions of the BoM, the draft said it will consider loan proposals, recommend action for recovery of bad loans, implement sound internal controls and oversee compliances, among others.</p>\n<p>\n\tThe draft also proposes Fit and Proper' criteria for selection of Chief Executive Officers or Managing Directors of UCBs.</p>\n<p>\n\tThe draft said that any person who has had a business relationship with the bank, in question, during the immediate preceding three years will not be eligible for appointment as members of BoM.</p>\n<p>\n\tFurther, constitution of BoM will be a mandatory condition for obtaining regulatory approval for expansion of area of operation and opening of new branches by existing UCBs.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "public",
        "24"
    ],
    "verbs": [
        "Board",
        "will",
        "draft"
    ]
}