{
    "creator": "Reuters",
    "title": "Asia stocks edge up after G7; US Fed, ECB meetings eyed; investors await Trump-Kim summit",
    "link": "https://www.financialexpress.com/market/asia-stocks-edge-up-after-g7-us-fed-ecb-meetings-eyed-investors-await-trump-kim-summit/1201003/",
    "pubDate": "Mon, 11 Jun 2018 08:38:20 +05:30",
    "dc:creator": "Reuters",
    "content": "Asia stocks shook off initial modest losses and edged up on Monday ahead of a U.S.-North Korea summit that might ease regional tensions, while investors also started to focus on key central bank meetings later this week. ",
    "contentSnippet": "Asia stocks shook off initial modest losses and edged up on Monday ahead of a U.S.-North Korea summit that might ease regional tensions, while investors also started to focus on key central bank meetings later this week.",
    "guid": "https://www.financialexpress.com/?p=1201003",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-11T03:08:20.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.06666666666666667,
        "tokens": [
            "asia",
            "stocks",
            "edge",
            "up",
            "after",
            "g7",
            "us",
            "fed",
            "ecb",
            "meetings",
            "eyed",
            "investors",
            "await",
            "trump-kim",
            "summit"
        ],
        "words": [
            "await"
        ],
        "positive": [],
        "negative": [
            "await"
        ]
    },
    "article": {
        "title": "Asia stocks edge up after G7; US Fed, ECB meetings eyed; investors await Trump-Kim summit",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"wp-image-1201004 size-full\" src=\"https://images.financialexpress.com/2018/06/Asian-Shares-Reuters-1-2.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/Asian-Shares-Reuters-1-2.jpg 660w, https://images.financialexpress.com/2018/06/Asian-Shares-Reuters-1-2-300x200.jpg 300w, https://images.financialexpress.com/2018/06/Asian-Shares-Reuters-1-2-620x413.jpg 620w, https://images.financialexpress.com/2018/06/Asian-Shares-Reuters-1-2-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> MSCI’s broadest index of Asia-Pacific shares outside Japan slipped early but was last up 0.15 percent. (Image: Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>Asia stocks shook off initial modest losses and edged up on Monday ahead of a U.S.-North Korea summit that might ease regional tensions, while investors also started to focus on key central bank meetings later this week. Stocks dipped after U.S. President Donald Trump backed out of a joint Group of Seven communique over the weekend, in a blow to the group’s efforts to show a united front. The S&amp;P 500 futures were down 0.1 percent after dropping as much as 0.3 percent. MSCI’s broadest index of Asia-Pacific shares outside Japan slipped early but was last up 0.15 percent. Hong Kong’s Hang Seng gained 0.3 percent while the Shanghai Composite Index fell 0.5 percent. South Korea’s KOSPI added 0.4 percent, and Japan’s Nikkei climbed 0.3 percent.</p><span>\n</span><p>“What took place at the G7 weekend was within the scope of earlier expectations. And while the countries disagreed on trade, they did seem to show a unified front on the North Korean issue, so there is also a positive element from the G7 affecting risk sentiment,” said Masahiro Ichikawa, senior strategist at Sumitomo Mitsui Asset Management.</p><span>\n</span><p>After the G7 meeting, the U.S. president withdrew his support for its communique and raised fresh trade concerns by taking aim at Canadian Prime Minister Justin Trudeau amid a spat over import tariffs. “The G7 meeting in Canada reiterated the growing rift between Washington and its allies over free trade,” wrote Tai Hui, chief market strategist for Asia Pacific at J.P. Morgan Asset Management. “Business confidence, and subsequently capital spending, is at risk if this tension continues through the summer,” he said, adding that central bank meetings will be critical events this week.</p><span>\n</span><p>Trump and North Korean leader Kim Jong Un will have an unprecedented meeting on Tuesday in Singapore, possibly laying the groundwork for ending a nuclear stand-off between the old foes. Investors also got prepared for a raft of other key events. The Federal Reserve holds a two-day meeting starting on June 12, and it is widely expected to raise interest rates for the second time this year. The focus is on whether the central bank will hint at raising rates a total of four times in 2018.</p><span>\n</span><p>The European Central Bank meets on June 14, when it could signal intentions to start unwinding its massive bond purchasing programme. On Monday, the dollar slipped against the yen, which often draws demand in times of market turmoil and political tensions. The greenback was down 0.1 percent at 109.455 yen. The Canadian dollar, which has been dogged by fears Trump may scrap the North American Free Trade Agreement (NAFTA), fell 0.25 percent to C$1.2959 per dollar.</p><span>\n</span><p>The euro, which was lifted last week amid the prospect of the ECB signalling its exit from easy policy, was 0.25 percent higher at $1.1801.&nbsp;The dollar index against a basket of six major currencies was 0.15 percent lower at 93.410. Oil prices were mixed, caught between the downward pull of rising Russian production and U.S. oil drilling activity, and upward pressure from strong demand.</p><span>\n</span><p>Brent crude futures were up 0.1 percent at $76.55 a barrel. U.S. crude futures &amp;lt;CLc1. Slipped 0.15 percent to $65.66 a barrel. Bitcoin struggled near two-month lows after South Korean cryptocurrency exchange Coinrail said it was hacked over the weekend, raising concerns about security at small- to mid-sized virtual currency exchanges.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "central",
        "modest",
        "regional",
        "later",
        "off",
        "ahead",
        "North",
        "edged",
        "eyed",
        "initial",
        "U",
        "key"
    ],
    "nouns": [
        "central",
        "US",
        "Monday",
        "bank",
        "Trump",
        "stocks",
        "S",
        "Fed",
        "summit",
        "North",
        "Korea",
        "Asia",
        "edge",
        "shook",
        "initial",
        "losses",
        "U",
        "ease",
        "focus",
        "key",
        "week"
    ],
    "verbs": [
        "bank",
        "Trump",
        "off",
        "summit",
        "edge",
        "await",
        "initial",
        "ease",
        "focus",
        "key"
    ]
}