{
    "creator": "Sudhir Chowdhary",
    "title": "Skagen Falster review: A worthy wearable companion",
    "link": "https://www.financialexpress.com/industry/technology/skagen-falster-a-worthy-wearable-companion/1200793/",
    "pubDate": "Mon, 11 Jun 2018 01:09:23 +05:30",
    "dc:creator": "Sudhir Chowdhary",
    "content": "The Falster is an elegant timepiece that comes with smart features and an affordable price.",
    "contentSnippet": "The Falster is an elegant timepiece that comes with smart features and an affordable price.",
    "guid": "https://www.financialexpress.com/?p=1200793",
    "categories": [
        "Industry",
        "Technology"
    ],
    "isoDate": "2018-06-10T19:39:23.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.2857142857142857,
        "tokens": [
            "skagen",
            "falster",
            "review",
            "a",
            "worthy",
            "wearable",
            "companion"
        ],
        "words": [
            "worthy"
        ],
        "positive": [
            "worthy"
        ],
        "negative": []
    },
    "article": {
        "title": "Skagen Falster review: A worthy wearable companion",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1200797\" src=\"https://images.financialexpress.com/2018/06/falster-1.jpg\" alt=\"Skagen Falster, Skagen, falster, smartwatch, watch, mens watch, digi watch, digital watch, touch watch\" srcset=\"https://images.financialexpress.com/2018/06/falster-1.jpg 660w, https://images.financialexpress.com/2018/06/falster-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/falster-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/falster-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The Falster does a splendid job in helping you keep updated with all your WhatsApp messages, Gmail and SMSes.</figure>\n\t\t\t</section></div><span>\n</span><p>Smartwatches can be initially confusing and intimidating to those who are somewhat conservative when it comes to the adoption of new technology, but after using them for an extended amount of time both the user and the device begin to work in harmony. Take the case of Falster, the first-ever touchscreen smartwatch from Fossil Group brand Skagen. This wearable device is a perfect blend of form and function—modern, minimalist design with added technology that simplifies rather than complicates, and connects rather than distracts.</p><span>\n</span><p>My point is this: Many people—myself included—like to have advanced features around fitness and connectivity in their wristwatches but they want their wrist wear to look like a ‘normal’ watch and not a futuristic band, normally worn by Leonard “Bones” McCoy, one of the central characters in the Star Trek series, alongside Captain James T Kirk.</p><span>\n</span><p>The Falster smartwatch blends simple, timeless design with modern innovation. It is available in two models—SKT5000 and SKT5001. With features like an efficient battery, automatic time accuracy, activity tracking, customisable watch faces, voice commands powered by <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/google/\">Google</a> Assistant, wireless syncing and even more, you will see that Falster is an efficient go-to accessory as soon as you put it on and swipe across the dial. We received the SKT5000 for a trial evaluation; it retails for Rs 19,995. Here are our views on some of its features and performance.</p><span>\n</span><p>Out of the box, the Falster comes across as a stylish piece of wear. The watch has a smart and stylish steel-mesh on the exterior, it is powered by Android Wear 2.0 and the Qualcomm Snapdragon Wear 2100 platform. It is compatible with iOS 9.0+/Phone 5+ and Android Devices 4.4+. It connects via Bluetooth technology, there is wireless syncing too.</p><span>\n</span><p>To get started, connect the Falster to the included charger. When it’s fully charged, press the button to turn it on. Download the latest version of the Android Wear app onto your phone from the App Store or Google Play Store. Open the app, enable Bluetooth and follow the prompts to pair your smartwatch. Once paired, your smartwatch screen will walk you through the rest of the setup.</p><span>\n</span><p>Switched on, the Falster features a full-round touchscreen that allows for expanded capabilities while maintaining an understated design and intuitive, easy-to-navigate interface. The dials seek to be simple and visually balanced, showing information in an edited and informative way, without adding unnecessary clutter. The dial layouts and the movements are designed for calm and pleasant interaction.</p><span>\n</span><p>The Falster has a range of smart features: Function-based dials—so you can access your favourite features quickly; Automatic accuracy—so you never have to set your watch; Smartwatch notifications—so you can effortlessly view incoming calls, texts, and emails from your wrist; Activity tracking, Customisable watch faces allowing users to personalise their dial’s mode, colour, and apps; Voice commands powered by the Google Assistant; Music control through third-party apps like Google Play.</p><span>\n</span><p>For most of us, notifications are the main reason to buy a smartwatch. The Falster does a splendid job in helping you keep updated with all your <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/whatsapp/\">WhatsApp</a> messages, Gmail, SMSes, straight from your wrist without having to fish out your phone from the pocket or bag. You can also figure out who is calling you. However, you will need to take the call from your mobile phone—a big disappointment, especially at a time when numerous smartwatches allow you to take and decline calls on the watch itself.</p><span>\n</span><p>Additionally, the Falster is capable of step counting, it also runs fitness apps such as Fit and Fit Workout. The benefit of these features is that they hook in users with other useful features, making them less likely to be sidelined.</p><span>\n</span><p>The main argument against smartwatches is that they simply do everything a smartphone can, which is true, but take my word, they are not there to replace your phone—they are there to complement it, and make your life that little bit easier. The Falster does that to precision and it is ready to rule your wrist.</p><span>\n</span><ul>\n<li>Estimated street price: Rs 19,995</li>\n</ul><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "wearable",
        "worthy",
        "smart",
        "elegant",
        "affordable"
    ],
    "nouns": [
        "price",
        "wearable",
        "worthy",
        "smart",
        "companion",
        "timepiece",
        "review",
        "A"
    ],
    "verbs": [
        "price",
        "smart",
        "companion",
        "review"
    ]
}