{
    "title": "ICICI Bank board meets to decide Kochhar's fate",
    "link": "https://timesofindia.indiatimes.com/business/india-business/is-chanda-kochhar-on-her-way-out-bank-board-meets-to-decide-ceos-fate/articleshow/64632014.cms",
    "pubDate": "Mon, 18 Jun 2018 08:14:55 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/is-chanda-kochhar-on-her-way-out-bank-board-meets-to-decide-ceos-fate/articleshow/64632014.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64632014.cms\" /></a>The bank's board is discussing a reshuffle of its top management that may see its life insurance venture’s CEO Sandeep Bakhshi becoming interim chief.",
    "contentSnippet": "The bank's board is discussing a reshuffle of its top management that may see its life insurance venture’s CEO Sandeep Bakhshi becoming interim chief.",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/is-chanda-kochhar-on-her-way-out-bank-board-meets-to-decide-ceos-fate/articleshow/64632014.cms",
    "isoDate": "2018-06-18T08:14:55.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "icici",
            "bank",
            "board",
            "meets",
            "to",
            "decide",
            "kochhar's",
            "fate"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Is Chanda Kochhar on her way out? Bank board meets to decide CEO's fate",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>The </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/ICICI-Bank\">ICICI Bank</a><span> board is meeting today to decide the fate of its chief executive officer </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/chanda-kochhar\">Chanda Kochhar</a><p> and finalise the proposal to appoint Justice BN Srikrishna as the head of the probe committee, multiple sources aware with the development said. \n\n</p><span>ET had reported that the board of directors of the private lender are discussing a reshuffle of its top management that may see its life insurance venture’s CEO </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Sandeep-Bakhshi\">Sandeep Bakhshi</a><p> becoming interim chief at ICICI Bank. To be sure, the board is yet to sign off on the decision to make the changes, sources aware of the development said. \n</p><p>This comes amid investigations into ICICI Bank chief executive Chanda Kochhar’s alleged violation of the lender’s code of conduct.\n</p><p>The rearrangement is being contemplated by the board as BN Srikrishna, a retired Supreme Court judge, investigates the role of Kochhar, who is likely to be on leave until the investigation is complete. Srikrishna will investigate whether Kochhar violated the bank's code of conduct and the allegations relating to conflict of interest.\n</p><span> \n</span><p>Kochhar is currently on her annual leave. ET has also learnt that the Incidentally, Insurance Regulatory and Development Authority (IRDA) officials have been informally told that ICICI Prudential Life may see Bakhshi may move to a different role and that the regulator would be informed accordingly, said one of the persons. \n</p><span>The bank has been shaken by conflict-of-interest allegations by a whistle blower against Kochhar over loans to </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Videocon\">Videocon</a><p> Industries. It was alleged that she did not disclose business dealings of her husband Deepak Kochhar with the Dhoots of Videocon.\n</p><p>While ICICI Bank chairman MK Sharma has said that the board was convinced that Kochhar was in the clear, a second accusation was made recently on similar grounds.\n</p><span>\n</span><br><span>Chanda Kochhar was on the bank’s credit committee that sanctioned a loan of Rs 3,250 crore to the Videocon Group in 2012. Videocon’s promoter Venugopal Dhoot was one of the first investors in NuPower Renewables promoted by Deepak Kochhar, Chanda Kochhar’s husband, in 2008.\n</span><br><span>\n</span><br><span> Dhoot subsequently sold his stake but firms controlled by him or his associates maintained a relationship with NuPower until early 2013 when control was finally transferred to a trust controlled by Deepak Kochhar for a small sum.\n</span><br><span>\n</span><br><span>The lender and Chanda Kochhar have denied any wrongdoing. \n</span><br><span>\n</span><br><span>\n</span><br><span>\n</span></div></div>"
    },
    "adjectives": [
        "10",
        "left",
        "top",
        "right",
        "interim",
        "chief",
        "becoming"
    ],
    "nouns": [
        "india",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo",
        "interim",
        "reshuffle",
        "management",
        "Bank",
        "bank",
        "may",
        "board",
        "chief",
        "fate",
        "life",
        "insurance",
        "venture",
        "CEO"
    ],
    "verbs": [
        "border",
        "align",
        "style",
        "top",
        "right",
        "reshuffle",
        "Bank",
        "bank",
        "decide",
        "board",
        "fate",
        "venture"
    ]
}