{
    "creator": "Bloomberg",
    "title": "ONGC’s funds drop 90% in one year;  this is why cash reserves shrunk",
    "link": "https://www.financialexpress.com/market/commodities/ongcs-funds-drop-90-in-one-year-this-is-why-cash-reserves-shrunk/1201011/",
    "pubDate": "Mon, 11 Jun 2018 08:59:04 +05:30",
    "dc:creator": "Bloomberg",
    "content": "ONGC’s reserves dropped to about 10 billion rupees ($148 million) as on March 31 from nearly 130 billion rupees a year earlier.",
    "contentSnippet": "ONGC’s reserves dropped to about 10 billion rupees ($148 million) as on March 31 from nearly 130 billion rupees a year earlier.",
    "guid": "https://www.financialexpress.com/?p=1201011",
    "categories": [
        "Commodities",
        "Market"
    ],
    "isoDate": "2018-06-11T03:29:04.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.07692307692307693,
        "tokens": [
            "ongc’s",
            "funds",
            "drop",
            "90",
            "in",
            "one",
            "year ",
            "this",
            "is",
            "why",
            "cash",
            "reserves",
            "shrunk"
        ],
        "words": [
            "drop"
        ],
        "positive": [],
        "negative": [
            "drop"
        ]
    },
    "article": {
        "title": "ONGC’s funds drop 90% in one year;  this is why cash reserves shrunk",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1191656\" src=\"https://images.financialexpress.com/2018/06/ongc-1.jpg\" alt=\"petrol, diesel, petrol and diesle prices, petrol price, petrol price in delhi, petrol price in india, today petrol price, diesle price in india, petrol rate\" srcset=\"https://images.financialexpress.com/2018/06/ongc-1.jpg 660w, https://images.financialexpress.com/2018/06/ongc-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/ongc-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/ongc-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> India’s Oil and Natural Gas Corp., which once had .3 billion of funds, is now bleeding cash.</figure>\n\t\t\t</section></div><span>\n</span><p>India’s Oil and Natural Gas Corp., which once had $4.3 billion of funds, is now bleeding cash. The state-run company’s cash reserves have shrunk by more than 90 percent in the past year, after it was ordered to purchase the administration’s stake in a refiner and it paid a record dividend. ONGC’s reserves dropped to about 10 billion rupees ($148 million) as on March 31 from nearly 130 billion rupees a year earlier, according to data compiled by Bloomberg.</p><span>\n</span><p>ONGC’s largest shareholder, Prime Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/narendra-modi/\">Narendra Modi</a>’s government, has been tapping state-run companies including India’s biggest energy explorer to bridge its fiscal deficit. That’s left the company with depleting cash at a time when it has been ordered to boost investment to help cut the nation’s crude imports. ONGC paid 426 billion rupees last fiscal year as dividend to the government and to buy its stake in the refiner. “ONGC is heavily leveraged now,” Aloke Kumar Banerjee, the company’s former finance head, said in an interview. “It’s important for exploration companies to have sizable cash balance as buffer. It’s a high-risk business.” The energy explorer’s shares have fallen 17 percent from a January high and ended last week at 173.20 rupees.</p><span>\n</span><p>ONGC aims to spend 860 billion rupees on 31 big projects to boost oil and gas production, according to its website. The company has started work on its largest-ever exploration project that will require investments of more than $5 billion over about four years. Earlier this year, ONGC sold debt for the first time to pay for the 369.2 billion rupee acquisition of the government’s holding in refiner Hindustan Petroleum Corp. Its capital expenditure swelled to a record 729 billion rupees in the year ended March as it also invested 283.5 billion rupees on exploration and production, and 74.8 billion rupees to buy a stake in a block operated by Gujarat State Petroleum Corp, according to the company’s website.</p><span>\n</span><p>ONGC has about 250 billion rupees of one-year loans maturing in January, according to company officials, who asked not to be identified as they are not allowed to speak to the media. It used up cash it had for capital expenditure and the acquisitions and needs about 21 billion rupees more for the final dividend payout for the year ended March, the officials said. The company officials said that ONGC has no plans to raise more debt to fund its capital expenditure of 320 billion rupees in the current fiscal that started April 1. Cash flows through the year will suffice, they said.</p><span>\n</span><p>In the past, ONGC has been asked to share fuel subsidies by selling oil to refiners at a discount, a burden that was taken entirely off its back only in the year ended March 2017. Despite these pressures ONGC ’s credit rating remains good, primarily because it is majority owned by the government, which means a sovereign assurance and easier access to the domestic banking system. Moody’s Investors Service has a very high investment grade rating on ONGC, Vikas Halan, senior vice president at the ratings company said in an interview. “In terms of financial ability, they have access to the banking sector in India unlike anybody else.”</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "earlier",
        "million",
        "one",
        "10",
        "billion",
        "90",
        "31",
        "130"
    ],
    "nouns": [
        "million",
        "year",
        "one",
        "March",
        "10",
        "reserves",
        "billion",
        "funds",
        "drop",
        "90",
        "why",
        "cash"
    ],
    "verbs": [
        "March",
        "drop",
        "cash"
    ]
}