{
    "creator": "Nandagopal Rajan",
    "title": "Sony MHC-V81D review: Strictly for the party animals",
    "link": "https://www.financialexpress.com/industry/sony-mhc-v81d-review-strictly-for-the-party-animals/1209870/",
    "pubDate": "Mon, 18 Jun 2018 01:19:14 +05:30",
    "dc:creator": "Nandagopal Rajan",
    "content": "Music is subject to individual tastes. So is the audio equipment used to recreate and replay music. There are a lot of users out there who have specific needs and uses related to their lifestyle.",
    "contentSnippet": "Music is subject to individual tastes. So is the audio equipment used to recreate and replay music. There are a lot of users out there who have specific needs and uses related to their lifestyle.",
    "guid": "https://www.financialexpress.com/?p=1209870",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-17T19:49:14.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "sony",
            "mhc-v81d",
            "review",
            "strictly",
            "for",
            "the",
            "party",
            "animals"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Sony MHC-V81D review: Strictly for the party animals",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1209875\" src=\"https://images.financialexpress.com/2018/06/sony.jpg\" alt=\"Sony MHC-V81D, sony,&nbsp;DVD player, music\" srcset=\"https://images.financialexpress.com/2018/06/sony.jpg 660w, https://images.financialexpress.com/2018/06/sony-300x200.jpg 300w, https://images.financialexpress.com/2018/06/sony-620x413.jpg 620w, https://images.financialexpress.com/2018/06/sony-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Music is subject to individual tastes. So is the audio equipment used to recreate and replay music. There are a lot of users out there who have specific needs and uses related to their lifestyle.</figure>\n\t\t\t</section></div><span>\n</span><p>Music is subject to individual tastes. So is the audio equipment used to recreate and replay music. There are a lot of users out there who have specific needs and uses related to their lifestyle. While someone like me prefers to listen to music to relax, there are others who want music to add a level of excitement to their lives and liven up the environment when they are organising a party, for instance. This why Sony and others have for sometime been looking at the party speaker category. The latest from Sony in this range is the MHC-V81D, which can replace not just the DJ, but also the party arrangers who bring in blingy lights to add to the mood. Sony MHC-V81D is a large speaker, almost the size of a small refrigerator. So the first thing you need to keep in mind is whether you have the space for a speaker like this in your house. I did not. So it did stick out in the house, even when I was having a party. Thankfully, there are rollers at the back to drag it from one part of the house to the other.</p><span>\n</span><p>While this is actually a large Bluetooth speaker, MHC-V81D has almost all source options, including a DVD player. So, figuring out what to play should not be an issue. I used it primarily yoked to my iPhone as I could not find where my stash of music CDs from my nether life were. The audio controls while streaming music from the phone are independent, so you will need to adjust both to get to the right levels. And if the phone rings while you are playing the music loudly, then you can just pray you have good vibes with your neighbours as they will be banging on the doors to throw you out of the apartment complex. The pro tip here is to the keep the phone offline, if you are indeed streaming from it. The MHC-V81D comes with party lights, karaoke options as well as some DJ gimmicks in case your party is falling flat despite the loud music. The lights are fun and can be controlled using the Sony Fiesta app. I found them a bit too loud even by Punjabi wedding standards, but then I am a boring person.</p><span>\n</span><p>I could not try out the Karaoke option as I did not have a microphone or the vocals for the same. The DJ options are good in the hands of someone who knows how to mix this noise into their music. The speakers are loud, and have the right amount of mega bass for a party. I did try it out at a gathering I had in the house, but then we switched it off in favour of some conversation. Yeah, this is for the kind of party where unnecessary conversation is frowned upon and drowned in loud music. And like its lights which have 360-degree spread, the audio goes all around the room. I thought the MHC-V81D was too complicated for my daily dose of music. It has good output, but something or the other was adding that extra layer to my music. And for just listening to your Malayalam playlist or essential Leonard Cohen, this is a bit too loud, even at low volume given the small size of my apartment. If you have a large house, regular parties and understanding neighbours, then the Sony MHC-V81D is a good investment. Regular music lovers can give this a miss.</p><span>\n</span><p>Estimated street price: Rs 51,990</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "subject",
        "individual",
        "specific",
        "used",
        "related"
    ],
    "nouns": [
        "review",
        "subject",
        "individual",
        "party",
        "audio",
        "equipment",
        "Music",
        "music",
        "So",
        "replay",
        "There",
        "specific",
        "lot",
        "lifestyle"
    ],
    "verbs": [
        "review",
        "party",
        "subject",
        "recreate",
        "replay",
        "lot"
    ]
}