{
    "title": "How Odisha's land bank is speeding up investments, avoiding repeat of Posco",
    "link": "https://www.business-standard.com/article/economy-policy/how-odisha-s-land-bank-is-speeding-up-investments-avoiding-repeat-of-posco-118060400917_1.html",
    "pubDate": "Mon, 04 Jun 2018 18:42:00 +0530",
    "content": "Historically, unavailability of land or inordinate delay in acquisition has been a key irritant to setting up of large industries in the state",
    "contentSnippet": "Historically, unavailability of land or inordinate delay in acquisition has been a key irritant to setting up of large industries in the state",
    "guid": "https://www.business-standard.com/article/economy-policy/how-odisha-s-land-bank-is-speeding-up-investments-avoiding-repeat-of-posco-118060400917_1.html",
    "isoDate": "2018-06-04T13:12:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "how",
            "odisha's",
            "land",
            "bank",
            "is",
            "speeding",
            "up",
            "investments",
            "avoiding",
            "repeat",
            "of",
            "posco"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "How Odisha's land bank is speeding up investments, avoiding repeat of Posco",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=land+bank\" target=\"_blank\">land bank </a>scheme of the Odisha government, with over 100,000 acres in the pool, is helping the state cement investor interest and accelerate the pace of implementation of fresh investments.</p>\n<p>\n\tHistorically, unavailability of land or inordinate delay in acquisition has been a key irritant to setting up of large industries. Big-ticket investors such as <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=posco\" target=\"_blank\">Posco </a>and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=arcelormittal\" target=\"_blank\">ArcelorMittal </a>bumped into land hurdles and eventually had their projects aborted in Odisha. Between them, the two steel giants proposed mega scale projects whose combined investments totaled over Rs one trillion.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tHaving learnt bitter lessons in land buying, the state government decided to create land banks across the state. The state's agency for land acquisition and infrastructure development -- Odisha Industrial Infrastructure Development Corporation (Idco) -- has filed for 129,000 acres. Of this, 62,475 are now in its possession. The results of the land pool have manifested on the ground. New industrial projects, especially the small and mid-sized investors are being alloted land from the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=land+bank\" target=\"_blank\">land bank.</a></p>\n<p>\n\t“Over the past one year, around 500 acres of land have been alloted to industries across sectors from our <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=land+bank\" target=\"_blank\">land bank.</a> Due to this scheme, the state government is in a position to offer land in any location. In addition, our <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=goiplus\" target=\"_blank\">GoiPlus </a>app helps the investor to check availability of land without a physical recce”, said a state government official.</p>\n<p>\n\tWhile the land bank mostly has smaller parcels of 200-300 acres suitable for the SMEs, Idco has plans to make available larger patches (more than 1,000 acres) of land for the large industries.</p>\n<p>\n\tThe ready availability of land is changing equations in Odisha's investment matrix. The other visible game changer is the launch of GOSWIFT- Government of Odisha Single Window for Investor Facilitation &amp; Tracking in November 2017. Within the first six months, the GOSWIFT portal has drawn 200 investment proposals valued at Rs 10.6 billion, promising employment for 10,500 persons. The investments are from sectors such as food processing, seafood, aluminium downstream, apparel, cement and tourism. Referenced on a six-month period before GO-SWIFT's launch, the quantum of investment proposals post the launch of the portal has risen by 37 per cent.</p>\n<p>\n\t“Due to the significant ease of application and expeditious approval process, there has been a considerable increase in the number of investors wanting to set up their business in the state. We will continue to raise the bar for ease of doing business and are focused on speedy implementation of investment proposals on the ground”, Sanjeev Chopra, principal secretary (industries), Odisha had said previously.</p>\n<p>\n\tOver the past six months, the state government has received and cleared proposals by some of the leading companies- Manpasand Beverages, ITC Foods, Apar Industries Limited, Sri Malani Foams (a company from the house of Century brand of mattresses), Vedanta Ltd and Lalchand Resorts.</p>\n<p>\n\tGO-SWIFT has seamlessly integrated all existing technological applications of the industries department via the Single-Sign on Framework and covers all aspects of B2G (Business to Government) interface during the investment life cycle. As a result, an industrial unit can get customized information regarding incentives and requisite approvals about the proposed investment, select land, apply for single window clearance, obtain land and other utilities, get statutory clearances, take advantage of risk-based synchronized inspections by regulatory agencies, obtain post-land allotment services, resolve issues with government departments and also dovetail its CSR activities with the developmental goals of the state. This is first-of-its-kind development by any state in the country. Over 6600 industries have registered themselves on GO-SWIFT so far to avail various kinds of services. </p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "inordinate",
        "key",
        "large"
    ],
    "verbs": [
        "land",
        "bank",
        "repeat",
        "delay",
        "key",
        "state"
    ],
    "nouns": [
        "land",
        "bank",
        "speeding",
        "repeat",
        "unavailability",
        "acquisition",
        "delay",
        "key",
        "setting",
        "large",
        "state",
        "irritant"
    ]
}