{
    "creator": "PTI",
    "title": "India has lost demographic dividend, says TV Mohandas Pai",
    "link": "https://www.financialexpress.com/economy/india-has-lost-demographic-dividend-says-tv-mohandas-pai/1210280/",
    "pubDate": "Mon, 18 Jun 2018 12:27:10 +05:30",
    "dc:creator": "PTI",
    "content": "India no longer enjoys the advantage of demographic dividend as it's saddled with crores of youngsters with low skills unsuited to the economy, claimed a human resources and education expert.",
    "contentSnippet": "India no longer enjoys the advantage of demographic dividend as it's saddled with crores of youngsters with low skills unsuited to the economy, claimed a human resources and education expert.",
    "guid": "https://www.financialexpress.com/?p=1210280",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-18T06:57:10.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.3333333333333333,
        "tokens": [
            "india",
            "has",
            "lost",
            "demographic",
            "dividend",
            "says",
            "tv",
            "mohandas",
            "pai"
        ],
        "words": [
            "lost"
        ],
        "positive": [],
        "negative": [
            "lost"
        ]
    },
    "article": {
        "title": "India has lost demographic dividend, says TV Mohandas Pai",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img src=\"https://images.financialexpress.com/2018/06/pai-1.jpg\" alt=\"T V Mohandas Pai, startup, start up india&nbsp;policy,&nbsp;Manipal Global Education,&nbsp;Infosys, india\" class=\"size-full wp-image-1210286\" srcset=\"https://images.financialexpress.com/2018/06/pai-1.jpg 660w, https://images.financialexpress.com/2018/06/pai-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/pai-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/pai-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The Chairman of Manipal Global Education, T V Mohandas Pai claimed that the country already has ten crore people in the 21-35 age-group with bad skills, unsuited for the economy. (IE)</figure>\n\t\t\t</section></div><span>\n</span><p>India no longer enjoys the advantage of demographic dividend as it’s saddled with crores of youngsters with low skills unsuited to the economy, claimed a human resources and education expert. The Chairman of Manipal Global Education, T V Mohandas Pai claimed that the country already has ten crore people in the 21-35 age-group with bad skills, unsuited for the economy. “There is no democraphic dividend,” he told PTI. “Because of the failure of the UPA era (2004-2014), we will add another ten crore by 2025…total 20 crore in the 21-45 age group with low skills, low education.”</p><span>\n</span><p>An information technology industry veteran who had served as Head of Human Resources and Chief Financial Officer at software major Infosys Ltd, Pai lamented “lack of educational reforms” during the 10-year UPA regime. It takes time for educational reforms to impact, he said. “Reform now will take ten years to impact by which (time) this (the current) generation will be lost. The key is: How to ensure they do not (lose out).”</p><span>\n</span><p>Pai was sharing his thoughts on a recent report by the research wing of the country’s largest lender SBI. This report said India has only one decade to change its status into a developed country and will need to focus on education, failing which the much-hailed ‘demographic dividend’ will turn into a disadvantage. If India is not able to get its act together, it will will never be able to go into the developed group of nations, it said.</p><span>\n</span><p>The report said, “India has perhaps now only a limited window of a decade to get into the developed country tag, or stay perpetually in emerging group of economies.” Secretary General of the industry body ASSOCHAM, D S Rawat said India must invest a lot in education, health and child nutrition so that the human resource is qualitatively superior.</p><span>\n</span><p>Both the Centre and the States, Rawat said, need to “jack up” their budget on health and education. “While both the private and public sectors have to contribute in the endeavour, the public investment along with a lot of emphasis on quality education and health in the government schools, colleges and state-run hospitals and primary health care centres must be given,” he told PTI.</p><span>\n</span><p>Pai, meanwhile, said there is a need to improve quality of education, stopping controlling education, and opening up of the sector with transparent norms and enforcing quality standards in higher education.</p><span>\n</span><p>“India should focus on creating a good future. The political discourse by Leftists is the biggest disaster for us as they create a wrong narrative,” he added. </p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "lost",
        "demographic",
        "no",
        "saddled",
        "low",
        "human",
        "expert",
        "unsuited"
    ],
    "nouns": [
        "economy",
        "India",
        "lost",
        "demographic",
        "dividend",
        "TV",
        "no",
        "longer",
        "advantage",
        "low",
        "education",
        "expert",
        "human"
    ],
    "verbs": [
        "advantage",
        "low"
    ]
}