{
    "creator": "FE Bureau",
    "title": "NITI Aayog meet: More steps to lift growth, says PM Modi",
    "link": "https://www.financialexpress.com/economy/niti-aayog-meet-more-steps-to-lift-growth-says-pm-modi/1209970/",
    "pubDate": "Mon, 18 Jun 2018 04:22:42 +05:30",
    "dc:creator": "FE Bureau",
    "content": "Addressing the NitiAayog’s fourth Governing Council meeting, Modi called for “widespread” debate on holding simultaneous elections to the Lok Sabha and state assemblies saying that it will result in financial savings. ",
    "contentSnippet": "Addressing the NitiAayog’s fourth Governing Council meeting, Modi called for “widespread” debate on holding simultaneous elections to the Lok Sabha and state assemblies saying that it will result in financial savings.",
    "guid": "https://www.financialexpress.com/?p=1209970",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-17T22:52:42.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.18181818181818182,
        "tokens": [
            "niti",
            "aayog",
            "meet",
            "more",
            "steps",
            "to",
            "lift",
            "growth",
            "says",
            "pm",
            "modi"
        ],
        "words": [
            "growth"
        ],
        "positive": [
            "growth"
        ],
        "negative": []
    },
    "article": {
        "title": "NITI Aayog meet: More steps to lift growth, says PM Modi",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1209973\" src=\"https://images.financialexpress.com/2018/06/niti-aayog-l-ie-2-1-1-3.jpg\" alt=\"NITI Aayog,&nbsp;NITI Aayog meet, narendra modi,&nbsp;15th Finance Commission\" srcset=\"https://images.financialexpress.com/2018/06/niti-aayog-l-ie-2-1-1-3.jpg 660w, https://images.financialexpress.com/2018/06/niti-aayog-l-ie-2-1-1-3-300x200.jpg 300w, https://images.financialexpress.com/2018/06/niti-aayog-l-ie-2-1-1-3-620x413.jpg 620w, https://images.financialexpress.com/2018/06/niti-aayog-l-ie-2-1-1-3-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> ddressing the NitiAayog’s fourth Governing Council meeting, Modi called for “widespread” debate on holding simultaneous elections to the Lok Sabha and state assemblies saying that it will result in financial savings.</figure>\n\t\t\t</section></div><span>\n</span><p>With general elections less than a year away, Prime Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/narendra-modi/\">Narendra Modi</a> on Sunday hinted at “many more steps” to take the country’s economic growth rate to double-digits and urged the chief ministers, many of whom are unhappy over the 15th Finance Commission’s terms of reference, to “give fresh ideas” to the constitutional body “for incentivising outcome-based allocations and expenditure correction”. Addressing the NitiAayog’s fourth Governing Council meeting, Modi also called for “widespread” debate on holding simultaneous elections to the Lok Sabha and state assemblies saying that it will result in financial savings. On their part, the Opposition-ruled states in one voice reiterated their concern over the Centre’s alleged attempt to dilute cooperative federalism and said the Centre would do well to not ‘unnecessarily interfere’ in states’ affairs. Bihar and Andhra Pradesh also used the ocassion to press their demand for special-category status, although independent analysts have long spoken against such differentiations, without which the backward states are anyway allocated optimum resources.</p><span>\n</span><p>Eight north-eastern states plus J&amp;K, Himachal Pradesh and Uttarakhand are now special-category. Later briefing reporters, Niti Aayog vice-chairman Rajiv Kumar said the PM said the Centre will fulfill all promises made at the time of bifurcation of Bihar and Andhra Pradesh in “letter and spirit”. States like Andhra Pradesh, Kerala, Odisha and West Bengal feel that their tax-devolution share will shrink if the 15th Finance Commission relies on the 2011 census rather than the 1971 census. Also, how the states run central schemes is listed among the performance-based yardsticks for the horizontal distribution of resources among states, a move some states view with scepticism. Chief ministers of states like Andhra Pradesh, Kerala and Karnataka were among those who raised the issue of loan waiver scheme for farmers. Karnataka chief minister HD Kumaraswamy, in his address, sought 50% support from the Centre to implement the scheme.</p><span>\n</span><p>Modi asked the Niti Aayog to follow up with the states on the actionable points made by them within three months. On the lines of the 115 aspirational districts identified by the NITI Aayog, Modi said states can define their own parameters to identify 20% of the total blocks in the state as “aspirational blocks”. Speaking on the issue of environment, raised by chief ministers, he urged all states to use LED bulbs in their government buildings, official residences and street lights. As per the PMO, Modi asked chief ministers of Madhya Pradesh, Bihar, Sikkim, Gujarat, Uttar Pradesh, West Bengal and Andhra Pradesh to work together to make recommendations on a coordinated policy approach on agriculture and MNREGA. Referring to the government’s flagship ‘Swachh Bharat Mission’, the PM said the cleanliness drive was being discussed around the world. In the last four years, 7.70 crore toilets have been constructed. He asked those present in the meeting to work towards 100% sanitation coverage by October 2, 2019, the 150th birth anniversary of Mahatma Gandhi. India’s gross domestic product (GDP) grew at 7.7% in the final quarter of the last financial year (Q4FY18), the fastest pace in seven quarters. But there are concerns about the growth prospects in FY19 given the high oil prices, absence of strong export growth, slow recovery of private investments and less than robust private consumption. (With inputs from PTI)</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "Governing",
        "financial",
        "meet",
        "More",
        "fourth",
        "widespread",
        "simultaneous"
    ],
    "verbs": [
        "state",
        "will",
        "result",
        "meet",
        "debate",
        "lift"
    ],
    "nouns": [
        "state",
        "saying",
        "steps",
        "will",
        "Governing",
        "result",
        "growth",
        "Council",
        "meet",
        "meeting",
        "debate",
        "PM",
        "More",
        "fourth",
        "lift",
        "holding",
        "savings"
    ]
}