{
    "creator": "Prasanta Sahu",
    "title": "State Finances: Expenses reined in to meet deficit target",
    "link": "https://www.financialexpress.com/economy/state-finances-expenses-reined-in-to-meet-deficit-target/1200932/",
    "pubDate": "Mon, 11 Jun 2018 05:04:27 +05:30",
    "dc:creator": "Prasanta Sahu",
    "content": "The Centre, wanting to pump-prime the economy, let its fiscal targets slip in FY18 but the state governments went in the opposite direction: many of them cut spending massively to adhere to the deficit targets. ",
    "contentSnippet": "The Centre, wanting to pump-prime the economy, let its fiscal targets slip in FY18 but the state governments went in the opposite direction: many of them cut spending massively to adhere to the deficit targets.",
    "guid": "https://www.financialexpress.com/?p=1200932",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-10T23:34:27.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.2222222222222222,
        "tokens": [
            "state",
            "finances",
            "expenses",
            "reined",
            "in",
            "to",
            "meet",
            "deficit",
            "target"
        ],
        "words": [
            "deficit"
        ],
        "positive": [],
        "negative": [
            "deficit"
        ]
    },
    "article": {
        "title": "State Finances: Expenses reined in to meet deficit target",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1200940\" src=\"https://images.financialexpress.com/2018/06/deficit-1.jpg\" alt=\"government, fiscal deficit, fiscal dificit target, cga, gdp, cga data\" srcset=\"https://images.financialexpress.com/2018/06/deficit-1.jpg 660w, https://images.financialexpress.com/2018/06/deficit-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/deficit-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/deficit-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> According to Care Ratings, the majority of states (17 out of 22) are expected to continue to adhere to the fiscal deficit norms stipulated by the Finance Commission.</figure>\n\t\t\t</section></div><span>\n</span><p>The Centre, wanting to pump-prime the economy, let its fiscal targets slip in FY18 but the state governments went in the opposite direction: many of them cut spending massively to adhere to the deficit targets. The combined fiscal deficit of all states in the last financial year is seen to have been contained within the Fiscal Responsibility and Budget Management (FRBM) Act threshold of 3% of the gross domestic product (GDP). The consolidation came after two successive years (FY16 and FY17) when the states’ combined fiscal deficit crossed the 3% mark, owing in part to their assumption of major portions of the electricity distribution entities’ debts, under the UDAY scheme.</p><span>\n</span><p>Apart from sharp spending cuts, the assured GST revenue growth of 14% under a compensation scheme has also helped the states in fiscal consolidation, with many of them either meeting the tax revenue targets or coming close to it. Despite the states curtailing expenditure, the expansion (7.7%) of the gross domestic product (GDP) in the final quarter of last financial year was aided by a robust 16.8% growth in government final consumption expenditure (GFCE), implying that the Centre and CPSEs spearheaded it.</p><span>\n</span><p>According to the data on state finances vetted by the Comptroller &amp; Auditor General (CAG), 17 states (except northeastern states, Jammu and Kashmir, Bihar, Jharkhand and Goa the data for which are not available), reported their combined fiscal deficit at a benign 2.64% of their aggregate gross state domestic product in FY18. But this was after a 14% squeeze in revenue expenditure and even a steeper 22% cut in capex from the originally estimated (BE) levels. Of course, on a year-on-year basis, there was still a 4% increase in the spending by these states, whose tax revenue grew a strong 10%.</p><span>\n</span><p>The fiscal deficits of Punjab, Tamil Nadu, Odisha and Maharashtra came considerably lower than their respective BEs; by a huge 2.66 percentage points for Punjab, 1.56 percentage points for TN, 1.27 percentage point for Odissa and and 60 basis points for Maharashtra. However, Andhra Pradesh allowed the deficit to widen by 2.1 percentage points from the BE level to 5%, mainly because its tax revenue fell short of target by 13%.</p><span>\n</span><p>Maharashtra, Uttar Pradesh, Tamil Nadu, Gujarat, Telangana, Punjab and Kerala cut expenditure the most. Despite implementing a farm loan waiver, UP’s budget spending was lower than the BE by Rs 79,913 crore or 22%; it cut capex by a steeper 33%. Maharashtra, which also implemented a farm loan waiver scheme, saw a similar 22% compression (Rs 77,449 crore) as against budget spending target. Maharashtra cut its capex by Rs 12,866 crore or 34% in FY18 from BE level. With revenues falling short of target, Punjab cut its capex by Rs 3,656 crore or 59% while Chhattisgarh (Rs 6,029 crore or 35%) and Kerala (Rs 4,547 crore or 36%) also saw over much lower capex than their original targets.</p><span>\n</span><p><img class=\"alignnone size-full wp-image-1200938\" src=\"https://images.financialexpress.com/2018/06/expenses.jpg\" alt=\"government, fiscal deficit, fiscal dificit target, cga, gdp, cga data\" width=\"660\" height=\"568\" srcset=\"https://images.financialexpress.com/2018/06/expenses.jpg 660w, https://images.financialexpress.com/2018/06/expenses-232x200.jpg 232w, https://images.financialexpress.com/2018/06/expenses-480x413.jpg 480w, https://images.financialexpress.com/2018/06/expenses-310x267.jpg 310w\" sizes=\"(max-width: 660px) 100vw, 660px\"></p><span>\n</span><p>Outperforming the Centre, Indian states had achieved creditable fiscal consolidation till FY12 (when their combined deficit stood at 1.93% of the GDP), but have since turned less prudent; the combined deficit widened to 2.69% in FY15 and the UDAY scheme for power discoms extended the fiscal gap to 3.6% in FY16 and to 3.4% in FY17 (UDAY allowed extra fiscal headroom to a maximum of 0.5% over and above the normal FRMB limit of 3% for FY16 and FY17). As the UDAY burden was set to largely removed in FY18, the states targeted aggressive deficit cuts for the year. The Centre’s FY18 fiscal deficit came at 3.53%, marginally higher than RE of 3.5% and BE of 3.2%.</p><span>\n</span><p>According to Care Ratings, the majority of states (17 out of 22) are expected to continue to adhere to the fiscal deficit norms stipulated by the Finance Commission. Kerala, Telangana, Punjab, Himachal Pradesh and J&amp;K are budgeted to witness a fiscal deficit above the stipulated norm in FY19. “The sustainability of the fiscal profile of the states in FY19 would be contingent on the revenue generation ability and control of non-developmental expenditure by the states,” it said.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "prime",
        "meet",
        "wanting",
        "fiscal",
        "opposite",
        "cut"
    ],
    "nouns": [
        "Centre",
        "spending",
        "State",
        "state",
        "prime",
        "Finances",
        "meet",
        "target",
        "deficit",
        "economy",
        "let",
        "slip",
        "pump",
        "opposite",
        "direction",
        "cut"
    ],
    "verbs": [
        "Centre",
        "State",
        "state",
        "prime",
        "meet",
        "target",
        "pump",
        "let",
        "slip",
        "cut",
        "adhere"
    ]
}