{
    "title": "Cracking 'bad bank' tough nut, but it's not impossible, say experts",
    "link": "https://www.business-standard.com/article/economy-policy/cracking-bad-bank-tough-nut-but-it-s-not-impossible-say-experts-118061000740_1.html",
    "pubDate": "Mon, 11 Jun 2018 07:01:00 +0530",
    "content": "The NPA problem and the effect on bank balance sheets has not improved despite the Insolvency and Bankruptcy Code (IBC) process",
    "contentSnippet": "The NPA problem and the effect on bank balance sheets has not improved despite the Insolvency and Bankruptcy Code (IBC) process",
    "guid": "https://www.business-standard.com/article/economy-policy/cracking-bad-bank-tough-nut-but-it-s-not-impossible-say-experts-118061000740_1.html",
    "isoDate": "2018-06-11T01:31:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "cracking",
            "'bad",
            "bank'",
            "tough",
            "nut",
            "but",
            "it's",
            "not",
            "impossible",
            "say",
            "experts"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Cracking 'bad bank' tough nut, but it's not impossible, say experts",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p><span> The idea of a ‘bad (loans) bank’ is back on the table as loans gone sour at Indian banks near Rs 10 trillion.</span> <span></span> <span> Details are sketchy yet on whether the asset reconstruction company (ARC) in this regard would be owned by the government or have non-state participants. Either way, say experts, this is not going to be an easy task.</span> <span></span> <span> In any case, there are precedents in India, albeit much smaller in scale. A direct example can be found in the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=stressed+assets\" target=\"_blank\">Stressed Assets </a>Stabilisation Fund (SASF), formed in 2004 by the Government of India, to recover Rs 90 billion bad debt of the erstwhile Industrial Development Bank of India (later converted into IDBI Bank). The government issued bonds against the debt and the balance sheet was cleaned.</span> <span></span> <span> For some accounts, the fund did recover a substantial amount. However, it was recently revealed, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=write+offs\" target=\"_blank\">write-offs </a>(‘haircuts’ in banking jargon) in many cases exceeded 90 per cent. A report given in the Lok Sabha last July showed there were inconsistencies on collecting personal guarantees, and property pledges, that led to poor recovery.</span> <span></span> <span> “The committee (which probed) are of the opinion that had the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=sasf\" target=\"_blank\">SASF </a>not failed in obtaining details of assets of guarantors, net worth of the borrowers, income tax returns, affidavit of assets filed by the guarantors in the courts/ debt recovery tribunals, besides net worth certificate by a chartered accountant, and liability statements, maximum recovery would have been assured,” went the report.<span></span> <span></span> <span> <strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/current-affairs/banks-to-come-up-with-mechanism-to-tackle-bad-loans-piyush-goyal-118060800821_1.html\" target=\"_blank\">Panel to take a call on asset reconstruction company for tackling bad loans</a></strong></span> </span> <span></span> <span> There were important lessons in the episode. To start with, that such an ARC can be formed and, if executed well, would make a difference.</span> <span></span> <span> It is a matter of comfort for the banks too, as they are not stressed asset resolution experts – their focus is lending.</span> <span></span> <span> “In such a trust or ARC, all banks can transfer the fair value of the assets. Instead of dealing with all the companies that have built up stress, banks can deal with a single ARC,” said Abizer Diwanji, partner for financial services at consultants EY.</span> <span></span> <span> The ARC could be managed by professionals and resolution experts. Even for individual cases, sub-groups of experts can be formed. An example is when the government formed a special resolution group for scam-hit Satyam Computer under the chairmanship of Deepak Parekh.</span> <span></span> <span> There could be five or more <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=stressed+assets\" target=\"_blank\">stressed assets </a>funds which come together to float such an entity. Or it could be the government taking the help of experts. For example, such ARCs in South Korea are fully owned by the government.</span> <span></span> <span> “Government can be the owner; no issue with that. But, they should let competent and experienced professionals handle the resolution. The government should not be the manager and decision maker. Such a model can be a fantastic success story,” said Diwanji.</span> <span></span> <span> However, the issue of capital remains. “The problem of infusing large amounts of capital when loans are sold to an ARC does not go away. </span></p><p>The ARC itself will require a large amount of capital. If it has majority private ownership, valuation of loans bought from banks will be a huge issue,” said T T Ram Mohan, professor at the Indian Institute of Management, Ahmedabad. <span></span> <span> <strong>Then &amp; now</strong></span> <span></span> <span> He adds that the idea of a <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=bad+bank\" target=\"_blank\">bad bank </a>was debated at length in the past but finally “not considered useful”. In recent times, the idea of floating one was first raised by Reserve Bank deputy governor Viral Acharya. Soon after he took charge in February 2017, he had suggested two different structures – a private asset management company (AMC) and a national one. The latter would specifically look at sectors currently under stress but with long-term economic viability. Just before that, in January 2017, the official Economic Survey had suggested a centralised Public Sector Asset Rehabilitation Agency could be established.<span></span> <span></span> <span> <strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/finance/sbi-to-auction-12-npa-accounts-on-june-25-to-recover-dues-of-over-rs-13-bn-118061000154_1.html\" target=\"_blank\">SBI to auction 12 NPA accounts on June 25 to recover dues of over Rs 13 bn</a></strong></span> </span> <span></span> <span> Last week, officiating Union finance minister Piyush Goyal met heads of public sector banks (PSBs) on how best to resolve their non-performing asset (NPA) accounts and improve their credit flow. He announced the government’s plan for such a proposal. A committee under Sunil Mehta, non-executive chairman of Punjab National Bank, will look into the proposal to form an ARC/AMC for resolution of the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=npa+problem\" target=\"_blank\">NPA problem.</a></span> <span></span> <span> “We have had ARCs in the past and they have struggled. It is not a new experience but, possibly, we will have better experience this time,” says Ranen Banerjee, partner at consultants PwC India.</span> <span></span> <span> While the government awaits the Mehta committee recommendations, a ‘bad bank’ should not be thought of a panacea to the NPA problem, experts say.</span> <span></span> <span> “Even when they move some NPA accounts to the ARC, the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=psbs\" target=\"_blank\">PSBs </a>will take a hit. For, the ARC will take over these loans only at a discounted price -- a hit on the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=psbs\" target=\"_blank\">PSBs </a>and on the government, the main shareholder,” Banerjee said.</span> <span></span> <span> The <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=npa+problem\" target=\"_blank\">NPA problem </a>and the effect on bank balance sheets has not improved despite the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=insolvency+and+bankruptcy+code\" target=\"_blank\">Insolvency and Bankruptcy Code </a>(IBC) process. This is recovering only 43 per cent or Rs 1.7 trillion of the Rs 4 trillion of dues owed to banks by corporate debtors, according to rating agency <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=icra\" target=\"_blank\">ICRA.</a></span> <span></span> <span> The problem is that under the IBC, “there are 15 to 20 voices in the Committee of Creditors, deliberating on the resolution of stressed assets”. Whereas, says Ashutosh Mishra, lead analyst at Reliance Securities, under the ‘bad bank’ or ARC/AMC, there will be one voice. This could mean better outcomes for the bank and for the companies that have defaulted. Further, by clearing some of the NPAs, the banks can “focus more on their core business”, he says.</span> <span></span> <span> In 2015, the government recapitalised 13 <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=psbs\" target=\"_blank\">PSBs </a>by a combined Rs 200.9 billion. In October 2017, it announced a further recapitalisation plan of Rs 2.1 trillion, of which Rs 900 billion was disbursed by March 2018.<span></span> </span></p><blockquote class=\"blockquoteBG styleQ1\"> <p> <strong>Is a refund called for?</strong><span></span> </p> <ul> <li> A ‘bad bank’ is not a new idea in India</li> <li> A mini <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=bad+bank\" target=\"_blank\">bad bank </a>already existed in the form of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=sasf\" target=\"_blank\">SASF </a>fund of IDBI</li> <li> <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=bad+bank\" target=\"_blank\">Bad bank </a>can be successful if left to professionals</li> <li> Govt can be the owner, but should not be managers and decision makers</li> <li> Issue of capital infusion in such a bad bank remains</li> <li> Banks can transfer their bad assets in the bank and can get bonds in return</li> <li> Experts say banks would be eager to transfer their assets as they largely failed in resolution</li> </ul> </blockquote> </span>"
    },
    "adjectives": [
        "impossible",
        "improved",
        "bad",
        "tough",
        "Cracking"
    ],
    "verbs": [
        "process",
        "say",
        "bank",
        "Code",
        "effect",
        "nut",
        "balance"
    ]
}