{
    "creator": "IANS",
    "title": "Arun Jaitley lauds GDP growth, says job creation is on track",
    "link": "https://www.financialexpress.com/economy/arun-jaitley-lauds-gdp-growth-says-job-creation-is-on-track/1210460/",
    "pubDate": "Mon, 18 Jun 2018 14:31:58 +05:30",
    "dc:creator": "IANS",
    "content": "In yet another long blog, Finance Minister and senior BJP leader Arun Jaitley on Monday lauded the fourth quarter GDP growth of 7.7 per cent saying the future looked much brighter than the past.",
    "contentSnippet": "In yet another long blog, Finance Minister and senior BJP leader Arun Jaitley on Monday lauded the fourth quarter GDP growth of 7.7 per cent saying the future looked much brighter than the past.",
    "guid": "https://www.financialexpress.com/?p=1210460",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-18T09:01:58.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.18181818181818182,
        "tokens": [
            "arun",
            "jaitley",
            "lauds",
            "gdp",
            "growth",
            "says",
            "job",
            "creation",
            "is",
            "on",
            "track"
        ],
        "words": [
            "growth"
        ],
        "positive": [
            "growth"
        ],
        "negative": []
    },
    "article": {
        "title": "Arun Jaitley lauds GDP growth, says job creation is on track",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img src=\"https://images.financialexpress.com/2018/06/jaitley-5.jpg\" alt=\"arun jaitley, job creation, job search, jobs, job seekers, jobs in india, jobs in delhi, construction jobs, engineer jobs\" class=\"size-full wp-image-1210481\" srcset=\"https://images.financialexpress.com/2018/06/jaitley-5.jpg 660w, https://images.financialexpress.com/2018/06/jaitley-5-300x200.jpg 300w, https://images.financialexpress.com/2018/06/jaitley-5-620x413.jpg 620w, https://images.financialexpress.com/2018/06/jaitley-5-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> He said that GST, after a few weeks of its implementation became problem free, and was leading to higher tax collection. (PTI)</figure>\n\t\t\t</section></div><span>\n</span><p>In yet another long blog, Finance Minister and senior <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/bharatiya-janata-party/\">BJP</a> leader <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/arun-jaitley/\">Arun Jaitley</a> on Monday lauded the fourth quarter GDP growth of 7.7 per cent saying the future looked much brighter than the past.</p><span>\n</span><p>“The fourth quarter result of GDP data showed a phenomenal 7.7 per cent growth rate and has established India firmly as the fastest growing global economy. This trend, according to experts, is likely to continue for the next few years, he wrote. </p><span>\n</span><p>“With structural reforms like demonetisation, the implementation of the Goods and Services Tax (GST) and the enforcement of the Insolvency and Bankruptcy Code (IBC), we had two challenging quarters,” Jaitley said adding that “those who predicted a two per cent decline in GDP growth have been conclusively proved wrong.” </p><span>\n</span><p>He said a distinguished predecessor of his had feared that he may have to live his future in poverty. “We have enabled every Indian to be a part of the world’s fastest growing economy. The future looks much brighter than the past. This trend is likely to continue for some years,” Jaitley said.</p><span>\n</span><p>He tried to address various economic issues concerning people from rising oil price, structural reforms and job creation and praised the social sector schemes and the rural development programmes launched by the government.</p><span>\n</span><p>“These involve legislations which are path breaking and development works in roads, railways, housing, power, sanitation — which yield high social benefits — require high level of government expenditure. This type of government spending promotes growth. This is what we are witnessing today,” he said.</p><span>\n</span><p>Jaitley who underwent kidney replacement recently is still recovering and is yet to rejoin his office.</p><span>\n</span><p>On job creation Jaitley said: “An analysis of the data released clearly shows that the construction sector is expanding by double digits. It is a job creating sector. Investment is increasing. Domestic investment is also increasing. The FDI is at an unprecedented level.”</p><span>\n</span><p>He said the IBC had unlocked value in non-performing assets. “Fixed capital formation is growing. Manufacturing is expanding. We are spending huge amounts on infrastructure creation. Expenditure on rural projects has increased in a big way. The social sector schemes, more particularly the financial inclusion programmes, have created a wave of self-employment. Each one of these is a high job creating sector,” he asserted.</p><span>\n</span><p>He said if India remains a tax non-compliant nation, both Centre and state government would have very little to spend. They will borrow more and spend less. “Demonetisation, GST, digitisation, Aadhaar and the anti-<a target=\"_blank\" href=\"http://www.financialexpress.com/tag/black-money/\">black money</a> measures are leading to gradual formalisation of the Indian economy.”</p><span>\n</span><p>Talking about tax collection, Jaitley said: “We have reached 6.86 crore income tax return filers last year. The number of income tax returns post demonetisation show a 25 per cent growth. Even the corporate returns have increased by 17 per cent.” </p><span>\n</span><p>He said that GST, after a few weeks of its implementation became problem free, and was leading to higher tax collection. “With higher revenues, the Government has been able to spend more on infrastructure, rural India and social sector schemes and yet maintained fiscal prudence and keeping the fiscal deficit on downward glide path,” he added.</p><span>\n</span><p>“The last four years have seen an improvement in central government’s tax-GDP ratio from 10 per cent to 11.5 per cent. There is an increase of 1.46 percentage points. Almost half of this, 0.72 per cent of GDP, accounts for an increase in non-oil tax-GDP ratio. The level of non-oil taxes to GDP at 9.8 per cent in 2017-18 is the highest since 2007-08 a year in which our revenue position was boosted by buoyant international environment,” the minister said.</p><span>\n</span><p>He said despite higher compliances in new system, as far as the non-oil taxes are concerned, “we are still far from being a tax complaint society. Salaried employees is one category of tax compliant assessees. Most other sections still have to improve their track record. The effort for next few years has to be to replicate the last four years and improve India’s tax to GDP ratio by another 1.5 per cent.”</p><span>\n</span><p>Finally speaking about the spiraling fuel prices, which is hurting every common man, he said: “if people pay their taxes honestly the high dependence on oil products for taxation eventually comes down.”</p><span>\n</span><p>Taking a dig at former finance minister and <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/congress/\">Congress</a> leader P. Chidambaram over his comment on oil, Jaitley said: “Another distinguished predecessor of mine had stated that the tax on oil should be cut by Rs 25 per litre. He never endeavoured to do so himself. This is a “Trap” suggestion. It is intended to push India into an unmanageable debt — something which the UPA Government left as its legacy.”</p><span>\n</span><p>He the economy and the markets rewarded structural reforms, fiscal prudence, and macro-economic stability. “They punish fiscal indiscipline and irresponsibility. The transformation from UPA’s ‘policy paralysis’ to the NDA’s ‘fastest growing economy’ conclusively demonstrates this,” Jaitley said.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "In",
        "long",
        "senior",
        "fourth",
        "future",
        "past"
    ],
    "nouns": [
        "Monday",
        "GDP",
        "saying",
        "growth",
        "job",
        "track",
        "creation",
        "In",
        "Minister",
        "blog",
        "Finance",
        "senior",
        "leader",
        "fourth",
        "quarter",
        "cent",
        "future",
        "past"
    ],
    "verbs": [
        "job",
        "track",
        "long",
        "blog",
        "Minister",
        "Finance",
        "quarter"
    ]
}