{
    "title": "Market review: Farm distress for real, prices plunge",
    "link": "https://www.financialexpress.com/economy/market-review-farm-distress-for-real-prices-plunge/1209975/",
    "pubDate": "Mon, 18 Jun 2018 04:30:52 +05:30",
    "content": "Government managers have sought to talk down the recent nationwide farmers’ agitation as a mere attempt to hog the limelight. But a cursory analysis of key agricultural markets across the country would reveal the farming distress is real.",
    "contentSnippet": "Government managers have sought to talk down the recent nationwide farmers’ agitation as a mere attempt to hog the limelight. But a cursory analysis of key agricultural markets across the country would reveal the farming distress is real.",
    "guid": "https://www.financialexpress.com/?p=1209975",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-17T23:00:52.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.25,
        "tokens": [
            "market",
            "review",
            "farm",
            "distress",
            "for",
            "real",
            "prices",
            "plunge"
        ],
        "words": [
            "distress"
        ],
        "positive": [],
        "negative": [
            "distress"
        ]
    },
    "article": {
        "title": "Market review: Farm distress for real, prices plunge",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1209980\" src=\"https://images.financialexpress.com/2018/06/farmer-l-pti-e1453085503184.jpg\" alt=\"farmers in india, farm distress,&nbsp;farmers protest,&nbsp;agriculture, high prices\" srcset=\"https://images.financialexpress.com/2018/06/farmer-l-pti-e1453085503184.jpg 660w, https://images.financialexpress.com/2018/06/farmer-l-pti-e1453085503184-300x200.jpg 300w, https://images.financialexpress.com/2018/06/farmer-l-pti-e1453085503184-620x413.jpg 620w, https://images.financialexpress.com/2018/06/farmer-l-pti-e1453085503184-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Government managers have sought to talk down the recent nationwide farmers’ agitation as a mere attempt to hog the limelight. But a cursory analysis of key agricultural markets across the country would reveal the farming distress is real.</figure>\n\t\t\t</section></div><span>\n</span><p>Government managers have sought to talk down the recent nationwide farmers’ agitation as a mere attempt to hog the limelight. But a cursory analysis of key agricultural markets across the country would reveal the farming distress is real. During the 2017-18 crop year (July-June), the mandi prices of most pulses and oilseeds, all coarse cereals and cotton — key crops other than rice and wheat whose farm-gate prices are protected via MSP operations — were all significantly lower than the previous year’s levels. A review of the market prices by FE showed price decline of over 30% in case of major pulses and up to 12% for oilseeds. Also, maize prices during the harvest season between October-December 2017 ruled 10% lower than the year-ago period; jowar too was sold by farmers 20% cheaper. Clearly, the profitability of all these crops, which together have a major share in the country’s farm output, declined over the past year, causing distress in rural India and triggering the farmers’ agitation. As for most pulses, the minimum support prices have been hiked liberally during the NDA government’s tenure in a bid to incentivise their production, but the prices in many mandis ruled far below the MSPs and procurement operations were below par. As for oilseeds and coarse cereals, the MSPs have been increasingly non-remunerative for the farmers in recent years (the chart shows MSP over A2+FL costs in 2013-14 and 2017-18). Farming of cotton, maize, groundnut, soyabean, jowar, bajra, rape and mustard seed have been less than profitable in the last couple of years. Prime Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/narendra-modi/\">Narendra Modi</a> has promised 50% profit over production cost to farmers — the MSPs for kharif 2018, which is likely to be announced this week, may reflect this. However, it had reined in inflation by slowing the pace of increase in MSPs seen during the UPA government’s term, an exercise which has hit farmers’ margins. While the Wholesale Price Index (WPI) jumped to 4.43% y-o-y in May, hitting a 14-month high, pulses saw a deflation of 21.13%. The average monthly WPI inflation in pulses in 2017-18 was -26.7% and that of coarse cereals like bajra and jowar were -10.4% and -0.5%, respectively. “The market prices of crops are down mainly due to supply side pressures as production has been increasing at a faster rate than demand,” said Sahshanka Bhide, director of Madras Institute of Development Studies. Besides, global prices have been influencing the rates of crops like cotton, he added. The dip in farming profitability has been moderated by the slowing growth in agricultural wage growth: For men, the wage growth fell to 6.72% in February 2018 from 12.77% registered in February 2015. Govindbhai G Patel who runs GGN International, a farm commodity trading firm, said, “The rates for groundnut oil have dropped due to higher production and lower demand. Earlier, people used to pay a premium for groundnut oil, but because of blending with other edible oils the demand for it has come down.” The agriculture ministry has estimated that groundnut production in 2017-18 increased to 8.94 million tonne from 7.46 million tonne a year earlier. Domestic soyabean oil prices too are influenced by global markets, as there are large-scale imports of this item. Noted agricultural economist Ashok Gulati wrote in this paper recently: “In this period (last 48 months), the Indian economy (GDP) grew at an average rate of about 7.2% but its agriculture sector (agri-GDP) grew at a mere 2.5% per annum… Investments in agriculture (gross capital formation in agriculture, GCFA, as percentage of agri-GDP) fell from 17.7% in 2013-14 to 15.5% in 2016-17.” Prabhudatta Mishra &nbsp;</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "real",
        "nationwide",
        "sought",
        "agricultural",
        "recent",
        "farming",
        "down",
        "mere",
        "cursory",
        "key"
    ],
    "verbs": [
        "review",
        "reveal",
        "Market",
        "distress",
        "Farm",
        "plunge",
        "talk",
        "down",
        "attempt",
        "hog",
        "key"
    ]
}