{
    "title": "What's holding Indians back? Parents' income and education levels",
    "link": "https://www.business-standard.com/article/economy-policy/what-s-holding-indians-back-parents-income-and-education-levels-118060400080_1.html",
    "pubDate": "Mon, 04 Jun 2018 08:19:00 +0530",
    "content": "The income of Indians is more dependent on their parents' income and educational levels, restricting their chances of rising above the socio-economic strata they are born in, says World Bank report",
    "contentSnippet": "The income of Indians is more dependent on their parents' income and educational levels, restricting their chances of rising above the socio-economic strata they are born in, says World Bank report",
    "guid": "https://www.business-standard.com/article/economy-policy/what-s-holding-indians-back-parents-income-and-education-levels-118060400080_1.html",
    "isoDate": "2018-06-04T02:49:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "what's",
            "holding",
            "indians",
            "back?",
            "parents'",
            "income",
            "and",
            "education",
            "levels"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "What's holding Indians back? Parents' income and education levels",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\t<span>Indians are more constrained by the circumstances they are born into than the citizens of five other large developing countries–Brazil, China, Egypt, Indonesia and Nigeria–a <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=world+bank\" target=\"_blank\">World Bank </a></span><a href=\"https://openknowledge.worldbank.org/handle/10986/28428\">report</a><span> released in May 2018 said. The <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=income+of+indians\" target=\"_blank\">income of Indians </a>is more dependent on their parents’ income and educational levels, restricting their chances of rising above the socio-economic strata they are born in.</span></p>\n<p>\n\t<span>The report, “Fair Progress: Economic Mobility across Generations Around the World”, measured intergenerational mobility by comparing the income and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=education\" target=\"_blank\">education </a>levels of one generation with those of their parents, and relative mobility by comparing the difference between generations across income and educational levels.</span>\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\t<span>“It is about fairness. Do you have a chance to get ahead in society regardless of where you are from?” said Ambar Narayan, the lead economist studying poverty and equity at the World Bank, and a co-author of the report, while explaining the basic query the report pursues. Mobility is important for the long-term growth of a country. “It is not an efficient society if you are not rewarded for your own ability and potential,” he said.</span></p>\n<div><span>\n\t</span><div id=\"InRead\"><span>\n\t\t</span><span>Data on intergenerational mobility can help shed light on the equality of opportunity in a country–whether a level playing field exists for those born in poor and rich families. Data on India in the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=world+bank\" target=\"_blank\">World Bank </a>report are based on the 2011-12 </span><a href=\"https://ihds.umd.edu/\">India Human Development Survey</a><span>, conducted by researchers from the University of Maryland and the National Council of Applied Economic Research in New Delhi. The most recent data are for the generation that was born in 1980 who were able to provide data on themselves and their parents for the 2011-12 survey.</span></div><span>\n</span></div>\n<p>\n\t<span>“Parents want [their] children to have a better life than they did, while children want to fulfil their aspirations irrespective of their parent’s income and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=education\" target=\"_blank\">education </a>level,” Narayan said.</span></p>\n<p>\n\t<strong>Effect of parents’ education, income</strong></p>\n<p>\n\t<span>India has made progress on educational intergenerational mobility, with those born in the 1980s doing better than those born in the 1940s, the report showed.</span></p>\n\n\n<p>\n\tDespite improvement, India offers the least <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=educational+mobility\" target=\"_blank\">educational mobility </a>among its developing-country peers.</p>\n\n\n<p>\n\tIn countries such as Brazil, India, Nigeria, Peru and South Africa, if a person earns double the amount earned by another, her/his child is, on average, expected to make somewhere between 60-70% more than the child of the lower-income person, the report said.</p>\n<p>\n\t<span>This gap is worse in other countries such as the Arab Republic of Egypt, Morocco and Panama, where it can go up to 90%, and in Colombia, Ecuador, Guatemala and Uganda, where it can be as much as 100%.</span></p>\n<p>\n\t<span>In comparison, the difference is less than 20% in countries such as Belgium, Denmark, Finland and Norway, and 50% in the United States and Vietnam, the report said.</span></p>\n<p>\n\t<span>The report also measured the mobility of those whose parents belonged to the bottom half in educational </span>attainment,<span> and found that educational levels were dependent on parents’ educational levels across generations. For instance, there was a 71% chance that an individual born in the 1980s to parents in the bottom half in terms of educational attainment would stay in the bottom half, and just a 9% chance that he or she would move to the topmost quarter.</span></p>\n\n<style type=\"text/css\">table,th,td{font-size:12px;font-family:arial;border-collapse:collapse;border:1px solid #000}table{width:580px}th,td{text-align:center;padding:2px}th.center{text-align:center}tr:nth-child(odd) {background-color:#f9f9f9}tr:nth-child(even) {background-color:#fff}th{background-color:#1f77b4;color:#fffff0;font-weight:bold}</style>\n<table>\n\t<tbody>\n\t\t<tr>\n\t\t\t<th colspan=\"5\">\n\t\t\t\tProbability That Child Born To Parents With Lowest <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=education\" target=\"_blank\">Education </a>Levels In India Will Move Up</th>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>\n\t\t\t\tIndividual Born In</td>\n\t\t\t<td>\n\t\t\t\t*Probability Of Moving From Bottom Half To Lowest Quarter</td>\n\t\t\t<td>\n\t\t\t\t*Probability Of Moving From Bottom Half To Second Quarter</td>\n\t\t\t<td>\n\t\t\t\t**Probability Of Moving From Bottom Half To Third Quarter</td>\n\t\t\t<td>\n\t\t\t\t**Probability Of Moving From Bottom Half To Highest Quarter</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>\n\t\t\t\t1940</td>\n\t\t\t<td>\n\t\t\t\t0.357194</td>\n\t\t\t<td>\n\t\t\t\t0.323469</td>\n\t\t\t<td>\n\t\t\t\t0.198599</td>\n\t\t\t<td>\n\t\t\t\t0.120738</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>\n\t\t\t\t1950</td>\n\t\t\t<td>\n\t\t\t\t0.371941</td>\n\t\t\t<td>\n\t\t\t\t0.319064</td>\n\t\t\t<td>\n\t\t\t\t0.198775</td>\n\t\t\t<td>\n\t\t\t\t0.110219</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>\n\t\t\t\t1960</td>\n\t\t\t<td>\n\t\t\t\t0.358653</td>\n\t\t\t<td>\n\t\t\t\t0.323518</td>\n\t\t\t<td>\n\t\t\t\t0.206648</td>\n\t\t\t<td>\n\t\t\t\t0.111181</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>\n\t\t\t\t1970</td>\n\t\t\t<td>\n\t\t\t\t0.390075</td>\n\t\t\t<td>\n\t\t\t\t0.309021</td>\n\t\t\t<td>\n\t\t\t\t0.196659</td>\n\t\t\t<td>\n\t\t\t\t0.104245</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>\n\t\t\t\t1980</td>\n\t\t\t<td>\n\t\t\t\t0.408908</td>\n\t\t\t<td>\n\t\t\t\t0.297528</td>\n\t\t\t<td>\n\t\t\t\t0.204539</td>\n\t\t\t<td>\n\t\t\t\t0.089025</td>\n\t\t</tr>\n\t</tbody>\n</table>\n<p>\n\tSource:<a href=\"http://www.worldbank.org/en/topic/poverty/brief/what-is-the-global-database-on-intergenerational-mobility-gdim\"> Global Database on Intergenerational Mobility</a>.<br>Note: This chart measures the effect of parents’ education on children’s education levels.<br>* Higher the number, lower the upward mobility.<br>** Higher the number, higher the upward mobility</p>\n\n<p>\n\tIn India, for the generation born in 1980, 17.8% of an individual’s income could be explained through the effect of parents’ education on a child’s education; 7.2% of the income could be attributed to parents’ education impacting the child’s income through factors other than education (such as by helping a child develop better non-cognitive or soft skills); and 75% by income-related characteristics other than education (such as parental connections, segregated neighbourhoods, etc.).</p>\n<p>\n\t<span>Although data on intergenerational mobility are as important as data on poverty and inequality for making policy, not enough up-to-date data are available at present. Arguing that more such data must be collected, Narayan said, “There is a simple, low-cost way of doing this by including a question on parental education, and occupation, in national surveys.”</span></p>\n<p>\n\t<strong>Intergenerational mobility of scheduled castes, tribes up; gender gap persists</strong></p>\n<p>\n\t<span>The gender gap in intergenerational mobility, which would constrain girls more than boys, is almost zero in the current generation in Brazil, China, Egypt and Indonesia. By contrast, it has remained unchanged in India for those born in the 1940s, 1950s and 1980s.</span></p>\n<p>\n\t<span>Other data also show that girls are more disadvantaged in India than boys–68.4% of Indian women were </span><a href=\"http://rchiips.org/NFHS/pdf/NFHS4/India.pdf\">literate</a><span> in 2015-16 versus 85.7% men, and the </span><a href=\"http://rchiips.org/NFHS/pdf/NFHS4/India.pdf\">sex ratio at birth</a><span> was 919 women for every 1,000 boys, betraying a preference for male children.</span></p>\n<p>\n\t<span>On the positive side, the difference in the intergenerational mobility among scheduled castes and tribes, when compared to other social groups, has reduced between 1983 and 2004-05, the report said, citing a 2012 </span><a href=\"http://faculty.arts.ubc.ca/alahiri/AEJ_published.pdf\">study</a><span>. This could be the effect of the strengthening of community networks within scheduled castes and tribes, increasing market competition because of economic liberalisation, and reservation policies in education and government jobs, the study published in the </span><em>American Economic Journal: Applied Economics </em><span>said.</span></p>\n<p>\n\t<strong>What can be done</strong></p>\n<p>\n\t<span>“Interventions early in life are critical because gaps that emerge early in life are difficult to offset through interventions later,” the report said, suggesting that maternal health programmes, which also affect the baby’s health, and early </span>child<span> nutrition and cognitive development programmes can help reduce the gap in opportunities between poor and rich children.</span></p>\n<p>\n\t<span>In low and </span>lower middle-income<span> economies such as India, school enrolment increases with rising parental income and education. If parents’ educational level is low, secondary school enrolment is very sensitive to household income, the report said.</span></p>\n<p>\n\t<span>Inequality of opportunity is likely to be much higher if the quality of education is considered, the report added. In India, one in 10 rural residents aged 14-18 years is unable to read a text in their own language meant for children aged 5-7 years, according to data from the Annual Survey of Education Report, as </span><strong>IndiaS</strong><strong>pend</strong><span> </span><a href=\"http://www.indiaspend.com/cover-story/crisis-in-adolescent-learning-in-indias-rural-schools-is-revealed-14954\">reported</a><span> in January 2018. Closing this gap in the quality of education could improve upward mobility.</span></p>\n<p>\n\t<span>Further, public spending on education promotes a level playing field for poorer children, the report suggested, so that economies with higher public investment in education show higher relative mobility in education.</span></p>\n<p>\n\t<span>Government spending on education in India, as a proportion of the country’s gross domestic product (GDP), has historically been low. For instance, Brazil spent 5.9% of its GDP on education in 2014, while India spent 2.8%. Spending in India has reduced from 3.1% of GDP in 2012-13 to 2.7% in 2017-18, government data show.</span></p>\n\n\n<p>\n\t“Children from low-income households, or minority groups, are more likely to reside in disadvantaged neighbourhoods, compared to neighbourhoods where better-off families live,” the report said. This could lead to differential access to resources–such as schools, medical facilities, employment opportunities–and exposure to good peers and mentors, the report explained.</p>\n<p>\n\t<span>“Programs such as mandatory inclusionary zones and community land trusts, which provide affordable housing for low-income families, mentoring programs, interventions through social networks, and internships at local companies as ways to motivate and help children, could also help lower the inequity in access to opportunities,” the report said.</span></p>\n<p>\n\t<span>Further, a well-functioning labour market is important to improve upward mobility, as an economy in which “jobs are rationed, labour mobility is limited, and human capital investments are priced differently based on characteristics unrelated to a worker’s productivity” could decrease intergenerational mobility, the report added.</span></p>\n<hr>\n<p>\n\t<em>(</em><strong><em>Khaitan</em></strong><em> is a writer/editor with IndiaSpend)</em></p>\n<p>\n\t<em>Reprinted with permission from IndiaSpend.org, a data-driven, public-interest journalism non-profit organisation. You can read the original article <a href=\"http://www.indiaspend.com/cover-story/indians-least-likely-to-break-out-of-education-income-bracket-theyre-born-into-90641\" target=\"_blank\">here</a></em></p>\n\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "World",
        "back",
        "educational",
        "dependent",
        "restricting",
        "rising",
        "above",
        "economic",
        "born"
    ],
    "nouns": [
        "World",
        "income",
        "Bank",
        "holding",
        "back",
        "education",
        "dependent",
        "rising",
        "above",
        "born",
        "report"
    ],
    "verbs": [
        "Bank",
        "back",
        "report"
    ]
}