{
    "creator": "PTI",
    "title": "Indian pharma companies should partner Chinese manufacturers for greater market access: Study",
    "link": "https://www.financialexpress.com/industry/indian-pharma-companies-should-partner-chinese-manufacturers-for-greater-market-access-study/1211120/",
    "pubDate": "Mon, 18 Jun 2018 22:54:09 +05:30",
    "dc:creator": "PTI",
    "content": "Indian pharma companies should enter into strategic alliances and partnership with local manufacturers and distributors in China for getting greater market access in that country, a commerce ministry sponsored study has recommended. ",
    "contentSnippet": "Indian pharma companies should enter into strategic alliances and partnership with local manufacturers and distributors in China for getting greater market access in that country, a commerce ministry sponsored study has recommended.",
    "guid": "https://www.financialexpress.com/?p=1211120",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-18T17:24:09.000Z",
    "sentiment": {
        "score": 3,
        "comparative": 0.25,
        "tokens": [
            "indian",
            "pharma",
            "companies",
            "should",
            "partner",
            "chinese",
            "manufacturers",
            "for",
            "greater",
            "market",
            "access",
            "study"
        ],
        "words": [
            "greater"
        ],
        "positive": [
            "greater"
        ],
        "negative": []
    },
    "article": {
        "title": "Indian pharma companies should partner Chinese manufacturers for greater market access: Study",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1211127\" src=\"https://images.financialexpress.com/2018/06/cats-1222.jpg\" alt=\"Indian pharma companies,&nbsp;Chinese manufacturers,&nbsp;China,&nbsp;Indian MNC, idian exports, CDSCO\" srcset=\"https://images.financialexpress.com/2018/06/cats-1222.jpg 660w, https://images.financialexpress.com/2018/06/cats-1222-300x200.jpg 300w, https://images.financialexpress.com/2018/06/cats-1222-620x413.jpg 620w, https://images.financialexpress.com/2018/06/cats-1222-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The research study on ‘Enhancing Indian exports of pharmaceutical products to China’ has suggested as many as 17 options to domestic firms for gaining market access in China. (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>Indian pharma companies should enter into strategic alliances and partnership with local manufacturers and distributors in China for getting greater market access in that country, a commerce ministry sponsored study has recommended. The research study on ‘Enhancing Indian exports of pharmaceutical products to China’ has suggested as many as 17 options to domestic firms for gaining market access in China. It was commissioned by the ministry. “With the owing complexities of the Chinese market, it is advisable for Indian MNCs exploring local deals/ strategic alliances (in form of joint ventures) with domestic companies, leveraging their market knowledge, geographic access and R&amp;D capabilities to ensure easier and sustainable market penetration,” it said.</p><span>\n</span><p>This step, it said, will take sizeable amount of investment for a longer period, which can only be strategically done by large cap pharmaceutical companies of India. It said that joint ventures will allow Indian MNCs to avoid tariff and quota issues, to gain more focus and control of product distribution and service in China.</p><span>\n</span><p>The study also suggested for setting up of a local Indian CDSCO (Central Drugs Standard Control Organisation) office in China having Indian representatives for all policy and regulatory recommendations; and increasing understanding on differences that exists in provincial procurement of hospital medicines.</p><span>\n</span><p>The other recommendations include targeting high priority medicine segments, identified by China; securing short-term supply of essential drugs and advanced intermediates; strengthening India’s API (bulk drugs) and intermediary market for it to be able to compete and enter market in China; and focus on setting up bioequivalence centres.</p><span>\n</span><p>It said that currently, India levies an extremely low registration fee of USD 1,000 per product for Chinese pharmaceutical companies, whereas China imposes an exorbitant fee of USD 145,960 for registering a product.</p><span>\n</span><p>Further, it said that marketing India should go hand in hand with <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/make-in-india/\">Make in India</a> and Indian missions have to be proactive in promoting the country’s exports. Industry and export chambers should be given some tasks and handholding with targets, besides creating an Ombudsman for resolving export related problems and disputes.</p><span>\n</span><p>It added that China is one of the healthiest pharmaceutical markets in the world when viewed through the lens of growth. “To survive, and thrive, in this market going forward means embracing the intricacies and proactively addressing those dynamics that make China truly unique,” it said. India wants greater market access in China for its pharma products with a view to bridge the widening trade deficit with the country, which has touched USD 63.12 billion in 2017-18.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "Chinese",
        "Indian",
        "strategic",
        "greater",
        "local"
    ],
    "nouns": [
        "Chinese",
        "China",
        "Indian",
        "market",
        "country",
        "commerce",
        "partner",
        "partnership",
        "access",
        "Study",
        "study",
        "getting",
        "ministry",
        "pharma",
        "local"
    ],
    "verbs": [
        "market",
        "partner",
        "access",
        "Study",
        "study",
        "enter"
    ]
}