{
    "title": "A bond-trading secret that helped one Indian bank beat its peers",
    "link": "https://www.business-standard.com/article/finance/a-bond-trading-secret-that-helped-one-indian-bank-beat-its-peers-118062500603_1.html",
    "pubDate": "Mon, 25 Jun 2018 16:29:00 +0530",
    "content": "The answer, according to the head of treasury and global markets at Bank of Baroda, goes back to a contrarian bet taken two years ago",
    "contentSnippet": "The answer, according to the head of treasury and global markets at Bank of Baroda, goes back to a contrarian bet taken two years ago",
    "guid": "https://www.business-standard.com/article/finance/a-bond-trading-secret-that-helped-one-indian-bank-beat-its-peers-118062500603_1.html",
    "isoDate": "2018-06-25T10:59:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "a",
            "bond-trading",
            "secret",
            "that",
            "helped",
            "one",
            "indian",
            "bank",
            "beat",
            "its",
            "peers"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "A bond-trading secret that helped one Indian bank beat its peers",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=kamal+mahajan\" target=\"_blank\">Kamal Mahajan </a>says he's being asked just one question: how did he make money as peers lost $4.4 billion during India’s worst bond-market rout in two decades?</p>\n<p>\n\tThe answer, according to the head of treasury and global markets at Bank of Baroda, goes back to a contrarian bet taken two years ago. As the Reserve Bank of India started an easing cycle in 2015, eventually cutting policy rates seven times, bond yields fell to levels not seen since the global financial crisis. While investors were lured into a one-way bet, Mahajan thought differently.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\t“Traders, however, experienced they are, tend to be carried away by the market noise,” said Mahajan, who manages $20 billion of sovereign debt at India’s second-biggest state lender. “Our model predicted the tightening cycle two years back and we started positioning ourselves for this well in advance.”</p>\n<p>\n\tHis desk began selling long bonds and buying paper that matured in four years or less, while also bulking up on 200 billion rupees ($2.9 billion) of floating-rate debt from August 2016. That very month, the pressure was mounting on the central bank to cut interest rates further as the latest data showed slowing economic growth.</p>\n<p>\n\tThe benchmark 10-year bond yield would sink to a seven-year low just three months later, raising questions over the strategy. Backed by Chief Executive Officer PS Jayakumar, the 59-year-old stuck to his guns.</p>\n<p>\n\t“When yields were lower than 7 percent we didn’t buy while many other desks kept on buying,” said Mahajan. “Conviction in one’s models and formula is very important to ride through the market noise that opposes your stance and to come out on top on the other end.”</p>\n<p>\n\tYields would climb more than 180 basis points from that nadir to touch 8 percent this month, as oil prices surged and investors became increasingly concerned about Prime Minister Narendra Modi’s expanding debt sales and fiscal discipline. In April, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rbi\" target=\"_blank\">RBI </a>shocked traders when minutes showed a tilt toward tightening, with a hike taking place two months later.</p>\n<p>\n\tLosses mounted for local lenders, the biggest holders of sovereign debt.</p>\n<p>\n\tState lenders probably held 300 billion rupees of losses on bond holdings in the six months ended March, according to India Ratings &amp; Research, the local unit of Fitch Group. The red ink was so deep that <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rbi\" target=\"_blank\">RBI </a>allowed <a class=\"storyTags\" href=\"https://www.business-standard.com/category/finance-news-banks-1030101.htm\" target=\"_blank\">banks </a>to spread it out over time.</p>\n<p>\n\t<strong>Trading Secrets</strong></p>\n<p>\n\tBank of Baroda, by contrast, booked a trading profit of 4.9 billion rupees for the same period, and 14.5 billion rupees for the entire fiscal year. Of the 17 state-run <a class=\"storyTags\" href=\"https://www.business-standard.com/category/finance-news-banks-1030101.htm\" target=\"_blank\">banks </a>covered, only a couple had trading gains, according to India Ratings &amp; Research.</p>\n<p>\n\tMahajan, who started at Baroda in 1984, doesn’t want to give away details of his trading model, except to say that it incorporates forecasts on budget deficits and oil prices, a major swing factor for India which relies on imports.</p>\n<p>\n\tThe only other tip he would share is that another turning point may come if the benchmark bond yield reaches 8.25 percent.</p>\n<p>\n\tThe 10-year bond yield was at 7.84 percent as of 3:29 p.m. in Mumbai on Monday, suggesting that more pain may be in store. Every 10 basis point increase leads to a loss of as much as 40 billion rupees for state banks, according to Anil Gupta, head of financial sector ratings at ICRA, the local unit of Moody’s Investors Service.</p>\n<p>\n\tBank of Baroda’s top management is now working to ensure that Mahajan’s model will be continued by his successors. For them, the veteran trader returns to a favorite theme.</p>\n<p>\n\t“To ride the yield curve and not get persuaded by current events, the senior treasury team needs to look beyond the present time horizon,” Mahajan said. “I am not good at trigonometry or statistics. But I went through the last 30 years and formed this model based on basic logic.”</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Indian",
        "secret",
        "one",
        "beat",
        "according",
        "global",
        "back",
        "taken",
        "two",
        "ago"
    ],
    "nouns": [
        "trading",
        "bank",
        "Bank",
        "Indian",
        "A",
        "bond",
        "secret",
        "one",
        "beat",
        "head",
        "treasury",
        "answer",
        "back",
        "contrarian",
        "two",
        "years",
        "bet"
    ],
    "verbs": [
        "bank",
        "Bank",
        "bond",
        "beat",
        "answer",
        "head",
        "back",
        "bet"
    ]
}