{
    "creator": "Pragya Srivastava",
    "title": "After fitness challenge, PM Modi takes double-digit growth challenge; these goals will help meet it",
    "link": "https://www.financialexpress.com/economy/after-fitness-challenge-pm-modi-take-double-digit-growth-challenge-these-goals-will-help-meet-it/1210207/",
    "pubDate": "Mon, 18 Jun 2018 12:41:51 +05:30",
    "dc:creator": "Pragya Srivastava",
    "content": "PM Modi Niti Aayog meet: Identifying \"last people standing in the line\" and ensuring that benefits of the governance reach them was the crux of Prime Minister Narendra Modi's vision at the fourth meeting of the Governing Council of Niti Aayog.",
    "contentSnippet": "PM Modi Niti Aayog meet: Identifying \"last people standing in the line\" and ensuring that benefits of the governance reach them was the crux of Prime Minister Narendra Modi's vision at the fourth meeting of the Governing Council of Niti Aayog.",
    "guid": "https://www.financialexpress.com/?p=1210207",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-18T07:11:51.000Z",
    "sentiment": {
        "score": 3,
        "comparative": 0.2,
        "tokens": [
            "after",
            "fitness",
            "challenge",
            "pm",
            "modi",
            "takes",
            "double-digit",
            "growth",
            "challenge",
            "these",
            "goals",
            "will",
            "help",
            "meet",
            "it"
        ],
        "words": [
            "help",
            "challenge",
            "growth",
            "challenge",
            "fitness"
        ],
        "positive": [
            "help",
            "growth",
            "fitness"
        ],
        "negative": [
            "challenge",
            "challenge"
        ]
    },
    "article": {
        "title": "After fitness challenge, PM Modi takes double-digit growth challenge; these goals will help meet it",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1210299\" src=\"https://images.financialexpress.com/2018/06/niti-pm.jpg\" alt=\"After fitness challenge, PM Modi take double digit growth challenge; these goals will help meet it\" srcset=\"https://images.financialexpress.com/2018/06/niti-pm.jpg 660w, https://images.financialexpress.com/2018/06/niti-pm-300x200.jpg 300w, https://images.financialexpress.com/2018/06/niti-pm-620x413.jpg 620w, https://images.financialexpress.com/2018/06/niti-pm-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> PM Narendra Modi said that the challenge is to&nbsp;take the GDP growth rate to double digits. (Image: Niti Aayog)</figure>\n\t\t\t</section></div><span>\n</span><p><strong>PM Modi Niti Aayog meet:</strong> Identifying “last people standing in the line” and ensuring that benefits of the governance reach them was the crux of Prime Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/narendra-modi/\">Narendra Modi</a>’s vision at the&nbsp;fourth meeting of the Governing Council of Niti Aayog. While the Prime Minister envisaged this ultimate goal, he also identified that the biggest challenge before India is to grow at the double-digit, for which more steps need to be taken.</p><span>\n</span><p>In the meeting with&nbsp;23 chief ministers and one Lt Governor, Narendra Modi said that after a healthy GDP growth of 7.7% in the fourth quarter of the financial year 2017-18, the challenge is to&nbsp;take this growth rate to double digits. He said that steps like&nbsp;doubling the farmers’ income, development of aspirational districts, Ayushman Bharat, Mission Indradhanush, Nutrition Mission et al are essential to ensure a double-digit growth.</p><span>\n</span><p>The Narendra Modi government has set the ambitious target of doubling the farmers’ income by 2022. Under the scheme, the government aims to double farmers’ income by improvement in technology involved, through increased use of quality seed, fertiliser, irrigation, agrochemicals,&nbsp;and facilitating institutions such as cold storage and food processing.</p><span>\n</span><p>However, the biggest challenge for India’s agriculture sector is decreasing its dependence on monsoon as climate change poses a big challenge. Chief Economic Advisor Arvind Subramanian advocated for improving irrigation in the Economic Survey report this year.</p><span>\n</span><p>In January, the government launched ‘Transformation of Aspirational Districts’ programme, under which districts’ performance will be measured&nbsp;on 49 key indicators in raising the living standards of its citizens and ensuring inclusive growth for all. So far, Niti Aayog has identified 115 districts. Narendra Modi said states can define their own parameters to identify areas as aspirational blocks.</p><span>\n</span><p>In the Budget 2018, the biggest highlight was the announcement of world’s largest healthcare coverage of Rs 5 lakh for 10 crore poor families, known as&nbsp;Ayushman Bharat, also popularised as ‘ModiCare’. Although this plan is still a planning stage, some analysts believe that if the government overcomes the infrastructural barriers, this could become one the of the biggest inclusive schemes.</p><span>\n</span><p>Another healthcare scheme by the Narendra Modi government is&nbsp;Mission Indradhanush under which the aim is to provide full immunization against preventable childhood diseases.&nbsp;Mission Indradhanush will ensure that all children under the age of two years and pregnant women are fully immunized with all available vaccines, said the government.</p><span>\n</span><p>In March, the government launched National Nutrition Mission, which aims to provide&nbsp;a comprehensive approach towards raising nutrition level in the country. The programme has been set up with a three year budget of Rs 9046.17 crore.</p><span>\n</span><p>At the meeting, Narendra Modi also called upon chief ministers of Madhya Pradesh, Bihar, Sikkim, Gujarat, Uttar Pradesh, West Bengal and Andhra Pradesh&nbsp;to work together to make recommendations on a coordinated policy approach on “agriculture and MNREGA,” including both pre-sowing, and post-harvest phases.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "standing",
        "Prime",
        "meet",
        "last",
        "Governing",
        "After",
        "double",
        "fourth"
    ],
    "verbs": [
        "will",
        "Minister",
        "people",
        "Prime",
        "meet",
        "challenge",
        "reach",
        "last",
        "help",
        "double",
        "line"
    ],
    "nouns": [
        "will",
        "Council",
        "Minister",
        "standing",
        "people",
        "growth",
        "Prime",
        "vision",
        "meet",
        "meeting",
        "challenge",
        "PM",
        "reach",
        "last",
        "help",
        "governance",
        "Governing",
        "fitness",
        "double",
        "digit",
        "crux",
        "fourth",
        "line"
    ]
}