{
    "title": "Fraud-hit PNB signals recovery by Q2; eyes Rs 55 billion net profit",
    "link": "https://www.business-standard.com/article/economy-policy/pnb-signals-recovery-from-fraud-by-q2-eyes-rs-55-bn-net-profit-118061000745_1.html",
    "pubDate": "Mon, 11 Jun 2018 02:56:00 +0530",
    "content": "Govt refuses bank's demand for additional capital of Rs 80 bn",
    "contentSnippet": "Govt refuses bank's demand for additional capital of Rs 80 bn",
    "guid": "https://www.business-standard.com/article/economy-policy/pnb-signals-recovery-from-fraud-by-q2-eyes-rs-55-bn-net-profit-118061000745_1.html",
    "isoDate": "2018-06-10T21:26:00.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.16666666666666666,
        "tokens": [
            "fraud-hit",
            "pnb",
            "signals",
            "recovery",
            "by",
            "q2",
            "eyes",
            "rs",
            "55",
            "billion",
            "net",
            "profit"
        ],
        "words": [
            "profit"
        ],
        "positive": [
            "profit"
        ],
        "negative": []
    },
    "article": {
        "title": "Fraud-hit PNB signals recovery by Q2; eyes Rs 55 billion net profit",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p><span> Fraud-hit Punjab National Bank (PNB), which recently reported the highest-ever loss by any domestic bank in history, is aiming to clock its largest-ever quarterly profit of Rs 55 billion in the July-August period this financial year.</span> <span></span> <span> However, the road to profitability has already hit some hurdles for the Delhi-based bank as the Union government has rejected its demand for an additional <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/capital-infusion\" target=\"_blank\">capital infusion </a>of around Rs 80 billion in 2018-19, sources said.</span> <span></span> <span> Submitting its turnaround plan last month, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/pnb\" target=\"_blank\">PNB </a>has told the department of financial services (DFS) and the Reserve Bank of India (RBI) that it is eyeing an ambitious net profit of Rs 55 billion in the second quarter, according to documents reviewed by Business Standard. This will mean a huge recovery from the Rs 134 billion net loss reported by the bank in fourth quarter of 2017-18, owing to the Rs 143-billion swindle on account of fraudulent loans to jewellery firms belonging to <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nirav-modi\" target=\"_blank\">Nirav Modi </a>and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/mehul-choksi\" target=\"_blank\">Mehul Choksi </a>and the Reserve Bank of India (RBI)’s new provisioning norms.<span></span> <span></span> <span> <strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/finance/public-sector-banks-post-rs-870-bn-net-loss-in-fy-18-pnb-tops-the-list-118061000221_1.html\" target=\"_blank\">Public sector banks post Rs 870 bn net loss in FY 18, PNB tops the list</a></strong></span> </span> <span></span> <span> The highest quarterly net profit reported by <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/pnb\" target=\"_blank\">PNB </a>stood at Rs 14.2 billion in January-March 2012.</span> <span></span> <span> <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/pnb\" target=\"_blank\">PNB </a>had sought Rs 80 billion in the form of capital support from the Union government in 2018-19. However, the DFS is not keen on pumping in additional money into the fraud-hit bank and it has instead asked the management to focus on selling non-core assets, shedding risk-weight assets and improve recovery to clock profitability, sources said.</span> <span></span> <span> PNB’s demand for an additional capital comes on the back of the expected hit of Rs 100 billion in the present financial year due to the fraud-related provisions, mark-to-market losses (due to high yields impacting the market value of investment book), provision on insolvency and bankruptcy code, among others.</span> <span></span> <span> In the fourth quarter of 2017-18, PNB had to make a provisioning of Rs 102 billion in its books because of the RBI’s new stressed assets resolution norms and a sum of Rs 71.8 billion towards the fraud, which is half the amount involved in the scam.</span> <span></span> <span> “Additional capital infusion, apart from the second round of recapitalisation due this financial year, in PNB is unlikely,” said a senior finance ministry official. Last year, PNB received Rs 54.7 billion from the Union government, under the first round of public sector bank recapitalisation.<span></span> <span></span> <span> <strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/current-affairs/pnb-scam-ex-rbi-governor-faults-govt-says-public-trust-in-psbs-affected-118061000245_1.html\" target=\"_blank\">PNB scam: Ex-RBI governor faults govt, says public trust in PSBs affected</a></strong></span> </span> <span></span> <span> Recently, rating agency Moody’s Investors Service said PNB will need Rs 120 billion-130 billion in 2018-19 to meet regulatory requirements, while downgrading its rating.</span> <span></span> <span> PNB has planned to substantially bring down net non-performing assets (NPA) to 5.96 per cent by March 2019 from 11.24 per cent in March this year. </span></p><p>A net <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/npa\" target=\"_blank\">NPA </a>of above six per cent is itself a trigger for the RBI to put PNB under its prompt corrective action (PCA) framework – to restore its health — that will somewhat restrict its ability to expand. <span></span> <span> Though the RBI may take a call on whether PNB’s financial conditions warrants putting it under PCA, the Delhi-based bank is taking early steps to cut down expenses. For instance, it has put a freeze on fresh hiring and plans to close down 634 unviable ATMs across the country. In 2017-18, PNB had shut 506 unviable ATMs, as per the RBI data.</span> <span></span> <span> Overall, the bank will aim to cut down operating expenses by 10 per cent, as per its roadmap for revival. Further, it plans to reduce the risk-weighted assets by Rs 230 billion and has targeted return on assets at 0.14 per cent by March 2019 from a negative return at end of March 2018.</span> <span></span> <span> In a bid to prevent slippages, the amount of loans that turns from good to bad, PNB has strengthened its loan monitoring system and launched an internal mobile application known as <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=pnb+mtouch\" target=\"_blank\">PNB MTOUCH.</a> The bank management has told branch officials to visit the borrower’s residence or business premises regularly and persuade them to repay the overdue from day 1.<span></span> </span></p><blockquote class=\"blockquoteBG styleQ1\"> <p> <strong>Turnaround plan</strong></p> <ul> <li> Net profit of Rs 55 billion in July-August period from net loss of Rs 134 billion in January-March</li> <li> Bring down net non-performing assets (NPA) to 5.96% in March 2019 from 11.24% in March 2018</li> <li> Raise Rs 86 billion from sale of non-core assets in 2018-19</li> <li> Reduce risk-weighted assets by Rs 230 billion</li> <li> Cut operating expenses by 10%</li> <li> Freeze on fresh hiring</li> <li> Close down 634 unviable ATMs</li> <li> Rationalise overseas branches</li> <li> Return on assets of 0.14% by March 2019 from negative at present</li> </ul> </blockquote> </span>"
    },
    "adjectives": [
        "additional",
        "capital",
        "billion",
        "55",
        "net",
        "80"
    ],
    "nouns": [
        "demand",
        "capital",
        "billion",
        "bank",
        "profit",
        "Fraud",
        "hit",
        "recovery",
        "eyes",
        "net",
        "80"
    ],
    "verbs": [
        "demand",
        "bank",
        "profit",
        "hit",
        "net"
    ]
}