{
    "creator": "FE Bureau",
    "title": "Resolution of bad loans: ‘ARC/AMC norms in two weeks’",
    "link": "https://www.financialexpress.com/economy/resolution-of-bad-loans-arc-amc-norms-in-two-weeks/1199357/",
    "pubDate": "Sat, 09 Jun 2018 03:46:38 +05:30",
    "dc:creator": "FE Bureau",
    "content": "The government on Friday revisited the idea of setting up a large public-sector asset reconstruction company (ARC), sort of a ‘big bad bank’.",
    "contentSnippet": "The government on Friday revisited the idea of setting up a large public-sector asset reconstruction company (ARC), sort of a ‘big bad bank’.",
    "guid": "https://www.financialexpress.com/?p=1199357",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-08T22:16:38.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.1111111111111111,
        "tokens": [
            "resolution",
            "of",
            "bad",
            "loans",
            "‘arcamc",
            "norms",
            "in",
            "two",
            "weeks’"
        ],
        "words": [
            "bad",
            "resolution"
        ],
        "positive": [
            "resolution"
        ],
        "negative": [
            "bad"
        ]
    },
    "article": {
        "title": "Resolution of bad loans: ‘ARC/AMC norms in two weeks’",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img src=\"https://images.financialexpress.com/2018/06/bad-loan-1.jpg\" alt=\"Bad Loan Market, NPA, Non Performing Assets, Indian Economy, India, Economy, Bad loans in Indian Economy, Bad debts, Bad loans, Bad Loans in India, Indian Economy status\" class=\"size-full wp-image-1199366\" srcset=\"https://images.financialexpress.com/2018/06/bad-loan-1.jpg 660w, https://images.financialexpress.com/2018/06/bad-loan-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/bad-loan-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/bad-loan-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Strict provisioning norms, losses in bond portfolio and a string of scandals are straining the finances of PSBs, especially the ones under PCA.</figure>\n\t\t\t</section></div><span>\n</span><p>The government on Friday revisited the idea of setting up a large public-sector asset reconstruction company (ARC), sort of a ‘big bad bank’, as it vowed to persist with efforts to fast-track the resolution of stressed assets in the banking system and bolster public-sector banks’ (PSBs) impaired capacity to ease credit flows, especially to the small and medium enterprises. Addressing the media after a long brainstorming session with heads of PSBs here, Piyush Goyal, who holds additional charge of the finance ministry, said a committee under Sunil Mehta, non-executive chairman of Punjab National Bank, has been asked to appraise the desirability of an ARC and/or an asset management company (AMC) and frame the possible modalities for them in two weeks. </p><span>\n</span><p>Goyal also said that all vacant positions of PSB heads would be filled in the next 30 days. At present, five PSBs — Dena Bank, Punjab &amp; Sind Bank, IDBI Bank, Allahabad Bank and Andhra Bank — do not have a chief executive officer. The Economic Survey for 2016-17 had made a case for a centralised Public-sector Asset Rehabilitation Agency (PARA) that would purchase stressed loans (especially the largest and most difficult ones) from banks and then work them out. </p><span>\n</span><p>However, the government was non-committal on the proposal, apparently because it wasn’t happy with the performance of the existing ARCs and thought that a robust ecosystem for ARCs should be evolved before deciding on PARA, which, as mooted by the survey, was to be much bigger in scale and required substantial government investment. Asked how the capital for the ARC/AMC would be mobilised, Goyal merely said that it was too early to “go to that level”.</p><span>\n</span><p>Experts have argued that the existing ARCs whose functions are largely confined to recovering stressed loans through liquidation of asset can’t address the mammoth problem of stressed assets with PSBs and an agency that could also take up jobs like executing stalled projects, writing off part of the debt, etc, could stand them in good stead. After purchasing the bad assets, the agency could work them out, either by converting debt to equity and selling the stakes in auctions or by granting debt reduction, depending on professional assessments. Since the largest bad loans involve multiple banks, it is reckoned that transferring such assets to a robust ARC could streamline the process and allow coordinated effort. Most of the stressed assets have been identified that could fit into the ARC or AMC structure, Goyal said.</p><span>\n</span><p>Reserve Bank of India (<a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a>) deputy governor Viral Acharya had pitched for an efficient structure for handling the stressed loan crisis: A private asset management company (PAMC) and a national asset management company (NAMC). A PAMC could be modelled, he had said, as a private agency that would seek to resolve assets with economic value in the short run. An NAMC, on the other hand, would rope in asset managers such as ARCs and private equity to manage and turn around the assets that appear to be unviable in the short or medium term.</p><span>\n</span><p>There was also a plan to task the National Investment and Infrastructure Fund (NIIF) with the take-over an finding professional management of the stressed assets identified to be viable but languishing because promoters are unable to infuse fresh equity. When asked about the NIIF proposal, Goyal said it was an autonomous body performing a creditable role, but was non-committal on its roping in for the ARC/AMC agenda.</p><span>\n</span><p>The minister said discussions during the meeting focused on credit flow and banks devising mechanism to ensure credit flow to good borrowers should not face difficulties. According to RBI data, credit flow has improved, although a large portion of the growth has been driven by retail credit. For the fortnight ended May 25, 2018, non-food credit stood at Rs 85.11 lakh crore, up 13.3% year-on-year. </p><span>\n</span><p>He reiterated the government’s commitment to provide “every necessary support” to all 21 PSBs, but on a question on additional capital support to them in the current financial year (PSBs were offered Rs 90,000 crore in FY18 of which Rs 80,000 crore was in the form of bonds; securities worth another Rs 65,000 crore is to be given to them in the current fiscal under the current plan), he said it required to be seen how much funds they could mobilise by disposing of non-core assets. The process of stressed assets resolution under the Insolvency and Bankruptcy Code (IBC) would play a complementary role in improving the banks’ capital bases, he noted.</p><span>\n</span><p>Goyal said that a process has been devised by the bankers amongst themselves to ensure that the credit flow to good borrowers, to good accounts where some of the banks under the RBI’s prompt corrective action (PCA) framework are also the part of consortium, would not face any difficulty in meeting their working capital needs.</p><span>\n</span><p>The minister said that the finance and power ministry will act on the Allahabad High Court order on 11 stressed power plants in an expeditious manner. The court ordered last week that no action be taken against these power projects under the RBI February 12 circular till the finance ministry called a meeting of relevant stakeholders in June to discuss the issues.</p><span>\n</span><p>State Bank of India chairman Rajnish Kumar said that a screening committee would be set up to assess some of the resolution plans adopted by banks. “It will be for those cases where we are getting into an one-time settlement (OTS) or sale to ARCs,” Kumar said. As many as 11 of 21 PSBs are officially stressed and under the PCA framework. The central bank has imposed restrictions on lending by two of these banks — Dena Bank and Allahabad Bank — until they fix their finances. </p><span>\n</span><p>Strict provisioning norms, losses in bond portfolio and a string of scandals are straining the finances of PSBs, especially the ones under PCA. Losses posted by as many as 20 PSBs in the March quarter have almost touched a record Rs 60,000 crore, with just two banks having turned in a profit. Bad loans with these 20 banks touched a staggering Rs 8,58,421 crore as of March 2018, according to Capitaline data.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "public",
        "bad",
        "two",
        "large",
        "big"
    ],
    "nouns": [
        "government",
        "sector",
        "bank",
        "public",
        "setting",
        "bad",
        "idea",
        "Resolution",
        "two",
        "Friday",
        "large",
        "asset",
        "reconstruction",
        "company",
        "ARC",
        "sort"
    ],
    "verbs": [
        "bank",
        "ARC",
        "company",
        "sort"
    ]
}