{
    "title": "Govt likely to sell a significant portion of its stake in IDBI Bank to LIC",
    "link": "https://www.business-standard.com/article/economy-policy/govt-likely-to-sell-a-significant-portion-of-its-stake-in-idbi-bank-to-lic-118062300068_1.html",
    "pubDate": "Sat, 23 Jun 2018 02:16:00 +0530",
    "content": "The insurance regulator may take up the matter during its June 29 board meeting",
    "contentSnippet": "The insurance regulator may take up the matter during its June 29 board meeting",
    "guid": "https://www.business-standard.com/article/economy-policy/govt-likely-to-sell-a-significant-portion-of-its-stake-in-idbi-bank-to-lic-118062300068_1.html",
    "isoDate": "2018-06-22T20:46:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.06666666666666667,
        "tokens": [
            "govt",
            "likely",
            "to",
            "sell",
            "a",
            "significant",
            "portion",
            "of",
            "its",
            "stake",
            "in",
            "idbi",
            "bank",
            "to",
            "lic"
        ],
        "words": [
            "significant"
        ],
        "positive": [
            "significant"
        ],
        "negative": []
    },
    "article": {
        "title": "Govt likely to sell a significant portion of its stake in IDBI Bank to LIC",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>The government is considering a proposal to sell a significant portion of its stake in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/idbi-bank\" target=\"_blank\">IDBI Bank </a>to <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=life+insurance+corporation+of+india\" target=\"_blank\">Life Insurance Corporation of India </a>(LIC) and has approached the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=insurance+regulatory+and+development+authority+of+india\" target=\"_blank\">Insurance Regulatory and Development Authority of India </a>(IRDAI) for clearance, according to sources.</p><p>\nThe insurance regulator may take up the matter during its June 29 board meeting. Further, to make this proposal effective, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/irdai\" target=\"_blank\">IRDAI </a>is likely to give <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/lic\" target=\"_blank\">LIC </a>an exemption from breaching the maximum company-specific investment limit.\n\n\n</p>\n<!-- INPAGE_BANNER --><p>\nCurrently, insurance companies are not allowed to own more than 15 per cent in a single company. However, the regulator would ask <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/lic\" target=\"_blank\">LIC </a>to bring down its stake in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/idbi-bank\" target=\"_blank\">IDBI Bank </a>over a period of five-seven years. Sources said this would not be a challenge because <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/irdai\" target=\"_blank\">IRDAI </a>had allowed such exemptions in the past.</p><p>\nThe <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/lic\" target=\"_blank\">LIC </a>board has approved the proposal in principle. The bank will be asked to present fresh capital requirements.</p><p>\nCurrently, LIC has over 10 per cent stake in six PSU banks, including <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/idbi-bank\" target=\"_blank\">IDBI Bank </a>(see table). In another four, its stake ranges between 9.5 and 10 per cent.</p><p>\nThe government held an 80.96 per cent stake in the beleaguered bank, and LIC 10.82 per cent, as on March 31, 2018.</p><p>\nThe market was already abuzz with this <a class=\"storyTags\" href=\"https://www.business-standard.com/category/economy-policy-news-1020101.htm\" target=\"_blank\">news </a>on Friday. IDBI Bank’s stock scaled an intra-day high of Rs 61 before closing 2 per cent higher at Rs 59 per share on the BSE. The buzz is that the government could sell as much as 40 per cent in the bank to the country's largest life insurance company. If this move fructifies, the state-owned life insurer may end up holding a majority stake in the ailing public sector bank. The buyout will cost LIC about Rs 100 billion, based on the Rs 248 billion market capitalisation of IDBI Bank, as on Friday, and assuming it acquires a 40 per cent equity stake from the government.</p><p>\nThe government has for over three years been seeking strategic investors for the lender. International Finance Corporation (IFC) had conducted due diligence, but the matter did not move ahead.</p><p>\nMarket experts, however, are not excited by the news, due to lack of any immediate benefits for the bank.</p><p>\n“The deal is not beneficial for either of the parties. Given the negative adjusted book value (net worth minus bad loans) of IDBI Bank, the deal is not good for LIC. Also, the bank is not going to get any capital infusion with this. Only government will get some amount,” said G Chokkalingam, founder and managing director, Equinomics Research &amp; Advisory.</p><p>\nIDBI Bank is under the Reserve Bank of India’s (RBI's) prompt corrective action framework due to its weak credit profile. Faced with a huge provisioning bill for bad loans for 2017-18, it booked a net loss of Rs 82.37 billion, against a net loss of Rs 51.58 billion in 2016-17.</p><p>\nThe bank’s gross non-performing assets (NPAs) ratio stood at 27.95 per cent (Rs 555.88 billion). As a share of total advances, this is the second-highest in the history of Indian banking. Earlier, IDBI Bank had reported gross NPAs of 30 per cent in the quarter ended December 2003.</p><p>\nThe bank also reported divergence in asset classification to the tune of Rs 102.81 billion in 2016-17. Gross NPAs assessed by <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rbi\" target=\"_blank\">RBI </a>stood at Rs 550.34 billion against the bank’s assessment of Rs 447.52 billion.</p><div><span>\n\t</span><img align=\"left\" alt=\"Govt likely to sell a significant portion of its stake in IDBI Bank to LIC\" class=\"imgCont\" height=\"640\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/23/full/1529700345-6082.jpg\" title=\"Govt likely to sell a significant portion of its stake in IDBI Bank to LIC\" width=\"532\"></div>\nIDBI Bank plans to put NPAs worth Rs 210 billion on the block in order to clean up its balance sheet. Some of these NPA accounts are from RBI’s first list of companies referred to the National Company Law Tribunal for insolvency resolution. The bank will only part with these stressed loans if it receives the expected value.<p>\nThe net NPA ratio stood at 16.69 per cent (Rs 286.65 billion), up from 16.02 per cent (Rs 293.52 billion) in December 2017. Net NPAs were 13.21 per cent (Rs 252.05 billion) of advances at the end of March 2017. The bank has been engaged in sale of non-core assets, including real estate and stakes in the National Stock Exchange and SIDBI, to shore up its capital base. The profit from the sale of non-core assets stood at Rs 38.7 billion in 2017-18.</p><p>\nIDBI Bank also plans to sell 26-30 per cent stake in its mutual fund arm IDBI Asset Management Company to a strategic investor and intends to exit the life insurance venture, IDBI Federal Life Insurance Company. IDBI Capital Market Ltd, the investment banking arm, will reduce its 33 per cent stake in the AMC. The balance 67 per cent stake is held by IDBI Bank.  The bank also hopes to conclude the sale of a 30 per cent stake in NSDL valued at around Rs 9 billion.</p><p>\n(With inputs by Shreepad S Aute)<br></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "significant",
        "likely",
        "29"
    ],
    "nouns": [
        "insurance",
        "Bank",
        "stake",
        "matter",
        "sell",
        "meeting",
        "regulator",
        "may",
        "portion",
        "29",
        "June",
        "board"
    ],
    "verbs": [
        "Bank",
        "stake",
        "matter",
        "sell",
        "portion",
        "board"
    ]
}