{
    "title": "8 states, 4 UTs sign MoUs with health ministry to implement Ayushman Bharat",
    "link": "https://www.business-standard.com/article/economy-policy/8-states-4-uts-sign-mous-with-health-ministry-to-implement-ayushman-bharat-118060900395_1.html",
    "pubDate": "Sat, 09 Jun 2018 16:11:00 +0530",
    "content": "Prime Minister Modi is expected to roll out the programme on August 15",
    "contentSnippet": "Prime Minister Modi is expected to roll out the programme on August 15",
    "guid": "https://www.business-standard.com/article/economy-policy/8-states-4-uts-sign-mous-with-health-ministry-to-implement-ayushman-bharat-118060900395_1.html",
    "isoDate": "2018-06-09T10:41:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "8",
            "states",
            "4",
            "uts",
            "sign",
            "mous",
            "with",
            "health",
            "ministry",
            "to",
            "implement",
            "ayushman",
            "bharat"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "8 states, 4 UTs sign MoUs with health ministry to implement Ayushman Bharat",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tEight states and four Union Terrorities have signed MoUs with the Union <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=health+ministry\" target=\"_blank\">Health Ministry </a>to implement the government's ambitious national health protection mission, which aims to provide a cover of Rs 500,000 per family annually to 100 million vulnerable families, an official said today.</p>\n<p>\n\tFour states - Delhi, Odisha, Punjab and West Bengal - have not yet given any positive response towards adopting the programme, the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=health+ministry\" target=\"_blank\">health ministry </a>official said.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tDiscussions with these states are on, he added.</p>\n<p>\n\tThe eight states which signed the MoUs to implement the Ayushman Bharat-National <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=health+protection+mission\" target=\"_blank\">Health Protection Mission </a>include Himachal Pradesh, Haryana, Jammu and Kashmir and Uttarakhand.</p>\n\n<p>\n\tThe Union Territory of Chandigarh is among the four UTs.</p>\n<p>\n\tGujarat, Madhya Pradesh, Uttar Pradesh, Bihar, Andhra Pradesh, Kerala, Andaman and Nicobar Islands and Tamil Nadu are among those that will sign the agreement soon, the official said.</p>\n\n<p>\n\tPrime Minister Modi is expected to roll out the programme on August 15.</p>\n<p>\n\tThrough the MoUs, the states and UTs formally committed to implement the health programme. The MoU outlines the role of central and state governments/UT administrations in implementing the scheme. Regional workshops are being planned across India to sign MoU with other states.</p>\n\n<p>\n\tUnion Health Minister <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=j+p+nadda\" target=\"_blank\">J P Nadda </a>had said the initiative would eventually become the world's largest healthcare programme because of India's second largest population.</p>\n<p>\n\tThe scheme will provide a coverage of Rs 500,000 per family to 100 million poor and vulnerable families annually. It will target poor rural families and identified occupational categories of urban workers' families - 80.3 million in rural and 23.3 million in urban areas, according to the latest Socio-Economic and Caste Census data.</p>\n\n<p>\n\tIt will provide cashless and paperless access to services up to Rs 500,000&nbsp;per year and will be available for the beneficiary families at the point of service in public and private empanelled hospitals across India.</p>\n\n<p>\n\tThe beneficiaries under the scheme can avail the services anywhere in India and it is expected to bring a visible relief to the target families by mitigating the financial risk from catastrophic health episodes.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "expected",
        "Prime",
        "sign",
        "15",
        "August"
    ],
    "nouns": [
        "Prime",
        "programme",
        "sign",
        "implement",
        "ministry",
        "Minister",
        "health",
        "15",
        "August",
        "Bharat",
        "roll"
    ],
    "verbs": [
        "Prime",
        "programme",
        "sign",
        "implement",
        "Minister",
        "roll"
    ]
}