{
    "title": "SBI General to launch 'inherent defects' policy for real estate developers",
    "link": "https://www.business-standard.com/article/finance/sbi-general-to-launch-inherent-defects-policy-for-real-estate-developers-118061600007_1.html",
    "pubDate": "Sat, 16 Jun 2018 07:03:00 +0530",
    "content": "SBI-General will launch 5-year inherent defects product in next six to eight weeks and has received the IRDAI approval",
    "contentSnippet": "SBI-General will launch 5-year inherent defects product in next six to eight weeks and has received the IRDAI approval",
    "guid": "https://www.business-standard.com/article/finance/sbi-general-to-launch-inherent-defects-policy-for-real-estate-developers-118061600007_1.html",
    "isoDate": "2018-06-16T01:33:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "sbi",
            "general",
            "to",
            "launch",
            "'inherent",
            "defects'",
            "policy",
            "for",
            "real",
            "estate",
            "developers"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "SBI General to launch 'inherent defects' policy for real estate developers",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tSBI General (SBI-G) insurance company will be the second general insurer in the country to introduce an ‘inherent defects’ insurance policy for real estate developers, after <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/hdfc\" target=\"_blank\">HDFC </a>Ergo launched their product last November.</p>\n<p>\n\tUnder the new <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=real+estate+regulation+and+development+act\" target=\"_blank\">Real Estate Regulation and Development Act </a>(RERA), 2016, builders are liable to pay for any structural flaws in their buildings which are detected within five years, from the date of purchase of the property.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tWhile traditional insurance policies for property or residences cover damage or loss caused by fire, the different in the ‘inherent defects’ policy will cover issues discovered because of poor workmanship, structural defects for example.</p>\n<p>\n\tIt will provide a builder with protection against cost of repairing, restoring and or strengthening the building if there is damage caused by inherent structural problems.</p>\n<p>\n\t“For years the product was available abroad, but now with the new real-estate regulations coming in, demand from builders has grown. That is the immediate trigger,” says Puneet Sahni, Assistant Vice-President of Product Development at SBI-G.</p>\n<p>\n\tSBI-G will launch the 5-year inherent defects product in the next six to eight weeks and has received the Insurance Regulatory and Developmental Authority of India’s (IRDAI) approval.</p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/current-affairs/millennials-most-susceptible-to-kidney-ailments-says-sbi-g-study-118031201207_1.html\" target=\"_blank\">Millennials most susceptible to kidney ailments, says SBI-G study</a></strong><br></p>\n<p>\n\t“RERA says builder says builder should be making-good of any loss because of inherent defects within five years of handing over the possession to the end-buyer.</p>\n<p>\n\tAt this point in time, the product is only for residential buildings. Given that it’s a new product and new risk, once we build our book and gain some experience,  we will extend it to commercial properties,” said Sahni.</p>\n<p>\n\tIn terms of the premium size under ‘inherent defect’ policies, on average it will be in the range of 0.6 to 1 per cent of the cost of the project, depending on the size, risk and features of the construction.</p>\n<p>\n\tModern apartment complexes comprise of an average of six to eight towers, of 20 floors each, with around 4 flats per floor. Assuming each flat is of an average size of 1,000 square feet, the premium ticket size would be around Rs 300,000 while the sum assured for each tower would be in the range of Rs 6 million to Rs 8 million, explained Sahni.</p>\n<p>\n\tThe cover can only be bought by a residential builder prior to the start of development.</p>\n<p>\n\tFrom the time of construction till the time the project is completed, SBI-G will conduct around eight technical inspections, through a competent technical and investigative agency, to check the quality of construction.</p>\n<p>\n\t“The agency will give feedback, in case there is an issue, so this is a risk management, improvement and transfer model, all in one product,” he said.</p>\n<p>\n\tSimilar to <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/hdfc\" target=\"_blank\">HDFC </a>Ergo’s inherent defects insurance policy, a fundamental aspect of the underwriting standards includes the fact that the insurer(s) will conduct technical inspections and audits throughout the construction-cycle.</p>\n<p>\n\tFurther, the policy is portable to new owners of a property; therefore if an apartment is sold, the policy cover on the particular flat can also be transferred.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "received",
        "General",
        "real",
        "inherent",
        "next",
        "six",
        "eight"
    ],
    "nouns": [
        "product",
        "year",
        "General",
        "policy",
        "will",
        "real",
        "launch",
        "estate",
        "six",
        "eight",
        "approval"
    ],
    "verbs": [
        "General",
        "will",
        "launch"
    ]
}