{
    "title": "SBI invests Rs 35 bn a year as it reaches out digitally to 420 mn customers",
    "link": "https://www.business-standard.com/article/finance/sbi-invests-rs-3-500-cr-a-year-as-it-reaches-out-digitally-to-420-mn-customers-118060900434_1.html",
    "pubDate": "Sat, 09 Jun 2018 17:08:00 +0530",
    "content": "SBI has also been leading the digital charge with its DIGITAL VILLAGES project that it launched in July 2016",
    "contentSnippet": "SBI has also been leading the digital charge with its DIGITAL VILLAGES project that it launched in July 2016",
    "guid": "https://www.business-standard.com/article/finance/sbi-invests-rs-3-500-cr-a-year-as-it-reaches-out-digitally-to-420-mn-customers-118060900434_1.html",
    "isoDate": "2018-06-09T11:38:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.0625,
        "tokens": [
            "sbi",
            "invests",
            "rs",
            "35",
            "bn",
            "a",
            "year",
            "as",
            "it",
            "reaches",
            "out",
            "digitally",
            "to",
            "420",
            "mn",
            "customers"
        ],
        "words": [
            "reaches"
        ],
        "positive": [
            "reaches"
        ],
        "negative": []
    },
    "article": {
        "title": "SBI invests Rs 35 bn a year as it reaches out digitally to 420 mn customers",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tWith 420 million customers, roughly 40 per cent of India's population; it is adopting a collaborative and partner ecosystem leveraged approach to achieve its digital business outcomes. It partnered with Google last year for a wider adoption of digital payments, building unique propositions for users and merchants, including specially curated offers.</p>\n<p>\n\tGoogle is attempting to simplify the payment process and has launched Tez, a platform for fund transfers to bank, with UPI enabled banks, using UPI's platform.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tSujith Narayanan, Head of Partnerships, Tez (Google) said, \"We are very excited to be working with the State Bank of India, India's Largest Bank for Tez. <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/sbi\" target=\"_blank\">SBI </a>has achieved great traction in driving adoption of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=digital+channels\" target=\"_blank\">digital channels </a>and today, transactions via <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=digital+channels\" target=\"_blank\">digital channels </a>account for a substantial part of SBI's total transactions. This is significant and there is a bigger opportunity to innovate across all forms of digital payments- credit cards, wallets and merchant adoption of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/digital-payments\" target=\"_blank\">digital payments.</a>\"</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/sbi\" target=\"_blank\">SBI </a>has invested early in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/digital-technology\" target=\"_blank\">digital technology </a>and has adopted a comprehensive digital strategy. Technology has been scaled up substantially to handle not just the 6,000 transactions that happen every second but to continuously release new products and services including enhancement and upgrades, which numbered over 1,000 last year.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/sbi\" target=\"_blank\">SBI </a>has also been leading the digital charge with its DIGITAL VILLAGES project that it launched in July 2016, which aims to transform 100 selected villages into safe, healthy and vibrant digital centres. The idea is to encourage migration of citizens to AnyTime Channels through <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=digital+channels\" target=\"_blank\">digital channels </a>like PoS, ATMs, Micro ATMs, Mobile Banking, Internet Banking, etc. Villages such as Punsari, Sanganwa (Ahmedabad), Penamaluru (Amravati), Bhaktarhalli, Chamanahalli (Bangalore), Kandhalavadi (Chennai), Khairpur (Bhopal), Belpara (Bhubaneshwar) , Ghuman (Chandigarh), Khera Dabar, Motharowala (Delhi), Achanbigei (Guwahati), Nagaram (Hyderabad), Sultanpur (Lucknow), Balal (Thiruvananthapuram) and many more have already benefited from the same.</p>\n<p>\n\t\"Our digital strategy focus is on the millenials and enabling digital banking for greater productivity. Our digital app YONO ; unique and first in many respect globally has 6.5 million downloads already in last six months of operations. This prova ides seamless experience of banking, e-commerce and financial superstore experience on a single platform. Featuring deals from more than 65 e-commerce players, YONO is available on both Android and iOS platforms. Many of SBI's and its subsidiary financial products offerings such as SBI Cards, SBI Caps, SBI Mutual Funds, SBI General and SBI Life are also integrated into the YONO app,\" said DMD (DB&amp;NB), SBI, Mrityunjay Mahapatra.</p>\n<p>\n\tAdditionally, SBI is at the forefront of Omnibus innovations, adoption of new technology and creation of platforms like Yono. Business and products are simultaneously being re-jigged. Apart from IT opex, the capex tops Rs 35 billion.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "35",
        "digital",
        "DIGITAL",
        "leading"
    ],
    "verbs": [
        "charge",
        "project"
    ]
}