{
    "title": "Ayushman Bharat, farmers' income to figure prominently in NITI Aayog meet",
    "link": "https://www.business-standard.com/article/economy-policy/ayushman-bharat-farmers-income-to-figure-prominently-in-niti-aayog-meet-118061500897_1.html",
    "pubDate": "Sat, 16 Jun 2018 01:45:00 +0530",
    "content": "Opposition-ruled States prepare to corner Centre on various issues, Andhra Pradesh Chief Minister Chandrababu Naidu says no spirit of cooperative federalism",
    "contentSnippet": "Opposition-ruled States prepare to corner Centre on various issues, Andhra Pradesh Chief Minister Chandrababu Naidu says no spirit of cooperative federalism",
    "guid": "https://www.business-standard.com/article/economy-policy/ayushman-bharat-farmers-income-to-figure-prominently-in-niti-aayog-meet-118061500897_1.html",
    "isoDate": "2018-06-15T20:15:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "ayushman",
            "bharat",
            "farmers'",
            "income",
            "to",
            "figure",
            "prominently",
            "in",
            "niti",
            "aayog",
            "meet"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Ayushman Bharat, farmers' income to figure prominently in NITI Aayog meet",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\tPrime Minister Narendra Modi’s pet scheme ‘Ayushman Bharat’ and plan to double farmer income by 2022 are expected to figure prominently during the fourth governing council meeting of the NITI Aayog scheduled for Sunday.</p>\n<p>\n\tThe Union government’s Nutrition Mission, “POSHAN” and the NITI Aayog Strategy Paper for New India 2020-2022 are also expected to be taken up by the Centre and the states.</p>\n<p>\n\tChief ministers of all states, heads of UTs along with cabinet ministers of major ministries are part of the governing council of the NITI Aayog that is chaired by <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/prime-minister-narendra-modi\" target=\"_blank\">Prime Minister Narendra Modi.</a></p>\n<p>\n\tSenior officials from the Centre and the PMO will also participate in the meeting.</p>\n<p>\n\tAccording to an official statement, other flagship issues like Mission Indradhanush, development of aspirational districts and celebration of the 150th birth anniversary of Mahatma Gandhi will also figure during the day-long delibertions.</p>\n<p>\n\tSources said <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/prime-minister-narendra-modi\" target=\"_blank\">Prime Minister Narendra Modi </a>has constituted a high-powered committee of chief ministers and others to celebrate the 150th birth anniversary of Mahatma Gandhi, which will also be reviewed during the meet.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/current-affairs/india-suffering-worst-water-crisis-in-history-says-niti-aayog-report-118061401212_1.html\" target=\"_blank\">India suffering worst water crisis in history, says Niti Aayog report</a></strong></p>\n\n<p>\n\t“The governing council of NITI Aayog is the premier body tasked with evolving a shared vision of national development priorities. It reviews the work done during the previous year and deliberates on developmental priorities,” a statement added.</p>\n<p>\n\tThe fourth governing council meeting will be pivotal as it may be the last such meeting before the crucial election to the state assemblies later this year.</p>\n<p>\n\tOfficials said agriculture and related issues will figure prominently in the discussion with the Centre keen to review progress of schemes like Fasal Bima Yojana, Krishi Sinchai and also its ambitious programme to create a grid for vegetables, This is to ensure steady supplies under ‘Operation Top’, announced in Budget 2018-19. Meanwhile, among the state’s leaders, West Bengal Chief Minister Mamata Banerjee, who had earlier declined to be present due to Eid, has confirmed her presence after the meeting was rescheduled for Sunday.<br></p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/current-affairs/niti-aayog-paper-seeks-ai-boost-praises-its-use-in-kumbh-mela-experiment-118060501482_1.html\" target=\"_blank\">NITI Aayog paper seeks AI boost, praises its use in 'Kumbh Mela Experiment'</a></strong></p>\n\n<p>\n\tIn a statement issued on Friday, former NDA ally and Andhra Pradesh chief minister <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/chandrababu-naidu\" target=\"_blank\">Chandrababu Naidu </a>said he will raise the issue of the Centre’s ‘failure’ over non-fulfillment of assurances made in the Rajya Sabha</p>\n<p>\n\tThese include special category status for Andhra.</p>\n<p>\n\t“The agenda for this meeting is very brief, unlike the previous ones. Topics like Swachh Bharat, Skill India, and Digital India, which were discussed in the last meeting, have not been included in the agenda this time,” Chandrababu said.</p>\n<p>\n\t\t<img align=\"left\" alt=\"Ayushman Bharat, farmers' income to figure prominently in NITI Aayog meet\" class=\"imgCont\" height=\"159\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/16/full/1529093730-2633.jpg\" title=\"graph\" width=\"620\"></p>\n\tHe said he will highlight the issues being faced by farmers, traders and daily labourers due to the prevailing cash crunch in the ATMs. Also on the agenda will be issues like insecurity among SCs, STs and minorities; lack of employment for youths; problems in crop insurance scheme, minimum support prices (MSP) to farmers and doubling of farmer income\n<p>\n\t“Despite the Centre’s non-cooperation, our state was able to grow at the rate of 10.5 per cent during the last four years only because of the consistent efforts of the people and the government. Isn’t it the Centre’s responsibility to handhold AP until it becomes on par with neighbouring states in terms of per capita income? Where is the spirit of Team India?” asked <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/chandrababu-naidu\" target=\"_blank\">Chandrababu Naidu.</a></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "meet",
        "ruled",
        "various",
        "Chief",
        "no",
        "cooperative"
    ],
    "nouns": [
        "Minister",
        "income",
        "Bharat",
        "Centre",
        "corner",
        "figure",
        "meet",
        "Opposition",
        "Chief",
        "no",
        "cooperative",
        "federalism",
        "spirit"
    ],
    "verbs": [
        "prepare",
        "Minister",
        "Centre",
        "corner",
        "figure",
        "meet",
        "spirit"
    ]
}