{
    "title": "Digital India eliminates middlemen, creates job opportunities: PM Modi",
    "link": "https://www.business-standard.com/article/economy-policy/digital-india-eliminates-middlemen-creates-job-opportunities-pm-modi-118061600035_1.html",
    "pubDate": "Sat, 16 Jun 2018 03:23:00 +0530",
    "content": "Modi said when he first spoke about digital payments, people made fun of him but due to use of digital payments, benefits are reaching the people directly and the role of middlemen has been abolished",
    "contentSnippet": "Modi said when he first spoke about digital payments, people made fun of him but due to use of digital payments, benefits are reaching the people directly and the role of middlemen has been abolished",
    "guid": "https://www.business-standard.com/article/economy-policy/digital-india-eliminates-middlemen-creates-job-opportunities-pm-modi-118061600035_1.html",
    "isoDate": "2018-06-15T21:53:00.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.2222222222222222,
        "tokens": [
            "digital",
            "india",
            "eliminates",
            "middlemen",
            "creates",
            "job",
            "opportunities",
            "pm",
            "modi"
        ],
        "words": [
            "opportunities"
        ],
        "positive": [
            "opportunities"
        ],
        "negative": []
    },
    "article": {
        "title": "Digital India eliminates middlemen, creates job opportunities: PM Modi",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tTerming <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/digital-india\" target=\"_blank\">Digital India </a>as a war against black money and middlemen, Prime Minister <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/narendra-modi\" target=\"_blank\">Narendra Modi </a>on Friday said the programme has provided job opportunities and benefits of technology to people in rural areas.</p>\n<p>\n\tDigital India, which was launched on July 1, 2015, has been the pet project of Modi. Digital delivery of services has been the main thrust of the government as it feels leakages can be plugged if things are done online.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe government takes pride in saying that about Rs 900 billion could be saved because of the Jandhan, Aadhaar and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/mobile\" target=\"_blank\">Mobile </a>(JAM)  trinity. Interacting with beneficiaries of various <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/digital-india\" target=\"_blank\">Digital India </a>initiatives through video conferencing, Modi said the move towards <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/digital-payments\" target=\"_blank\">digital payments </a>is linked to eliminating middlemen.</p>\n<p>\n\t“We have to take <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/digital-india\" target=\"_blank\">Digital India </a>forward. Touts are upset with Digital India. We can easily fight for our rights through Digital India,” Modi said. Modi interacted for around one and a half hours with the beneficiaries, who include village-level entrepreneurs running common service centres (CSCs), people working in rural BPOs, and MGNREGA workers, among others.</p>\n<p>\n\tModi said when he first spoke about digital payments, people made fun of him but due to use of digital payments, benefits are reaching the  people  directly and the role of middlemen has been abolished.</p>\n<p>\n\tA beneficiary from Yamuna Nagar said the use of BHIM app for payments has made life easier for her. <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/digital-payments\" target=\"_blank\">Digital payments </a>are making the Indian economy more transparent as they ensure the poor get their benefits directly into bank accounts.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/current-affairs/digital-india-is-war-against-touts-a-help-to-check-black-money-pm-modi-118061500275_1.html\" target=\"_blank\">Digital India is war against touts, a help to check black money : PM Modi</a></strong></p>\n<p>\n\t“Now, middlemen are not required for ration, and the poor get the full amount of their hard work directly in their bank account. When poor farmers of villages have started adopting digital payments, they (middlemen) have now started spreading fresh rumours,” Modi said. The Prime Minister also highlighted that there are vested interests against Digital India and the middlemen are spreading lies against the programme.</p>\n<p>\n\t“They will keep abusing from whichever platform they get but we have to take our nation to the forefront of the world,” Modi said. Modi asked beneficiaries to press traders and shopkeepers to install the BHIM app to facilitate paying for goods and services digitally.</p>\n<p>\n\tHe also pushed for use of RuPay, the local version of credit/debit cards, saying that when other similar cards are used, the transaction or processing fee goes to foreign companies.</p>\n<p>\n\tThe Prime Minister also highlighted the importance of common service centres and rural BPOs in providing jobs. The BPO scheme has led to creation of 200,000 jobs as it has taken business process outsourcing centres to smaller cities and towns by providing financial assistance of up to Rs 100,000 for every seat.</p>\n<p>\n\tModi also said the push for domestic electronic manufacturing has led to the setting up of 23 electronic manufacturing centres in 15 states. The number of units manufacturing <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/mobile\" target=\"_blank\">mobile </a>handsets and components has multiplied from two in 2014 to over 120, providing direct and indirect employment to 450,000 people.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "due",
        "first",
        "Digital",
        "digital",
        "made"
    ],
    "verbs": [
        "people",
        "job",
        "use"
    ],
    "nouns": [
        "India",
        "people",
        "due",
        "first",
        "PM",
        "spoke",
        "fun",
        "use",
        "reaching",
        "role",
        "job"
    ]
}