{
    "creator": "Nanda Kasabe",
    "title": "Sluggish trend in pulses demand hits Maharashtra farmers hard",
    "link": "https://www.financialexpress.com/market/commodities/sluggish-trend-in-pulses-demand-hits-maharashtra-farmers-hard/1208127/",
    "pubDate": "Sat, 16 Jun 2018 01:08:43 +05:30",
    "dc:creator": "Nanda Kasabe",
    "content": "Pulses farmers in Maharashtra are a distressed lot. Although the Maharashtra government has decided to pay Rs 1,000 per quintal to tur and chana growers, they don’t seem to be happy.",
    "contentSnippet": "Pulses farmers in Maharashtra are a distressed lot. Although the Maharashtra government has decided to pay Rs 1,000 per quintal to tur and chana growers, they don’t seem to be happy.",
    "guid": "https://www.financialexpress.com/?p=1208127",
    "categories": [
        "Commodities",
        "Market"
    ],
    "isoDate": "2018-06-15T19:38:43.000Z",
    "sentiment": {
        "score": -4,
        "comparative": -0.4444444444444444,
        "tokens": [
            "sluggish",
            "trend",
            "in",
            "pulses",
            "demand",
            "hits",
            "maharashtra",
            "farmers",
            "hard"
        ],
        "words": [
            "hard",
            "demand",
            "sluggish"
        ],
        "positive": [],
        "negative": [
            "hard",
            "demand",
            "sluggish"
        ]
    },
    "article": {
        "title": "Sluggish trend in pulses demand hits Maharashtra farmers hard",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1208128\" src=\"https://images.financialexpress.com/2018/06/1-40.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/1-40.jpg 660w, https://images.financialexpress.com/2018/06/1-40-300x200.jpg 300w, https://images.financialexpress.com/2018/06/1-40-620x413.jpg 620w, https://images.financialexpress.com/2018/06/1-40-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Sluggish trend in pulses demand hits Maharashtra farmers hard</figure>\n\t\t\t</section></div><span>\n</span><p>Pulses farmers in Maharashtra are a distressed lot. Although the Maharashtra government has decided to pay Rs 1,000 per quintal to tur and chana growers, they don’t seem to be happy.</p><span>\n</span><p>With availability outstripping demand, the sluggish trend in pulses seeds and pulses continues. Tur prices were quoted at `3,800 a quintal in Maharashtra, while tur in Madhya Pradesh ruled at Rs 3,500-3,700 and urad and its dal ruled flat at Rs 3,400-3,500.</p><span>\n</span><p>In Latur, one of the key producing regions for tur, the mandis wore a deserted look with no buyers coming forward for tur. According to top officials of the Latur Agriculture Produce Market Committee (APMC), farmers are pretty unhappy.</p><span>\n</span><p>“The government procurement programme has stopped. The farmers who had registered for the procurement programme had to take it back home. And then although they are not allowed to sell below MSP to traders, the government itself has floated tenders for the sale of last year’s tur currently lying in warehouses at Rs 36 per kg,” said Lalitbhai Shah, chairman, Latur APMC.</p><span>\n</span><p>Nitin Kalantry, a major pulses trader in Latur echoed similar sentiments and said that tur will be sold at Rs 35 per kg through fair price shops. The government has approved tenders for sale of tur at Rs 36 per kg and therefore the farmer has no place to go. Moreover, the government has given conditional approval to millers to import pulses and sell them in the market after processing them. The government has allowed import of 1.50 lakh tonne of moong, 1.50 lakh tonne of urad, 2 lakh tonne of tur.</p><span>\n</span><p>For this, the millers will have to file online application to DGFT from May 12 to 25.</p><span>\n</span><p>The import is allowed for year 2018-19 and is expected to hit the market by September. This will lead to a glut in the market, he said.</p><span>\n</span><p>Both tur and chana growers in Maharashtra have been hit by low prices all through the season. Both the pulses have traded below their respective MSPs of Rs 5,400 and Rs 4,400 per quintal. Moreover, the previous year’s stock and low demand is being blamed for the price slide.</p><span>\n</span><p>Earlier, the National Agricultural Cooperative Marketing Federation (Nafed) had begun procurement of both the pulses after the state government had sought permission from the Centre. The central government has granted permission to Maharashtra for the purchase of 44.60 lakh quintals from February 1.</p><span>\n</span><p>The government began a registration drive for farmers from January 19 and some 4.14 lakh farmers had registered themselves in the drive. Although Maharashtra had set a target of 4.47 lakh tonne of tur and 3 lakh tonne of chana under the scheme, the targets could not be met. As per the scheme, farmers had to register for the scheme and were to be called on a date to bring their produce to the mandi.</p><span>\n</span><p>Maharashtra produced about 1 lakh tonne of chana and around 3.24 lakh tonne of tur by the end of May. However, lack of storage facilities ensured that targets were not met. More than 2 lakh farmers failed to sell their produce. The government has been seeking a further extension for the procurement of tur. However, there has been no response from the Centre.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "distressed",
        "Sluggish",
        "decided",
        "happy",
        "hard"
    ],
    "verbs": [
        "trend",
        "demand",
        "pay",
        "don",
        "seem",
        "lot"
    ]
}