{
    "title": "Norms for FPIs to invest in debt eased, may boost rupee, corporate bonds",
    "link": "https://www.business-standard.com/article/economy-policy/norms-for-fpis-to-invest-in-debt-eased-may-boost-rupee-corporate-bonds-118061600581_1.html",
    "pubDate": "Sat, 16 Jun 2018 20:30:00 +0530",
    "content": "The RBI increased the FPIs cap on investment in government security to 30 per cent of the outstanding stock of that security, from 20 per cent earlier",
    "contentSnippet": "The RBI increased the FPIs cap on investment in government security to 30 per cent of the outstanding stock of that security, from 20 per cent earlier",
    "guid": "https://www.business-standard.com/article/economy-policy/norms-for-fpis-to-invest-in-debt-eased-may-boost-rupee-corporate-bonds-118061600581_1.html",
    "isoDate": "2018-06-16T15:00:00.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.07692307692307693,
        "tokens": [
            "norms",
            "for",
            "fpis",
            "to",
            "invest",
            "in",
            "debt",
            "eased",
            "may",
            "boost",
            "rupee",
            "corporate",
            "bonds"
        ],
        "words": [
            "boost",
            "debt"
        ],
        "positive": [
            "boost"
        ],
        "negative": [
            "debt"
        ]
    },
    "article": {
        "title": "Norms for FPIs to invest in debt eased, may boost rupee, corporate bonds",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tThe Reserve Bank has eased investment norms for <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/foreign-portfolio-investors\" target=\"_blank\">foreign portfolio investors </a>(FPIs) in debt, especially into individual large corporates, a move that can help attract more overseas flows and thereby help arrest the recent fall in the rupee on one hand and also lift the recent fall in demand for corporate bonds.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/fpis\" target=\"_blank\">FPIs </a>are allowed to invest in various debt market instruments such as government bonds, treasury bills, state development loans and corporate bonds, but with certain limits and restrictions.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rbi\" target=\"_blank\">RBI </a>increased the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/fpis\" target=\"_blank\">FPIs </a>cap on investment in government security to 30 per cent of the outstanding stock of that security, from 20 per cent earlier.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/fpis\" target=\"_blank\">FPIs </a>were allowed to invest in government bonds with a minimum residual maturity of three years.</p>\n<p>\n\t\"Henceforth, FPIs are permitted to invest in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/government-securities\" target=\"_blank\">Government securities </a>(G-secs), including treasury bills, and SDLs without any minimum residual maturity requirement, subject to the condition that short-term investments by an FPI under either category shall not exceed 20 per cent of the total investment of that FPI in that category,\" <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rbi\" target=\"_blank\">RBI </a>said in a notification on Friday evening.</p>\n<p>\n\tShort-term investments are defined as investments with residual maturity up to one year.</p>\n<p>\n\tIn the corporate bond segment, FPIs are permitted to invest with a minimum maturity of three years.</p>\n<p>\n\tThe central bank has now allowed FPIs to invest in corporate bonds with minimum residual maturity of above one year.</p>\n<p>\n\tHowever, it has kept a condition that short-term investments in corporate bonds by an FPI shall not exceed 20 per cent of the total investment of that FPI in corporate bonds.</p>\n<p>\n\tThe requirement that short-term investments shall not exceed 20 per cent of total investment by an FPI in any category applies on an end-of-day basis.</p>\n<p>\n\t\"At the end of any day, all investments with residual maturity of up to one year will be reckoned for the 20 per cent limit,\" <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rbi\" target=\"_blank\">RBI </a>said.<br></p>\n<p>\n\tRBI said short-term investments by an FPI may exceed 20 per cent of total investments, only if the short-term investments consist entirely of investments made on or before April 27, 2018, and not made after April 27, 2018.</p>\n<p>\n\tFollowing the RBI notification, market regulator, Sebi, withdrew last evening the minimum three-year residual maturity restriction on investments made by them in government securities, corporate bonds and SDLs.</p>\n<p>\n\tFPIs were permitted to invest in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/government-securities\" target=\"_blank\">government securities </a>till the limit utilisation reaches 90 per cent, after which the auction mechanism was triggered for allocation of the remaining limit.</p>\n<p>\n\t\"With <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=clearing+corporation+of+india\" target=\"_blank\">Clearing Corporation of India </a>(CCIL) commencing online monitoring of utilisation of government-securities limits, the auction mechanism has been discontinued with effect from June 1, 2018,\" the RBI said.</p>\n<p>\n\tThe RBI said investment by any FPI, including investments by related FPIs, should not exceed 50 per cent of any issue of a corporate bond.</p>\n<p>\n\tIn case an FPI, including related FPIs, has invested in more than 50 per cent of any single issue, it shall not make further investments in that issue until this stipulation is met, RBI said.</p>\n<p>\n\t\"No FPI shall have an exposure of more than 20 per cent of its corporate bond portfolio to a single corporate (including exposure to entities related to the corporate),\" RBI said.</p>\n<p>\n\tIt can be noted that since this RBI circular in April, there has been a dip in corporate bonds market with papers worth hundreds of crore lying with dealers for want of buyers.</p>\n<p>\n\tThe move will also help arrest the spike in call money rates after the June 6 rate hike by the central bank. The rupee has been on a falling spree and has hit the 68 levels many times in went months.</p>\n<p>\n\tWith the fed hiking rates for the fourth time earlier this week since last year and hinting at four more hikes this year, there is no chance that the rupee will have an easy life going forward, according to analysts.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "20",
        "increased",
        "outstanding",
        "eased",
        "corporate",
        "30",
        "stock",
        "earlier"
    ],
    "nouns": [
        "20",
        "cap",
        "investment",
        "security",
        "cent",
        "government",
        "RBI",
        "may",
        "debt",
        "boost",
        "rupee",
        "30",
        "stock"
    ],
    "verbs": [
        "cap",
        "invest",
        "boost",
        "stock"
    ]
}