{
    "title": "Aditya Birla Finance bets on SMEs as it looks to expand to 50 cities",
    "link": "https://www.business-standard.com/article/companies/aditya-birla-finance-bets-on-smes-as-it-looks-to-expand-to-50-cities-118062200434_1.html",
    "pubDate": "Sat, 23 Jun 2018 01:12:00 +0530",
    "content": "ABFL offers SMEs lines of credit, business loans, supply-chain financing and working capital loans.",
    "contentSnippet": "ABFL offers SMEs lines of credit, business loans, supply-chain financing and working capital loans.",
    "guid": "https://www.business-standard.com/article/companies/aditya-birla-finance-bets-on-smes-as-it-looks-to-expand-to-50-cities-118062200434_1.html",
    "isoDate": "2018-06-22T19:42:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.07142857142857142,
        "tokens": [
            "aditya",
            "birla",
            "finance",
            "bets",
            "on",
            "smes",
            "as",
            "it",
            "looks",
            "to",
            "expand",
            "to",
            "50",
            "cities"
        ],
        "words": [
            "expand"
        ],
        "positive": [
            "expand"
        ],
        "negative": []
    },
    "article": {
        "title": "Aditya Birla Finance bets on SMEs as it looks to expand to 50 cities",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tBy the end of July <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=aditya+birla+finance+limited\" target=\"_blank\"></a><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/aditya-birla-finance\" target=\"_blank\">Aditya Birla Finance </a>Limited (ABFL) will be present in 50 cities (Tier I, II and III) across the country, growing from tapping 70 per cent of small-medium enterprises’ (SMEs) demand for credit, at present, to 85 per cent of the SME credit pool. The company has grown its lending book by 25 per cent to Rs 432.4 billion at the end of FY2018, with 27 per cent of ABFLs credit products being sold to SMEs.</p>\n<p>\n\t“The biggest challenge is to have a uniformity in terms of quality, culture and risk management across all our branches. Our biggest strength is that we strive our best to maintain this uniformity,” says Rakesh Singh, chief executive officer at <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=abfl\" target=\"_blank\">ABFL.</a>\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tLarge corporates make up 33 per cent of ABFLs lending book, followed by mid-corporates at 17 per cent and retail customers at 11 per cent.</p>\n<p>\n\tThe company sees the SME segment as the primary engine of growth over the coming years.</p>\n<p>\n\t“We believe the license to grow in the lending business comes from managing risks well,” he told Business Standard, “One needs to maintain the same quality and controls across the entire distribution including the smallest of branches.”</p>\n<p>\n\tBy implementing a top-down approach the company has built strong sales and risk processes, a toques control framework where a system of approvals and delegation has been put in place.</p>\n<p>\n\t“This framework right from the top to bottom has enabled us to create strong governance structures and much tighter control on operations to manage risks. ,” Singh said.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=abfl\" target=\"_blank\">ABFL </a>offers SMEs lines of credit, business loans, supply-chain financing and working capital loans. <br></p>\n<p>\n\tThe SME book of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=abfl\" target=\"_blank\">ABFL </a>is stable without any rise in delinquencies, and Singh believes non-banking financial <a class=\"storyTags\" href=\"https://www.business-standard.com/companies\" target=\"_blank\">companies </a>(NBFCs) “are best placed to serve the credit demand of SMEs in an efficient manner as most of the large financing institutions concentrate on the corporate and consumer side and there is no focused approach for SMEs.”</p>\n<p>\n\tAsset Quality has marginally risen, Gross Non-Performing Assets (NPA) increased from 0.47 per cent in FY2017 to 0.92 per cent in FY2018. Two reasons stated by the company management in its financial statements are the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/reserve-bank-of-india\" target=\"_blank\">Reserve </a><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bank-of-india\" target=\"_blank\">Bank of India </a>(RBI) circular of February 12 which withdrew previous debt-restructuring schemes, and their new internal NPA framework.</p>\n<p>\n\t“We’ve moved from 180 to 90 days of NPA recognition but our overall NPAs has remained stable over the last three to four years. We have been investing in online early warning systems which can help us to identify risks early so that we can mitigate and take early action,” says Singh.</p>\n<p>\n\tProvisions against NPA accounts have increased to 95 per cent at the end of FY2018, compared to provisions worth 59 per cent for NPA accounts in the previous fiscal year.</p>\n<p>\n\tThe government’s focus on boosting the SME segment in the economy will push a lot of informal businesses into the formal segment with more customers (SMEs) added to the credit-worthy pool.</p>\n<p>\n\tAccording to a CARE, rating agency, report the outstanding value of loans (RBI data) to the SME segment has grown by eight per cent, year on year, from Rs 17.5 trillion at the end of April 2017 to Rs 19 trillion at the end of April 2018. </p>\n<p>\n\t“Most of the time SMEs are family-run businesses, they are stable and are in the business for generations. This provides a lot of stability. Though, still early days, the overall impact and credit expansion of this reform will be visible in the next two to three years,” Singh said.</p>\n<p>\n\tThe cost to Income ratio rose from 29 per cent in FY2017 to 30 per cent at the end of FY2018 on account of heavy investing focus on the digital spaces of the lender’s business. Around 50 per cent of new customers today transact on ABFLs digital channel/platform.</p>\n<p>\n\t“We deal with money so there is always a chance of slippages and operational risk, so we have to ensure that we do not have these slippages. It’s all about building the right work culture across the franchise,” he said. </p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "capital",
        "50",
        "working"
    ],
    "nouns": [
        "capital",
        "50",
        "business",
        "working",
        "chain",
        "Finance",
        "financing",
        "supply",
        "Aditya",
        "credit"
    ],
    "verbs": [
        "chain",
        "expand",
        "Finance",
        "supply",
        "credit"
    ]
}