{
    "title": "G7 divides to G6 plus Trump over trade war threat",
    "link": "https://timesofindia.indiatimes.com/business/international-business/g7-divides-to-g6-plus-trump-over-trade-war-threat/articleshow/64515499.cms",
    "pubDate": "Sat, 09 Jun 2018 00:56:48 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/international-business/g7-divides-to-g6-plus-trump-over-trade-war-threat/articleshow/64515499.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64515499.cms\" /></a>Summit host Canada's Prime Minister Justin Trudeau sided with his European and Japanese colleagues against the unpredictable US leader and his \"illegal\" levies on steel and aluminum imports.",
    "contentSnippet": "Summit host Canada's Prime Minister Justin Trudeau sided with his European and Japanese colleagues against the unpredictable US leader and his \"illegal\" levies on steel and aluminum imports.",
    "guid": "https://timesofindia.indiatimes.com/business/international-business/g7-divides-to-g6-plus-trump-over-trade-war-threat/articleshow/64515499.cms",
    "isoDate": "2018-06-09T00:56:48.000Z",
    "sentiment": {
        "score": -4,
        "comparative": -0.4,
        "tokens": [
            "g7",
            "divides",
            "to",
            "g6",
            "plus",
            "trump",
            "over",
            "trade",
            "war",
            "threat"
        ],
        "words": [
            "threat",
            "war"
        ],
        "positive": [],
        "negative": [
            "threat",
            "war"
        ]
    },
    "article": {
        "title": "G7 divides to G6 plus Trump over trade war threat",
        "content": "<div class=\"Normal\"><span>LA MALBAIE: US President </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Donald-Trump\">Donald Trump</a><span> wrangled over tariffs with the world's next six most powerful democracies Friday, as the threat of </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/trade-war\">trade war</a><span> clouded day one of the </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/G7-summit\">G7 summit</a><p>.\n\n</p><span>Summit host </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Canada\">Canada</a><span>'s Prime Minister </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/justin-trudeau\">Justin Trudeau</a><p> sided with his European and Japanese colleagues against the unpredictable US leader and his \"illegal\" levies on steel and aluminum imports.\n</p><p>Apparently reveling in a rift that threatens to undermine the Western-led world economic order, Trump stirred further strife by declaring before the talks began that he would like to see Russia re-admitted to the club.\n</p><p>But this apparently spontaneous suggestion -- rejected out of hand by the other allies -- did not make it to the summit table, where instead the leaders confronted Trump's assault on the world trade system and came to no immediate agreement.\n</p><p>\"We've made a lot of progress today. We'll see how it all works out, but we've made a lot of progress,\" Trump said, sitting by Trudeau after talks that an official said were marked by \"strong disagreement\" but \"not heated.\"\n</p><span>France's President </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/emmanuel-macron\">Emmanuel Macron</a><p> also put a brave face on the encounter.\n</p><p>\"I think we had a very open and direct discussion this afternoon, we've always had this kind of discussion. And I think on trade, there is a critical path, there is a way to progress altogether,\" he said, speaking in English.\n</p><p>Trump has invoked a US national security provision to unilaterally impose tariffs on imports of foreign steel and aluminum, to the outrage of his allies, who have retaliated with a threat of their own, more targeted, sanctions.\n</p><p>European leaders met separately Friday ahead of the G7 summit in La Malbaie, a golf resort north of Quebec City, and presented Trump with a united front \"backed by facts and figures\" to counter his charge, officials said.\n</p><p>Trump said he hoped a final summit communique would be agreed, and officials were to work late into the night, but Canadian and European officials suggested trade would be a sticking point and that separate statements may be made on other issues.\n</p><p>Ahead of the encounter, the allies made no secret of their anger at Trump's stance, pointed starkly to fears that he is undermining the rules-based world order and driving former US friends into a damaging trade war.\n</p><p>European leaders warned Trump's stance on trade, climate, Iran and -- now -- Russia was setting him apart, and Canada firmly rejected the tariffs threat and warned of retaliation.\n</p><p>\"It is evident that the American president and the rest of the group continue to disagree on trade, climate change and the Iran nuclear deal,\" said Donald Tusk, president of the European Council.\n</p><p>And he said Trump's determination to bait his allies over trade and diplomatic engagements \"would only play into the hands of those who seek a new post-West order where liberal democracy and fundamental freedoms would cease to exist.\"\n</p><p>Canada's Foreign Minister Chrystia Freeland expressed outrage that Trump had invoked a national security justification for his global tariff on steel and aluminum imports, even those from close US allies.\n</p><p>\"We are very clear that Canada does not pose a national security threat to the United States,\" she said.\n</p><p>\"So this an illegal act. It is absolutely unjustified. We have already raised cases at the WTO and at NAFTA, and we will retaliate,\" she warned.\n</p><p>Trump was the last G7 leader to arrive and will probably be the first to leave on Saturday when he sets off for his nuclear summit with North Korea's Kim Jong Un in Singapore.\n</p><p>With unmistakable symbolism, the fractious Western democracies were meeting on the same day that China's President Xi Jinping welcomed his Russian counterpart Vladimir Putin to Beijing.\n</p><p>Three decades after the end of the Cold War, the G7 nations are split over trade, climate and multilateral engagements such as the Iran nuclear deal.\n</p><p>And at the same time, the US president seems more at home with autocrats than with Washington's traditional allies.\n</p><span>The \"America First\" president's broadside before leaving Washington reinforced predictions that the Quebec G7 would be the first such summit to end without an agreed joint statement.\n</span><br><span>\n</span><br><span>Host Canada and its European allies are striving to hold together a united front to oppose Trump's tariffs on aluminum, steel, cars and other exports, but global stock markets are rattled.\n</span><br><span>\n</span><br><span>On Friday, bilateral meetings preceded round-table discussions. Later the leaders were to tuck into a dinner of lobster, asparagus and maple leaves nestled on a brioche at the end of the first day of talks.\n</span><br><span>\n</span><br><span>The summit is being held at a luxury resort more than two hours' drive from the provincial capital, where more than 400 protesters faced off Thursday and Friday against police.\n</span><br><span>\n</span><p>Previous G7 summits have seen large-scale anti-globalization protests, but Trump was a main target of the demonstration as masked anarchists set fire to US flags and those of other G7 nations.\n</p><span>\n</span></div>"
    },
    "adjectives": [
        "10",
        "left",
        "top",
        "right",
        "Prime",
        "international",
        "plus",
        "European",
        "Japanese",
        "unpredictable",
        "illegal"
    ],
    "verbs": [
        "border",
        "align",
        "style",
        "top",
        "right",
        "Minister",
        "Prime",
        "trade",
        "war",
        "Trump",
        "trump",
        "Summit",
        "host",
        "steel"
    ],
    "nouns": [
        "threat",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo",
        "Minister",
        "leader",
        "Prime",
        "international",
        "trade",
        "Canada",
        "war",
        "plus",
        "Trump",
        "trump",
        "Summit",
        "host",
        "European",
        "Japanese",
        "US",
        "steel",
        "aluminum"
    ]
}