{
    "creator": "Indu Bhan",
    "title": "Arbitration Award: US court rejects Hardy’s claim",
    "link": "https://www.financialexpress.com/economy/arbitration-award-us-court-rejects-hardys-claim/1199341/",
    "pubDate": "Sat, 09 Jun 2018 03:26:39 +05:30",
    "dc:creator": "Indu Bhan",
    "content": "In a boost to the government, the US District Court for the District of Columbia has rejected a claim of an oil and gas company for enforcement of a Rs 600-crore ($113 million excluding interest) international arbitration award in its favour. ",
    "contentSnippet": "In a boost to the government, the US District Court for the District of Columbia has rejected a claim of an oil and gas company for enforcement of a Rs 600-crore ($113 million excluding interest) international arbitration award in its favour.",
    "guid": "https://www.financialexpress.com/?p=1199341",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-08T21:56:39.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.2857142857142857,
        "tokens": [
            "arbitration",
            "award",
            "us",
            "court",
            "rejects",
            "hardy’s",
            "claim"
        ],
        "words": [
            "rejects",
            "award"
        ],
        "positive": [
            "award"
        ],
        "negative": [
            "rejects"
        ]
    },
    "article": {
        "title": "Arbitration Award: US court rejects Hardy’s claim",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1199343\" src=\"https://images.financialexpress.com/2018/06/hardy-1.jpg\" alt=\"Hardy Exploration,&nbsp;Rudolph Contreras,&nbsp;HEPI\" srcset=\"https://images.financialexpress.com/2018/06/hardy-1.jpg 660w, https://images.financialexpress.com/2018/06/hardy-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/hardy-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/hardy-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Given that other recourse is still available to HEPI, through its litigation in the Indian courts, the court declines to confirm this portion of the award, it said.</figure>\n\t\t\t</section></div><span>\n</span><p>In a boost to the government, the US District Court for the District of Columbia has rejected a claim of an oil and gas company for enforcement of a Rs 600-crore ($113 million excluding interest) international arbitration award in its favour. Rejecting the petition of Hardy Exploration and Production (India) (HEPI) for enforcement of the award, Rudolph Contreras, the US district judge, said this infringement on India’s national sovereignty would contravene the US’ public policy interest in respecting the territorial integrity of other nations to control extraction and processing of natural resources within their own sovereign territories.</p><span>\n</span><p>Given that other recourse is still available to HEPI, through its litigation in the Indian courts, the court declines to confirm this portion of the award, it said. “While the court acknowledges the right of the Indian government to challenge an arbitral award that it believes was unlawful, India’s contributions to the protractedness of the litigation in the Indian courts cannot be denied,” the judgment stated.</p><span>\n</span><p>Stating that the US district court does not have such authority to enforce the arbitration award, including the specific performance portion, the judge said it cannot even order the interest on the Rs 500-crore investment made by Hardy in the block. “…the practical effect of confirming the Tribunal’s award of interest would be to coerce a foreign state into complying with a non-existent order from this court, a non-existent order which… would be a severe affront to India’s sovereignty and would violate US public policy…,” the judgment said.</p><span>\n</span><p>HEPI had urged the court to enforce the two remaining portions of the award — return of the block to it for three years and interest on its original investment in the block. However, India had argued that any such confirmation would divest it of possession and control of its own territorial waters and natural resources and this violates the US public policy.</p><span>\n</span><p>Hardy holds a 75% participating interest in — and along with GAIL and ONGC is a party and operator of – an 859 sq km gas block (CY-OS/2) in the northern Cauvery Basin off the Pondicherry coast.</p><span>\n</span><p>This case stems from HEPI’s participation in 1997 in a PSC with the Indian government for extraction, development, and production of hydrocarbons in an area off India’s southeastern coast. HEPI discovered a reserve of hydrocarbons in 2006 and claimed that it was natural gas, entitling it to a five-year appraisal period. India disagreed, and after two years informed HEPI that the block had been relinquished because the company had failed to declare commerciality within two years of the find, as set out in rules for oil discovery.</p><span>\n</span><p>This prompted HEPI to initiate arbitration proceedings and the tribunal on February 2, 2013 ruled in favour of the company. The arbitrators, sitting in Kuala Lumpur, ordered the block be restored to HEPI and GAIL and they be allowed three extra years for appraisal. The tribunal also asked the oil ministry to pay 9% interest on Rs 500 crore spent on the block.</p><span>\n</span><p>India challenged the award in the the <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/delhi-high-court/\">Delhi High Court</a>, which dismissed its plea in July 2006. The HC upheld Hardy’s preliminary objection that Indian courts have no jurisdiction to entertain the application filed by the UoI to question the legality and correctness of the award.</p><span>\n</span><p>Since HEPI was not allowed back on to the block even three years after it had won the arbitral award, it sought confirmation of its arbitral award in the US court under the Federal Arbitration Act.</p><span>\n</span><p>Meanwhile, the government challenged the HC decision in the Supreme Court, which in May referred the matter to a larger Bench. While additional solicitor general Tushar Mehta and counsel KR Sasiprabhu appeared for the government, the company was represented by senior counsel Abhishek Manu Singhvi.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "international",
        "rejected",
        "Hardy",
        "In",
        "million"
    ],
    "nouns": [
        "court",
        "Court",
        "company",
        "interest",
        "international",
        "Columbia",
        "gas",
        "Arbitration",
        "arbitration",
        "Award",
        "award",
        "US",
        "Hardy",
        "claim",
        "In",
        "boost",
        "government",
        "District",
        "oil",
        "enforcement",
        "crore",
        "million",
        "favour"
    ],
    "verbs": [
        "court",
        "Court",
        "company",
        "interest",
        "gas",
        "Award",
        "award",
        "claim",
        "boost",
        "District",
        "oil",
        "favour"
    ]
}