{
    "creator": "ANI",
    "title": "These platforms are creating a difference by empowering the MSME sector",
    "link": "https://www.financialexpress.com/economy/these-platforms-are-creating-a-difference-by-empowering-the-msme-sector/1199990/",
    "pubDate": "Sat, 09 Jun 2018 19:43:04 +05:30",
    "dc:creator": "ANI",
    "content": "Government and RBI have been working on empowering MSMEs. After special schemes to support the segment, the government also announced the allocation of 3lakh crores to MUDRA Bank under the scheme during the budget.",
    "contentSnippet": "Government and RBI have been working on empowering MSMEs. After special schemes to support the segment, the government also announced the allocation of 3lakh crores to MUDRA Bank under the scheme during the budget.",
    "guid": "https://www.financialexpress.com/?p=1199990",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-09T14:13:04.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "these",
            "platforms",
            "are",
            "creating",
            "a",
            "difference",
            "by",
            "empowering",
            "the",
            "msme",
            "sector"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "These platforms are creating a difference by empowering the MSME sector",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"wp-image-1199997 size-full\" src=\"https://images.financialexpress.com/2018/06/msme.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/msme.jpg 660w, https://images.financialexpress.com/2018/06/msme-300x200.jpg 300w, https://images.financialexpress.com/2018/06/msme-620x413.jpg 620w, https://images.financialexpress.com/2018/06/msme-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Government and RBI have been working on empowering MSMEs (PTI)</figure>\n\t\t\t</section></div><span>\n</span><p>Government and <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a> have been working on empowering MSMEs. After special schemes to support the segment, the government also announced the allocation of 3lakh crores to <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/mudra-bank/\">MUDRA Bank</a> under the scheme during the budget. Also, RBI recently eased NPA classification norms for such units facing input credit linkages and associated issues. From all directions nation is trying to nurture the MSME segment which also provides maximum employment from the non-Agri sector in the country.</p><span>\n</span><p>Further to this, there are fintech and NBFC that are making efforts in the same direction and creating a difference in the economic scenario. With a credit analysis procedure that is supportive and easier for MSMEs to meet, these organisations are also working as financial advisors to them. Right from how much to be borrowed to how the fund is to be utilised well, these brands are taking a step ahead and making the segment move.</p><span>\n</span><p>Some of the top names are:</p><span>\n</span><p><strong>Aye Finance</strong><br>Aye Finance has been one of the leaders in the space of MSME empowerment. The brand has 72 branches across the country and is known for its cluster-based approach while lending. Aye Finance is a commercial institution built around the mission to solve these challenges of funding MSMEs and enabling their inclusion into the mainstream of the economy. Aye Finance differentiates itself by creating a technology enabled process that builds credit insights through a variety of available business and behavioural data.<br>This effective credit appraisal coupled with the use of modern workflow automation and a small but engaged workforce is helping bridge the gap between the MSMEs and organized lending. The cloud-computing architecture enables flexibility delivery of customer service at an affordable cost. It is part of Aye Finance’s vision to leverage modern technology for multiplying the productivity of field force, early detection of frauds and lowering operational risks.</p><span>\n</span><p><strong>Happy Loans</strong><br>Promising a unique borrowing experience to Indians, Happy Loans provides customized loan offerings to consumers to meet their specific demands. It even offers Micro Business loans that start at as low as Rs 2,000 for durations as short as 30 days. By empowering small businesses and merchants to meet their working capital requirements, Happy Loans aims to be the harbinger of a financial revolution that ensures the availability of funds to every business person as and when required. It has partnered with numerous merchant aggregators to help their merchants’ businesses develop a stable working capital base.</p><span>\n</span><p><strong>CoinTribe</strong><br>CoinTribe is a leading online loan disbursement platform that provides quick and easy collateral-free loans to small businesses and individuals. It is the only online lending platform which has back-tested its credit model with large banks. The marketplace model facilitates loan origination and credit assessment through CoinTribe before it is shared with the banks. PaaS enables banks and NBFCs to utilize CoinTribe’s platform for effective risk analysis and recommendations to digitally underwrite their own consumers. CoinTribe’s PaaS is equipping lenders across the country to become digital ready and enhance the efficiency of their lending process.</p><span>\n</span><p><strong>Faircent</strong><br>Faircent, leading P2P platform has been facilitating loans for a number of businesses across the country. Its tech-enabled backbone makes the entire process and hassle free. Each borrower that registers with Faircent is evaluated based on his ability, stability and intention to repay across more than 120 parameters processed through access to more than 400 data points. The strong algorithm helps to find the apt lender for borrowers on the basis of borrower’s profile. Borrowers new to credit or with poor credit history, who face much difficulty in getting their loan requirements fulfilled by traditional avenues, are also able to avail hassle-free loans through the Faircent.com platform.</p><span>\n</span><p><strong>Lendingkart</strong><br>Lendingkart Finance Ltd. is a non-deposit taking NBFC, providing SME lending in India. The company aims to transform small business lending by making it convenient for SMEs to access credit easily. The company uses technology and analytics tools, analyzing thousands of data points from various data sources to assess the creditworthiness of small businesses rapidly and accurately.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "After",
        "special",
        "working",
        "announced"
    ],
    "nouns": [
        "difference",
        "sector",
        "Government",
        "government",
        "RBI",
        "working",
        "special",
        "scheme",
        "support",
        "segment",
        "allocation",
        "MUDRA",
        "Bank",
        "budget"
    ]
}