{
    "title": "IRDAI panel to revisit insurance marketing rules",
    "link": "https://www.business-standard.com/article/economy-policy/irdai-panel-to-revisit-insurance-marketing-rules-118061600725_1.html",
    "pubDate": "Sat, 16 Jun 2018 23:45:00 +0530",
    "content": "The committee is also tasked with providing recommendations on how best to strengthen the insurance marketing firms' channel",
    "contentSnippet": "The committee is also tasked with providing recommendations on how best to strengthen the insurance marketing firms' channel",
    "guid": "https://www.business-standard.com/article/economy-policy/irdai-panel-to-revisit-insurance-marketing-rules-118061600725_1.html",
    "isoDate": "2018-06-16T18:15:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "irdai",
            "panel",
            "to",
            "revisit",
            "insurance",
            "marketing",
            "rules"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "IRDAI panel to revisit insurance marketing rules",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tA committee has been constituted to review the regulations governing insurance marketing firms and make necessary recommendations.</p>\n<p>\n\tThe concept of insurance marketing firms was introduced by the Insurance Regulatory and Development Authority of India (IRDAI) in 2015 to improve insurance penetration in the country through an area-specific approach.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tInsurance marketing firms are allowed to solicit or procure insurance products, undertake insurance service activities and distribute other financial products. The concept was introduced based on the recommendations of the Govardhan Committee, which submitted its report in 2007. Insurance marketing firms can sell mutual funds, pension products, banking services and non-banking financial products. The idea of the distribution channel was introduced to encourage entrepreneurs to provide customers in non-urban areas a facility to access a complete range of financial protection services.</p>\n<p>\n\tMoreover, the committee is tasked with providing recommendations on how best to strengthen the insurance marketing firms’ channel by taking up products which fall under the jurisdiction of other financial sector regulators.</p>\n<p>\n\tThe committee is headed by Suresh Mathur, executive director of IRDAI, and includes Siddharth Pradhan, general manager of New India Assurance, Deepti Rastogi, senior vice-president of Apollo Munich Health, Rajinder Singh, managing director of JK Insurance Marketing, and Rakesh Kumar, executive director of the Life Insurance Corporation of India.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "best"
    ],
    "nouns": [
        "panel",
        "insurance",
        "marketing",
        "committee",
        "best",
        "channel"
    ],
    "verbs": [
        "panel",
        "revisit",
        "best",
        "strengthen",
        "channel"
    ]
}