{
    "title": "'Bad bank' back on table: Piyush Goyal says panel will decide on ARCs",
    "link": "https://www.business-standard.com/article/finance/bad-bank-back-on-table-piyush-goyal-says-panel-will-decide-on-arcs-118060801341_1.html",
    "pubDate": "Sat, 09 Jun 2018 01:05:00 +0530",
    "content": "Finance Minister announces panel to consider formation of ARC for quicker resolution of stressed accounts",
    "contentSnippet": "Finance Minister announces panel to consider formation of ARC for quicker resolution of stressed accounts",
    "guid": "https://www.business-standard.com/article/finance/bad-bank-back-on-table-piyush-goyal-says-panel-will-decide-on-arcs-118060801341_1.html",
    "isoDate": "2018-06-08T19:35:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "'bad",
            "bank'",
            "back",
            "on",
            "table",
            "piyush",
            "goyal",
            "says",
            "panel",
            "will",
            "decide",
            "on",
            "arcs"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "'Bad bank' back on table: Piyush Goyal says panel will decide on ARCs",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\tThe proposal on transferring non-performing assets (NPAs) of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/public-sector-banks\" target=\"_blank\">public sector </a><a class=\"storyTags\" href=\"https://www.business-standard.com/category/finance-news-banks-1030101.htm\" target=\"_blank\">banks </a>(PSBs) to special purpose vehicles — asset reconstruction companies or asset management firms — is back on the agenda.</p>\n<p>\n\tA panel headed by Sunil Mehta, non-executive chairman, Punjab National Bank, would give recommendations in two weeks on forming asset reconstruction companies/asset management companies (ARCs/AMCs) to resolve the problem, Union <a class=\"storyTags\" href=\"https://www.business-standard.com/finance\" target=\"_blank\">Finance </a>Minister <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/piyush-goyal\" target=\"_blank\">Piyush Goyal </a>told reporters after discussions with public sector bank heads in Mumbai.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe panel will study whether such a suggestion is good for Indian banking. If it was found useful, it would suggest ways of setting up such entities, Goyal said.</p>\n<p>\n\tThe idea of a ‘bad bank’ has been one of the most debated ones for stressed asset resolution. A ‘bad bank’ helps <a class=\"storyTags\" href=\"https://www.business-standard.com/category/finance-news-banks-1030101.htm\" target=\"_blank\">banks </a>clear their balance sheets by transferring the NPAs. In January 2017, the Economic Survey had suggested that a centralised Public Sector Asset Rehabilitation Agency (PARA) could be established.</p>\n<p>\n\tIn a speech in February 2017, Reserve Bank of India Deputy Governor Viral Acharya had suggested two structures – a private asset management company and a national asset management company. The former could be set up with equity participation from <a class=\"storyTags\" href=\"https://www.business-standard.com/category/finance-news-banks-1030101.htm\" target=\"_blank\">banks </a>and global funds and would invest in sectors where there is economic viability in the short term. The latter could be set up with some form of government support and could look at stressed assets in sectors that are facing short-term stress but are of long-term economic value.</p>\n<p>\n\t\t<img align=\"left\" alt=\"'Bad bank' back on table: Piyush Goyal says panel will decide on ARCs\" class=\"imgCont\" height=\"549\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/09/full/1528486494-2478.jpg\" title=\"graph\" width=\"482\"></p>\n\tReplying to a question whether the government could provide capital for SPVs, Goyal said it was too early to say anything on this. There is an option of roping in the National Infrastructure Investment Fund for such initiatives. The government does not interfere in the decisions of the NIIF, he said.\n<p>\n\tAlso, banks will consider having oversight committees with external experts to help faster decision-making and resolving stressed accounts in a transparent and speedy manner.</p>\n<p>\n\tThe Economic Survey for 2016-17 had broached the idea of a centralised bad bank to take over large <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bad-loans\" target=\"_blank\">bad loans.</a> The Survey had pointed out the Indian <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/economy\" target=\"_blank\">economy </a>was hobbled by the “twin balance sheet”, which is composed of over-leveraged companies and banks troubled by the weight of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bad-loans\" target=\"_blank\">bad loans.</a></p>\n<p>\n\tGoyal said discussions during the meeting focused on credit flows and banks that devised a mechanism to ensure loans to good borrowers should not face difficulties.</p>\n<p>\n\tRisks needed to be mitigated, he said, adding that all bankers wished to set up a mechanism to enable a faster resolution of stressed accounts.</p>\n<p>\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/finance\" target=\"_blank\">finance </a>minister said most of the stressed assets that could fit into the ARC or AMC structure had been identified.</p>\n<p>\n\tAccording to rating agency CRISIL, gross NPAs (GNPAs) in the banking system, which stood at 11.2 per cent in 2017-18, are likely to touch 11.5 per cent this fiscal year.</p>\n<p>\n\tIn 2017-18, GNPAs increased to around Rs 10.3 trillion, or 11.2 per cent of advances compared with Rs 8 trillion, or 9.5 per cent of advances, as of March 31, 2017.</p>\n<p>\n\tThe public sector banks, which control over 70 per cent of banking system loans, also have a predominant share in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bad-loans\" target=\"_blank\">bad loans.</a></p>\n<p>\n\tAbout a fifth of the slippages in 2017-18 was due to the withdrawal of various structuring schemes by the Reserve Bank of India in February, after the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/insolvency\" target=\"_blank\">Insolvency </a>and Bankruptcy Code (IBC) came into force, the report said.</p>\n<p>\n\tThe rating agency, however, said the tide was turning and it expected moderation in slippages, better recoveries from NPAs, and improved provision coverage. After meeting the heads of state-owned banks, Goyal said the government \"stands solidly behind each of the 21 <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/public-sector-banks\" target=\"_blank\">public sector banks </a>(PSBs)\".</p>\n<p>\n\tHe said all vacant positions of PSB heads would be filled in the next 30 days. Suggestions about strengthening governance processes and honest recognition of NPAs were discussed at the meeting, he said.</p>\n<p>\n\t‘ICICI a good bank with robust processes’</p>\n<p>\n\tGoyal said private sector lender ICICI Bank was a good bank with very robust internal processes internally.</p>\n<p>\n\tThere was \"no cause for concern for any of the stakeholders\" of ICICI Bank, Goyal said in response to a media query.</p>\n<p>\n\tMedia persons asked Goyal about the government’s almost total silence over governance issues at ICICI Bank, and why the government's nominee to the bank's board had not attended a recent board meeting.</p>\n<p>\n\tHe said the law would take its own course in the matter and that processes were already underway both internally and externally.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "stressed",
        "Bad",
        "back"
    ],
    "nouns": [
        "will",
        "Minister",
        "Bad",
        "bank",
        "back",
        "panel",
        "ARC",
        "Finance",
        "formation",
        "resolution",
        "table"
    ],
    "verbs": [
        "will",
        "decide",
        "Minister",
        "bank",
        "back",
        "table",
        "panel",
        "ARC",
        "Finance",
        "consider"
    ]
}