{
    "title": "‘India in Airbnb’s top 3 strategic markets’",
    "link": "https://timesofindia.indiatimes.com/business/india-business/india-in-airbnbs-top-3-strategic-markets/articleshow/64517456.cms",
    "pubDate": "Sat, 09 Jun 2018 05:48:42 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/india-in-airbnbs-top-3-strategic-markets/articleshow/64517456.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64517456.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/india-in-airbnbs-top-3-strategic-markets/articleshow/64517456.cms",
    "isoDate": "2018-06-09T05:48:42.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.2857142857142857,
        "tokens": [
            "‘india",
            "in",
            "airbnb’s",
            "top",
            "3",
            "strategic",
            "markets’"
        ],
        "words": [
            "top"
        ],
        "positive": [
            "top"
        ],
        "negative": []
    },
    "article": {
        "title": "‘India in Airbnb’s top 3 strategic markets’",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>MUMBAI: </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Chris-Lehane\">Chris Lehane</a><span>, Airbnb’s head of global policy, said India has emerged as one of the top three most significant markets for the $31-billion valued home-sharing startup, after China and the US. </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/airbnb\">Airbnb</a><p> clocked a 101% year-on-year growth in terms of inbound guests over the past year, as the company looks to build its domestic infrastructure and increase its presence here. While the numbers are still small in India in terms of the size of the business, Lehane — a former Democratic political strategist — said Airbnb is in the midst of drawing up a long-term plan for India and chalk out investments for the market.\n\n</p><span>Having had a long political career, including a six-year stint with former US President Bill Clinton at the White House, Lehane told TOI that India is at the centre of the Silicon Valley tech company’s strategy, given the country’s macro trends like 400-million-strong millennial population and growing middle class, both of which are increasingly travelling both within the country and outside. Airbnb is now looking to bulk up its inbound piece here by adding more listings locally after having tapped Indians who were travelling abroad. It currently has 31,000 listings, which the company said has grown by 115% over the past year.\n</span><br><span>\n</span><br><span>Founded by Brian Chesky, Joe Gebbia, and Nathan Blecharczyk 10 years ago, Airbnb has been forming partnerships with tourism departments across states in India to facilitate supply of properties. Lehane said they struck a partnership with the Maharashtra Tourism Development Corporation (MTDC) to launch a tourism entrepreneurship accelerator programme. It is also launching Airbnb Experiences in Goa, which according to Lehane is among the fastest growing markets in India. Experiences are activities designed and led by local hosts, which travellers can select and pay for when booking through Airbnb.\n</span><br><span>\n</span><br><span>“Travel and tourism would generate jobs for the growing working population in India, and governments are open to platforms like ours where they can work on a revenue-share model to facilitate the supply and create employment,” he said.\n</span><br><span>\n</span><br><span>He said, the biggest companies in terms of market cap today are technology, most of which were founded in Silicon Valley and the West Coast. “But the next set of these large tech companies will likely come from China and India. And some of the challenges that the world faces is in effect at some level being pushed by these technology platforms. The scale and speed of digital revolution is huge. Tech companies need to take responsibility for what’s going on and make sure it’s all aligned,” Lehane said.\n</span><br><span>\n</span><p>Policy and business have come together because the impact that these platforms are having — it is unprecedented, he said.\n</p><span>\n</span></div></div>"
    },
    "adjectives": [
        "top",
        "10",
        "strategic",
        "left",
        "right"
    ],
    "nouns": [
        "India",
        "india",
        "top",
        "10",
        "business",
        "margin",
        "border",
        "left",
        "style",
        "right",
        "photo"
    ],
    "verbs": [
        "top",
        "border",
        "align",
        "style",
        "right"
    ]
}