{
    "creator": "Reuters",
    "title": "Singapore Exchange to continue SGX Nifty trade beyond August 2018 despite India dispute",
    "link": "https://www.financialexpress.com/market/singapore-exchange-to-continue-sgx-nifty-trade-beyond-august-2018-despite-india-dispute/1208696/",
    "pubDate": "Sat, 16 Jun 2018 15:04:48 +05:30",
    "dc:creator": "Reuters",
    "content": "The Singapore Exchange (SGX) on Saturday said a court-appointed arbitrator had allowed it to continue listing and trading of SGX Nifty contracts beyond August 2018, during dispute resolution with India's National Stock Exchange (NSE).",
    "contentSnippet": "The Singapore Exchange (SGX) on Saturday said a court-appointed arbitrator had allowed it to continue listing and trading of SGX Nifty contracts beyond August 2018, during dispute resolution with India's National Stock Exchange (NSE).",
    "guid": "https://www.financialexpress.com/?p=1208696",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-16T09:34:48.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "singapore",
            "exchange",
            "to",
            "continue",
            "sgx",
            "nifty",
            "trade",
            "beyond",
            "august",
            "2018",
            "despite",
            "india",
            "dispute"
        ],
        "words": [
            "dispute",
            "nifty"
        ],
        "positive": [
            "nifty"
        ],
        "negative": [
            "dispute"
        ]
    },
    "article": {
        "title": "Singapore Exchange to continue SGX Nifty trade beyond August 2018 despite India dispute",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"wp-image-1208700 size-full\" src=\"https://images.financialexpress.com/2018/06/Singapore-Exchange-Reuters.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/Singapore-Exchange-Reuters.jpg 660w, https://images.financialexpress.com/2018/06/Singapore-Exchange-Reuters-300x200.jpg 300w, https://images.financialexpress.com/2018/06/Singapore-Exchange-Reuters-620x413.jpg 620w, https://images.financialexpress.com/2018/06/Singapore-Exchange-Reuters-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> SGX responded that it would launch successor products to its flagship Indian equity derivative products on June 4. (Image: Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>The Singapore Exchange (SGX) on Saturday said a court-appointed arbitrator had allowed it to continue listing and trading of SGX Nifty contracts beyond August 2018, during dispute resolution with India’s National Stock Exchange (NSE). The two exchanges have been locked in dispute after India’s three main bourses unexpectedly announced in February they would stop licensing their indexes to foreign bourses from August.</p><span>\n</span><p>SGX responded that it would launch successor products to its flagship Indian equity derivative products on June 4. Now NSE and SGX have been ordered “to facilitate the continued listing of SGX Nifty products for at least two successive contract month maturations beyond the arbitration’s completion date”, SGX said in a statement. The arbitrator has also asked SGX not to offer its proposed new India equity derivative products until the final decision, it said.</p><span>\n</span><p>“Arbitration proceedings are continuing and the hearings on evidence are expected to commence in early 2019,” the statement said. SGX had postponed the launch of a set of new India derivatives products after an Indian court in May referred a dispute around the proposed offerings to an arbitrator. The NSE had sought an interim injunction against the launch on grounds that the offerings infringed the intellectual property rights of its unit India Index Services and Products (IISL), which runs the Nifty index.</p><span>\n</span><p>The Bombay High Court then asked a senior retired judge to arbitrate in the matter, and resolve the issue by June 16. However, the June 16 interim order, which was reviewed by Reuters, laid out a timeline for filing of claims and counter-claims and set November 21 for hearing of the issues, with further directions to be provided on June 18. Over the past two decades, SGX has become the most popular market for foreign investors to bet on Indian equity indexes, with Nifty 50 futures tracking the NSE’s main index .</p><span>\n</span><p>But NSE, BSE Ltd and Metropolitan Stock Exchange moved to end licensing deals with foreign bourses so as to stem the loss of trades to overseas rivals, following SGX’s plans to launch trade in single-stock futures contracts. The Indian government backed the decision, as it is keen to draw investors to an international financial centre being developed in Prime Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/narendra-modi/\">Narendra Modi</a>’s western home state of Gujarat, sources say.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "Nifty",
        "August",
        "appointed",
        "National",
        "Stock"
    ],
    "nouns": [
        "Singapore",
        "Exchange",
        "trade",
        "trading",
        "despite",
        "India",
        "August",
        "court",
        "Saturday",
        "arbitrator",
        "dispute",
        "National",
        "listing",
        "resolution",
        "Stock"
    ]
}