{
    "creator": "Bloomberg",
    "title": "Millionaires now own 50% of world’s personal wealth; booming stock markets the reason behind it!",
    "link": "https://www.financialexpress.com/market/millionaires-now-own-50-of-worlds-personal-wealth-booming-stock-markets-the-reason-behind-it/1208780/",
    "pubDate": "Sat, 16 Jun 2018 16:43:12 +05:30",
    "dc:creator": "Bloomberg",
    "content": "The rich are getting a lot richer and doing so a lot faster. Personal wealth around the globe reached $201.9 trillion last year, a 12 percent gain from 2016 and the strongest annual pace in the past five years, Boston Consulting Group said in a report released Thursday.",
    "contentSnippet": "The rich are getting a lot richer and doing so a lot faster. Personal wealth around the globe reached $201.9 trillion last year, a 12 percent gain from 2016 and the strongest annual pace in the past five years, Boston Consulting Group said in a report released Thursday.",
    "guid": "https://www.financialexpress.com/?p=1208780",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-16T11:13:12.000Z",
    "sentiment": {
        "score": 3,
        "comparative": 0.2,
        "tokens": [
            "millionaires",
            "now",
            "own",
            "50",
            "of",
            "world’s",
            "personal",
            "wealth",
            "booming",
            "stock",
            "markets",
            "the",
            "reason",
            "behind",
            "it"
        ],
        "words": [
            "wealth"
        ],
        "positive": [
            "wealth"
        ],
        "negative": []
    },
    "article": {
        "title": "Millionaires now own 50% of world’s personal wealth; booming stock markets the reason behind it!",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"wp-image-1208790 size-full\" src=\"https://images.financialexpress.com/2018/06/Millionaires.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/Millionaires.jpg 660w, https://images.financialexpress.com/2018/06/Millionaires-300x200.jpg 300w, https://images.financialexpress.com/2018/06/Millionaires-620x413.jpg 620w, https://images.financialexpress.com/2018/06/Millionaires-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Wealth is also highly concentrated in Hong Kong, where individuals with more than  million hold 47 percent of investable riches. (Image: Bloomberg)</figure>\n\t\t\t</section></div><span>\n</span><p>The rich are getting a lot richer and doing so a lot faster. Personal wealth around the globe reached $201.9 trillion last year, a 12 percent gain from 2016 and the strongest annual pace in the past five years, Boston Consulting Group said in a report released Thursday. Booming equity markets swelled fortunes, and investors outside the U.S. got an exchange-rate bonus as most major currencies strengthened against the greenback.</p><span>\n</span><p>The growing ranks of millionaires and billionaires now hold almost half of global personal wealth, up from slightly less than 45 percent in 2012, according to the report. In North America, which had $86.1 trillion of total wealth, 42 percent of investable capital is held by people with more than $5 million in assets. Investable assets include equities, investment funds, cash and bonds.</p><span>\n</span><p><img class=\"alignnone wp-image-1208787 size-full\" src=\"https://images.financialexpress.com/2018/06/Millionaires-e1529146717990.png\" alt=\"\" width=\"660\" height=\"413\"></p><span>\n</span><p>“The fact that the wealth held by millionaires as a percentage of total wealth is increasing does not mean that the poor are getting poorer,” Anna Zakrzewski, the report’s lead author, said in an emailed statement. “What it means is that everyone is getting richer. Specifically, we believe that the rich are getting richer faster.”</p><span>\n</span><p>Last year’s big winner was China, which now ranks second globally in terms of financial wealth after overtaking Japan in the past five years, Zakrzewski said. While China trails only the U.S. in the number of millionaires and billionaires, the biggest driver of growth in the Asian country was its so-called affluent segment, or those with $250,000 to $1 million of investable assets.</p><span>\n</span><p>“China will continue to experience similar growth as in the past and this will mean that over the next five years, there will be more wealth created in China than in the U.S.,” she said, adding the number of millionaires there is expected to grow four times as fast as in the U.S.</p><span>\n</span><p>Without the boost from a weakening dollar, the global wealth gain would have been 7 percent. The region that benefited the most from currency appreciation was Western Europe, where a 15 percent advance in U.S. dollar terms shrinks to 3 percent in local currency.</p><span>\n</span><p><img class=\"alignnone wp-image-1208786 size-full\" src=\"https://images.financialexpress.com/2018/06/Wealthy-People-e1529146747614.png\" alt=\"\" width=\"660\" height=\"413\"></p><span>\n</span><p>Eastern Europe and Central Asia had the greatest concentration of wealth at the top, with billionaires alone holding almost a quarter of investable assets. The 28 Eastern Europeans in the Bloomberg Billionaires Index have a total net worth of $294 billion, which includes a gain of $3.4 billion so far in 2018.</p><span>\n</span><p>Wealth is also highly concentrated in Hong Kong, where individuals with more than $20 million hold 47 percent of investable riches. Money in investment funds and publicly traded equities gained the most, while bonds were the only core asset class to post negative growth last year, falling 7 percent.</p><span>\n</span><p>The Middle East was the region with the greatest share of wealth held in investable assets —- $3.1 trillion of a total $3.8 trillion. Western European residents held 56 percent in currency and deposits, while in North America the emphasis was on equities and investment funds, with 62 percent of $47 trillion of investable wealth parked in those assets.</p><span>\n</span><p>If personal wealth creation continues at the rate of the past few years, Boston Consulting projects a compound annual growth rate of about 7 percent from 2017 to 2022, in U.S. dollars. Events like stock market corrections and geopolitical uncertainties could knock that down to 4 percent. In a worse-case scenario, such as a major economic crisis, global wealth might produce a compound growth rate of only 1 percent over five years, the study found.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "stock",
        "world",
        "personal",
        "Personal",
        "annual",
        "own",
        "50",
        "booming",
        "behind",
        "rich",
        "trillion",
        "12",
        "past",
        "five",
        "last"
    ],
    "nouns": [
        "stock",
        "world",
        "getting",
        "personal",
        "Personal",
        "percent",
        "wealth",
        "report",
        "reason",
        "year",
        "years",
        "annual",
        "50",
        "behind",
        "lot",
        "rich",
        "so",
        "12",
        "trillion",
        "globe",
        "last",
        "past",
        "five",
        "gain",
        "Thursday",
        "pace",
        "Boston",
        "Group"
    ],
    "verbs": [
        "stock",
        "report",
        "reason",
        "own",
        "lot",
        "last",
        "gain",
        "pace",
        "Group"
    ]
}