{
    "creator": "PTI",
    "title": "Niti Aayog seeks comments on rationalisation of trade margins in medical devices",
    "link": "https://www.financialexpress.com/economy/niti-aayog-seeks-comments-on-rationalisation-of-trade-margins-in-medical-devices/1200018/",
    "pubDate": "Sat, 09 Jun 2018 20:22:49 +05:30",
    "dc:creator": "PTI",
    "content": "With a view to achieving the overall goal of affordable 'healthcare for all', the government think tank Niti Aayog today sought suggestions for rationalisation of trade margins in medical devices. ",
    "contentSnippet": "With a view to achieving the overall goal of affordable 'healthcare for all', the government think tank Niti Aayog today sought suggestions for rationalisation of trade margins in medical devices.",
    "guid": "https://www.financialexpress.com/?p=1200018",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-09T14:52:49.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "niti",
            "aayog",
            "seeks",
            "comments",
            "on",
            "rationalisation",
            "of",
            "trade",
            "margins",
            "in",
            "medical",
            "devices"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Niti Aayog seeks comments on rationalisation of trade margins in medical devices",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1200019\" src=\"https://images.financialexpress.com/2018/06/niti-1.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/niti-1.jpg 660w, https://images.financialexpress.com/2018/06/niti-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/niti-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/niti-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> With a view to achieve the overall goal of affordable ‘healthcare for all’, government think tank Niti Aayog today sought suggestions for rationalisation of trade margins in medical devices (PTI)</figure>\n\t\t\t</section></div><span>\n</span><p>With a view to achieving the overall goal of affordable ‘healthcare for all’, the government think tank Niti Aayog today sought suggestions for rationalisation of trade margins in medical devices. The Aayog in a concept note titled ‘Rationalisation of Trade Margins in Medical Devices – A Concept Note’ said the government intends to make available critical and lifesaving medical devices to the needy masses at affordable prices.</p><span>\n</span><p>“The aim is to ensure reasonable prices to consumers and at the same time allow reasonable profits to all stakeholders in the medical device industry, including those involved in the supply – chain by rationalising trade margins and thereby passing the benefits of the reduced cost to the final consumer,” the note added. The trading margin is the difference between the price at which the manufacturers/importers sell to trade (price to trade) and the price to patients (maximum retail price). The note pointed out that the issue of unreasonably high trade margins in medical devices has been adversely affecting both the industry as well as consumer interest.</p><span>\n</span><p>“Various representations regarding rationalisation of trade margins on medical devices from industry/trade associations/indigenous manufacturers/importers have also been received. The government has had stakeholders consultations on this subject beginning from October 2017 to ascertain their viewpoints,” the note said. According to the note, Only 23 medical devices have been notified as drugs and are regulated under Drugs and Cosmetics Act, of these, only 4 devices viz. cardiac stents, drug-eluting stents, condoms and intrauterine devices are included in the national list of essential medicines and by virtue thereof are subject to notified price ceilings.</p><span>\n</span><p>Besides, knee implants have been brought under price control under para 19 of the Drugs (Prices Control) Order 2013. The remaining medical devices are under no price regulation. The Niti Aayog said that stakeholders can submit their comments or suggestions by June 15, 2018. As per the note, the medical devices industry has been growing at a rapid pace and is currently estimated to have a market size of USD 10 billion and it is likely to reach a size of USD 20 billion in next couple of years.</p><span>\n</span><p>“It has been the effort of the government to encourage the medical devices industry and keep it by and large a free and unregulated industry,” the note said. India imports more than 75 per cent of all its medical device needs.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "affordable",
        "medical",
        "overall",
        "sought"
    ],
    "nouns": [
        "government",
        "trade",
        "rationalisation",
        "medical",
        "devices",
        "view",
        "think",
        "goal",
        "today",
        "overall",
        "healthcare",
        "tank"
    ],
    "verbs": [
        "trade",
        "view",
        "think",
        "tank"
    ]
}