{
    "creator": "Shubhra Tandon",
    "title": "Rising input costs hit India Inc margins",
    "link": "https://www.financialexpress.com/industry/rising-input-costs-hit-india-inc-margins/1199314/",
    "pubDate": "Sat, 09 Jun 2018 02:47:59 +05:30",
    "dc:creator": "Shubhra Tandon",
    "content": "Rising input costs hit the margins of India Inc in January-March 2018 with only a few being able to pass on this increase to consumers. ",
    "contentSnippet": "Rising input costs hit the margins of India Inc in January-March 2018 with only a few being able to pass on this increase to consumers.",
    "guid": "https://www.financialexpress.com/?p=1199314",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-08T21:17:59.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "rising",
            "input",
            "costs",
            "hit",
            "india",
            "inc",
            "margins"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Rising input costs hit India Inc margins",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1199316\" src=\"https://images.financialexpress.com/2018/06/india-inc-1.jpg\" alt=\"india inc, india companies, indian companies, latam, latin america, latin american companies\" srcset=\"https://images.financialexpress.com/2018/06/india-inc-1.jpg 660w, https://images.financialexpress.com/2018/06/india-inc-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/india-inc-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/india-inc-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> At 13.03%, the operating profit margin was the lowest in at least 8 quarters.</figure>\n\t\t\t</section></div><span>\n</span><p>Rising input costs hit the margins of India Inc in January-March 2018 with only a few being able to pass on this increase to consumers. The sectors particularly impacted include cement, fast moving consumer goods and auto ancillaries. At 13.03%, the operating profit margin for a sample of 2,217 companies was the lowest in at least eight quarters; in Q4FY18, the OPM contracted by 138 basis points. The raw materials to sales in Q4 stood at 43.09%, which was an increase of 56.05 basis points on a year-on-year basis.</p><span>\n</span><p>While higher sales translated into better gross margins for FMCG companies, for some it was offset by the increase in certain raw material prices. For instance, at Marico, gross margins fell by a sharp 550 bps y-o-y to 47.8% for January-March 2018. Meanwhile, Dabur, after suffering a decline in gross margins in H1FY18 to 49-50%, saw an improvement in H2 after hiking price in categories seeing raw material inflation.</p><span>\n</span><p>The prices of key inputs for the companies such as copra, kardi and mentha oil have gone up, while palm oil prices have declined. Copra prices surged 49% on a y-o-y basis to Rs 11,410 per quintal in Q4, and Kardi (Safflower) Oil has gone up 30% to Rs 1,454 per 10 kilograms, according to data sourced from Axis Capital report. Meanwhile, palm oil prices have declined 26% y-o-y to Rs 65,115 per tonne.</p><span>\n</span><p>In fact, Saugata Gupta, managing director &amp; CEO, Marico, does not think the prices of copra will come down in a hurry. “Given the current outlook on the crop, the inflationary pressures will continue to be there for — definitely in H1 of the year,” he told analysts. The company undertook significant price hikes of about 22% in its Parachute brand in October-March of FY18, which impacted the volumes and led to a 5% decline in ‘Parachute’ rigid packs during the January-March 2018 quarter, analysts at JP Morgan observed.</p><span>\n</span><p>With crude prices going up, a sharp increase in the prices of petroleum coke has pressurised the operating margins of cement majors, and may continue to trouble in the April-June quarter as well. UltraTech Cement’s ebitda margins compressed to 18.9% from 19.32% in the three months of January-March 2018. In absolute terms, ebitda grew by 31% to Rs 1,781 crore from Rs 1,356 crore in the previous fiscal.</p><span>\n</span><p>Atul Daga, CFO, UltraTech Cement, told analysts recently that the company’s Q4FY18 margins were the lowest of ebitda margins due to increasing input costs and muted price trends. “Pet coke is a worry for all cement players, it has become black gold now. Costs of pet coke procurement have been going up continuously. It is currently trading somewhere around $115 per tonne and has already gone up about $10 from the last quarter. Next quarter, (April-June) also we will feel the impact of rising cost,” he said.</p><span>\n</span><p>With the price of pet coke expected to remain at elevated levels, UltraTech is planning to switch to imported or domestic coal. “Given the level that which pet coke is operating some of the plants in our network have become amenable to switch over from pet coke to imported coal or domestic coal and we are looking at those opportunities,” Daga said.</p><span>\n</span><p>At the same time, the market should expect the prices of cement inching up with the capacity utilisation improving significantly across the country. “With capacity utilisation now hitting upwards of 75% for the industry as a whole, I believe that prices improvement could happen,” he added.</p><span>\n</span><p>Meanwhile, continued tightness in lead supply has had the price of the base metal soaring during FY18. Ongoing environmental crackdown in China has disrupted the supply chain for lead, while the demand for it remains high especially in the industrial batteries space.</p><span>\n</span><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "Rising",
        "pass",
        "few",
        "able"
    ],
    "verbs": [
        "pass",
        "March",
        "increase",
        "input",
        "hit"
    ]
}