{
    "creator": "Rituparna Chakraborty",
    "title": "India must bet big on logistics",
    "link": "https://www.financialexpress.com/economy/india-must-bet-big-on-logistics/1216850/",
    "pubDate": "Sat, 23 Jun 2018 03:57:00 +05:30",
    "dc:creator": "Rituparna Chakraborty",
    "content": " It will not only stimulate job creation—a critical need for the nation—but also bring to the forefront the talent requirement of the industry in the coming years. As a result of all the investment-led transformation, the logistics sector in India is expected to provide employment to 13.9 million people, up from the current 10.9 million, over the next four years (2018-2022), making it the largest job-creator in the infrastructure space.",
    "contentSnippet": "It will not only stimulate job creation—a critical need for the nation—but also bring to the forefront the talent requirement of the industry in the coming years. As a result of all the investment-led transformation, the logistics sector in India is expected to provide employment to 13.9 million people, up from the current 10.9 million, over the next four years (2018-2022), making it the largest job-creator in the infrastructure space.",
    "guid": "https://www.financialexpress.com/?p=1216850",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-22T22:27:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.16666666666666666,
        "tokens": [
            "india",
            "must",
            "bet",
            "big",
            "on",
            "logistics"
        ],
        "words": [
            "big"
        ],
        "positive": [
            "big"
        ],
        "negative": []
    },
    "article": {
        "title": "India must bet big on logistics",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignleft\"><figure><img class=\"size-full wp-image-1216861\" src=\"https://images.financialexpress.com/2018/06/logistics-1-1.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/logistics-1-1.jpg 660w, https://images.financialexpress.com/2018/06/logistics-1-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/logistics-1-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/logistics-1-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> India’s logistics sector is coming of age. With its new found infrastructure status and the GST giving tailwinds, it is all set for transformation.</figure>\n\t\t\t</section></div><span>\n</span><p>India’s logistics sector is coming of age. With its new found infrastructure status and the GST giving tailwinds, it is all set for transformation. In addition, there is a lot happening in favour of this sector, which has resulted in it being deemed a sunshine industry. During the last two years, India’s position has progressed in the World Bank Logistics Performance Index (LPI), in terms of overall logistics performance from 54 in 2014 to 35 in 2016. The 2017-2018 Economic Survey also paints a promising future for the sector. Industry analysts also endorse such growth trends for logistics—e.g., a recent report by real estate consultancy CBRE predicts a stronger growth for logistics in 2018, owing to leasing activity shooting up to 70%, to reach 17 million sq. ft. It also forecast that demand for warehousing space will reach 20 million sq. ft. in 2018, with both new and existing occupiers expanding their operations. GST, in particular, has given a major fillip to the sector and will expedite faster conversion of informal logistics setups to formal ones. It will also speed up freight movement at interstate borders due to dismantling of check-posts. With the GST e-bill being rolled out from April 1, 2018, the sector will witness further improvements.</p><span>\n</span><p>The government is committing a whopping Rs 6 lakh crore towards infrastructure this financial year. More than 50% of this investment will be routed to the creation and upgradation of roads, railways and ports, and forms one of the primary drivers of transformational growth for the logistics sector in India. The large-scale investments are aimed at bringing down the cost of logistics from a staggering 14.4% of GDP to about a 10% level over next three-four years, which will make the sector competitive.</p><span>\n</span><p>All this augurs well for the industry. It will not only stimulate job creation—a critical need for the nation—but also bring to the forefront the talent requirement of the industry in the coming years. As a result of all the investment-led transformation, the logistics sector in India is expected to provide employment to 13.9 million people, up from the current 10.9 million, over the next four years (2018-2022), making it the largest job-creator in the infrastructure space.</p><span>\n</span><p>According to our research, 3 million incremental jobs will get created across seven sub-sectors within the logistics sector. Road freight, a Rs 9.6-lakh-crore market growing at 16.5% CAGR, will account for 1.89 million new logistics jobs (63% of all potential jobs in the sector), while rail freight (40,000 incremental jobs), waterways (450,000 incremental jobs), air freight (400,000 incremental jobs) and warehousing (120,000 incremental jobs) will contribute a million more jobs over the next four years. Courier services, a Rs 28,000-crore sub-sector and the second-fastest (at 17.3% CAGR) growing, will create 60,000 incremental jobs and packaging, a 24,000-crore sub-sector, will create 40,000 incremental jobs over 2018-2022. The bulk of these new jobs, amounting to 1.74 million incremental jobs (58% of all potential logistics jobs) across the sector between 2018 and 2022, will get created in four cities—Delhi-NCR, Mumbai, Chennai, Bangalore.</p><span>\n</span><p>Now, while it is good news to see demand for additional man-power in this industry, there exist challenges on the supply-side. In the recent years, technology has changed the way the industry works—as a result, certain skills have become redundant and certain job profiles have been eliminated. Newer technologies such as IoT, Big Data Analytics, AI are having a profound impact on employment already, and are resulting in demand for newer skills. Similarly, the emergence of newer third party and fourth party logistics players are also leading to demand for new skills. Now, the industry, which hitherto banked on unskilled and semi-skilled workforce, is facing a talent crunch. Logistics service providers now realise that their pace of growth, profitability and ability to deliver superior quality services and achieving continuous improvements will demand a rapid development of capabilities across several areas. A key capability that would require focus is that of skills development. With the business rapidly formalising, logistics player are waking up to the reality of talent management, and are faced with an immediate imperative to embrace technology, acquire new and relevant skills, and invest in continuous learning for business growth. They are also facing challenges in attracting and retaining talent, including battling perception of logistics as a low-skills sector.</p><span>\n</span><p>This can be a major growth impediment, and, therefore, this makes it imperative for the government, training institutions, logistics companies and sectoral skill council to build training capacity and offer industry-relevant skills to candidates. Apprenticeship is one of the proven models of training that ensures skilled workforce as per the demands of the industry and emerging job roles. A notable step in this direction was the launch of the ‘First Apprentice’ programme under the National Apprenticeship Promotion Scheme (NAPS) by the Logistics Skill Council in 2017 to boost apprenticeships in the logistics sector; this aims to train 3 lakh youths by 2020. Similarly, at the industry level, CII has also set up a Centre of Excellence in logistics and supply chain management, with enhancing the competitiveness of the Indian Industry through supply-chain and logistics excellence being the objective. While all these initiatives are steps in the right direction, more concerted effort is required of industry, academia, policy-makers and trade-bodies if the supply of skilled logistics resources is to be enhanced. Collaborative efforts by all stakeholders and interested parties would enable the development of a sustainable and thriving logistics sector that not just serves the nation’s needs, but also will make India a global hub for logistics services.</p><span>\n</span><p>If India needs to reap the benefits of the logistics revolution, it is has to undertake strategic investment, intervention and initiatives to build this sector and make it the largest infrastructure jobs engine for India. The day of reckoning for logistics is here, and betting big on this sector will surely translate into a large number of jobs for India.</p><span>\n</span><span>\n</span><p>(Author is Executive vice-president and co-founder, TeamLease Services )</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "big",
        "critical",
        "coming",
        "expected",
        "13",
        "million",
        "current",
        "10",
        "next",
        "four"
    ],
    "nouns": [
        "India",
        "industry",
        "bet",
        "logistics",
        "will",
        "creation",
        "creator",
        "need",
        "It",
        "nation",
        "job",
        "forefront",
        "talent",
        "requirement",
        "coming",
        "years",
        "As",
        "result",
        "investment",
        "led",
        "transformation",
        "sector",
        "13",
        "million",
        "current",
        "10",
        "employment",
        "making",
        "people",
        "four",
        "infrastructure",
        "space"
    ],
    "verbs": [
        "bet",
        "will",
        "stimulate",
        "job",
        "need",
        "bring",
        "result",
        "provide",
        "people",
        "space"
    ]
}