{
    "title": "How to work from anywhere",
    "link": "https://timesofindia.indiatimes.com/business/india-business/how-to-work-from-anywhere/articleshow/64609088.cms",
    "pubDate": "Sat, 16 Jun 2018 00:18:56 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/how-to-work-from-anywhere/articleshow/64609088.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64609088.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/how-to-work-from-anywhere/articleshow/64609088.cms",
    "isoDate": "2018-06-16T00:18:56.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "how",
            "to",
            "work",
            "from",
            "anywhere"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "How to work from anywhere",
        "content": "<div class=\"Normal\"><span>Many companies allow employees to </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/work-from-home\">work from home</a><p>. But to set up a remote office requires planning. Organisations need to invest in cloud storage, robust internet connectivity and communication tools to help employees access and store data securely, as well as collaborate with one another. You, however, can create a personal ecosystem that allows you to work from wherever you are, especially if you cannot travel to the office on certain days, or if you need to get some last-minute work done on the weekends…\n\n</p><span>PRODUCTIVITY SUITES | </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Google-Drive\">Google Drive</a><p> &amp; MS OneDrive\n</p><p>he Google productivity suite has been around T since 2006. If you have a Google account, you already have access to a productivity ecosystem that will allow you to work from anywhere. You get Gmail for email, Contacts to store your phone numbers and addresses, Calendar to schedule your appointments and share events with collaborators, Keep to store your notes, lists and voice memos, Docs to edit and work on documents, Sheets for spreadsheets, Slides for presentations, and Drive that provides you with 15GB of free storage for your files. These apps allow you to collaborate with other Google users on the same files that are stored on the cloud, and you can even use Google Hangouts for communication.\n</p><p>But if you're accustomed to using MS Office for all your productivity needs, you might want to take a serious look at OneDrive. This cloud storage comes with only 5GB of storage when you sign in with your free Outlook email address. But what you get are cloud-based versions of Word, Excel and PowerPoint that sport a user interface that's similar to the offline software.\n</p><span>Of course, you get Outlook for email, People to store all your contacts, Calendar to schedule your appointments, Tasks for your to-do lists, OneNote for your memos and quick notes, Sway to create newsletters and documentations, and </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Skype\">Skype</a><p> for video communication. You can invite your colleagues who are also on Outlook to collaborate with you on documents.\n</p><p>Regardless of which suite you choose, you can access your files from anywhere in the world, share them with coworkers, and you are also guaranteed secure backups for your data. Depending on your use, you can also opt for extra features that come with a paid subscriptions to these services.\n</p><p># drive.google.com # onedrive.com\n</p><p>PROJECT MANAGEMENT | Asana\n</p><p>Asana is a cloud-based app that's designed to help you organise, track, and manage workflows for your team. After you create an account and add members to a project, you can create tasks with due dates, and create lists to prioritise and organise work. The app allows team-leaders to set clear targets to give everyone clarity on what needs to be done, which tasks they're responsible for, along with completion dates.\n</p><p>The app provides teammates with a graphical interface - complete with a calendar view - to help everyone visualise how all the pieces fit together, spot potential issues, and keep work on track.\n</p><span>Asana also allows co-workers to seek clarification, provide guidance and give updates on the work that's being done, so conversations turn into actions. And it even comes with apps for Android and </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/iOS\">iOS</a><p> that allow users to track progress while on the go. A free Asana account allows for unlimited tasks, projects, and conversations for a team of up to 15 members, with basic dashboards and search feature, but you can opt for a paid account for extras depending on your requirement.\n</p><p># asana.com\n</p><p>COMMUNICATION | Slack &amp; Flock\n</p><p>Email and instant messengers help communicate with teammates, but low-priority bulk messages also increase the chance that you might overlook important ones. The best way to focus on projects is to set up a separate workspace where your teammates and you can only discuss the work at hand and keep tabs on who is doing what.\n</p><p>Slack lets you set up \"hubs\" where you can connect with your colleagues to discuss a specific project or assignment. After you register, you have to create a workspace and invite colleagues to the service. Next, you are prompted to create \"channels\" with hashtags - which can be public for all your colleagues or only for some members - to discuss more than one aspect of the project.\n</p><p>You can tag someone in your conversation with an @ to bring something to their attention, pin a message, search for a message or files that have been shared by a team member, archive channels from active conversations and more. A free account lets you create one workspace with 5GB storage, a search feature that works with up to 10,000 messages, and the ability to connect up to ten cloud services like Asana, Google Drive, and more.\n</p><p>Alternatively, you can also use Flock, which lets you create group \"chats\". These real-time message boards can be used to share files, notes and to-dos. With a free account, you can have an unlimited number chats and channels, search up to 10,000 messages, make audio/video calls and connect with five web services, including Asana, Facebook Pages, Twitter and Google Calendar.\n</p><p># slack.com # flock.com\n</p><p>DESIGN COLLABORATION | Concept Board\n</p><p>If you work on marketing campaigns, product design, web/app development then try Concept Board that allows you to share digital designs with your colleagues via a web-based interface.\n</p><p>After you create a free account, invite your team to register with the service, and you can then create a whiteboard for collaboration.\n</p><p>It includes tools to import and embed content from your computer or cloud storage; scribble and highlight something on the mockups; leave a comment, tag a user to draw his/her attention to the pending job, and even leave sticky notes.\n</p><p>Once a comment has been addressed and resolved, all you have to do is click the Task button and mark it as done.\n</p><p>A free account lets you create an unlimited number of whiteboards, with 500MB storage and up to 50 objects in each. Upgrade to a paid plan and you also get video conferencing and screensharing capabilities.\n</p><p># conceptboard.com\n</p><p>PERSONAL/PRIVATE CLOUD | WD My Cloud Home\n</p><p>If you are not comfortable with storing confidential files on a third-party cloud service, you might want to look at the WD My Cloud Home. This storage device connects to your Wi-Fi router's Ethernet (RJ45) port.\n</p><p>To set it up, you will need to connect to the same wireless network with your laptop to create an account on mycloud.com and follow the on-screen instructions. This process is straightforward - the network drive is detected automatically after you register with My Cloud - and does not involve any advanced configuration.\n</p><span>After the My Cloud Home is set up, you can download files from it and even copy files onto it, wherever you are in the world, provided it is powered on and has an active internet connection.\n</span><br><span>\n</span><br><span>You will be able to access your files via mycloud.com or its app for Android and iOS handsets. You can create new folders, share files with other users, view recent upload/download activity and even connect to cloud services like Dropbox, OneDrive and Google Drive to import data stored there.\n</span><br><span>\n</span><br><span>This storage device also supports IFTTT, a web-based service, that lets you set up \"routines\" that run when certain conditions are met. For instance, you can create a routine to automatically back up photos every time you click a picture with your handset.\n</span><br><span>\n</span><br><span>The WD My Cloud Home is available in \"single\" and \"dual\" form factors. The latter (Duo) houses two hard drives that are configured, by default, as a \"RAID 1\" array. This means the second hard drive is a mirror of the first, so you will always have a backup in case one of the drives fail. However, you can opt out of this configuration (not recommended) by switching to the JBOD (Just a Bunch of Drives) mode to double storage space.\n</span><br><span>\n</span><p>My Cloud 2TB to 8TB (?16,500 onwards), My Cloud Duo 4TB to 12TB (?32,000 onwards)\n</p><span>\n</span></div>"
    },
    "adjectives": [
        "10",
        "left",
        "top",
        "right"
    ],
    "nouns": [
        "margin",
        "work",
        "india",
        "business",
        "border",
        "10",
        "left",
        "style",
        "top",
        "right",
        "photo"
    ],
    "verbs": [
        "work",
        "border",
        "align",
        "style",
        "top",
        "right"
    ]
}