{
    "creator": "Mithun Dasgupta",
    "title": "Adhunik Metaliks: NCLT allows 20 more days to complete insolvency process",
    "link": "https://www.financialexpress.com/industry/adhunik-metaliks-nclt-allows-20-more-days-to-complete-insolvency-process/1208229/",
    "pubDate": "Sat, 16 Jun 2018 03:44:05 +05:30",
    "dc:creator": "Mithun Dasgupta",
    "content": "Bankrupt Adhunik Metaliks has received an additional 20 days to complete the ongoing insolvency resolution process. ",
    "contentSnippet": "Bankrupt Adhunik Metaliks has received an additional 20 days to complete the ongoing insolvency resolution process.",
    "guid": "https://www.financialexpress.com/?p=1208229",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-15T22:14:05.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "adhunik",
            "metaliks",
            "nclt",
            "allows",
            "20",
            "more",
            "days",
            "to",
            "complete",
            "insolvency",
            "process"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Adhunik Metaliks: NCLT allows 20 more days to complete insolvency process",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1208231\" src=\"https://images.financialexpress.com/2018/06/1-58.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/1-58.jpg 660w, https://images.financialexpress.com/2018/06/1-58-300x200.jpg 300w, https://images.financialexpress.com/2018/06/1-58-620x413.jpg 620w, https://images.financialexpress.com/2018/06/1-58-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> NCLT has ordered exclusion of 20 days from the mandated 270-day deadline to Adhunik Metaliks</figure>\n\t\t\t</section></div><span>\n</span><p>Bankrupt Adhunik Metaliks has received an additional 20 days to complete the ongoing insolvency resolution process. The Kolkata bench of the National Company Law Tribunal (NCLT) on Friday ordered exclusion of 20 days from the mandated 270-day deadline under the corporate insolvency resolution process (CIRP) for the company, the flagship of the Adhunik Group.</p><span>\n</span><p>The resolution professional (RP) of the insolvent company, Sumit Binani, had urged the tribunal to exclude around 20 days from the stipulated 270-day deadline so that in this additional time the revised resolution plan of UK-based Liberty House could be considered. Earlier, the committee of creditors (CoC) had identified Liberty House as the highest bidder (H1).</p><span>\n</span><p>Notably, for the debt-laden steel maker, the stipulated deadline under the CIRP had expired on April 29, and during this period no resolution plan for the company was approved by its CoC. There are only two resolution applicants — Liberty House and Maharashtra Seamless of the DP Jindal Group. Liberty House’s offer currently stands at around `600 crore, sources said.</p><span>\n</span><p>“This application is allowed by excluding 20 days out of 270 days for completion of CIRP process of the corporate debtor with effect from the date of this order i.e. from 15.06.2018 till 06.07.2018,” said a division bench of the tribunal, comprising Justices Jinan KR and Madan B Gosavi.</p><span>\n</span><p>“The Committee of Creditors is hereby directed to consider the plan submitted by the Liberty House as well as the Maharashtra Seamless Limited’s resolution plan and approve any one of the plans as per the provision of the Code and submit before the bench on or before July 2,” the order stated.</p><span>\n</span><p>In his submission before the division bench of the tribunal, advocate Sidhartha Sharma, appearing on behalf of the RP on May 11, had said, “A lot of time has been lost while negotiating with Liberty House. The company has taken time to clarify its stand as an eligible resolution applicant under Section 29A of IBC.”</p><span>\n</span><p>As per the Insolvency and Bankruptcy Code (IBC) norms, an insolvent company is to be liquidated if during the moratorium of nine months no successful resolution plan is in place.</p><span>\n</span><p>For Zion Steel also the tribunal on Friday ordered exclusion of 20 days from the mandated 270-day deadline under the CIRP for the company. Liberty House is also the highest bidder in this case. This matter is also listed on July 2 for filing the progress report.</p><span>\n</span><p>Notably, bankruptcy proceedings against Adhunik Metaliks (AML), its subsidiary Orissa Manganese &amp; Minerals (OMML), and Adhunik Group company Zion Steel were admitted by the Kolkata bench of NCLT in August last year. The insolvency petitions had been filed by the State Bank of India (SBI).</p><span>\n</span><p>SBI, which leads the consortium of lenders to the companies, had in July last year filed insolvency petitions over non-payment of loans worth Rs 812 crore by AML and Rs 940 crore by OMML.</p><span>\n</span><p>The bank had also claimed dues from Zion Steel, as it was a co-obligator to the loans disbursed to AML and OMML under the provisions of the master restructuring agreement and the common loan agreement signed in March, 2014.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "received",
        "complete",
        "Bankrupt",
        "additional",
        "20",
        "ongoing"
    ],
    "verbs": [
        "complete",
        "process",
        "Bankrupt"
    ]
}