{
    "title": "ICICI Bank gets fresh whistleblower complaint on 31 loan accounts",
    "link": "https://www.business-standard.com/article/finance/icici-bank-gets-fresh-whistleblower-complaint-on-31-loan-accounts-118062300074_1.html",
    "pubDate": "Sat, 23 Jun 2018 02:55:00 +0530",
    "content": "The bank said that based on its investigations before the closure of accounts for the fiscal 2017-18, the claims have not been proven",
    "contentSnippet": "The bank said that based on its investigations before the closure of accounts for the fiscal 2017-18, the claims have not been proven",
    "guid": "https://www.business-standard.com/article/finance/icici-bank-gets-fresh-whistleblower-complaint-on-31-loan-accounts-118062300074_1.html",
    "isoDate": "2018-06-22T21:25:00.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.1,
        "tokens": [
            "icici",
            "bank",
            "gets",
            "fresh",
            "whistleblower",
            "complaint",
            "on",
            "31",
            "loan",
            "accounts"
        ],
        "words": [
            "complaint",
            "fresh"
        ],
        "positive": [
            "fresh"
        ],
        "negative": [
            "complaint"
        ]
    },
    "article": {
        "title": "ICICI Bank gets fresh whistleblower complaint on 31 loan accounts",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>India’s largest private sector lender <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/icici-bank\" target=\"_blank\">ICICI Bank </a>said another whistle-blower had accused it of having lax controls over operations. This is the third instance of such complaint. In the first two complaints, the bank’s Managing Director and Chief Executive Officer Chanda Kochhar is facing an inquiry by the board and is on leave till investigations are over. The latest complaint relates to the incorrect asset classification of 31 loan accounts, and alleges that interest income and recoveries from non-performing assets (NPA) have been accounted as fees.</p><p>\nIt also alleges that the bank overstated the value of mortgages offered for getting corporate loans.</p><p>\nThe amount outstanding against these accounts was Rs 60.82 billion as on March 31, 2018, or about 1.1 per cent of its advances book, the bank said in a notification to exchanges. However, the accounts referenced in the complaint were all classified as non-performing before December 31, 2017, it said.</p>\n <br>“All these loans had been classified as non-performing prior to the bank becoming aware of the complaint,” said the filing. It said classification of certain accounts as non-performing under Indian accounting rules were delayed in earlier years.<p>\nThe bank said that based on its investigations before the closure of accounts for the fiscal 2017-18, the claims have not been proven.</p><p>\nThe interim report of the inquiry was reviewed by the bank’s auditors, but “the findings in the interim report had no material impact on the financial statements for FY18,” the bank said. The interim report has also been submitted to the regulator, it said.</p>\n <br>The bank is facing a potential reputation risk due to conflict of interest allegations against Kochhar, pertaining to loans extended by the lender to the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=videocon+group\" target=\"_blank\">Videocon group.</a> <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=videocon+group\" target=\"_blank\">Videocon group </a>and its promoter Venugopal Dhoot had business relations with NuPower Renewables, owned by Chanda Kochhar’s husband Deepak Kochhar.<p>\n“An inquiry was instituted as per the Whistle Blower Policy of the Bank under the supervision of the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=audit+committee\" target=\"_blank\">Audit Committee </a>of the Board of Directors, without involvement of the senior management other than Internal Audit. The inquiry was carried out by Head of the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=internal+audit+group\" target=\"_blank\">Internal Audit Group </a>under the supervision of the Audit Committee,” said the bank adding that the statutory auditors were provided periodic updates and their inputs were factored into the inquiry process.</p>\n <br>\n<!-- INPAGE_BANNER -->\nThe first whistle-blower complaint came from <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/icici-bank\" target=\"_blank\">ICICI Bank </a>and Videocon shareholder <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/arvind-gupta\" target=\"_blank\">Arvind Gupta </a> alleging that a corrupt nexus between Kochhar’s dealings with Dhoot and his family was well established. While the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=videocon+nupower+deal\" target=\"_blank\">Videocon-NuPower deal </a>was first brought to notice two years ago in 2016, it has only been in the limelight since the last few months.\n <br>Following the second whistleblower complaint, the bank board appointed former Supreme Court judge B N Srikrishna to probe allegations of conflict of interest against Kochhar. He will be aided by a number of internal and external ‘experts’ to complete the investigation.<p>\nEarlier this week, the bank appointed Sandeep Bakhshi as whole-time director and chief operating officer (COO) for five years.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "proven",
        "18",
        "fiscal",
        "fresh",
        "31",
        "based"
    ],
    "nouns": [
        "complaint",
        "Bank",
        "bank",
        "loan",
        "whistleblower",
        "18",
        "closure"
    ],
    "verbs": [
        "Bank",
        "bank",
        "loan",
        "closure"
    ]
}