{
    "title": "No tariff concessions for US imports: Government",
    "link": "https://timesofindia.indiatimes.com/business/india-business/no-tariff-concessions-for-us-imports-government/articleshow/64515642.cms",
    "pubDate": "Sat, 09 Jun 2018 01:36:39 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/no-tariff-concessions-for-us-imports-government/articleshow/64515642.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64515642.cms\" /></a>Ahead of commerce and industry minister Suresh Prabhu’s US trip for discussions with trade officials, the government has ruled out any tariff concessions for American imports, arguing that import duties are well within the limits agreed under WTO rules.",
    "contentSnippet": "Ahead of commerce and industry minister Suresh Prabhu’s US trip for discussions with trade officials, the government has ruled out any tariff concessions for American imports, arguing that import duties are well within the limits agreed under WTO rules.",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/no-tariff-concessions-for-us-imports-government/articleshow/64515642.cms",
    "isoDate": "2018-06-09T01:36:39.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.14285714285714285,
        "tokens": [
            "no",
            "tariff",
            "concessions",
            "for",
            "us",
            "imports",
            "government"
        ],
        "words": [
            "no"
        ],
        "positive": [],
        "negative": [
            "no"
        ]
    },
    "article": {
        "title": "No tariff concessions for US imports: Government",
        "content": "<div class=\"section1\"><div class=\"Normal\"><p>NEW DELHI: Ahead of commerce and industry minister Suresh Prabhu’s US trip for discussions with trade officials, the government has ruled out any tariff concessions for American imports, arguing that import duties are well within the limits agreed under World Trade Organisation (WTO) rules.\n\n</p><p>Sources told TOI that the main thrust from the Indian point of view was going to be on restoration of some of the benefits under the Generalised System of Preferences and getting the American side to drop the higher import duty on steel products. But given the Donald Trump administration’s stance, Prabhu was candid enough to acknowledge that he would be “explaining” India’s position. “There are no big expectations, but we will try to find solutions to the problem,” he told reporters.\n</p><p>The commerce minister flies to Washington next week to meet his counterparts commerce secretary Wilbur Ross and US trade representative Robert Lighthizer at a time when the US is tightening visa rules, raising import duties and dragging India to the WTO on a variety of issues, including the export incentive schemes. The visit, which was organised at short notice, will try to bring about some understanding or resolution on a number of issues.\n</p><p>A couple of big issues dominate the landscape — of which Harley Davidson motorcycles are the most visible. US President Donald Trump scoffed at PM Narendra Modi’s offer to bring down tariffs on these bikes from 75% to 50%. Senior officials in the Indian government said Modi had been ill-advised on that front.\n</p><span>\n</span><br><span>US officials said, on condition of anonymity, that it is a relatively trivial issue, but it had caught the attention of Trump. They hinted that if India were to show flexibility on Harley-Davidsons, the US could move on other ticklish issues. Questioned, Prabhu said, “Every country has a right to demand the best deal for itself. So if the US has some demands on the Harley Davidson, as I have seen reported, let us see what they are. So far we have not heard formally on this issue, so we will go for talks and understand their concerns and deal with them appropriately.”\n</span><br><span>\n</span><br><span>Prabhu will also have his hands full, trying to resolve Indian price caps on medical devices like stents, pork imports, data localisation, where India is refusing to allow mirroring particularly to fintech companies, as well as on export subsidies, where US says India is not WTO-compliant, but India says it is. Prabhu said, when asked, “those measures are not subsidies and instead ways to partially offset various additional costs incurred by them (exporters). Our export support regime is not violating any of the WTO rules,” he said. “We are also working to make sure that there is a proper clarity on this. But what we are doing today is not violating any WTO rule,” he added.\n</span><br><span>\n</span><br><span>Prabhu said he would raise the issues of professional H-1B visas and H4 visas with his counterparts. “We will be raising the visa issue because we feel that Indians and their spouses are facing some issues there,” he said. India may be joining the world in criticising US’ new protectionism, but officials there say the US is still more open. Instead, they say India’s recent moves such as slapping tariffs on auto components are prompting US automotive companies to consider moving out of India to other countries like Thailand and Vietnam. Tesla and General Motors have been “scared away”.\n</span><br><span>\n</span><br><span>Washington may also slap sanctions on India for buying Russian missiles under its new law, CAATSA. India has declared it would not stop buying the Russian S-400 Triumf systems, prompting hectic discussions between US and India.\n</span><br><span>\n</span></div></div>"
    },
    "adjectives": [
        "top",
        "10",
        "agreed",
        "Ahead",
        "left",
        "right",
        "No",
        "no",
        "ruled",
        "American"
    ],
    "verbs": [
        "import",
        "trade",
        "top",
        "minister",
        "border",
        "align",
        "style",
        "right",
        "tariff",
        "trip"
    ],
    "nouns": [
        "industry",
        "india",
        "import",
        "trade",
        "top",
        "10",
        "business",
        "minister",
        "Government",
        "government",
        "commerce",
        "US",
        "us",
        "margin",
        "border",
        "left",
        "style",
        "right",
        "photo",
        "No",
        "no",
        "tariff",
        "trip",
        "arguing",
        "WTO",
        "American"
    ]
}