{
    "title": "Bankruptcy code to eliminate ‘fly-by-night’ developers: Arun Jaitley",
    "link": "https://timesofindia.indiatimes.com/business/india-business/bankruptcy-code-to-eliminate-fly-by-night-developers-jaitley/articleshow/64515653.cms",
    "pubDate": "Sat, 09 Jun 2018 01:39:58 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/bankruptcy-code-to-eliminate-fly-by-night-developers-jaitley/articleshow/64515653.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64515653.cms\" /></a>Arun Jaitley said just as the film industry, in the last few years, has increasingly formalised itself, the real estate industry would eventually have to formalise, and sound and structured real estate developers would remain.",
    "contentSnippet": "Arun Jaitley said just as the film industry, in the last few years, has increasingly formalised itself, the real estate industry would eventually have to formalise, and sound and structured real estate developers would remain.",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/bankruptcy-code-to-eliminate-fly-by-night-developers-jaitley/articleshow/64515653.cms",
    "isoDate": "2018-06-09T01:39:58.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.375,
        "tokens": [
            "bankruptcy",
            "code",
            "to",
            "eliminate",
            "‘fly-by-night’",
            "developers",
            "arun",
            "jaitley"
        ],
        "words": [
            "bankruptcy"
        ],
        "positive": [],
        "negative": [
            "bankruptcy"
        ]
    },
    "article": {
        "title": "Bankruptcy code to eliminate ‘fly-by-night’ developers: Arun Jaitley",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>NEW DELHI: Union minister </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Arun-Jaitley\">Arun Jaitley</a><span> said on Friday that the </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/insolvency-and-bankruptcy-code\">Insolvency and Bankruptcy Code</a><p> (IBC) will help eliminate “fly by night” operators, projects would be completed in reasonable time and investors would get their share of allotments expeditiously. “Construction is already growing at a double digit growth. RERA and the new ordinance would only catalyse this process further,” he said in a blog. Jaitley is currently recovering from a kidney transplant surgery.\n\n</p><p>He said just as the film industry, in the last few years, has increasingly formalised itself, the real estate industry would eventually have to formalise, and sound and structured real estate developers would remain. Jaitley said the new ordinance equates an “allottee” of a “real estate project” to be a person having a commercial effect of borrowing.\n</p><p>“He is now treated as financial creditor. He can initiate a corporate insolvency for a resolution against the errant developer. He acquires the right to be on the committee of creditors. He gets voting right. He can influence the resolution process. In the unlikely eventuality of liquidation, he stands at par with other financial creditors,” he said.\n</p><p>The minister said that given the logistical problems, liquidations are rarely likely to take place in asset owning companies and resolution would be the natural course.\n</p><span>“In a resolution, probably some other developer would acquire an interest or some alternative method would be found to complete the project. The inevitable consequence of this would be that the market itself will discover solutions,” the minister said.\n</span><br><span>\n</span><br><span>He said that post 1991 economic liberalisation, there has been a phenomenal growth in the creation of new townships, urbanisation and more particularly sub-urbanisation.\n</span><br><span>\n</span><br><span>“This trend is likely to accelerate. Economic growth gives rise to aspirations. More </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/purchasing-power\">purchasing power</a><span>, migration from rural areas and aspiration to improve the quality of life are increasing. In and around major townships, massive real estate projects have been coming up,” he said.\n</span><br><span>\n</span><br><span>Jaitley said many of these projects are by professional real estate developers but this is also an area where many “fly by night” operators have entered. He said some developers have very little resources of their own and they use the home buyer’s money to develop, invest in land banks and then get caught in a debt trap.\n</span><br><span>\n</span><br><span>“The </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/home-buyer\">home buyer</a><p> is the worst sufferer. He has a triple whammy. He has invested his savings with the developer. He may be paying EMIs on the loans taken and may continue to pay either rent of his currently occupied property or live in some alternate accommodation under compulsion,” Jaitley said, adding that the insolvency and bankruptcy code and RERA will help alleviate the woes faced by home buyers. \n</p><span>\n</span></div></div>"
    },
    "adjectives": [
        "formalised",
        "10",
        "structured",
        "last",
        "left",
        "top",
        "real",
        "right",
        "fly",
        "just",
        "few",
        "sound"
    ],
    "nouns": [
        "margin",
        "years",
        "Bankruptcy",
        "bankruptcy",
        "industry",
        "india",
        "border",
        "10",
        "last",
        "left",
        "top",
        "estate",
        "real",
        "business",
        "style",
        "right",
        "photo",
        "code",
        "fly",
        "night",
        "film",
        "few",
        "sound"
    ],
    "verbs": [
        "eliminate",
        "formalise",
        "border",
        "last",
        "top",
        "style",
        "right",
        "align",
        "code",
        "fly",
        "film",
        "sound",
        "remain"
    ]
}