{
    "title": "Banks are not providing adequate foreign exchange at market rates to SMEs",
    "link": "https://www.business-standard.com/article/economy-policy/banks-are-not-providing-adequate-foreign-exchange-at-market-rates-to-smes-118062300040_1.html",
    "pubDate": "Sat, 23 Jun 2018 06:58:00 +0530",
    "content": "SMEs at large do not understand foreign exchange and the concept of hedging, which banks often take advantage of",
    "contentSnippet": "SMEs at large do not understand foreign exchange and the concept of hedging, which banks often take advantage of",
    "guid": "https://www.business-standard.com/article/economy-policy/banks-are-not-providing-adequate-foreign-exchange-at-market-rates-to-smes-118062300040_1.html",
    "isoDate": "2018-06-23T01:28:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.08333333333333333,
        "tokens": [
            "banks",
            "are",
            "not",
            "providing",
            "adequate",
            "foreign",
            "exchange",
            "at",
            "market",
            "rates",
            "to",
            "smes"
        ],
        "words": [
            "adequate"
        ],
        "positive": [
            "adequate"
        ],
        "negative": []
    },
    "article": {
        "title": "Banks are not providing adequate foreign exchange at market rates to SMEs",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/banks\" target=\"_blank\">Banks </a>are not providing adequate <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/foreign-exchange\" target=\"_blank\">foreign exchange </a>at market rates to small firms, despite being reprimanded by the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/reserve-bank-of-india\" target=\"_blank\">Reserve Bank of India </a>(RBI).</p>\n<p>\n\tThe situation is somewhat better with public sector (PSU) <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/banks\" target=\"_blank\">banks.</a> But private and foreign <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/banks\" target=\"_blank\">banks </a>are charging their small and medium enterprise (SME) customers exorbitant rates, with no scope of negotiation, said several <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/smes\" target=\"_blank\">SMEs </a>and currency consultants. Executives at the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/smes\" target=\"_blank\">SMEs </a>didn’t want to get identified as they are heavily dependent on banks for financial needs.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/smes\" target=\"_blank\">SMEs </a>at large do not understand <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/foreign-exchange\" target=\"_blank\">foreign exchange </a>and the concept of hedging, which banks often take advantage of.</p>\n<p>\n\tIn April 2015, the RBI’s then executive director <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=g+padmanabhan\" target=\"_blank\">G Padmanabhan </a>had warned banks against charging high rates from SMEs.</p>\n<p>\n\t“Not only there appears to be a wide variation amongst the banks in the charges levied on smaller customers, there also appears to be complete lack of transparency regarding information on the charges levied,” Padmanabhan had said. <br><a href=\"https://mybs.in/2VniFeY\" target=\"_blank\"><strong>ALSO READ: Aditya Birla Finance bets on SMEs as it looks to expand to 50 cities</strong></a></p>\n<p>\n\tPSU banks largely became reasonable after that. But private and foreign banks have reverted to their old practices.</p>\n<p>\n\tIn 2014-15, the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rbi\" target=\"_blank\">RBI </a>made it semi-mandatory to hedge every <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/foreign-exchange\" target=\"_blank\">foreign exchange </a>transaction, in the absence of which loans commanded a higher risk weightage for banks. Lenders started arm-twisting clients to hedge, but at a rate offered by banks. Otherwise, the other line of rupee credit was also getting choked.<br></p>\n<!-- INPAGE_BANNER -->\n\t \n<p>\n\tBanks no longer care to ask clients to hedge unless the foreign exchange transaction involved is substantial. However, the root problem of exorbitant rates, almost at par with retail, has not been addressed.</p>\n<p>\n\t“SMEs are indeed charged very high commission on <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/forex\" target=\"_blank\">forex </a>conversion. While large companies pay quarter to half paisa, small companies pay anywhere between 5 and 250 paise. Whereas, the reasonable amount for their size should be 2 to 6 paise,” said Samir Lodha, managing director of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=quantart+markets+solutions\" target=\"_blank\">QuantArt Markets Solutions.</a> <br><a href=\"https://mybs.in/2VnhKJU\" target=\"_blank\"><strong>ALSO READ: Sequoia Capital, others open $15-mn tap for Drip Capital's trade financing</strong></a><br></p>\n<p>\n\tAccording to an executive with a company engaged in building machines for converting pulps into papers, nobody in the firm has any knowledge about foreign exchange, but have to engage in such transactions regularly and banks exploit that.</p>\n<p>\n\t“There is no one to handhold us, so we go by whatever banks offer us. We know the rates we see on websites are what we will get, but nobody explains why we are charged more. We don’t want to antagonise banks by challenging the quotations,” said the official.</p>\n<p>\n\tIn case of exporters, who generally have a better understanding of foreign exchange than importers,  the situation is equally bad.</p>\n<p>\n\t“Quite often banks offer us rates (to buy dollars from the exporter) much below market rates. We cannot sell foreign exchange somewhere else, as most transactions happen through banks,” said an executive of an export-oriented SME.</p>\n<p>\n\tAjay Sahai, director-general and CEO of the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/federation-of-indian-export-organisations\" target=\"_blank\">Federation of Indian Export Organisations </a>(FIEO), agreed that small firms are at disadvantage in meeting their foreign exchange needs. <br><a href=\"https://mybs.in/2VndADh\" target=\"_blank\"><strong>ALSO READ: CRISIL SME TRACKER: Testing times for small electrical equipment makers</strong></a><br></p>\n<p>\n\t“There is no cap on how much a bank can charge interest on foreign exchange loans or products. Banks treat SMEs as riskier clients than large corporates, even as NPA numbers point out the opposite, and this results in SMEs getting a rough deal on exchanges,” said Sahai.</p>\n<p>\n\tBankers say it won’t be right to blame them for the differential. They say the fixed cost remains the same, no matter the size of the loan.</p>\n<p>\n\t“So, the smaller the foreign exchange need, the higher the cost in relative terms. When seen in isolation, rates look exaggerated vis-a-vis a large firm’s rates. Unfortunately, we cannot change this unless there is a separate structure mandated specifically for SMEs,” said a private sector banker.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "adequate",
        "foreign",
        "large"
    ],
    "nouns": [
        "market",
        "Banks",
        "banks",
        "exchange",
        "rates",
        "large",
        "concept",
        "hedging",
        "advantage"
    ],
    "verbs": [
        "market",
        "exchange",
        "understand",
        "advantage"
    ]
}