{
    "title": "Looking to invest? Small savings schemes back in favour with Indian public",
    "link": "https://www.business-standard.com/article/economy-policy/investments-in-small-savings-schemes-rise-to-rs-1-55-trillion-in-2017-18-118061600052_1.html",
    "pubDate": "Sat, 16 Jun 2018 10:39:00 +0530",
    "content": "Among other factors responsible, the real estate sector is unable to offer returns to the public owing to a crisis after demonetisation, implementation of GST, and creation of a real estate regulator",
    "contentSnippet": "Among other factors responsible, the real estate sector is unable to offer returns to the public owing to a crisis after demonetisation, implementation of GST, and creation of a real estate regulator",
    "guid": "https://www.business-standard.com/article/economy-policy/investments-in-small-savings-schemes-rise-to-rs-1-55-trillion-in-2017-18-118061600052_1.html",
    "isoDate": "2018-06-16T05:09:00.000Z",
    "sentiment": {
        "score": 3,
        "comparative": 0.25,
        "tokens": [
            "looking",
            "to",
            "invest?",
            "small",
            "savings",
            "schemes",
            "back",
            "in",
            "favour",
            "with",
            "indian",
            "public"
        ],
        "words": [
            "favour",
            "savings"
        ],
        "positive": [
            "favour",
            "savings"
        ],
        "negative": []
    },
    "article": {
        "title": "Looking to invest? Small savings schemes back in favour with Indian public",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tConfirming the recent shift in public preference for parking money in financial instruments like mutual funds and insurance schemes rather than bank deposits and physical assets, small <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/savings\" target=\"_blank\">savings </a>schemes have re-emerged as a lucrative investment option for the Indian public.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/investments\" target=\"_blank\">Investments </a>by the public in small <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/savings\" target=\"_blank\">savings </a>schemes rose to Rs 1.55 trillion in 2017-18, a 33 per cent rise over Rs 1.17 trillion in 2016-17,  the data with the National <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/savings\" target=\"_blank\">Savings </a>Institute (NSI) accessed by Business Standard shows.</p>\n<p>\n\tMore importantly, contributions to the National Small Savings Fund—a pool of all small savings schemes—have reached a record in 2017-18 from a meagre Rs 30 billion in 2011-12, a fifty-fold rise in annual accruals in seven years. Small savings had seen a drastic drop from 2009-10 to 2011-12.</p>\n<p>\n\tThe sharp rise in small savings as an investment option in recent years comes at a time when the contribution of household savings to the country’s gross domestic product is declining. Further, this uptick is in consonance with a near-60 per cent rise in net inflows to mutual funds in 2017-18, according to the Securities and Exchange Board of India data.</p>\n<p>\n\tThe NSSF collects public <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/investments\" target=\"_blank\">investments </a>in instruments such as the post office savings deposits, National Saving Certificates, Public Provident Fund (PPF), Kisan Vikas Patra, Senior Citizen Small Savings Scheme and the Sukanya Samriddhi Yojana. </p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/international/spending-by-savings-rich-elderly-on-grandkids-boosting-japan-s-economy-118061400193_1.html\" target=\"_blank\">Spending by savings-rich elderly on grandkids boosting Japan's economy</a></strong></p>\n<p>\n\t“Except National Savings Certificates, which saw a fall in preference in 2017-18, all other schemes have witnessed a rise, with post office savings deposits and PPF posting the highest growth rates,” a senior finance ministry official told Business Standard. The data on small savings published separately by the Reserve Bank of India sourced from the finance ministry does not match the provisional data with the NSI since the government changed the method of sharing data with the RBI from gross NSSF receipts to net NSSF receipts from April 2017 (FY18), sources said. </p>\n<p>\n\tSavings and fixed (term) deposits in banks—which are the first points of financial savings for individuals and households after holding cash—posted record low growth in 2017-18 due to the large base effect of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/demonetisation\" target=\"_blank\">demonetisation </a>in 2016-17, which, experts said, is the biggest reason for the rise in preference for small savings in recent years.</p>\n<p>\n\t“Oversupply in deposits reduced the returns on bank deposits, and made financial instruments such as mutual funds and small savings a better option to invest in due to the high return on investment,” Dharmakirti Joshi, chief economist at Crisil, a ratings agency, told <em>Business Standard</em>. <br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/investment-proposals-under-m-sips-drop-to-rs-914-bn-in-april-as-firms-exit-118061401219_1.html\" target=\"_blank\">Investment proposals under M-SIPS drop to Rs 914 bn in April as firms exit</a></strong></p>\n<p>\n\tFrom June 1, investment in National Savings Certificate fetches an investor 7.6 per cent annually, that in Kisan Vikas Patra 7.3 per cent over 11 months, while the Sukanya Samriddhi Yojana for young women earns 8.1 per cent annually. In contrast, term or fixed deposits in banks earn interest at 6.25 per cent over a year as of today. Experts also said that a shift from bank deposits to small savings is also representative of the people’s declining trust in banks. Stressed balance sheets of banks have reduced the size of their loan book, thereby reducing returns on lending, and reducing their appetite for high deposit growth.</p>\n<p>\n\tAmong other factors, the real estate sector is unable to offer returns to the public owing to a crisis after demonetisation, implementation of the goods and services tax, and creation of a real estate regulator. Further, gold prices have moderated, making it less attractive as investment, observers said.</p>\n<p>\n\tIn almost the same period when annual NSSF contributions rose fifty-fold, annual average consumer price index-based inflation dropped from 10  per cent in 2012-13 to 3.6 per cent in 2017-18. The real interest earned on financial instruments that pay a flat interest rate, including small savings schemes, thus increased during the period. As for the utilisation of the NSSF by the government, it invested Rs 1.08 trillion in central government securities, Rs 650 billion in Food Corporation of India, Rs 200 billion in the National Highways Authority of India, Rs 100 billion in Indian Railways Finance Corporation, Rs 92 billion in state government securities, Rs 80 billion in the Pradhan Mantri Awas Yojana and Rs 30 billion in Air India, all at a higher interest rate than the rate of return for the public.<br></p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t<img align=\"left\" alt=\"Investments in small savings schemes rise to Rs 1.55 trillion in 2017-18\" class=\"imgCont\" height=\"333\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/16/full/1529096603-7102.jpg\" title=\"Investments in small savings schemes rise to Rs 1.55 trillion in 2017-18\" width=\"620\"></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Indian",
        "Looking",
        "real",
        "Small",
        "back",
        "public",
        "responsible",
        "unable",
        "owing"
    ],
    "nouns": [
        "Indian",
        "Looking",
        "implementation",
        "savings",
        "real",
        "Small",
        "back",
        "favour",
        "public",
        "estate",
        "sector",
        "offer",
        "crisis",
        "demonetisation",
        "creation",
        "regulator"
    ],
    "verbs": [
        "invest",
        "back",
        "favour",
        "offer"
    ]
}