{
    "creator": "FE Bureau",
    "title": "Market Jitters: Bond yield past 8% 1st time in 3 years",
    "link": "https://www.financialexpress.com/market/market-jitters-bond-yield-past-8-1st-time-in-3-years/1199356/",
    "pubDate": "Sat, 09 Jun 2018 03:42:42 +05:30",
    "dc:creator": "FE Bureau",
    "content": "The yield on the benchmark bond soared past 8% in intra-day trade on Friday before closing at 7.94% even as the rupee weakened to 67.51 against the dollar, losing 35 paise over Thursday’s closing. ",
    "contentSnippet": "The yield on the benchmark bond soared past 8% in intra-day trade on Friday before closing at 7.94% even as the rupee weakened to 67.51 against the dollar, losing 35 paise over Thursday’s closing.",
    "guid": "https://www.financialexpress.com/?p=1199356",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-08T22:12:42.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "market",
            "jitters",
            "bond",
            "yield",
            "past",
            "8",
            "1st",
            "time",
            "in",
            "3",
            "years"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Market Jitters: Bond yield past 8% 1st time in 3 years",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img src=\"https://images.financialexpress.com/2018/06/bse-1.jpg\" alt=\"market, market news, equity market, equity prices, equity indices, equity index, macro economic data, industrial production, inflation, crude oil prices, indusind bank\" class=\"size-full wp-image-1199361\" srcset=\"https://images.financialexpress.com/2018/06/bse-1.jpg 660w, https://images.financialexpress.com/2018/06/bse-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/bse-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/bse-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Last crossed 8% in intra-day trade in May 2015; rupee too falls on dollar demand, uncertain capital flows.</figure>\n\t\t\t</section></div><span>\n</span><p>The yield on the benchmark bond soared past 8% in intra-day trade on Friday before closing at 7.94% even as the rupee weakened to 67.51 against the dollar, losing 35 paise over Thursday’s closing. At one point during the day, the Indian currency had dropped to a low of 67.78 against the greenback. Traders are apprehensive rising crude oil prices would widen both the trade and fiscal deficits. </p><span>\n</span><p>The yield had last crossed 8% in intra-day trade on May 8, 2015, when it touched 8.006%; on Friday it hit 8.033%. Ananth Narayan, professor (finance), SPJIMR, pointed out emerging market currencies had weakened overnight, which impacted the rupee in early trade. </p><span>\n</span><p>“The rupee continued to weaken through the day on the back customer demand for dollars, until likely <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a> (Reserve Bank of India) intervention arrested the decline,” Narayan said. He added that the rupee continues to face the pressure of a rising current account deficit and uncertain capital flows, and now depends on the RBI for support. Foreign portfolio investors (FPIs) have been sellers in both the bond and equity markets; in June so far, bonds worth $71 million have been offloaded on top of sales of $2.6 billion in May. FPIs have taken risk off the table in the equities market too, having sold shares worth $1.4 billion in May and $411 million in June so far. </p><span>\n</span><p>Yields retreated from highs as traders probably rushed to cover the short positions built after the central bank’s rate hike, Bloomberg reported citing PNB Gilts. The agency said the move was also helped by speculation the government may take some measures to support the market.</p><span>\n</span><p><img src=\"https://images.financialexpress.com/2018/06/bse-2.jpg\" alt=\"\" width=\"660\" height=\"2152\" class=\"alignnone size-full wp-image-1199362\" srcset=\"https://images.financialexpress.com/2018/06/bse-2.jpg 660w, https://images.financialexpress.com/2018/06/bse-2-61x200.jpg 61w, https://images.financialexpress.com/2018/06/bse-2-127x413.jpg 127w, https://images.financialexpress.com/2018/06/bse-2-82x267.jpg 82w\" sizes=\"(max-width: 660px) 100vw, 660px\"></p><span>\n</span><p>“It seems like a lot of people were waiting for the yield to touch 8% to buy,” said Vijay Sharma, executive vice-president for fixed income at PNB Gilts in New Delhi. “It doesn’t look like it’s going to be a long-lasting rally, because even though current levels are attractive, huge local and global uncertainties make it difficult to take a call on where the yield will peak.” </p><span>\n</span><p>Nonetheless, with the central bank having raised its inflation forecast for 2018-19, banks are reluctant buyers of sovereign debt. The bond markets have been rattled for nearly six months now — the yield has now jumped nearly150 basis points between August and now — on fears of inflation and further tightening by the RBI. The huge mark-to market losses sustained by banks, who are biggest holders of gilts, as a result of the rising yields has further spooked them.</p><span>\n</span><p>Experts said the late evening rally on Friday was unlikely to sustain too long unless there was clear evidence crude oil prices would come off substantially. While the central bank said on Wednesday, in its monetary policy announcement, that it would retain a neutral stance for the present, the hike in the repo of 25 basis points (bps) taking it to 6.25% has made treasurers cautious. </p><span>\n</span><p>Experts believe that after a 25 bps hike each in the repo and reverse repo rates by the Monetary Policy Committee (MPC), another hike is on the cards. Nomura India chief economist Sonal Varma is of the opinion that both growth and inflation are likely to head higher in the coming months, paving the path for another 25 bps hike in August, “However, the ongoing tightening of financial conditions, higher oil prices and political uncertainty are likely to slow economic activity after September, in our view,” Varma said.</p><span>\n</span><p>DK Joshi, chief economist at Crisil, observed that with somewhat tighter liquidity in the banking system, rates on the commercial paper borrowings have hardened nearly 90 bps so far in 2018 and 40 bps since the previous policy. “Meanwhile, banks have also started raising their deposit and loan rates after nearly a four-year rate easing cycle,” he said.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "even",
        "past",
        "1st",
        "closing",
        "94",
        "weakened",
        "67",
        "51",
        "35"
    ],
    "nouns": [
        "Market",
        "benchmark",
        "years",
        "even",
        "past",
        "Bond",
        "bond",
        "yield",
        "time",
        "day",
        "trade",
        "Friday",
        "closing",
        "rupee",
        "dollar",
        "Thursday",
        "Jitters"
    ],
    "verbs": [
        "Market",
        "even",
        "Bond",
        "bond",
        "yield",
        "time",
        "trade"
    ]
}