{
    "creator": "PTI",
    "title": "Currency with public doubles from demonetisation low; hits record at over Rs 18 lakh cr",
    "link": "https://www.financialexpress.com/economy/currency-with-public-doubles-from-demonetisation-low-hits-record-at-over-rs-18-lakh-cr/1200356/",
    "pubDate": "Sun, 10 Jun 2018 10:40:34 +05:30",
    "dc:creator": "PTI",
    "content": "This high level of currency available with the public is in sharp contrast to the reported cash crunch in various parts of the country a few months ago. There has been a fear that hoarding or accumulation of large amounts of cash for various reasons could have triggered an artificial currency crunch.",
    "contentSnippet": "This high level of currency available with the public is in sharp contrast to the reported cash crunch in various parts of the country a few months ago. There has been a fear that hoarding or accumulation of large amounts of cash for various reasons could have triggered an artificial currency crunch.",
    "guid": "https://www.financialexpress.com/?p=1200356",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-10T05:10:34.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "currency",
            "with",
            "public",
            "doubles",
            "from",
            "demonetisation",
            "low",
            "hits",
            "record",
            "at",
            "over",
            "rs",
            "18",
            "lakh",
            "cr"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Currency with public doubles from demonetisation low; hits record at over Rs 18 lakh cr",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1200363\" src=\"https://images.financialexpress.com/2018/06/demonetisation-1-620x413.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/demonetisation-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/demonetisation-1-620x413-300x200.jpg 300w, https://images.financialexpress.com/2018/06/demonetisation-1-620x413-401x267.jpg 401w\" sizes=\"(max-width: 620px) 100vw, 620px\"> Currency with the public has reached a record high level of over Rs 18.5 lakh crore, more than double from a low of about Rs 7.8 lakh crore it had hit post-demonetisation decision in late 2016, as per RBI data. (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>Currency with the public has reached a record high level of over Rs 18.5 lakh crore, more than double from a low of about Rs 7.8 lakh crore it had hit post-demonetisation decision in late 2016, as per <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a> data. At the same time, the total currency put in circulation by the Reserve Bank has also more than doubled to over Rs 19.3 lakh crore — from a low of about Rs 8.9 lakh crore post- demonetisation. Currency with the public is arrived at after deducting cash with banks from total currency in circulation. This high level of currency available with the public is in sharp contrast to the reported cash crunch in various parts of the country a few months ago. There has been a fear that hoarding or accumulation of large amounts of cash for various reasons could have triggered an artificial currency crunch. The figures for both ‘currency with the public’ and ‘currency in circulation’ have also exceeded the levels seen before the government’s demonetisation decision on November 8, 2016, that saw nearly 86 per cent of the currency in circulation at that time being invalidated overnight by scrapping the then Rs 500/1,000 banknotes.</p><span>\n</span><p>The public was given time to deposit the invalidated notes in banks, which saw nearly 99 per cent of banned notes coming back into the system. As per the RBI’s latest disclosure in this regard, people had returned Rs 15.28 lakh crore as on June 30, 2017, of the Rs 15.44 lakh crore banned currency, or 98.96 per cent, of the scrapped notes to the banking system. Since then, the RBI has introduced new denominations of Rs 2,000 and Rs 200, among others, besides a new Rs 500 note. After the recent cash crunch, the government had announced that printing of Rs 500 notes would be stepped up. While the RBI is yet to announce its final word on processing and verification of all the returned notes, the latest ‘money supply’ data from the central bank puts the “currency with the public” at over Rs 18.5 lakh crore as on May 25, 2018 — up more than 31 per cent from year-ago level.</p><span>\n</span><p>This is an over two-fold jump from Rs 7.8 lakh crore as on December 9, 2016 — the lowest level it had seen after the announcement of the demonetisation decision as people rushed to deposit the scrapped notes with banks and the RBI. Prior to demonetisation, the currency with the public stood at about Rs 17 lakh crore. In terms of ‘currency in circulation’, the RBI puts the latest figure at over Rs 19.3 lakh crore as on June 1, 2018 — again a jump of about 30 per cent from the year-ago level, according to the ‘reserve money’ data released by the central bank. This also marks an over two-fold rise from a low of Rs 8.9 lakh crore as on January 6, 2017 — the lowest level it saw post-demonetisation. The current level of currency in circulation is also above the pre-demonetisation figure of Rs 17.9 lakh crore as on November 5, 2016.</p><span>\n</span><p>The RBI publishes the figures for currency in circulation on a weekly basis, while the currency with the public comes out every fortnight. An analysis of historic data shows that the currency with the public stood at about Rs 13 lakh crore before the Modi government took charge in May 2014. It rose to over Rs 14.5 lakh crore in a year and then further to close to Rs 16.7 lakh crore by May 2016. The figure crossed Rs 17 lakh crore level by October that year, before starting to decline due to demonetisation. The figure again came back above Rs 10 lakh crore by February 2017 and crossed Rs 15 lakh crore mark in September last year.</p><span>\n</span><p>A similar trend was seen in the currency in circulation figure, which dropped sharply from November 2016 till early January 2017 due to demonetisation, before starting to go up. The total money supply, described as M3 by the RBI, now stands at over Rs 140 lakh crore — nearly 11 per cent higher than the year-ago level. It stood at about Rs 120 lakh crore during the demonetisation period and was below Rs 100 lakh crore level before the Modi government came to power.</p><span>\n</span><p>The M3 includes currency with the public, deposit money of the public (demand deposits with the banking system plus ‘other’ deposits with the RBI) and the time deposits with the banking system. This figure is equivalent to the net bank credit to the government, plus the bank credit to the commercial sector, plus net foreign exchange assets of the banking sector, plus government’s currency liabilities to the public, minus the net non-monetary liabilities of the banking sector. The government’s currency liabilities to the public comprise rupee coins and small coins.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "high",
        "public",
        "18",
        "low",
        "level",
        "sharp",
        "available",
        "reported",
        "various",
        "few",
        "ago",
        "large",
        "artificial"
    ],
    "nouns": [
        "high",
        "public",
        "doubles",
        "low",
        "Currency",
        "currency",
        "18",
        "demonetisation",
        "record",
        "lakh",
        "cr",
        "contrast",
        "level",
        "sharp",
        "crunch",
        "cash",
        "few",
        "parts",
        "country",
        "fear",
        "There",
        "hoarding",
        "accumulation",
        "large"
    ]
}