{
    "title": "Domestic macro data like IIP, CPI and global cues to drive market this week",
    "link": "https://www.business-standard.com/article/markets/domestic-macro-data-like-iip-cpi-and-global-cues-to-drive-market-this-week-118061000162_1.html",
    "pubDate": "Sun, 10 Jun 2018 11:09:00 +0530",
    "content": "Experts said that the near-term market trend will be dictated by domestic macro data like IIP, CPI and WPI, movement of crude oil prices and currency (INR vs USD) and progress of monsoon.",
    "contentSnippet": "Experts said that the near-term market trend will be dictated by domestic macro data like IIP, CPI and WPI, movement of crude oil prices and currency (INR vs USD) and progress of monsoon.",
    "guid": "https://www.business-standard.com/article/markets/domestic-macro-data-like-iip-cpi-and-global-cues-to-drive-market-this-week-118061000162_1.html",
    "isoDate": "2018-06-10T05:39:00.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.14285714285714285,
        "tokens": [
            "domestic",
            "macro",
            "data",
            "like",
            "iip",
            "cpi",
            "and",
            "global",
            "cues",
            "to",
            "drive",
            "market",
            "this",
            "week"
        ],
        "words": [
            "like"
        ],
        "positive": [
            "like"
        ],
        "negative": []
    },
    "article": {
        "title": "Domestic macro data like IIP, CPI and global cues to drive market this week",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tStock market this week will be guided by a host of key macroeconomic data points including the industrial production numbers for April, global cues, trend in crude oil prices and progress of monsoon, say experts.</p>\n<p>\n\t\"Going ahead, the focus would be on the US Fed policy meeting where it is widely believed that it will hike interest rates,\" said Sanjeev Zarbade Vice President - Research, Kotak Securities.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\t\"Also of interest would be, the ECB meeting in which it is being expected that the monetary body may signal a path towards end of the stimulus programme. Markets would also await IIP and CPI data to get a sense of the domestic macro trends,\" he added.</p>\n<p>\n\t\"Progressing monsoon and positive outlook on rural market is giving a boost to the economy, which is already showing signs of improvement. Additionally, cues from economic data like CPI, IIP and WPI will also be a determining factor in the market movement,\" said Vinod Nair, Head of Research, Geojit Financial Services.</p>\n<p>\n\tMarket experts said that the near term market trend will be dictated by domestic macro data like IIP, CPI and WPI, movement of crude oil prices and currency (INR vs USD) and progress of monsoon.</p>\n<p>\n\t\"In the coming week, the market will be looking forward to IIP data, manufacturing production and inflation. This will be very important and may set the tone for June month,\" said Mustafa Nadeem, CEO, Epic Research.</p>\n<p>\n\tOn the global front, all eyes will be on FOMC meeting, Nadeem added.</p>\n<p>\n\t\"This week is loaded with central bank meeting globally. The ECB will meet on Thursday. But before that we have the US Federal </p>\n<p>\n\tReserve meeting on Tuesday and Wednesday. So how the market moves this week will be totally a function of the crude, currency and central back action,\" said VK Sharma, Head Private Client Group &amp; Capital Market Strategy, HDFC Securities.</p>\n<p>\n\tOver the past week, the BSE Sensex recorded a rise of 216.41 points, or 0.61 per cent, to end at 35,443.67.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Domestic",
        "domestic",
        "macro",
        "global",
        "near",
        "dictated",
        "crude"
    ],
    "nouns": [
        "Domestic",
        "domestic",
        "data",
        "CPI",
        "drive",
        "market",
        "week",
        "term",
        "macro",
        "trend",
        "will",
        "movement",
        "crude",
        "oil",
        "currency",
        "INR",
        "progress",
        "monsoon"
    ],
    "verbs": [
        "drive",
        "market",
        "near",
        "term",
        "trend",
        "will",
        "oil",
        "progress"
    ]
}