{
    "title": "Organisations are redesigning jobs around AI and robotics, says report",
    "link": "https://www.business-standard.com/article/companies/organisations-are-redesigning-jobs-around-ai-and-robotics-says-report-118040800668_1.html",
    "pubDate": "Sun, 08 Apr 2018 21:02:00 +0530",
    "content": "Vantage point: Insights from cutting-edge research",
    "contentSnippet": "Vantage point: Insights from cutting-edge research",
    "guid": "https://www.business-standard.com/article/companies/organisations-are-redesigning-jobs-around-ai-and-robotics-says-report-118040800668_1.html",
    "isoDate": "2018-04-08T15:32:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "organisations",
            "are",
            "redesigning",
            "jobs",
            "around",
            "ai",
            "and",
            "robotics",
            "says",
            "report"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Organisations are redesigning jobs around AI and robotics, says report",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tIn the past year, organisations have become laser-focused on how automation induced job shifts will impact individuals, according to Deloitte’s sixth annual Human Capital Trends report, “The rise of social enterprise”. The research shows over four in 10 <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=companies\" target=\"_blank\">companies </a>believe automation will have a major impact on jobs, and 61 per cent are actively redesigning <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=jobs\" target=\"_blank\">jobs </a>around <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=artificial+intelligence\" target=\"_blank\">artificial intelligence </a>and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=robotics\" target=\"_blank\">robotics.</a> Against this backdrop, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=companies\" target=\"_blank\">companies </a>and individuals realise the traditional career model is becoming defunct. Sixty-two per cent respondents consider building new career models and skills as very important, making it the most important human capital trend for India. However, only 14 per cent are ready to address this challenge. Also the data shows a clear disconnect between development programmes and today’s career paths in India.</p>\n<p>\n\tIn addition to investing in employees’ professional development, organisations must rethink how they invest on a personal level. Only three per cent <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=companies\" target=\"_blank\">companies </a>think their reward offerings are very effective at motivating talent. Behaving as a social enterprise and managing the external environment’s macro trends effectively demands an unprecedented level of cross-functional vision, connectivity, and collaboration from C-suite leaders wherein top executives act as a team while also leading their own functional teams. The symphonic C-suite is the next stage in the ongoing evolution of leadership models. This new model is necessary to help leaders to understand, manage and respond to the complex social capital issues that organisations face, enabling them to tap opportunities, manage risks and build relationships with internal and external stakeholders.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\t<strong>Faster speeds are not exactly what separates <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=5g\" target=\"_blank\">5G </a>from 4G</strong></p>\n<p>\n\t\t<img align=\"left\" alt=\"4G and 5G\" class=\"imgCont\" height=\"463\" src=\"http://bsmedia.business-standard.com/_media/bs/img/article/2018-04/08/full/1523201524-3927.jpg\" title=\"4G and 5G\" width=\"620\"></p>\n\tThe shift to <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=5g\" target=\"_blank\">5G </a>will not happen in 2018, according to analytics firm GlobalData. While many <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=telecom\" target=\"_blank\">telecom </a>network technology vendors are claiming that the wait for fifth generation, high-speed wireless service (5G) is over, the full transition will not happen in 2018. Ed Gubbins, senior <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=telecom\" target=\"_blank\">telecom </a>technology and software analyst, GlobalData, says, “There are differing perspectives over whether <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=5g\" target=\"_blank\">5G </a>is finally here. For vendors selling 5G gear, basically 5G has arrived. For consumers, depending on where in the world they live, it’s coming soon. But for operators—in the sense that really matters to them, namely new revenue and profit—the wait will continue.” Network equipment vendors have been promoting mobile base station gear as “pre-5G” and “5G-ready”. In the first quarter of 2018, when vendors said 5G base stations would be available from later this year, the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=news\" target=\"_blank\">news </a>carried more weight. This is because the industry standard groups defining 5G’s common specifications finalised the first 5G standards in December 2017, allowing vendors to bring products to market.\n<p>\n\tGubbins says, “Some mobile operators and vendors have ‘5G’ to label residential broadband services delivered over fixed, point-to-point wireless networks to users’ homes, typically handed off to Wi-Fi within the home.” While the first big, global wave of 5G services will be aimed at consumer mobile broadband that is faster than today’s 4G, faster speeds are not exactly what separates 5G from <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=4g\" target=\"_blank\">4G.</a> The defining promise of 5G is to allow operators to connect people and machines with a common network, thus attaining greater efficiency and profitability than any previous generation. That depends on the development of new business cases and new market adoption that the mobile industry has not seen before.</p>\n\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "cutting"
    ],
    "nouns": [
        "report",
        "cutting",
        "research",
        "point",
        "AI",
        "robotics",
        "Vantage",
        "edge"
    ],
    "verbs": [
        "report",
        "research",
        "point",
        "edge"
    ]
}