{
    "creator": "PTI",
    "title": "States’ fiscal deficit steeply falls by 25 per cent in FY18, says Icra",
    "link": "https://www.financialexpress.com/economy/states-fiscal-deficit-steeply-falls-by-25-per-cent-in-fy18-says-icra/1209515/",
    "pubDate": "Sun, 17 Jun 2018 16:23:37 +05:30",
    "dc:creator": "PTI",
    "content": "Thirteen states have reported an average 25 per cent decline in their fiscal deficit primarily due to a contraction in capital outlay, even though their revenue has gone up by 7.5 per cent in the fiscal year to March 2018, says a report.",
    "contentSnippet": "Thirteen states have reported an average 25 per cent decline in their fiscal deficit primarily due to a contraction in capital outlay, even though their revenue has gone up by 7.5 per cent in the fiscal year to March 2018, says a report.",
    "guid": "https://www.financialexpress.com/?p=1209515",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-17T10:53:37.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.15384615384615385,
        "tokens": [
            "states’",
            "fiscal",
            "deficit",
            "steeply",
            "falls",
            "by",
            "25",
            "per",
            "cent",
            "in",
            "fy18",
            "says",
            "icra"
        ],
        "words": [
            "deficit"
        ],
        "positive": [],
        "negative": [
            "deficit"
        ]
    },
    "article": {
        "title": "States’ fiscal deficit steeply falls by 25 per cent in FY18, says Icra",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1209524\" src=\"https://images.financialexpress.com/2018/06/money-15.jpg\" alt=\"Fiscal deficit, fiscal deficit india, fiscal deficit 2017-18, fiscal deficit april\" srcset=\"https://images.financialexpress.com/2018/06/money-15.jpg 660w, https://images.financialexpress.com/2018/06/money-15-300x200.jpg 300w, https://images.financialexpress.com/2018/06/money-15-620x413.jpg 620w, https://images.financialexpress.com/2018/06/money-15-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> VAT is typically levied on an ad valorem basis by the states, and higher crude prices would ensure that they net higher revenues from higher retail prices, provided the Centre does not reduce the basic excise duty. (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>Thirteen states have reported an average 25 per cent decline in their fiscal deficit primarily due to a contraction in capital outlay, even though their revenue has gone up by 7.5 per cent in the fiscal year to March 2018, says a report. However, in FY17, their revenue had gone up by 11.5 per cent, says a report by domestic credit rating agency Icra, based on the provisional fiscal data given by the CAG of 13 states. Fiscal deficit of these 13 states sharply fell by 25.1 per cent to Rs 3.2 trillion in FY18 from Rs 4.3 trillion in FY17, partly on account of the contraction in capital spending.</p><span>\n</span><p>“While the CAG data shows that these 13 states have seen a steep 25 per cent decline in their fiscal deficit in FY18, their aggregate revenue receipts rose 7.5 per cent, which is sharply lower from 11.5 per cent a year ago,” Icra said in a weekend report. According to the agency, this slowdown in revenue growth was led by a contraction in the non-tax revenue, comprising grants from the Centre and states’ own non-tax revenues, and a mild slowdown in the pace of growth of tax revenue, comprising Central tax devolution and states’ own-tax revenues.</p><span>\n</span><p>But the agency estimates that the pace of growth of the aggregate tax revenue of 13 states improved to 10.1 per cent in FY18 from 7.7 per cent in FY17, as the CAG data is only provisional. The pre-actuals for FY18 indicate that growth of aggregate revenue expenditure of these 13 states eased to 8.8 per cent from 13.1 per cent in FY2017, while the capital outlay contracted by 9.4 per cent in FY18 in contrast to the healthy growth of 17.1 per cent in FY17.</p><span>\n</span><p>“The contraction in capital outlay can be due to a combination of factors, including the lack of fiscal space led by the slowing growth of revenue receipts, re-prioritisation of spending after the farm loan waiver announcement by some leading states, base effect related to the Uday scheme (of the power sector) and the delay in presentation of budgets by a few states in FY18 due to the assembly elections,” it says.</p><span>\n</span><p>The provisional data also indicates a massive 46.7 per cent widening of revenue deficit of these states to Rs 72,360 crore from Rs 49,340 crore in FY17, even as fiscal deficit of these states narrowed by 25.1 per cent to Rs 3.2 trillion from Rs 4.3 trillion in FY17, due to contraction in capital spending. Going forward, the rating agency feels that the national introduction of the e-way bill should boost GST collections.</p><span>\n</span><p>Additionally, the pace of growth of tax revenue collected on items, which at present are not under the GST, would impact the revenue of the states. The report also sees higher tax collection in this fiscal as it believes that they may net more VAT from petroleum products given the spike in crude prices.</p><span>\n</span><p>VAT is typically levied on an ad valorem basis by the states, and higher crude prices would ensure that they net higher revenues from higher retail prices, provided the Centre does not reduce the basic excise duty. “Sales tax collections of the states on oil products may continue to grow at a healthy pace in FY19. In our view, the annual growth of the aggregate VAT collection on oil products of all states could exceed 20 per cent in Q1 of FY19,” the report says.</p><span>\n</span><p>On expenditure side, some key factors that may keep the revenue spending of the states elevated, include the staggered implementation of the pay revision, funding of a portion of the crop loan waivers and implementation of new schemes ahead of the national and state polls.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "fiscal",
        "25",
        "Thirteen",
        "reported",
        "average",
        "due",
        "capital",
        "even",
        "gone"
    ],
    "nouns": [
        "falls",
        "25",
        "deficit",
        "report",
        "average",
        "decline",
        "due",
        "cent",
        "contraction",
        "even",
        "capital",
        "revenue",
        "Thirteen",
        "year",
        "March",
        "outlay"
    ]
}