{
    "creator": "PTI",
    "title": "Fake rupee note seizure in Switzerland plunges to just 3 in a year",
    "link": "https://www.financialexpress.com/economy/fake-rupee-note-seizure-in-switzerland-plunges-to-just-3-in-a-year/1209263/",
    "pubDate": "Sun, 17 Jun 2018 11:17:01 +05:30",
    "dc:creator": "PTI",
    "content": "Over the years, counterfeits have been found in Switzerland mostly for Rs 500 and Rs 1,000 notes, while there have been some instances for other denominations such as Rs 10 and Rs 100 notes as well. As per the latest Fedpol data, the number of counterfeit local currency, Swiss franc, seized during 2017 was 1,990 -- down from 2,370 in 2016.\r\n",
    "contentSnippet": "Over the years, counterfeits have been found in Switzerland mostly for Rs 500 and Rs 1,000 notes, while there have been some instances for other denominations such as Rs 10 and Rs 100 notes as well. As per the latest Fedpol data, the number of counterfeit local currency, Swiss franc, seized during 2017 was 1,990 -- down from 2,370 in 2016.",
    "guid": "https://www.financialexpress.com/?p=1209263",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-17T05:47:01.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.23076923076923078,
        "tokens": [
            "fake",
            "rupee",
            "note",
            "seizure",
            "in",
            "switzerland",
            "plunges",
            "to",
            "just",
            "3",
            "in",
            "a",
            "year"
        ],
        "words": [
            "fake"
        ],
        "positive": [],
        "negative": [
            "fake"
        ]
    },
    "article": {
        "title": "Fake rupee note seizure in Switzerland plunges to just 3 in a year",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1209282\" src=\"https://images.financialexpress.com/2018/06/fake-note-seizure.jpg\" alt=\"Fake rupee note,&nbsp;Fake rupee note seizure, Switzerland note seizure,&nbsp;fake Indian currency,&nbsp;black money,&nbsp;Swiss Federal Office of Police,&nbsp;Fedpol,&nbsp;counterfeit foreign currency,&nbsp;fake Indian notes,&nbsp;fake currencies seized,&nbsp;demonetisation,&nbsp;Fedpol data,&nbsp;foreign currencies,&nbsp;counterfeit statistics,&nbsp;Swiss banknotes\" srcset=\"https://images.financialexpress.com/2018/06/fake-note-seizure.jpg 660w, https://images.financialexpress.com/2018/06/fake-note-seizure-300x200.jpg 300w, https://images.financialexpress.com/2018/06/fake-note-seizure-620x413.jpg 620w, https://images.financialexpress.com/2018/06/fake-note-seizure-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The fake currencies seized during 2016 were in the denominations of Rs 500 and Rs 1,000 – both of which were withdrawn by the Indian government from the list of legal tenders towards the end of that year. (Image : Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>Seizure of fake Indian currency in Switzerland, for long perceived an alleged haven for <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/black-money/\">black money</a>, has come down sharply to just three in 2017 after a huge four-fold surge in the previous year. According to the latest annual data released by the Swiss Federal Office of Police (Fedpol), just two fake Rs 100 notes and one Rs 500 banknote was seized during 2017.</p><span>\n</span><p>This followed the fake Indian notes being the third most seized counterfeit foreign currency in Switzerland after euro and the US dollar during 2016. The fake currencies seized during 2016 were in the denominations of Rs 500 and Rs 1,000 – both of which were withdrawn by the Indian government from the list of legal tenders towards the end of that year.</p><span>\n</span><p>So far, there has been no seizure of any counterfeit Rs 2,000 note, which was introduced as part of the ambitious demonetisation drive to check the menace of fake notes and the black money problem. According to the Fedpol data, as many as 1,437 fake Rs 1,000 notes were seized in Switzerland during 2016, while there were also five counterfeit Rs 500 notes. This marked a huge surge from 342 fake Indian currency notes seized by Swiss authorities during 2015, five were counterfeits of Rs 500 notes, 336 for Rs 1,000 and one for Rs 100.</p><span>\n</span><p>Over the years, counterfeits have been found in Switzerland mostly for Rs 500 and Rs 1,000 notes, while there have been some instances for other denominations such as Rs 10 and Rs 100 notes as well. As per the latest Fedpol data, the number of counterfeit local currency, Swiss franc, seized during 2017 was 1,990 – down from 2,370 in 2016.</p><span>\n</span><p>Among foreign currencies, the maximum amount of counterfeits was found in case of Euro at 3,826 during 2017, though sharply down from 5,379 in the previous year. In case of the US dollar, the number has increased to 1,976 from 1,443. The fake Japanese yen notes seized during 2017 was also high at 2,500. The number of counterfeit British pound found during 2017 was 88, up from 65 in the previous year.</p><span>\n</span><p>An analysis of the counterfeit statistics released by the Fedpol over the years shows that the maximum number of fake Indian currency was seized during the year 2012 when it stood at 2,624, but fell sharply to 403 in the subsequent year 2013 and even further to just 181 in 2014. Earlier in 2011, the number of fake rupee notes was 1,144 -up from 212 in 2010. Prior to that, the number was in single digits mostly except for 25 in 2007 and 100 in the year 2000. No such notes were found in the year 1999 and again in 2003.</p><span>\n</span><p>Fake currency has been a major concern for India as well as many other countries, due to which they keep improving security features to make it difficult for them to be counterfeited. Still, there have already been some instances of Rs 2,000 notes getting counterfeited and found in some parts of India. India has also introduced new Rs 200 and Rs 500 notes, among other denominations.</p><span>\n</span><p>According to the Fedpol, counterfeit money is a very seldom occurrence in Switzerland, compared to other countries, because they consider Swiss banknotes to be forgery-proof. “Banknote production is state-of-the-art and of a very high international standard. Forged banknotes can often be identified with the naked eye on the basis of various security features,” Fedpol said.</p><span>\n</span><p>If suspected forgeries do appear, the police, banks, postal services or other institutions forward them to Fedpol, who examines them and if necessary registers the material that has been used to manufacture them. The total amount of counterfeit money discovered in Switzerland each year remained more or less the same between 2006 and 2017 at CHF 4-5 million involving all currencies and CHF 500,000 involving Swiss francs only.</p><span>\n</span><p>“This is not a large amount, considering the total amount of money in circulation – CHF 72 billion,” Fedpol said.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "counterfeit",
        "10",
        "100",
        "Over",
        "local",
        "found",
        "down",
        "just",
        "Fake",
        "Swiss",
        "500",
        "latest"
    ],
    "verbs": [
        "counterfeit",
        "found",
        "down",
        "number",
        "note",
        "Fake"
    ]
}