{
    "title": "Banks see jump in realisation from bankruptcy-hit cos",
    "link": "https://timesofindia.indiatimes.com/business/india-business/banks-see-jump-in-realisation-from-bankruptcy-hit-cos/articleshow/64534566.cms",
    "pubDate": "Sun, 10 Jun 2018 22:30:14 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/banks-see-jump-in-realisation-from-bankruptcy-hit-cos/articleshow/64534566.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64534566.cms\" /></a>Lenders to companies facing bankruptcy proceedings saw their entire c laims settled in a third of the cases resolved during the March quarter, while average realisation from the dozen companies was close to 70%, more than twice the level seen up to December.",
    "contentSnippet": "Lenders to companies facing bankruptcy proceedings saw their entire c laims settled in a third of the cases resolved during the March quarter, while average realisation from the dozen companies was close to 70%, more than twice the level seen up to December.",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/banks-see-jump-in-realisation-from-bankruptcy-hit-cos/articleshow/64534566.cms",
    "isoDate": "2018-06-10T22:30:14.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "banks",
            "see",
            "jump",
            "in",
            "realisation",
            "from",
            "bankruptcy-hit",
            "cos"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Banks see jump in realisation from bankruptcy-hit cos",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>NEW DELHI: </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Lenders\">Lenders</a><span> to companies facing </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/bankruptcy-proceedings\">bankruptcy proceedings</a><p> saw their entire claims settled in a third of the cases resolved during the March quarter, while average realisation from the dozen companies was close to 70%, more than twice the level seen up to December.\n\n</p><span>Latest data released by regulator </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Insolvency-and-Bankruptcy-Board-of-India\">Insolvency and Bankruptcy Board of India</a><span> (</span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/IBBI\">IBBI</a><p>), showed that against the admitted claims of Rs 4,405 crore by the financial creditors, Rs 3,070 crore were realized — which was more than twice the liquidation value.\n</p><span>In contrast, in the first 10 cases resolved up to the December quarter, the </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Economic-Survey\">Economic Survey</a><p> had said that of the Rs 5,530 crore claims made by financial creditors, in nine out of the 10 cases, they could recover Rs 1,853 crore or 33% of the claims.\n</p><p>Although no immediate reason was available, market players said that for companies looking to expand their businesses, the distressed companies with a good asset base offered an attractive option. Officials said the data suggested that fears of a sharp drop in valuations, after the government decided to keep out the promoters, were unfounded.\n</p><p>“The system is stabilising and there is greater awareness, resulting in more competition for companies. If the trend continues, banks can hope to see even better realisation,” said an official.\n</p><p>IBBI said that early initiation of the resolution process helps creditors realise a better value. “Many of the corporates ending up in liquidation had long-pending dues and hence were left with little organisational capital. \n</p><span>Therefore, in most cases, the resolution value offered was either below the liquidation value, the resolution plan came from ineligible parties or there was no resolution plan at all,” it said.\n</span><br><span>\n</span><br><span>Till the end of March, 701 cases had been admitted by the National Company Law Tribunal (NCLT), with 525 companies undergoing the resolution process, IBBI data showed. So far, 176 cases have seen closure in various benches of the NCLT, but almost half (87) went into liquidation, while 22 have been resolved, including the dozen in the March quarter.\n</span><br><span>\n</span><br><span>While there were four cases where the financial creditors managed to realise 100% or more of the claims admitted, on cases of Trinity Components, the realisation was 99.98%, the data showed with almost the entire Rs 17.38 crore of the claims realised.\n</span><br><span>\n</span><br><span>The data also revealed that of the 701 cases, 310 (44%) were moved by operational creditors, such as vendors and suppliers, while 262 (37%) came from the financial creditors, and the remaining 129 were filed by companies.\n</span><br><span>\n</span><p>Officials said that the numbers suggested that smaller suppliers were often using the IBC to get their dues back from the companies especially as 2,100 cases involving Rs 83,000 crore of claims were settled as soon as they were filed and had not been admitted by the NCLT.\n</p><span>\n</span></div></div>"
    },
    "adjectives": [
        "level",
        "entire",
        "settled",
        "top",
        "10",
        "resolved",
        "average",
        "left",
        "right",
        "close",
        "third",
        "70",
        "dozen"
    ],
    "nouns": [
        "level",
        "Banks",
        "bankruptcy",
        "banks",
        "proceedings",
        "quarter",
        "india",
        "entire",
        "top",
        "March",
        "margin",
        "10",
        "hit",
        "realisation",
        "December",
        "average",
        "business",
        "border",
        "left",
        "style",
        "photo",
        "right",
        "jump",
        "close",
        "cos",
        "third",
        "70",
        "facing",
        "saw",
        "dozen"
    ],
    "verbs": [
        "level",
        "quarter",
        "top",
        "March",
        "hit",
        "average",
        "border",
        "align",
        "style",
        "right",
        "jump",
        "close",
        "saw"
    ]
}