{
    "title": "PNB expects Rs 8,000 crore recovery from NPAs this month",
    "link": "https://timesofindia.indiatimes.com/business/india-business/pnb-expects-rs-8000-crore-recovery-from-npas-this-month/articleshow/64530459.cms",
    "pubDate": "Sun, 10 Jun 2018 12:21:58 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/pnb-expects-rs-8000-crore-recovery-from-npas-this-month/articleshow/64530459.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64530459.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/pnb-expects-rs-8000-crore-recovery-from-npas-this-month/articleshow/64530459.cms",
    "isoDate": "2018-06-10T12:21:58.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "pnb",
            "expects",
            "rs",
            "8000",
            "crore",
            "recovery",
            "from",
            "npas",
            "this",
            "month"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "PNB expects Rs 8,000 crore recovery from NPAs this month",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>NEW DELHI: Enthused by the successful resolution of </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Bhushan-Steel\">Bhushan Steel</a><span>, fraud-hit </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/pnb-scam\">Punjab National Bank</a><span> (</span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/punjab-national-bank\">PNB</a><p>) is hopeful of Rs 8,000 crore recovery from bad loans in the first quarter of the current fiscal.\n\n</p><p>The bank, with its focus on recovery of dues from defaulters, has managed to surpass the total amount recovered in the last fiscal in the first two months of this financial year, a senior PNB official told PTI.\n</p><span>\"This is due to renewed focus on recovery by PSB banks including referral of many cases to </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/NCLT\">NCLT</a><p> under the bankruptcy code is forcing many of the defaulting companies to settle their NPAs. While PNB had recovered Rs 5,617.55 crore in the whole of last year, the bank's recovery stands at Rs 6,000 crore by first week of June,\" the official said.\n</p><p>By the time this quarter (April-June) ends, PNB expects to complete recovery of almost Rs 8,000 crore, the official said, adding that large corporates like Religare, Arcotech and Surya Alloys have recently settled bad loans worth Rs 350 crore in the last two months via the recovery camps setup by PNB.\n</p><p>PNB posted loss of Rs 13,416.91 crore for the fourth quarter ended March, 2018, the biggest ever by any domestic lender.\n</p><p>The bank last month said it provided for Rs 7,178 crore, 50 per cent of the total amount of Rs 14,356 crore in the fourth quarter of 2017-18, with regards to the loss incurred on account of Nirav Modi fraud.\n</p><span>According to the bank, the remaining amount will be covered in the three quarters of the current fiscal year.\n</span><br><span>\n</span><br><span>PNB further said it has paid Rs 6,586.11 crore to other banks to discharge its liabilities towards Letters of Undertaking (LoUs) and Foreign Letters of Credit (FLCs) issued fraudulently and in unauthorised manner to certain overseas branches of Indian banks through the misuse of SWIFT system of the bank, which was then not integrated with CBS (core banking solutions).\n</span><br><span>\n</span><br><span>Modi and his associates in connivance with some officials of PNB defrauded the bank of over USD 2 billion dollar.\n</span><br><span>\n</span><br><span>To focus on recovery, PNB has moved over 3,000 personnel from operations across the country into the stressed assets vertical, the official said.\n</span><br><span>\n</span><p>\"The stressed assets vertical has started operating from June 1. Four General Managers from the Corporate office have been tasked with heading the recovery vertical as part of the bank's management strategy to fast track recovery of NPAs,\" the official said.\n</p><span>\n</span></div></div>"
    },
    "adjectives": [
        "10",
        "left",
        "top",
        "right"
    ],
    "nouns": [
        "margin",
        "month",
        "recovery",
        "india",
        "border",
        "10",
        "crore",
        "left",
        "top",
        "business",
        "style",
        "right",
        "photo"
    ],
    "verbs": [
        "border",
        "top",
        "style",
        "right",
        "align"
    ]
}