{
    "creator": "Ananaya Banerjee",
    "title": "Co-working spaces the choice of millennials",
    "link": "https://www.financialexpress.com/market/co-working-spaces-the-choice-of-millennials/1209139/",
    "pubDate": "Sun, 17 Jun 2018 03:57:49 +05:30",
    "dc:creator": "Ananaya Banerjee",
    "content": "When I stepped into a co-working space, touted to be the workplace of the future, for a first-hand experience, a dog wagging its tail was the last thing I expected to greet me on a Monday morning. ",
    "contentSnippet": "When I stepped into a co-working space, touted to be the workplace of the future, for a first-hand experience, a dog wagging its tail was the last thing I expected to greet me on a Monday morning.",
    "guid": "https://www.financialexpress.com/?p=1209139",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-16T22:27:49.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "co-working",
            "spaces",
            "the",
            "choice",
            "of",
            "millennials"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Co-working spaces the choice of millennials",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1209140\" src=\"https://images.financialexpress.com/2018/06/1-102.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/1-102.jpg 660w, https://images.financialexpress.com/2018/06/1-102-300x200.jpg 300w, https://images.financialexpress.com/2018/06/1-102-620x413.jpg 620w, https://images.financialexpress.com/2018/06/1-102-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> What is it like to function out of a co-working space, touted to be the office of the future?</figure>\n\t\t\t</section></div><span>\n</span><p>When I stepped into a co-working space, touted to be the workplace of the future, for a first-hand experience, a dog wagging its tail was the last thing I expected to greet me on a Monday morning. Needless to say, all blues vanished as I patted the pet someone had brought to work. While traditional offices rarely even have creches, here was an office that was pet-friendly!</p><span>\n</span><p>The next thing that knocked me out (not literally) was beer on tap at the ‘pay-for-what-you-consume’ pantry in the lobby of WeWork, in Mumbai’s Bandra Kurla Complex.</p><span>\n</span><p>The millennial in me thought the cool quotient of the place was its informal setting, bright interiors with plenty of natural light and amenities that ranged from beer to a nail spa. Of course, they took work seriously too, with office spaces for freelancers, small start-ups and even big companies.</p><span>\n</span><p>As I unpacked my things onto a hot desk (free space that can be used by any member), hoping to write a story and get some research work done, I noticed everyone around me was either in deep discussion with a colleague or typing away at their laptops, with huge headphones isolating them from the surroundings.</p><span>\n</span><p>As I walked across the space, I could see everyone through the glass dividers. “The space is designed in a way that watching others work can inspire you too. In fact, we don’t encourage opaque walls and they are put up only on demand,” said Karan Virwani, director, WeWork India. Privacy issues are taken care of in places like phone booths dedicated for audio and video calls.</p><span>\n</span><p>What is encouraged is socialising and collaborations, where people can discover others who can supplement and complement their own work. This is possible as the place is inhabited by people from all kinds of professions, in the age bracket of 25-40 years, some dressed casually in jeans and t-shirts, and others in suits and ties. And the socialising is not accidental. “The corridors are built in a way that people bump into each other — the brainchild of WeWork chief creative officer Adam Kimmel – who put in two years of research to find the perfect corridor length,” said Virwani, revealing that the space has sensors in many locations that keep a track of where more people congregate, helping the company to focus on those areas. For instance, the wellness centre, where members can go to relax and catch up on some sleep or retreat to if they want some quiet time.</p><span>\n</span><p>However, the cafe was invariably the most buzzing area, with people milling around with coffee mugs and laptops in hand, huddled over in intense discussions. This was till I discovered the tiny room at the corner of a corridor, housing the in-house unisex salon, where the three staffers were trying hard to deal with the numerous appointments. It’s evening and I learned that many were trying to look good for the TGIM (Thank God it’s Monday weekly get-together on the premises).</p><span>\n</span><p>Chairs and tables were removed to make space for people to mingle, the refrigerator was full of beer for those who preferred a pint over lager. Members flocked down from their offices and helped themselves to a glass even as the stand-up comedy act began. The show lasted for about an hour, and was interactive and fun. Some members invited other friends to join in, which is exactly what the company wants. “We want people to think of this as a place they can relax after a hard day of work, all under one roof,” said Virwani.</p><span>\n</span><p>I call it a day, and realise during the trip back home that it didn’t seem a hard day’s work at all!</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "last",
        "working",
        "choice",
        "future",
        "first",
        "expected",
        "I"
    ],
    "nouns": [
        "last",
        "morning",
        "Co",
        "co",
        "working",
        "workplace",
        "space",
        "choice",
        "future",
        "first",
        "I",
        "experience",
        "dog",
        "tail",
        "thing",
        "hand",
        "Monday"
    ],
    "verbs": [
        "last",
        "space",
        "hand",
        "experience",
        "dog",
        "tail",
        "greet"
    ]
}