{
    "creator": "PTI",
    "title": "Competition Commission may suggest structural changes in Walmart-Flipkart deal",
    "link": "https://www.financialexpress.com/industry/competition-commission-may-suggest-structural-changes-in-walmart-flipkart-deal/1200615/",
    "pubDate": "Sun, 10 Jun 2018 17:51:47 +05:30",
    "dc:creator": "PTI",
    "content": "In the case of the deal between Walmart and South African entity Massmart, it was approved by the Competition Commission of South Africa. ",
    "contentSnippet": "In the case of the deal between Walmart and South African entity Massmart, it was approved by the Competition Commission of South Africa.",
    "guid": "https://www.financialexpress.com/?p=1200615",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-10T12:21:47.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "competition",
            "commission",
            "may",
            "suggest",
            "structural",
            "changes",
            "in",
            "walmart-flipkart",
            "deal"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Competition Commission may suggest structural changes in Walmart-Flipkart deal",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1200630\" src=\"https://images.financialexpress.com/2018/06/walmart_flipkart_fe-620x413.jpg\" alt=\"cometition commission,CCI, flipkart walamrt deal, flikart deal, structural changes, US SEC\" srcset=\"https://images.financialexpress.com/2018/06/walmart_flipkart_fe-620x413.jpg 620w, https://images.financialexpress.com/2018/06/walmart_flipkart_fe-620x413-300x200.jpg 300w, https://images.financialexpress.com/2018/06/walmart_flipkart_fe-620x413-401x267.jpg 401w\" sizes=\"(max-width: 620px) 100vw, 620px\"> Fair trade regulator CCI might recommend structural changes to the proposed USD 16-billion Walmart-Flipkart deal to address possible competition concerns, according to officials.</figure>\n\t\t\t</section></div><span>\n</span><p>Fair trade regulator CCI might recommend structural changes to the proposed USD 16-billion Walmart-<a target=\"_blank\" href=\"http://www.financialexpress.com/tag/flipkart/\">Flipkart</a> deal to address possible competition concerns, according to officials. The Competition Commission of India (CCI) might also take cues from a ruling in South Africa with respect to Walmart- Massmart deal, which was announced in 2010. Last month, Walmart Inc announced acquisition of 77 per cent stake in Flipkart for about USD 16 billion (Rs 1.05 lakh crore) in the largest e-commerce deal. The retail giant has approached the CCI for approval, saying deal does not raise any competition concerns.</p><span>\n</span><p>However, various trade organisations have opposed the deal. While the CCI is yet to take a call on the Walmart-Flipkart deal, officials said the regulator might order certain structural changes in the proposed transaction to address possible competition concerns. In response to a query that the CCI may order some structural changes in the deal with Flipkart and whether Walmart would be ready for making such changes for getting approval, Walmart said, “we have no comments”. Officials said the CCI might take a cue from the South African example and might even recommend setting up of a long term fund to modernise kiranas going forward besides supporting local manufacturing by SME (Small and Medium Enterprises). The fund could work under the aegis of DIPP (Department of Industrial Policy and Promotion) along with Walmart representatives to build a robust Kiranas development programme wherein the US retailer provides knowledge and resources, they added.</p><span>\n</span><p>In the case of the deal between Walmart and South African entity Massmart, it was approved by the Competition Commission of South Africa. However, it was challenged and later South Africa’s Competition Tribunal gave its approval in 2011 for the merger subject to conditions proposed by the two companies. In a statement issued in May 2011, Walmart had said the tribunal has announced that Massmart deal can proceed to finality and has accepted the conditions proposed by the two companies. The conditions, included setting up of a “R100 million supplier development fund, no merger-related retrenchments for a period of two years…,” as per the statement.</p><span>\n</span><p>As per the notice submitted to the CCI, the acquisition of majority stake in Flipkart would be done through Wal-Mart International Holdings. The proposed transaction would be effected pursuant to the share purchase agreement and the share issuance and acquisition agreement entered into on May 9 by and among Walmart’s subsidiary and Flipkart, it added. Mergers and acquisitions beyond a certain threshold require the approval of the CCI. Last week, more than 100 trader organisations opposed the Walmart-Flipkart deal stating it would cause “irreversible damage” to small traders and endanger jobs for thousands.</p><span>\n</span><p>Meanwhile, Walmart expects to close the USD 16 billion deal to acquire 77 per cent stake in Flipkart this year. “In May 2018, the company announced it will pay approximately USD 16 billion in exchange for approximately 77 per cent of the outstanding shares of Flipkart Group (Flipkart). The investment includes USD 2 billion of new equity funding. “… closing is expected later this calendar year, and is subject to regulatory approval,” it said in a filing to the US Securities and Exchange Commission (SEC) earlier this month.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "structural",
        "In",
        "South",
        "African",
        "approved"
    ],
    "verbs": [
        "Commission",
        "suggest",
        "deal",
        "case"
    ],
    "nouns": [
        "Competition",
        "Commission",
        "may",
        "In",
        "case",
        "South",
        "African",
        "Africa",
        "entity",
        "deal"
    ]
}