{
    "title": "SBI presentation fuels talk of bank mergers",
    "link": "https://timesofindia.indiatimes.com/business/india-business/sbi-presentation-fuels-talk-of-bank-mergers/articleshow/64626856.cms",
    "pubDate": "Sun, 17 Jun 2018 21:32:24 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/sbi-presentation-fuels-talk-of-bank-mergers/articleshow/64626856.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64626856.cms\" /></a>The stage is set for intensification of attempts at public sector bank consolidation after a presentation by State Bank of India (SBI) chairman Rajnish Kumar at a recent meeting of bankers, although it isn't quite clear on who will make the first move.",
    "contentSnippet": "The stage is set for intensification of attempts at public sector bank consolidation after a presentation by State Bank of India (SBI) chairman Rajnish Kumar at a recent meeting of bankers, although it isn't quite clear on who will make the first move.",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/sbi-presentation-fuels-talk-of-bank-mergers/articleshow/64626856.cms",
    "isoDate": "2018-06-17T21:32:24.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "sbi",
            "presentation",
            "fuels",
            "talk",
            "of",
            "bank",
            "mergers"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "SBI presentation fuels talk of bank mergers",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>NEW DELHI: The stage is set for intensification of attempts at public sector bank consolidation after a presentation by State Bank of India (</span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/rajnish-kumar\">SBI</a><span>) chairman </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/rajnish-kumar\">Rajnish Kumar</a><p> at a recent meeting of bankers, although it isn't quite clear on who will make the first move.\n\n</p><p>Bankers and government officials told TOI that Kumar made a detailed presentation on SBI's experience with the merger of five associate banks, pointing out how there were some initial niggles during the first few months, along with heightened anxiety. But things have settled down smoothly and the positive impact is now visible. The presentation talked about how there were apprehensions about the impact on stock of bad debt, integration and staff issues. SBI, however, saw it as a move to gain size, something that has eluded Indian banks.\n</p><p>While officials said lenders have started initial discussions on the long-pending consolidation efforts, with the Centre backing these attempts, bankers are awaiting a clearer strategy from the government. \"SBI did talk about the pros and cons but the government has to suggest ways,\" said a bank chief, who was present in the meeting in Mumbai.\n</p><span> \n</span><div class=\"image\" data-msid=\"64626862\"><img src=\"https://timesofindia.indiatimes.com/img/64626862/Master.jpg\" alt=\"SBI gfx\"></div><span>The consolidation exercise has not moved forward, despite discussions happening for a decade as the finance ministry has maintained that it should be a bottoms-up approach, with the plan being worked out by the banks instead of it being forced on them.\n</span><br><span>\n</span><br><span>This is not the first time that SBI has made the initial move on consolidation. A few years ago, SBI Caps had even prepared a blueprint of sorts on merger of nationalised banks, a proposal that has been gathering dust.\n</span><br><span>\n</span><br><span>This time too, sources in the government said the exercise will be driven by the banks with the finance ministry stepping in once there was some movement. At the same time, they maintained that the idea is not to bunch two-three banks together, and instead take it as a gradual process where a large public sector lender takes over a smaller player, which was facing some difficulty.\n</span><br><span>\n</span><br><span>\"Someone like Dena Bank has been restricted from lending. Not only is it suffering but even its clients are affected. There is realisation that there is a need to look at options to stay in business,\" said a source.\n</span><br><span>\n</span><br><span>Further clarity may emerge when officiating finance minister </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Piyush-Goyal\">Piyush Goyal</a><p> meets MD and chief executives of state-run banks from the north and the east on Tuesday. The latest talk on consolidation has been spurred by the weak finances of public sector lenders, which are saddled with bad debt and 11 out of the 21 are under the RBI's prompt corrective action framework that has put curbs on some aspects of their expansion.\n</p><span>\n</span></div></div>"
    },
    "adjectives": [
        "set",
        "public",
        "recent",
        "clear",
        "first",
        "10",
        "left",
        "top",
        "right"
    ],
    "nouns": [
        "presentation",
        "talk",
        "bank",
        "Bank",
        "stage",
        "State",
        "set",
        "intensification",
        "public",
        "sector",
        "consolidation",
        "India",
        "india",
        "chairman",
        "recent",
        "meeting",
        "isn",
        "will",
        "first",
        "move",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo",
        "clear"
    ],
    "verbs": [
        "talk",
        "bank",
        "Bank",
        "stage",
        "State",
        "set",
        "chairman",
        "clear",
        "will",
        "move",
        "border",
        "align",
        "style",
        "top",
        "right"
    ]
}