{
    "creator": "PTI",
    "title": "NITI Aayog meeting 2018: Tamil Nadu CM K Palaniswami suggests revenue from indirect taxes be given to states",
    "link": "https://www.financialexpress.com/economy/niti-aayog-meeting-today-tamil-nadu-cm-k-palaniswami-suggests-revenue-from-indirect-taxes-be-given-to-states/1209508/",
    "pubDate": "Sun, 17 Jun 2018 16:14:12 +05:30",
    "dc:creator": "PTI",
    "content": "The Tamil Nadu government today told the Centre that states' flexibility to augment their own resources was \"very limited\"in the post-GST era, thus the revenue from all indirect taxes should be given to them. ",
    "contentSnippet": "The Tamil Nadu government today told the Centre that states' flexibility to augment their own resources was \"very limited\"in the post-GST era, thus the revenue from all indirect taxes should be given to them.",
    "guid": "https://www.financialexpress.com/?p=1209508",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-17T10:44:12.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "niti",
            "aayog",
            "meeting",
            "2018",
            "tamil",
            "nadu",
            "cm",
            "k",
            "palaniswami",
            "suggests",
            "revenue",
            "from",
            "indirect",
            "taxes",
            "be",
            "given",
            "to",
            "states"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "NITI Aayog meeting 2018: Tamil Nadu CM K Palaniswami suggests revenue from indirect taxes be given to states",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img src=\"https://images.financialexpress.com/2018/06/niti-5.jpg\" alt=\"NITI Aayog meeting today, NITI Aayog news, arvind kejriwal, narendra modi, palaniswami, tamil nadu, revenue, taxes, state tax, state revenue, economy, NITI Aayog wiki, NITI Aayog meeting\" class=\"size-full wp-image-1209513\" srcset=\"https://images.financialexpress.com/2018/06/niti-5.jpg 660w, https://images.financialexpress.com/2018/06/niti-5-300x200.jpg 300w, https://images.financialexpress.com/2018/06/niti-5-620x413.jpg 620w, https://images.financialexpress.com/2018/06/niti-5-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> In his address at the Niti Aayog meeting chaired by Prime Minister Narendra Modi in New Delhi, Tamil Nadu Chief Minister K Palaniswami said his suggestion was in practice in developed countries. (Twitter)</figure>\n\t\t\t</section></div><span>\n</span><p>The Tamil Nadu government today told the Centre that states’ flexibility to augment their own resources was “very limited”in the post-GST era, thus the revenue from all indirect taxes should be given to them. In his address at the Niti Aayog meeting chaired by Prime Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/narendra-modi/\">Narendra Modi</a> in New Delhi, Tamil Nadu Chief Minister K Palaniswami said his suggestion was in practice in developed countries. “In the post-GST era, flexibility of states to augment their own resources and mobilise more is very limited. It is time we think of a new model of resource sharing to effectively deal with the present development challenges,” he said. “As is the practice in developed countries, one suggestion is to levy and appropriate all indirect taxes which can be given to the states and the Union government can retain the direct tax revenues,” Palaniswami said.</p><span>\n</span><p>A copy of Palaniswami’s speech made at the fourth meeting of the Niti Aayog Governing Council in the national capital was released by the state government here. He further said, “alternatively, the power of collection and appropriation of personal income tax can be vested with the states as this would take care of growing needs of the states to implement development programmes.” “In this way, the present complicated process of devolution of resources can be simplified,” he added.</p><span>\n</span><p>Palaniswami said that unlike the Central government, states in general and Tamil Nadu in particular, had limited powers to mobilise resources. “No one in the Government of India other than the Prime Minister would perhaps understand this better,” he said, in an apparent reference to Modi’s earlier stints as chief minister of Gujarat.</p><span>\n</span><p>On devolution of taxes, Palaniswami sought to draw Modi’s attention to the “unfair treatment meted out to Tamil Nadu by successive Finance Commissions.” While the 14th Finance Commission increased overall devolution of taxes to states from 32 per cent to 42 per cent, “it reduced inter-se share of Tamil Nadu in the divisible pool from 4.969 per cent to 4.023 per cent.” “As a result, Tamil Nadu suffered an annual resource loss of Rs 6,000 crore,” he said.</p><span>\n</span><p>The Chief Minister also reiterated the state’s demand on revising certain Terms of Reference (Tor) in the 15th Finance Commission, saying “some of them are not in line with the principles of federalism enshrined in our Constitution and have to be reconsidered.” Tamil Nadu is opposed to certain ToR of the 15th Finance Commission, such as using the 2011 census to calculate population for allocation of union tax revenue in place of the 1976 census.</p><span>\n</span><p>The state insists the move would affect it as Tamil Nadu has effectively implemented population control measures. Speaking on the Cauvery issue at the Niti Aayog meeting, Palaniswami sought “immediate operationalisation of the Cauvery Water Management Authority and the Cauvery Water Regulation Committee for effective implementation of the Final Order of the Cauvery Water Disputes Tribunal as modified” by the Supreme Court.</p><span>\n</span><p>Further, Centre should take the lead in inter-linking of rivers by nationalisation of all inter-state rivers, “which alone offers the promise of creating a framework that would allow optimal utilisation of water resources amongst states,” he said.</p><span>\n</span><p>He recalled that late chief minister J Jayalalithaa had “repeatedly” urged the Centre to implement interlinking of the Mahanadhi-Godavari-Krishna-Pennar-Palar-Cauvery-Vaigai-Gundar Rivers and also to divert the surplus waters of the west flowing Pamba and Achankovil rivers to Vaippar in Tamil Nadu.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "indirect",
        "Tamil",
        "K",
        "given",
        "limited",
        "own"
    ],
    "verbs": [
        "Centre",
        "augment",
        "own",
        "post"
    ],
    "nouns": [
        "Centre",
        "revenue",
        "government",
        "meeting",
        "Tamil",
        "K",
        "CM",
        "given",
        "flexibility",
        "limited",
        "today",
        "era",
        "thus",
        "post"
    ]
}