{
    "title": "Indian Railways set to repaint 30,000 Mail, Express coaches in new colour",
    "link": "https://www.business-standard.com/article/economy-policy/indian-railways-set-to-repaint-30-000-mail-express-coaches-in-new-colour-118061700400_1.html",
    "pubDate": "Sun, 17 Jun 2018 19:11:00 +0530",
    "content": "The freshly-painted Delhi-Pathankot Express with 16 coaches will be the first train to be rolled out, by this month-end, with the new colour scheme developed by the in-house team of Northern Railway",
    "contentSnippet": "The freshly-painted Delhi-Pathankot Express with 16 coaches will be the first train to be rolled out, by this month-end, with the new colour scheme developed by the in-house team of Northern Railway",
    "guid": "https://www.business-standard.com/article/economy-policy/indian-railways-set-to-repaint-30-000-mail-express-coaches-in-new-colour-118061700400_1.html",
    "isoDate": "2018-06-17T13:41:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "indian",
            "railways",
            "set",
            "to",
            "repaint",
            "30000",
            "mail",
            "express",
            "coaches",
            "in",
            "new",
            "colour"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Indian Railways set to repaint 30,000 Mail, Express coaches in new colour",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tThe dark blue coaches of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/indian-railways\" target=\"_blank\">Indian Railways </a>will be a thing of the past now as the public transporter would be repainting all Mail/Express trains in a new colour scheme -- beige and brown.</p>\n<p>\n\tThe freshly-painted Delhi-Pathankot Express with 16 coaches will be the first train to be rolled out, by this month-end, with the new colour scheme developed by the in-house team of Northern Railway.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe colour of premium trains -- including Rajdhani, Shatabdi and Duronto -- will however not be changed and only Mail/Express service with conventional coaches manufactured at the Integral Coach Factory in Chennai will be donning the new colour.</p>\n<p>\n\tBesides, special service trains like Tejas and Gatimaan Express will also continue with the existing colour.</p>\n<p>\n\t\"A complete makeover of coaches was long overdue and the new colour scheme was applied in trains after it was finally approved by Railways Minister Piyush Goyal,\" a senior Railways Ministry official told IANS.</p>\n<p>\n\tIt was in the 1990s that the new colour scheme of dark blue was introduced for Mail/Express coaches, replacing the brick red colour which was in use for decades.</p>\n\n<p>\n\tNow the Railways has quite a task at hand -- repainting about 30,000 coaches in the new colour scheme.</p>\n<p>\n\tRailways have been taking steps to revamp its network across the country and improve passenger experience. The makeover of coaches for a more pleasing travel experience is one such step.</p>\n<p>\n\t\"The change of colour is part of the Railways' efforts to make passengers' experience a pleasant one,\" the official said.</p>\n<p>\n\tHe further said besides the exterior, steps have been taken to improve the interiors of the coaches with additional facilities.</p>\n<p>\n\t\"The replacement of all toilets with bio-toilets, providing mobile chargers at each berth, comfortable seats are some of the changes undertaken in trains. In fact, a provision has also been activated to solicit passengers' response and suggestions for improving service,\" he added.</p>\n\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "developed",
        "Indian",
        "colour",
        "30",
        "set",
        "Northern",
        "first",
        "new",
        "16",
        "Express",
        "painted",
        "rolled"
    ],
    "verbs": [
        "colour",
        "end",
        "will",
        "scheme",
        "set",
        "repaint",
        "Mail",
        "Express",
        "train",
        "house",
        "team"
    ]
}