{
    "creator": "PTI",
    "title": "NSE hopeful of consolidating offshore business to GIFT city",
    "link": "https://www.financialexpress.com/market/nse-hopeful-of-consolidating-offshore-business-to-gift-city/1209201/",
    "pubDate": "Sun, 17 Jun 2018 08:55:58 +05:30",
    "dc:creator": "PTI",
    "content": "The Nifty is the worlds largest traded derivative index in the off-shore market and a top volume generator on the Singapore Exchange (SGX) and reportedly generates 10 per cent of its volume. ",
    "contentSnippet": "The Nifty is the worlds largest traded derivative index in the off-shore market and a top volume generator on the Singapore Exchange (SGX) and reportedly generates 10 per cent of its volume.",
    "guid": "https://www.financialexpress.com/?p=1209201",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-17T03:25:58.000Z",
    "sentiment": {
        "score": 4,
        "comparative": 0.4444444444444444,
        "tokens": [
            "nse",
            "hopeful",
            "of",
            "consolidating",
            "offshore",
            "business",
            "to",
            "gift",
            "city"
        ],
        "words": [
            "gift",
            "hopeful"
        ],
        "positive": [
            "gift",
            "hopeful"
        ],
        "negative": []
    },
    "article": {
        "title": "NSE hopeful of consolidating offshore business to GIFT city",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1209214\" src=\"https://images.financialexpress.com/2018/06/NSE-Reu-620x413.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/NSE-Reu-620x413.jpg 620w, https://images.financialexpress.com/2018/06/NSE-Reu-620x413-300x200.jpg 300w, https://images.financialexpress.com/2018/06/NSE-Reu-620x413-401x267.jpg 401w\" sizes=\"(max-width: 620px) 100vw, 620px\"> The National Stock Exchange (NSE) is hopeful of consolidating trading volume at its subsidiary NSE IFSC Exchange in Gujarat’s GIFT City. (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>The National Stock Exchange (NSE) is hopeful of consolidating trading volume at its subsidiary NSE IFSC Exchange in Gujarat’s GIFT City in the long term even as it awaits the outcome of offshore derivative tussle with the Singapore Exchange, a top official has said. “We have received Commodities Futures Trading Commission (CFTC) nod for NSE and in a few months, we will get a nod for NSE IFSC in GIFT City,” NSE managing director &amp; CEO Vikram Lamaye told PTI.</p><span>\n</span><p>Although, it is believed to encourage overseas investors, Lamaye said this should not come in the way of people being able to trade in Gujarat International Finance Tec-City (GIFT City). He said it takes time to build liquidity but the bourse is actively working with investors to encourage them to trade in GIFT City, a financial Special Economic Zone. In a move to curb shifting of volumes to overseas markets after the imposition of long-term capital gains tax (LTCG), both NSE and BSE have decided to stop giving data to bourses in Singapore and Dubai.</p><span>\n</span><p>In the offshore markets, NSE’s Nifty is traded in Singapore bourse and BSEs Sensex is traded on the Dubai Gold and Commodity Exchange (DGCX). The Nifty is the worlds largest traded derivative index in the off-shore market and a top volume generator on the Singapore Exchange (SGX) and reportedly generates 10 per cent of its volume. In this backdrop, the Singapore bourse was planning to start its own derivative products based on publicly available settlement prices of Nifty futures contracts.</p><span>\n</span><p>It was to migrate all existing client contracts on the SGX Nifty Futures to the new SGX India Futures from June. However, after NSE got an injunction from court, SGX had decided to continue offering NSE-licensed Nifty contracts until August 2018, when agreement between the two bourses comes to an end.</p><span>\n</span><p>“Nifty is also available at NSE IFSC and offers all benefits required for overseas investors, be it Dollar denominated contracts, taxation benefits and compliance are similar to any offshore trading destination available at GIFT City,” he said. NSE was waiting for the outcome of the tussle with SGX before it takes further steps to lure overseas investors to keep offshore trading basket vibrant. “Let’s wait for the outcome of SGX case as they hold a lot of offshore funds,” Lamaye said. BSE also proposes to seek approval from Commodities Futures Trading Commission (CFTC) of the US to attract American investors to the GIFT City.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "10",
        "hopeful",
        "offshore",
        "off",
        "Nifty",
        "derivative",
        "top"
    ]
}