{
    "creator": "PTI",
    "title": "Violence cost India’s GDP over $1 trillion on PPP basis; Per person cost at Rs 40,000",
    "link": "https://www.financialexpress.com/economy/violence-cost-indias-gdp-over-1-trillion-on-ppp-basis-per-person-cost-at-rs-40000/1200366/",
    "pubDate": "Sun, 10 Jun 2018 10:48:36 +05:30",
    "dc:creator": "PTI",
    "content": "The economic impact of violence to the global economy was USD 14.76 trillion in 2017, in PPP terms. This is equivalent to 12.4 per cent of GDP, or USD 1,988 per person. ",
    "contentSnippet": "The economic impact of violence to the global economy was USD 14.76 trillion in 2017, in PPP terms. This is equivalent to 12.4 per cent of GDP, or USD 1,988 per person.",
    "guid": "https://www.financialexpress.com/?p=1200366",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-10T05:18:36.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.1875,
        "tokens": [
            "violence",
            "cost",
            "india’s",
            "gdp",
            "over",
            "1",
            "trillion",
            "on",
            "ppp",
            "basis",
            "per",
            "person",
            "cost",
            "at",
            "rs",
            "40000"
        ],
        "words": [
            "violence"
        ],
        "positive": [],
        "negative": [
            "violence"
        ]
    },
    "article": {
        "title": "Violence cost India’s GDP over $1 trillion on PPP basis; Per person cost at Rs 40,000",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1200367\" src=\"https://images.financialexpress.com/2018/06/bhadrak.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/bhadrak.jpg 660w, https://images.financialexpress.com/2018/06/bhadrak-300x200.jpg 300w, https://images.financialexpress.com/2018/06/bhadrak-620x413.jpg 620w, https://images.financialexpress.com/2018/06/bhadrak-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Violence cost the Indian economy a whopping USD 1.19 trillion (over Rs 80 lakh crore) last year in constant purchasing power parity (PPP) terms, which amounts to roughly USD 595.4 per person, says a report. (Representative photo)</figure>\n\t\t\t</section></div><span>\n</span><p>Violence cost the Indian economy a whopping USD 1.19 trillion (over Rs 80 lakh crore) last year in constant purchasing power parity (PPP) terms, which amounts to roughly USD 595.4 per person, says a report. The findings are part of the report prepared by the Institute for Economics and Peace (IEP) based on an analysis of 163 countries and territories. Violence impacted USD 1,190.51 billion to the Indian economy in 2017, 9 per cent of the country’s gross domestic product (GDP) or USD 595.4 (over Rs 40,000) per person. The economic impact of violence to the global economy was USD 14.76 trillion in 2017, in PPP terms. This is equivalent to 12.4 per cent of GDP, or USD 1,988 per person. The global economic impact of violence is defined as the expenditure and economic effect related to “containing, preventing and dealing with the consequences of violence”.</p><span>\n</span><p>The estimates include the direct and indirect cost of violence as well as an economic multiplier. “The multiplier effect calculates the additional economic activity that would have accrued if the direct costs of violence had been avoided,” the report noted. As per the report, human beings encounter conflict regularly – whether at home, at work, among friends, or on a more systemic level between ethnic, religious or political groups. But the majority of these conflicts do not result in violence. The fall in peacefulness over the decade was caused by a wide range of factors, including increased terrorist activity, the intensification of conflicts in the Middle East, rising regional tensions in Eastern Europe and northeast Asia, and increasing numbers of refugees and heightened political tensions in Europe and the US, it added.</p><span>\n</span><p>About the Asia-Pacific region, it said it remained the third most peaceful region in the world despite a slight fall in its overall peacefulness. There were notable improvements in both internal and external conflicts fought and relations with neighbouring countries, but violent crime, terrorism impact, political instability and political terror all deteriorated across the region. For South Asia, the report said strengthening scores on the Political Terror Scale, refugees and internally displaced person (IDPs) and terrorism impact were only partially offset by a deterioration in external conflicts fought after a border dispute with China flared in the Doklam Pass. The three-month standoff also involved India, which sent troops to the area, it added.</p><span>\n</span><p>In this region, the two least peaceful nations – Afghanistan and Pakistan – continued their decline. Besides, Bangladesh and Myanmar also saw deterioration, including due to the Rohingya crisis. “The total economic impact of violence (globally) was higher in 2017 than at any point in the last decade,” the report said, adding that the global economic impact of violence increased by 2.1 per cent from 2016 to 2017, mainly due to a rise in internal security expenditure. Syria topped the list of most affected countries by economic cost of violence as a percentage of GDP at 68 per cent, followed by Afghanistan (63 per cent), Iraq (51 per cent) in the second and third position respectively.</p><span>\n</span><p>Others in the ten most affected countries by economic cost of violence include El Salvador, South Sudan, Central African Republic, Cyprus, Colombia, Lesotho and Somalia. The report further noted that there has been a widening “prosperity gap” between less and more peaceful countries. Since 1960, the most peaceful countries have, on average, seen their per capita GDP grow by an annual rate of 2.8 per cent. On the other hand, less peaceful countries have experienced economic stagnation. Their annual per capita GDP has, on average, grown by just 1 per cent over the last seven decades.</p><span>\n</span><p>Switzerland is the least affected country in terms of economic cost of violence, followed by Indonesia and Burkina Faso. Among emerging markets violence impacted USD 1,704.62 billion to the Chinese economy, Brazil (USD 511,364.9 million), Russia (USD 1,013.78 billion) and South Africa (USD 239,480.2 million). Among developed nations, for the US, the cost of violence in terms of PPP was USD 2.67 trillion or 8 per cent of the GDP. For the UK, it was 312.27 billion, 7 per cent of GDP.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "trillion",
        "40",
        "economic",
        "global",
        "14",
        "76",
        "12",
        "equivalent"
    ],
    "nouns": [
        "terms",
        "person",
        "India",
        "GDP",
        "cost",
        "Violence",
        "violence",
        "trillion",
        "PPP",
        "basis",
        "40",
        "14",
        "economy",
        "12",
        "impact",
        "cent",
        "equivalent"
    ],
    "verbs": [
        "cost",
        "impact"
    ]
}