{
    "creator": "PTI",
    "title": "India has trade deficit with 10 RCEP members",
    "link": "https://www.financialexpress.com/economy/india-has-trade-deficit-with-10-rcep-members/1209310/",
    "pubDate": "Sun, 17 Jun 2018 12:22:50 +05:30",
    "dc:creator": "PTI",
    "content": "India had trade deficit with as many as 10 member countries, including China, South Korea and Australia, of the RCEP grouping of 16 nations which have been negotiating a mega trade pact since November 2012",
    "contentSnippet": "India had trade deficit with as many as 10 member countries, including China, South Korea and Australia, of the RCEP grouping of 16 nations which have been negotiating a mega trade pact since November 2012",
    "guid": "https://www.financialexpress.com/?p=1209310",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-17T06:52:50.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.25,
        "tokens": [
            "india",
            "has",
            "trade",
            "deficit",
            "with",
            "10",
            "rcep",
            "members"
        ],
        "words": [
            "deficit"
        ],
        "positive": [],
        "negative": [
            "deficit"
        ]
    },
    "article": {
        "title": "India has trade deficit with 10 RCEP members",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1209317\" src=\"https://images.financialexpress.com/2018/06/Trade-deficit.jpg\" alt=\"trade deficit, RCEP members, FTA partners, import, export,, domestic manufacturers, crude oil, highest deficit\" srcset=\"https://images.financialexpress.com/2018/06/Trade-deficit.jpg 660w, https://images.financialexpress.com/2018/06/Trade-deficit-300x200.jpg 300w, https://images.financialexpress.com/2018/06/Trade-deficit-620x413.jpg 620w, https://images.financialexpress.com/2018/06/Trade-deficit-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> India had trade deficit with as many as 10 member countries, including China, South Korea and Australia, of the RCEP grouping of 16 nations which have been negotiating a mega trade pact since November 2012.&nbsp; ( Source: PTI)</figure>\n\t\t\t</section></div><span>\n</span><p>India had trade deficit with as many as 10 member countries, including China, South Korea and Australia, of the RCEP grouping of 16 nations which have been negotiating a mega trade pact since November 2012. The Regional Comprehensive Economic Partnership (RCEP) block comprises 10 Asean group members (Brunei, Cambodia, Indonesia, Malaysia, Myanmar, Singapore, Thailand, the Philippines, Laos and Vietnam) and their six FTA partners – India, China, Japan, South Korea, Australia and New Zealand.</p><span>\n</span><p>According to the commerce ministry data, India’s trade deficit — the difference between imports and exports — with seven countries (Indonesia, Thailand, China, Japan, South Korea, Australia and New Zealand) of RCEP has in fact increased in 2017-18 as compared to the previous fiscal. The trade gap with China, Korea, Indonesia and Australia has increased to USD 63.12 billion; USD 11.96 billion; USD 12.47 billion and USD 10.16 billion in 2017-18. It was USD 51.11 billion, USD 8.34 billion, USD 9.94 billion and USD 8.19 billion respectively in the previous financial year, 2016-17. The case is same with regard to Japan, Thailand and New Zealand.</p><span>\n</span><p>However, the trade gap has dipped with the remaining three nations – Lao, Brunei, Malaysia — in 2017-18. Experts have given a mixed reaction on the impact of increasing this gap on India’s position in negotiating this mega free trade agreement. An industry expert stated that as this is a comprehensive trade deal, India would get greater market access in other countries not only in terms of<br>goods, but in services and investments also.</p><span>\n</span><p>“Trade deficit is only for goods. But this is a comprehensive pact. India would get market access in services and investment opportunities. RCEP members including Japan and South Korea are big investors in India,” the expert said. On the other hand, international trade experts stated that India needs to be cautious while negotiating the pact as the trade deficit is increasing with several of the RCEP member nations, which would impact domestic manufacturers. “Free trade agreements are not about only giving market access, but also getting that access in other countries. Our exports to countries like Singapore, with which India has trade surplus, is not increasing with healthy pace,” said Biswajit Dhar, the professor of economics at Jawaharlal Nehru University. He said that as the strength of the domestic manufacturing is weak, India would not be able to take advantage of such free trade agreements.</p><span>\n</span><p>On trade deficit, Commerce Secretary Rita Teaotia recently stated that “when we talk about trade deficits, it’s not necessarily a negative (thing for a country)”. India does not have a free trade agreement with two of its biggest trading partners – the US and China – but the country has the highest positive balance of trade with the US, while it has the highest deficit with China. “We import those products which we do not produce ourselves and which we do not have it in enough quantities like crude oil, certain intermediates for electronics and edible oil…You cannot have an entire global value chain located in a single country, no country has achieved this,” she had said. She had added that India will endeavour to have a “balanced” RECP trade agreement as it would cover 40 per cent of the global GDP and over 42 per cent of the world’s population.</p><span>\n</span><p>The pact, negotiations for which started in the Cambodian capital Phnom Penh in November 2012, aims to cover goods, services, investments, economic and technical cooperation, competition and intellectual property rights. Pressure is also mounting on India for early conclusion of the proposed trade pact. Member countries are looking to conclude the talks by end of this year but a lot of issues are yet to be finalised including the number of products over which duties will be eliminated. Domestic steel and other metal industries want these sectors to be kept out of the deal.</p><span>\n</span><p>Under services, India wants greater market access for its professionals in the proposed agreement. India already has a free trade pact with Association of South East Asian Nations (ASEAN), Japan and South Korea. It is also negotiating a similar agreement with Australia and New Zealand but has no such plans for China.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "10",
        "South",
        "16"
    ],
    "verbs": [
        "trade"
    ]
}