{
    "title": "DRI serves arrest warrant to absconding diamantaire Nirav Modi via email",
    "link": "https://www.business-standard.com/article/finance/dri-serves-arrest-warrant-to-absconding-diamantaire-nirav-modi-via-email-118062400449_1.html",
    "pubDate": "Sun, 24 Jun 2018 18:40:00 +0530",
    "content": "Nirav Modi and his uncle Mehul Choksi, the promoter of Gitanjali Gems, have allegedly defrauded PNB of over Rs 130 bn. The CBI and ED have also registered cases of alleged fraud against them",
    "contentSnippet": "Nirav Modi and his uncle Mehul Choksi, the promoter of Gitanjali Gems, have allegedly defrauded PNB of over Rs 130 bn. The CBI and ED have also registered cases of alleged fraud against them",
    "guid": "https://www.business-standard.com/article/finance/dri-serves-arrest-warrant-to-absconding-diamantaire-nirav-modi-via-email-118062400449_1.html",
    "isoDate": "2018-06-24T13:10:00.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.18181818181818182,
        "tokens": [
            "dri",
            "serves",
            "arrest",
            "warrant",
            "to",
            "absconding",
            "diamantaire",
            "nirav",
            "modi",
            "via",
            "email"
        ],
        "words": [
            "arrest"
        ],
        "positive": [],
        "negative": [
            "arrest"
        ]
    },
    "article": {
        "title": "DRI serves arrest warrant to absconding diamantaire Nirav Modi via email",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tRevenue intelligence agency DRI has served an arrest warrant via email to absconding diamantaire Nirav Modi in a case of alleged customs duty evasion, officials said today.</p>\n<p>\n\tThe warrant was issued by a court in Surat in Gujarat after he failed to appear before it in connection with the case, they said.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe DRI had in March launched prosecution against Nirav Modi and three of his firms Firestar International Pvt Ltd (FIPL), Firestar Diamond International Pvt Ltd (FDIPL) and Radashir Jewellery Co Pvt Ltd (RJCPL), based in the Special Economic Zone, Surat, for allegedly diverting duty-free imported goods for purposes other than specified in the rules, they said.</p>\n<p>\n\tAccording to the norms, duty-free import of goods by the units located in the SEZ is permitted only if they are to be used as raw material and are exported after value addition or processing.</p>\n<p>\n\tIt was found that high-value diamonds and pearls worth Rs 890 crore, involving customs duty of Rs 52 crore, were allegedly diverted by the SEZ units controlled by Nirav Modi and sold in the open market, the officials said.</p>\n<p>\n\tTo evade import duty, he exported low-quality diamonds and pearls and claimed that these were the ones imported and then processed, they said.</p>\n<p>\n\tThe DRI, which is probing the case, has claimed that it has collected vital details, documents and evidence.</p>\n<p>\n\tAfter the launch of prosecution in the case, summonses were issued by the court of chief judicial magistrate, Surat, against Nirav Modi but neither he nor his representative appeared before the court on specified dates, they said.</p>\n<p>\n\tThereafter, the arrest warrant was issued against Nirav Modi by the court and it was emailed by the DRI to him, they said.</p>\n<p>\n\tNirav Modi and his uncle Mehul Choksi, the promoter of Gitanjali Gems, have allegedly defrauded Punjab National Bank of over Rs 13,000 crore.</p>\n<p>\n\tThe Central Bureau of Investigation and the Enforcement Directorate have also registered cases of alleged fraud against them.<br>Meanwhile, a report said that Nirav Modi was living in a flat just above his jewellery store in the post Mayfair area of London while he was being hunted in India for an alleged money laundering case linked to over $2 bn.The 47-year-old diamantaire was able to travel in and out of Britain at least four times since his passport was cancelled by the Indian authorities in February.</p>\n<p>\n\tDuring his stay in London, he was reportedly living in the heart of the city above his jewellery boutique called \"Nirav Modi\" on Old Bond Street, which was reportedly closed last week, The Sunday Times reported.\n\t<br></p><p id=\"auto_disclaimer\">(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "alleged",
        "registered",
        "130"
    ],
    "verbs": [
        "arrest",
        "warrant",
        "email"
    ],
    "nouns": [
        "promoter",
        "fraud",
        "arrest",
        "warrant",
        "email",
        "uncle",
        "ED"
    ]
}