{
    "creator": "Anirban Halder",
    "title": "WhatsApp wishlist: Top 5 things the messaging app should have",
    "link": "https://www.financialexpress.com/industry/technology/whatsapp-wishlist-top-5-things-the-messaging-app-should-have/1200571/",
    "pubDate": "Sun, 10 Jun 2018 18:14:13 +05:30",
    "dc:creator": "Anirban Halder",
    "content": "WhatsApp wishlist: WhatsApp still has some caveats that, if taken care off, would probably make it more utilitarian. Below listed are some of the things that WhatsApp messaging application should include in the updates to come in future. ",
    "contentSnippet": "WhatsApp wishlist: WhatsApp still has some caveats that, if taken care off, would probably make it more utilitarian. Below listed are some of the things that WhatsApp messaging application should include in the updates to come in future.",
    "guid": "https://www.financialexpress.com/?p=1200571",
    "categories": [
        "Industry",
        "Technology"
    ],
    "isoDate": "2018-06-10T12:44:13.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.2,
        "tokens": [
            "whatsapp",
            "wishlist",
            "top",
            "5",
            "things",
            "the",
            "messaging",
            "app",
            "should",
            "have"
        ],
        "words": [
            "top"
        ],
        "positive": [
            "top"
        ],
        "negative": []
    },
    "article": {
        "title": "WhatsApp wishlist: Top 5 things the messaging app should have",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1200640\" src=\"https://images.financialexpress.com/2018/06/WhatsApp-600A.jpg\" alt=\" WhatsApp has been providing us with frequent updates from time to time to ensure the messaging application remains as simple and resourceful as possible.\" srcset=\"https://images.financialexpress.com/2018/06/WhatsApp-600A.jpg 661w, https://images.financialexpress.com/2018/06/WhatsApp-600A-300x200.jpg 300w, https://images.financialexpress.com/2018/06/WhatsApp-600A-620x413.jpg 620w, https://images.financialexpress.com/2018/06/WhatsApp-600A-401x267.jpg 401w\" sizes=\"(max-width: 661px) 100vw, 661px\"> WhatsApp has been providing us with frequent updates from time to time to ensure the messaging application remains as simple and resourceful as possible. (Image: Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>With over 1.5 billion active users, <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/whatsapp/\">WhatsApp</a> has truly captivated minds of masses and become one of the most essential apps in our smartphones. WhatsApp has been providing us with frequent updates from time to time to ensure the messaging application remains as simple and resourceful as possible. With the latest update, WhatsApp wants to curb spam messages floating on the application by adding the word ‘forwarded’ in every message you want to forward. However, the messaging application still has some caveats that, if taken care off, would probably make it more utilitarian. Below listed are some of the things that WhatsApp messaging application should include in the updates to come in future.</p><span>\n</span><h2>WhatsApp wishlist: Protect specific chat using pin</h2><span>\n</span><p>WhatsApp should have a feature that allows users to keep specific chats secure using a pin or a password. The inclusion of this feature would not only make the application more secure, it’ll make the users concerned about privacy happy. WhatsApp already boasts that all chats are end-to-end encrypted, and there are a lot many features like pin chat to top. However, the addition of the feature would definitely be a breather for many users.</p><span>\n</span><h2>WhatsApp wishlist: Dark Mode</h2><span>\n</span><p>There have been many features that make WhatsApp visibly simpler and neat. The clean UI of WhatsApp is what makes the messaging app so much more convenient for the user. However, in future updates, it would be extremely interesting to see the messaging application include a dark mode or a dark theme. This minimum bit customization could go a long way as WhatsApp doesn’t necessarily have a lot to offer. Most of the features/updates from WhatsApp make the application more user-friendly. However, users are left empty-handed when it comes to customization of the messaging app. A dark mode would definitely come in handy when using the messaging app in a room with less light.</p><span>\n</span><h2>WhatsApp wishlist: Seek permission of the user before joining a group</h2><span>\n</span><p>One of the biggest drawbacks that WhatsApp faces to date is the fact users are intimated after a group has been formed by another user, and not prior to that. This may create a hassle for the user as he/she may not want to join a specific group. A user must be notified before adding him/her in a WhatsApp group. The lack of this feature on WhatsApp doesn’t come out, however, the inclusion of this feature would be much appreciated.</p><span>\n</span><h2>WhatsApp wishlist: Preview voice messages before sending</h2><span>\n</span><p>Another feature that is missing from WhatsApp is that there is no option to preview a voice message before sending it. WhatsApp recently rolled out a feature called ‘locked voice recording’ which allows a user to be handsfree and speak to send a voice message. However, if you wish to listen to a recording before sending, then that option is missing.</p><span>\n</span><h2>WhatsApp wishlist: Complete invisible mode</h2><span>\n</span><p>WhatsApp has a feature that allows a user to forbid other users from seeing their “last seen” timestamp. However, it defeats the purpose of staying hidden as the moment you come online, the status shows “Online”. WhatsApp should include a feature that allows a user to go completely incognito while using the messaging application.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "future",
        "Top",
        "taken",
        "off",
        "utilitarian",
        "listed"
    ],
    "nouns": [
        "future",
        "things",
        "application",
        "Top",
        "messaging",
        "care",
        "utilitarian"
    ],
    "verbs": [
        "include",
        "Top",
        "care",
        "off"
    ]
}