{
    "title": "Excise duty cut in oil to impact fiscal deficit badly: Moody's",
    "link": "https://timesofindia.indiatimes.com/business/india-business/excise-duty-cut-in-oil-to-impact-fiscal-deficit-badly-moodys/articleshow/64623288.cms",
    "pubDate": "Sun, 17 Jun 2018 12:23:22 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/excise-duty-cut-in-oil-to-impact-fiscal-deficit-badly-moodys/articleshow/64623288.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64623288.cms\" /></a>Rating agency Moody's has sounded a note of caution that any reduction in excise duty on petrol and diesel would adversely affect fiscal deficit unless it is matched by a commensurate cut in expenditure.",
    "contentSnippet": "Rating agency Moody's has sounded a note of caution that any reduction in excise duty on petrol and diesel would adversely affect fiscal deficit unless it is matched by a commensurate cut in expenditure.",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/excise-duty-cut-in-oil-to-impact-fiscal-deficit-badly-moodys/articleshow/64623288.cms",
    "isoDate": "2018-06-17T12:23:22.000Z",
    "sentiment": {
        "score": -6,
        "comparative": -0.5454545454545454,
        "tokens": [
            "excise",
            "duty",
            "cut",
            "in",
            "oil",
            "to",
            "impact",
            "fiscal",
            "deficit",
            "badly",
            "moody's"
        ],
        "words": [
            "badly",
            "deficit",
            "cut"
        ],
        "positive": [],
        "negative": [
            "badly",
            "deficit",
            "cut"
        ]
    },
    "article": {
        "title": "Excise duty cut in oil to impact fiscal deficit badly: Moody's",
        "content": "<div class=\"Normal\"><span>NEW DELHI: Rating agency </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Moody%27s\">Moody's</a><p> has sounded a note of caution that any reduction in excise duty on petrol and diesel would adversely affect fiscal deficit unless it is matched by a commensurate cut in expenditure.\n\n</p><p>Pressure has been mounting on the government to cut excise duty on petrol and diesel to bring down their prices which have gone up following a spike in crude prices in the international market.\n</p><p>According to government estimates, every rupee cut in excise duty on petrol and diesel will result in a revenue loss of about Rs 13,000 crore.\n</p><p>Observing that fiscal consolidation would be closely watched for assigning the sovereign rating, Moody's said India's biggest challenge is its fiscal strength which is relatively low as compared to 'Baa' rated peers.\n</p><p>\"Any reduction in revenues, including through the excise duty on petroleum and diesel, would most likely need to be offset by a comparable reduction in expenditure in order to achieve fiscal consolidation,\" Moody's Investors Service VP &amp; Senior Credit Officer, Sovereign Risk Group, William Foster told PTI.\n</p><p>Moody's had last year upped India's sovereign rating for the first time in over 13 years to 'Baa2' with a stable outlook, saying that growth prospects have improved with continued economic and institutional reforms.\n</p><p>\"India's biggest credit challenge is its fiscal strength ... due to persistently large general government fiscal deficits and a high debt burden. For example, India's general government debt-to-GDP ratio is nearly 70 per cent, relative to the 'Baa' peer group median of about 50 per cent.\n</p><p>\"Moving forward, maintaining the government's commitment to fiscal consolidation will be a very important contributor to the strengthening of India's fiscal dynamics and overall sovereign credit profile,\" Foster said.\n</p><span>The government plans to bring down the fiscal deficit - the gap between total expenditure and total revenue - during 2018-19 to 3.3 per cent of the </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/gross-domestic-product\">gross domestic product</a><p> (GDP), from 3.53 per cent in last fiscal.\n</p><p>Asked about the 0.25 per cent hike in interest rate by the RBI after a gap of over four years, Foster said from a sovereign rating perspective it would help in containing inflation and ensuring more sustainable growth.\n</p><span>\n</span><br><span>\"The MPC's recent monetary policy decision is in line with the RBI's inflation targeting objectives, which supports the credibility of Indian monetary policymaking and contributes to a more sustainable growth dynamic by focusing on the anchoring of inflation expectations,\" he said.\n</span><br><span>\n</span><br><span>The RBI hiked rates citing growing concerns about inflation stoked by rising global crude oil prices as well as domestic price increases.\n</span><br><span>\n</span><br><span>The price of Indian basket of crude surged from $66 a barrel in April to around $74 currently.\n</span><br><span>\n</span><br><span>Retail inflation jumped to a four-month high of 4.87 per cent in May on costlier food items such as fruits, vegetables and fuel. \n</span><br><span>\n</span></div>"
    },
    "adjectives": [
        "commensurate",
        "10",
        "left",
        "top",
        "right",
        "cut",
        "fiscal",
        "Moody",
        "matched"
    ],
    "nouns": [
        "india",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo",
        "Excise",
        "excise",
        "duty",
        "cut",
        "oil",
        "impact",
        "deficit",
        "Moody",
        "Rating",
        "agency",
        "note",
        "caution",
        "reduction",
        "petrol",
        "diesel",
        "affect",
        "expenditure"
    ],
    "verbs": [
        "border",
        "align",
        "style",
        "top",
        "right",
        "Excise",
        "excise",
        "cut",
        "oil",
        "impact",
        "note",
        "caution",
        "affect"
    ]
}