{
    "title": "'Scrutiny of shell cos might unearth something about political parties'",
    "link": "https://www.business-standard.com/article/economy-policy/scrutiny-of-shell-cos-might-unearth-something-about-political-parties-118061700253_1.html",
    "pubDate": "Sun, 17 Jun 2018 16:11:00 +0530",
    "content": "The government wants transparency in the functioning of companies and ensure that they are not misused as conduits for money laundering and other illegal activities",
    "contentSnippet": "The government wants transparency in the functioning of companies and ensure that they are not misused as conduits for money laundering and other illegal activities",
    "guid": "https://www.business-standard.com/article/economy-policy/scrutiny-of-shell-cos-might-unearth-something-about-political-parties-118061700253_1.html",
    "isoDate": "2018-06-17T10:41:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "'scrutiny",
            "of",
            "shell",
            "cos",
            "might",
            "unearth",
            "something",
            "about",
            "political",
            "parties'"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "'Scrutiny of shell cos might unearth something about political parties'",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tSending out a strong message to erring corporates, Union Minister <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=p+p+chaudhary\" target=\"_blank\">P P Chaudhary </a>has said autonomy of companies cannot be at the cost of investor interests and indicated that scrutiny of shell firms could unearth \"something\" about political parties as well as individuals.</p>\n<p>\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=minister+of+state+for+corporate+affairs\" target=\"_blank\">Minister of State for Corporate Affairs </a>asserted that the government wants <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=transparency\" target=\"_blank\">transparency </a>in the functioning of companies and ensure that they are not misused as conduits for money laundering and other illegal activities.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tIntensifying its efforts to curb illicit fund flows, the corporate affairs ministry has served notices to around 225 thousand companies that have not been carrying out business activities for long and depending on their responses, a final decision on deregistering them would be taken.</p>\n<p>\n\tThe latest exercise comes after the ministry struck off the names of about 226 thousand companies from official records for being inactive and not making statutory filings for a long time.</p>\n<p>\n\tAgainst this backdrop, Chaudhary said scrutiny of the struck-off companies is going on to understand their financial tracks and how many other entities were linked to them.</p>\n<p>\n\t\"I am sure, personally I feel that something will come out once we scrutinise (struck off) companies. It may be (about) political parties, it may be (about) individuals... but certainly it will be (about) those who have ruled the nation for a longer time,\" he told PTI in an interview.</p>\n<p>\n\tAmid concerns in certain quarters that the crack down on illicit fund flows could also be impacting the autonomous functioning of companies, he said the norms are to ensure <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=transparency\" target=\"_blank\">transparency </a>and not create impediments for the functioning of corporates.</p>\n<p>\n\t\"Autonomy should be maintained but not at the cost of investor interests... We are compelling companies to observe the law,\" he noted.</p>\n<p>\n\tBlaming the previous UPA regime for allowing <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/shell-companies\" target=\"_blank\">shell companies </a>to continue, the minister said the ills are of so many years and that the government is only bringing them out now.</p>\n<p>\n\t\"There was no question of allowing them (shell companies) to continue because under the old Act and the new Act, the provisions were there with respect to non-compliance. It was not used and it shows that the UPA govermment and the Congress allowed such companies to flourish. It shows that unscruplous people also served their own interest,\" Chaudhary said.</p>\n<p>\n\tCompanies Act, 1956 has been replaced with Companies Act, 2013. Most provisions of the new law came into force from April 1, 2014.</p>\n<p>\n\tAbout the present round of clamping down on inactive companies, the minister said a decision on whether to deregister them or not would be taken by next month after taking into consideration their responses to the notices.</p>\n<p>\n\t\"Approximately, 2,25,000 companies have been identified in the second round of drive for defaults like non-filing of financial statements for last two financial years and not seeking dormant status in case they are not doing any business for some time.</p>\n<p>\n\t\"Notices have been issued to such companies to ascertain their true status,\" he noted.</p>\n<p>\n\tCurrently, there are more than 1100 thousand active companies in the country.</p>\n<p>\n\tSeparately, authorities are working on having a definition for <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/shell-companies\" target=\"_blank\">shell companies.</a></p>\n<p>\n\tAs per latest data available with the ministry, out of the 226 thousand companies that were deregistered, cash was deposited in the bank accounts of 168 thousand firms post demonetisation.</p>\n<p>\n\t\"73,000 companies deposited Rs 240 billion. Details of 58,000 companies from various banks are under process,\" Chaudhary said.</p>\n<p>\n\tAs many as 68 companies are under probe, with 19 of them being investigated by the Serious Fraud Investigation Office (SFIO).</p>\n<p>\n\tAs part of efforts to fight the black money menace, the government had cancelled old Rs 500 and Rs 1,000 as legal tenders in November 2016.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "political",
        "functioning",
        "misused",
        "illegal"
    ],
    "verbs": [
        "shell",
        "unearth",
        "ensure"
    ],
    "nouns": [
        "money",
        "cos",
        "government",
        "transparency",
        "functioning",
        "Scrutiny",
        "shell",
        "laundering"
    ]
}