{
    "title": "Vigilant eye on conduct of insolvency professionals: IBBI chief M S Sahoo",
    "link": "https://www.business-standard.com/article/economy-policy/vigilant-eye-on-conduct-of-insolvency-professionals-ibbi-chief-m-s-sahoo-118061000258_1.html",
    "pubDate": "Sun, 10 Jun 2018 14:07:00 +0530",
    "content": "Under the IBC, the professional has a key role in the resolution process and has significant powers",
    "contentSnippet": "Under the IBC, the professional has a key role in the resolution process and has significant powers",
    "guid": "https://www.business-standard.com/article/economy-policy/vigilant-eye-on-conduct-of-insolvency-professionals-ibbi-chief-m-s-sahoo-118061000258_1.html",
    "isoDate": "2018-06-10T08:37:00.000Z",
    "sentiment": {
        "score": 3,
        "comparative": 0.25,
        "tokens": [
            "vigilant",
            "eye",
            "on",
            "conduct",
            "of",
            "insolvency",
            "professionals",
            "ibbi",
            "chief",
            "m",
            "s",
            "sahoo"
        ],
        "words": [
            "vigilant"
        ],
        "positive": [
            "vigilant"
        ],
        "negative": []
    },
    "article": {
        "title": "Vigilant eye on conduct of insolvency professionals: IBBI chief M S Sahoo",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=insolvency\" target=\"_blank\">Insolvency </a>and Bankruptcy Board keeps a \"vigilant eye\" on the conduct of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=insolvency\" target=\"_blank\">insolvency </a>professionals and prompt actions, including cancellation of registration, can be taken against them for misdemeanours, its chief <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=m+s+sahoo\" target=\"_blank\">M S Sahoo </a>said.</p>\n<p>\n\tHis comments come against the backdrop of concerns expressed about the conduct of such professionals in certain cases and the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=insolvency+and+bankruptcy+board+of+india\" target=\"_blank\"></a><a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=insolvency\" target=\"_blank\">Insolvency </a>and Bankruptcy Board of India (IBBI) has also passed orders against some of them.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tUnder the Insolvency and Bankruptcy Code, the professional has a key role in the resolution process and has significant powers.</p>\n<p>\n\tEmphasising that the insolvency profession is not just another profession, Sahoo said there are adequate provisions in the regulations to ensure independence and impartiality of an insolvency professional and to avoid conflict of interests.</p>\n<p>\n\t\"There are also provisions in the regulations to deal with any misdemeanour on the part of an insolvency professional.</p>\n<p>\n\t\"The <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ibbi\" target=\"_blank\">IBBI </a>keeps a vigilant eye on the conduct of the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=insolvency+professionals\" target=\"_blank\">insolvency professionals </a>and takes prompt action permissible under the law, following a transparent, objective process that does not harass innocent insolvency professionals,\" the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ibbi\" target=\"_blank\">IBBI </a>Chairperson told PTI in an interview.</p>\n<p>\n\tOnly a fit and proper person is eligible to be registered as an insolvency professional, as per the norms. While stakeholders in a particular case proposes the name of such a person for the resolution process, the appointment is made by the adjudicating authority -- National Company Law Tribunal (NCLT). The tribunal also has powers to remove him or her from the position.</p>\n<p>\n\tAccording to Sahoo, various actions could be taken against <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=insolvency+professionals\" target=\"_blank\">insolvency professionals </a>in case of misdemeanour.</p>\n<p>\n\t\"These actions include suspension or cancellation of registration, disgorgement of unlawful gains or a monetary penalty which could be three times the amount of loss caused on account of the contravention or three times of unlawful gains made, whichever is higher,\" he noted.</p>\n<p>\n\tAbout instances of differences between stakeholders and resolution professionals, Sahoo said a decision taken by him or her may not always further the interests of all stakeholders to the same extent.</p>\n<p>\n\tThe professional may admit a claim for an amount different from what is claimed by a claimant, he said, adding that it is, therefore, natural that some stakeholders may have differences with the professional concerned.</p>\n<p>\n\t\"Nevertheless, not many cases of difference have come up. It is, however, important that the constituents of the Corporate Insolvency Resolution Plan (CIRP) need to act in harmony with one another and discharge their responsibilities in time. It is a team responsibility to complete the process in time, and there is no opposite party,\" the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ibbi\" target=\"_blank\">IBBI </a>chief said.</p>\n<p>\n\tThere are more than 1,800 registered <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=insolvency+professionals\" target=\"_blank\">insolvency professionals.</a></p>\n<p>\n\tMore than 750 cases have been admitted for resolution process under the Code, which came into force more than one-and-a-half years ago.</p>\n<p>\n\tOn May 18, Financial Services Secretary Rajiv Kumar had said it was a historic day as banks recover Rs 36,400 crore from sale of Bhushan Steels to Tata Steel under the Code. Banks will gain from write back. The result of silent and transformative change in credit culture, he had said.</p>\n<p>\n\tStating that the Code was, in many ways, a leap into the unknown, Sahoo said the authorities have displayed a strong commitment to the cause of reform.</p>\n<p>\n\t\"The adjudicating authority and the judiciary are in the forefront of this reform. They have settled many contentious issues expeditiously and delivered several landmark orders, bringing in clarity as to what is permissible and what is not, and streamlining the process for future.</p>\n<p>\n\t\"Another takeaway is that the Code has brought in behavioural changes among the stakeholders, particularly debtors and creditors,\" he said.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "verbs": [
        "process",
        "eye",
        "conduct",
        "key"
    ],
    "adjectives": [
        "professional",
        "significant",
        "Vigilant",
        "chief",
        "M",
        "key",
        "Under"
    ]
}