{
    "creator": "Banikinkar Pattanayak",
    "title": "India signals more retaliatory steps",
    "link": "https://www.financialexpress.com/economy/india-signals-more-retaliatory-steps/1209131/",
    "pubDate": "Sun, 17 Jun 2018 03:50:56 +05:30",
    "dc:creator": "Banikinkar Pattanayak",
    "content": "India has told the World Trade Organization (WTO) that it’s within its right to slap more retaliatory measures against the US if required, even beyond the 30 American goods.",
    "contentSnippet": "India has told the World Trade Organization (WTO) that it’s within its right to slap more retaliatory measures against the US if required, even beyond the 30 American goods.",
    "guid": "https://www.financialexpress.com/?p=1209131",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-16T22:20:56.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "india",
            "signals",
            "more",
            "retaliatory",
            "steps"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "India signals more retaliatory steps",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1209136\" src=\"https://images.financialexpress.com/2018/06/1-101.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/1-101.jpg 660w, https://images.financialexpress.com/2018/06/1-101-300x200.jpg 300w, https://images.financialexpress.com/2018/06/1-101-620x413.jpg 620w, https://images.financialexpress.com/2018/06/1-101-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> India says US action to determine future course; proposes extra duty on Harley bikes, 29 other items for now</figure>\n\t\t\t</section></div><span>\n</span><p>India has told the World Trade Organization (WTO) that it’s within its right to slap more retaliatory measures against the US if required, even beyond the 30 American goods —including Harley Davidson bikes, apples and almonds — it has selected for now to counter the Trump administration’s extra tariff on Indian steel and aluminium.</p><span>\n</span><p>In a communication to the WTO in Geneva on Wednesday, a day after commerce minister Suresh Prabhu wrapped up his US visit, New Delhi said: “India reserves its right to further suspend substantially equivalent concessions and other obligations based on the trade impact resulting from the application of the measures of the US.”</p><span>\n</span><p>Harley and other American bikes with engine capacity above 800cc will attract an additional 50% import duty (over and above the current 50%) if India implements its proposal, while the duty on apples will be raised by 25% and almonds by 20%. Only in February, India had cut the import duty on superbikes such as Harley Davidson to 50% to pacify the US.</p><span>\n</span><p>The fiscal impact of its proposed tariff hike for the 30 items, India says, will be in sync with the $241 million the US is estimated to rake in by slapping the extra duty of 25% on Indian steel and 10% on aluminium. The US could mop up $198.6 million in additional duty on steel and $42.4 million on aluminium, New Delhi estimates.</p><span>\n</span><p>Prabhu has said senior officials from the US and India will soon meet to resolve various trade issues. Given this backdrop, India’s proposed retaliation suggests while the country is ready to engage the US to sort out issues amicably, it is unwilling to take things lying down.</p><span>\n</span><p>Among other items, India has proposed an extra tariff of 10% on diagnostic reagent and binders for foundry moulds, 15% on certain steel products, 10% on select pulses and 15% on phosphoric acid. All these additional duties are meant for only American goods. The additional tariff on different varieties of American almonds will fetch almost $122 million, while that on apples will be to the tune of $24 million. Extra duty on superbikes would garner $5.3 million.</p><span>\n</span><p>Before February, imports of fully-assembled motorcycles with engine capacity of 800cc or less attracted a 60% duty, while those above 800cc were taxed at 75%. US President Donald Trump last year hinted that Harley Davidson was taxed at 100% in India, while the fact was the American bikemaker was paying as little as 10% on supplies it brought in in completely knocked-down (CKD) conditions and 30% on its semi-knocked-down (SKD) kits. India levies a 100% import duty only on second-hand bikes to avoid being a dumping ground for items that pose environmental risks.</p><span>\n</span><p>Since Harley Davidson is already importing much of its supplies in CKD and SKD conditions (it has a facility in Haryana), the impact of the additional duty on it is expected to be limited. Still, the move will send a signal that India will retaliate if provoked, said a senior trade analyst.</p><span>\n</span><p>Trump recently renewed his criticism of India’s alleged high tariff regime. “This isn’t just G7. I mean, we have India, where some of the tariffs are 100%. A 100%. And we charge nothing. We can’t do that,” Trump said, as he threatened to stop trade with countries “who are being unfair” to the US.</p><span>\n</span><p>Analysts have said the flip-flops in Trump’s attitude to trade (He went ahead with extra tariffs on $50 billion Chinese goods after signalling a thaw and also upset traditional close allies in the group of seven industrialised nations) have got India and others worried. Thus, India has to resolutely pursue its case at the WTO, they have said.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "retaliatory",
        "World",
        "right",
        "required",
        "even",
        "30",
        "American"
    ],
    "verbs": [
        "Trade",
        "right",
        "slap",
        "even"
    ],
    "nouns": [
        "India",
        "steps",
        "World",
        "Trade",
        "Organization",
        "WTO",
        "US",
        "even",
        "30",
        "American",
        "right",
        "slap"
    ]
}