{
    "title": "FinMin mulls transferring shares of 5 sick CPSE to a fund to meet Sebi norm",
    "link": "https://www.business-standard.com/article/economy-policy/finmin-mulls-transferring-shares-of-5-sick-cpse-to-a-fund-to-meet-sebi-norm-118061000147_1.html",
    "pubDate": "Sun, 10 Jun 2018 10:46:00 +0530",
    "content": "The finance ministry would be discussing with market regulator Sebi to allow transfer of shares in these companies to SNIF",
    "contentSnippet": "The finance ministry would be discussing with market regulator Sebi to allow transfer of shares in these companies to SNIF",
    "guid": "https://www.business-standard.com/article/economy-policy/finmin-mulls-transferring-shares-of-5-sick-cpse-to-a-fund-to-meet-sebi-norm-118061000147_1.html",
    "isoDate": "2018-06-10T05:16:00.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.06666666666666667,
        "tokens": [
            "finmin",
            "mulls",
            "transferring",
            "shares",
            "of",
            "5",
            "sick",
            "cpse",
            "to",
            "a",
            "fund",
            "to",
            "meet",
            "sebi",
            "norm"
        ],
        "words": [
            "sick",
            "shares"
        ],
        "positive": [
            "shares"
        ],
        "negative": [
            "sick"
        ]
    },
    "article": {
        "title": "FinMin mulls transferring shares of 5 sick CPSE to a fund to meet Sebi norm",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/finance-ministry\" target=\"_blank\">Finance Ministry </a>is planning to transfer shares of five sick CPSEs including <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/hmt\" target=\"_blank\">HMT </a>and Andrew Yule &amp; Company, to the SNIF fund to meet Sebi's minimum 25 per cent public shareholding.</p>\n<p>\n\tThe Central Public Sector Enterprises (CPSEs) whose shares would be transferred to the Special National Investment Fund (SNIF) are Fertilizers &amp; Chemicals (Travancore) (FACT), <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=hindustan+photo+films\" target=\"_blank\">Hindustan Photo Films </a>Manufacturing Co., Scooters India, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/hmt\" target=\"_blank\">HMT </a>and Andrew Yule &amp; Company, an official said.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/finance-ministry\" target=\"_blank\">Finance Ministry </a>would be discussing with market regulator Sebi to allow transfer of shares in these companies to SNIF to meet the 25 per cent public holding norm for listed companies.</p>\n<p>\n\tThese companies have time till August 21 to meet the 25 per cent public share holding norm.</p>\n<p>\n\t\"Since these CPSEs were not financially sound, meeting the minimum public shareholding norm by following Sebi's method to reduce stakes would have been difficult. Hence, we are planning to transfer the shares to SNIF on a case-to-case basis,\" the official told PTI.</p>\n<p>\n\tCurrently, government holds 89.25 per cent stake in Andrew Yule &amp; Company, 90 per cent each in <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=fact\" target=\"_blank\">FACT </a>and Hindustan Photo Films, 93.69 per cent in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/hmt\" target=\"_blank\">HMT </a>and 93.74 per cent in Scooters India.</p>\n<p>\n\tAccordingly, shares would be transferred on a proportionate basis to the fund to bring down government stake in these CPSEs to 75 per cent.</p>\n<p>\n\tThe government had in 2013 approved setting up of the SNIF with the specific objective of meeting the minimum public shareholding of 10 per cent as was then mandated by the Securities and Exchange Board of India (Sebi).</p>\n<p>\n\tAt that time, there were six sick CPSEs whose shares were to be transferred to SNIF -- FACT, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=hindustan+photo+films\" target=\"_blank\">Hindustan Photo Films </a>Manufacturing, HMT Ltd, Scooters India and ITI.</p>\n<p>\n\tWith ITI revival package in place, the telecom PSU has turned profitable after 16 years and posted a net profit of Rs 27 crore in the third quarter of 2017-18.</p>\n<p>\n\tITI will be launching a follow-on public offer (FPO) to meet the 25 per cent public holding norm. The government currently holds 92.59 per cent stake in ITI.</p>\n<p>\n\tThe SNIF was formed to transfer the number of shares that is required to make six sick companies compliant with the minimum public shareholding without any consideration.</p>\n<p>\n\tThe fund was managed by independent professional fund managers and was assigned to sell the shares within a period of five years.</p>\n<p>\n\tThe funds realised from the sale of shares would be used for funding social sector schemes of the government.</p>\n<p>\n\tTo promote a wider investor base in listed state-run companies and provide a boost to the government plan to raise funds from disinvestment programme, the Sebi board had in June 2014 asked listed companies to offer at least 25 per cent of their equity to non-promoter shareholders.</p>\n<p>\n\tAccordingly, the rules were notified for PSUs to achieve the minimum 25 per cent public shareholding by August 21, 2017, which was later extended by a year.</p>\n<p>\n\tIn the current fiscal, the government aims to mop up Rs 80,000 crore through PSU disinvestment, against Rs 1 lakh crore collected last fiscal which ended on March 31.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "sick",
        "meet"
    ],
    "verbs": [
        "finance",
        "transfer",
        "sick",
        "fund",
        "meet",
        "market",
        "allow"
    ],
    "nouns": [
        "finance",
        "transfer",
        "fund",
        "meet",
        "norm",
        "ministry",
        "regulator",
        "market",
        "sick"
    ]
}