{
    "title": "Fed up with pvt sector job? Modi gives you a chance to claim top govt posts",
    "link": "https://www.business-standard.com/article/economy-policy/fed-up-with-pvt-sector-job-modi-gives-you-a-chance-to-claim-top-govt-posts-118061000507_1.html",
    "pubDate": "Sun, 10 Jun 2018 21:30:00 +0530",
    "content": "The initiative is being called lateral recruitment to senior positions in the government",
    "contentSnippet": "The initiative is being called lateral recruitment to senior positions in the government",
    "guid": "https://www.business-standard.com/article/economy-policy/fed-up-with-pvt-sector-job-modi-gives-you-a-chance-to-claim-top-govt-posts-118061000507_1.html",
    "isoDate": "2018-06-10T16:00:00.000Z",
    "sentiment": {
        "score": 4,
        "comparative": 0.25,
        "tokens": [
            "fed",
            "up",
            "with",
            "pvt",
            "sector",
            "job?",
            "modi",
            "gives",
            "you",
            "a",
            "chance",
            "to",
            "claim",
            "top",
            "govt",
            "posts"
        ],
        "words": [
            "top",
            "chance"
        ],
        "positive": [
            "top",
            "chance"
        ],
        "negative": []
    },
    "article": {
        "title": "Fed up with pvt sector job? Modi gives you a chance to claim top govt posts",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tThe government has opened up <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=senior+level+bureaucratic+posts\" target=\"_blank\">senior-level bureaucratic posts </a>in several departments to people, even from the private sector, who are \"talented and motivated\", and willing to contribute towards nation building.</p>\n<p>\n\tAccording to an advertisement published in leading newspapers, the government is looking for 10 \"outstanding individuals\", even from the private sector, with expertise in the areas of revenue, financial services, economic affairs, agriculture, cooperation and farmers' welfare, road transport and highway, shipping, environment, forests and climate change, new and renewable energy, civil aviation and commerce.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tA circular issued by the Department of Personnel and Training also said, \"The Government of India invites talented and motivated Indian nationals willing to contribute towards nation building to join the government at the level of Joint Secretary.\"<br>The initiative is being called lateral recruitment to senior positions in the government.</p>\n<p>\n\tThe period of contract will be for three years from the date of commencement of service, extendable up to five years depending upon performance.</p>\n<p>\n\tJoint Secretaries are at a crucial level of senior management in the government of India and lead policy making as well as implementation of various programmes and schemes of the department assigned to them.</p>\n<p>\n\tThey report to the secretary/additional secretary in the ministry or department and are normally appointed from all India services like the IAS, IPS, IFS and other allied services.</p>\n<p>\n\tThe criteria for applicants include minimum age of 40 years as on July 1, 2018, graduate from a recognized university or institute. Higher qualifications would be an added advantage.</p>\n<p>\n\tThose who are eligible to apply are officers of any state or Union Territories government who are already working at an equivalent level or are eligible for appointment to equivalent level in their cadre, with relevant experience.</p>\n<p>\n\tIt also includes individuals working at comparable levels in public sector undertakings, autonomous bodies, statutory organisations, universities, recognised research institutes with a minimum of 15 years of experience.</p>\n<p>\n\tThose working at comparable levels in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/private-sector\" target=\"_blank\">private sector </a>companies, consultancy organisations, international or multinational organisations with a minimum of 15 years experience can also apply.</p>\n<p>\n\tSelected applicants shall be placed at the beginning of the pay scale as applicable to a joint secretary, which is Rs 1,44,200 - Rs 2,18,200 per month (Level 14 of Pay Matrix). In addition, they shall be eligible for all allowances and facilities as applicable to the equivalent level in the Government of India.</p>\n<p>\n\tHowever, the government reserves its right to place deserving appointees at an appropriate level within the scale of pay.</p>\n<p>\n\tAll appointees shall be deemed to be public servants for the purpose of the CCS (Conduct) Rules and such other statutes as notified by the government from time to time.</p>\n<p>\n\tThe employment contract can be terminated by either side with a minimum notice period of three months.</p>\n<p>\n\tThe shortlisted candidates will be called for a personal interaction with the selection committee. The last date for receipt of applications is July 30.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "chance",
        "senior",
        "lateral",
        "top",
        "initiative"
    ],
    "nouns": [
        "sector",
        "government",
        "recruitment",
        "job",
        "chance",
        "senior",
        "lateral",
        "claim",
        "top",
        "Fed",
        "initiative"
    ],
    "verbs": [
        "job",
        "chance",
        "claim",
        "top"
    ]
}