{
    "creator": "Vikram Chaudhary",
    "title": "Asus Zenfone Max Pro M1 smartphone review: When Asus outclassed itself, almost – From price to specs, all details here",
    "link": "https://www.financialexpress.com/industry/technology/asus-zenfone-max-pro-m1-smartphone-review-when-asus-outclassed-itself-almost-from-price-to-specs-all-details-here/1196415/",
    "pubDate": "Thu, 07 Jun 2018 02:22:22 +05:30",
    "dc:creator": "Vikram Chaudhary",
    "content": "The Max Pro is available in two specifications—3GB RAM with 32GB storage for Rs 10,999, 4GB RAM with 64GB storage for Rs 12,999. ",
    "contentSnippet": "The Max Pro is available in two specifications—3GB RAM with 32GB storage for Rs 10,999, 4GB RAM with 64GB storage for Rs 12,999.",
    "guid": "https://www.financialexpress.com/?p=1196415",
    "categories": [
        "Industry",
        "Technology"
    ],
    "isoDate": "2018-06-06T20:52:22.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "asus",
            "zenfone",
            "max",
            "pro",
            "m1",
            "smartphone",
            "review",
            "when",
            "asus",
            "outclassed",
            "itself",
            "almost",
            "–",
            "from",
            "price",
            "to",
            "specs",
            "all",
            "details",
            "here"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Asus Zenfone Max Pro M1 smartphone review: When Asus outclassed itself, almost – From price to specs, all details here",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1196421\" src=\"https://images.financialexpress.com/2018/06/Asus_ZenFone_Max_M1_zenfoneblog.jpg\" alt=\"Asus,&nbsp;Asus Zenfone Max Pro M1,&nbsp;Asus Zenfone Max Pro M1 review, Asus smartphone\" srcset=\"https://images.financialexpress.com/2018/06/Asus_ZenFone_Max_M1_zenfoneblog.jpg 660w, https://images.financialexpress.com/2018/06/Asus_ZenFone_Max_M1_zenfoneblog-300x200.jpg 300w, https://images.financialexpress.com/2018/06/Asus_ZenFone_Max_M1_zenfoneblog-620x413.jpg 620w, https://images.financialexpress.com/2018/06/Asus_ZenFone_Max_M1_zenfoneblog-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Before the camera wows you, the design does. Before the battery life surprises you, the specifications do. (Source: Asus-ZenFone.com)</figure>\n\t\t\t</section></div><span>\n</span><p>Before the camera wows you, the design does. Before the battery life surprises you, the specifications do. Before the features amaze you, the price does. If there is one phone most smartphone companies in India, especially <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/xiaomi/\">Xiaomi</a>, must watch out for, it’s the <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/asus/\">Asus</a> Zenfone Max Pro M1. On paper, it’s tough to match the price-value equation of this new smartphone by the Taiwanese company—it starts at Rs 10,999.</p><span>\n</span><p><strong>Now, the showing.</strong></p><span>\n</span><p>In this era of 5.5-inch smartphones, the Zenfone Max Pro, at 5.99-inch, stands out. This size appears to be just right—it grips as good as a 5.5-inch smartphone does, and a slightly bigger screen leads to a better multimedia experience. The clarity of the screen is good, and the ultra-wide 18:9 aspect ratio and slim bezel provide for an expanded viewing area—it’s good both for viewing photos and watching videos, and when you browse the web there is a lesser need for scrolling. A wider screen also makes multitasking easier; for example, two apps can easily fit side-by-side on the screen.</p><span>\n</span><p>As far as sound quality is concerned, Asus has taken the frugal innovation route. While the phone’s five-magnet speaker boosted by the NXP amplifier delivers clear sound, the company has provided a unit called the Max Box—made of cardboard—and once you place the phone in the Max Box in the way intended, the volume can be enhanced by up to two times. Call it ‘jugaad’ or the more sophisticated ‘frugal innovation’, the Max Box is a low-cost solution that leads to measurable improvements.</p><span>\n</span><p>Its build quality is impressive for an entry-level smartphone—Asus appears to have outclassed itself and the compact all-metal body makes the phone look more expensive than it is. It is powered by Qualcomm Snapdragon 636 mobile platform, with 14nm, 64-bit quadcore processor. There are two SIM slots supporting 4G LTE, and an additional microSD slot to expand storage by up to 2TB. The phone weighs 180gm.</p><span>\n</span><p>All previous Asus phones came with Zen user interface (UI), but the Max Pro is the first company phone that gets stock Android Oreo. The reason, according to Asus, is not because the Oreo is better, but because “buyers in this segment want Android”. Over a few days of use, I took a liking to the Oreo simply because of its friendlier UI design, and also because shifting from other phones to the Max Pro becomes a seamless experience—there’s no need to get used to a new UI. Another advantage of the Oreo is that Android, in general, doesn’t have bloatware—most of the installed apps you’d use anyway.</p><span>\n</span><p>Like some expensive smartphones, the Max Pro gets a face unlock feature that lets users unlock the phone simply by looking at it. In addition, it has a rear fingerprint sensor. The hallmark of the Max Pro is its huge battery capacity of 5000mAh battery—the most powerful in the ZenFone Max series and better than the competition. However, while the company claims that it offers “users up to 20 hours of YouTube video playback, 42 hours of 3G talk time and 28 hours of wi-fi web browsing,” the unit I used didn’t last that long on a full charge.</p><span>\n</span><p>Perhaps the reason is that I used the unit on high brightness, 4G and speaker. But there is enough power on tap and users can browse more, game more, talk more than other phones in this segment—on regular use, the battery lasts for a day and a half, even two days. Mention must be made of the charging time—you can fully charge the battery in a claimed 2 hours and 42 minutes (my unit took 2.5 hours), compared to some rival products with a 4000mAh battery that need three hours.</p><span>\n</span><p>The Max Pro, like all its competitors, has a dual-camera system. The primary rear camera has a 13MP sensor with a f/2.2 wide-aperture lens, assisted by the secondary 5MP camera that senses depth for bokeh effect in portraits and close-ups. The front is an 8MP camera with an LED flash and the usual beautification features that remove blemishes and enhance skin tone—in this age of unreal beauty, consumers want such features. Both cameras are above average, not exceptional. It can shoot videos at up to 4K UHD resolution.</p><span>\n</span><p>The Max Pro is available in two specifications—3GB RAM with 32GB storage for Rs 10,999, 4GB RAM with 64GB storage for Rs 12,999. A 6GB version, with some flagship-level features, will be launched later for Rs 14,999. Clearly, the best thing about the phone is its price-value equation, and it sits nicely between Redmi Note 5 and Note 5 Pro. Asus has sweetened the deal by offering <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/flipkart/\">Flipkart</a>’s Complete Mobile Protection plan, for this phone, at a special price of Rs 49 per year.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "Pro",
        "outclassed",
        "available",
        "two",
        "10",
        "12"
    ],
    "nouns": [
        "Pro",
        "Max",
        "M1",
        "review",
        "price",
        "specs",
        "details",
        "two",
        "RAM",
        "storage",
        "10",
        "12"
    ],
    "verbs": [
        "review",
        "price",
        "RAM"
    ]
}