{
    "title": "Private investment plans in India's strategic oil reserves get Cabinet nod",
    "link": "https://www.business-standard.com/article/economy-policy/private-investment-plans-in-india-s-strategic-oil-reserves-get-cabinet-nod-118062701124_1.html",
    "pubDate": "Thu, 28 Jun 2018 01:15:00 +0530",
    "content": "The strategic petroleum reserves facilities at Chandikhol and Padur will be underground rock-caverns and will have capacities to the tune of 4 MT and 2.5 MT respectively",
    "contentSnippet": "The strategic petroleum reserves facilities at Chandikhol and Padur will be underground rock-caverns and will have capacities to the tune of 4 MT and 2.5 MT respectively",
    "guid": "https://www.business-standard.com/article/economy-policy/private-investment-plans-in-india-s-strategic-oil-reserves-get-cabinet-nod-118062701124_1.html",
    "isoDate": "2018-06-27T19:45:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "private",
            "investment",
            "plans",
            "in",
            "india's",
            "strategic",
            "oil",
            "reserves",
            "get",
            "cabinet",
            "nod"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Private investment plans in India's strategic oil reserves get Cabinet nod",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tThe Union <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/cabinet\" target=\"_blank\">Cabinet </a>on Wednesday cleared a proposal to bring in private investments for building the next phase of strategic crude <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/oil-reserves\" target=\"_blank\">oil reserves </a>of around 6.5 million tonnes at <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=chandikhol\" target=\"_blank\">Chandikhol </a>in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/odisha\" target=\"_blank\">Odisha </a>and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=padur\" target=\"_blank\">Padur </a>in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/karnataka\" target=\"_blank\">Karnataka.</a></p>\n<p>\n\tThe strategic petroleum reserves facilities at <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=chandikhol\" target=\"_blank\">Chandikhol </a>and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=padur\" target=\"_blank\">Padur </a>will be underground rock-caverns and will have capacities to the tune of 4 MT and 2.5 MT respectively. This comes two days after Abu Dhabi National Oil Corporation (Adnoc) expressed its interest of having space in <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=padur\" target=\"_blank\">Padur </a>reserves. The move is likely to bring in investments from domestic private sector players like Reliance Industries (RIL) and Essar Oil.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\t\"The cost of the projects will be decided after the engineering studies and factoring in land acquisition costs,\" said finance minister Piyush Goyal, addressing the media on Wednesday. In February, Business Standard had reported that some Indian private refiners are in talks with Indian Strategic Petroleum Reserves Ltd (ISPRL) to grab a stake in their upcoming projects and a <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/cabinet\" target=\"_blank\">Cabinet </a>clearance is expected soon.</p>\n<p>\n\t\"The in-principle approval is to take up the project under public-private participation (PPP) model to reduce budgetary support of Government of India. The terms and conditions of such participation, would be determined by the ministry of petroleum and natural gas in consultation with Ministry of Finance after conducting road shows to elicit requirements of market, including prospective investors,\" the government said in a statement today. The project estimated to cost Rs 100 billion.</p>\n<p>\n\tISPRL has already constructed underground rock caverns for storage of 5.33MT of crude oil at three locations -- Vishakhapatnam (1.33 MT), Mangalore (1.5 MT) and Padur (2.5 MT). The total 5.33 MT capacity under Phase-I of the programme is currently estimated to supply approximately 10 days of India’s crude requirement. Cabinet’s approval for establishing additional 6.5 MT Strategic Petroleum Reserve facilities will provide an additional supply of about 12 days and is expected to augment India’s energy security, the statement said. <br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/2-more-strategic-oil-reserves-of-6-5-mt-capacity-to-come-up-piyush-goyal-118062700775_1.html\" target=\"_blank\">2 more strategic oil reserves of 6.5 MT capacity to come up: Piyush Goyal</a></strong></p>\n<p>\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/cabinet\" target=\"_blank\">Cabinet </a>also took a couple of decisions aiming to strengthen the export infrastructure. It approved a capital infusion of Rs.2000 crore to the Export Credit Guarantee Corporation (ECGC).  Set to be provided over the next three years, the government hopes the infusion would enhance insurance coverage to MSME exports and strengthen Indian shipments to emerging and challenging markets like Africa, central Asian and Latin American nations.</p>\n<p>\n\tECGC is the primary export credit agency providing insurance services to exporters. The ECGC offers credit insurance schemes to exporters to protect them against losses due to non-payment of export dues by overseas buyers due to political or commercial risks. More than 85 per cent of customers benefited by ECGC’s covers are MSMEs.</p>\n<p>\n\tWith enhanced capital, ECGC’s underwriting capacity and risk to capital ratio will improve considerably. The Cabinet on Wednesday said that increased capital infusion will help ECGC to diversify its product portfolio and provide cost effective credit insurance that will help in improving competitive position of India exporters. The organization covers exports to around 200 countries.</p>\n<p>\n\tThe Cabinet also approved a corpus of Rs. 10.40 billion to the National Export Insurance Account Trust (NEIA), a scheme under ECGC. To be utilized during three years from 2017-18 to 2019-20, the first tranche of Rs.4.40 billion has already been released. The Corpus is set to strengthen NEIA to support project exports from the country that are of strategic and national importance.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Private",
        "strategic",
        "underground"
    ],
    "verbs": [
        "will",
        "oil",
        "nod",
        "rock",
        "tune"
    ]
}