{
    "title": "Sebi tweaks IPO norms, intends to rationalise FPI, MF regulations",
    "link": "https://www.business-standard.com/article/markets/sebi-tweaks-ipo-norms-intends-to-rationalise-fpi-mf-regulations-118062100678_1.html",
    "pubDate": "Thu, 21 Jun 2018 16:53:00 +0530",
    "content": "Shareholding of foreign holding will be harmonised to 15% in Market Infrastructure Institutions",
    "contentSnippet": "Shareholding of foreign holding will be harmonised to 15% in Market Infrastructure Institutions",
    "guid": "https://www.business-standard.com/article/markets/sebi-tweaks-ipo-norms-intends-to-rationalise-fpi-mf-regulations-118062100678_1.html",
    "isoDate": "2018-06-21T11:23:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "sebi",
            "tweaks",
            "ipo",
            "norms",
            "intends",
            "to",
            "rationalise",
            "fpi",
            "mf",
            "regulations"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Sebi tweaks IPO norms, intends to rationalise FPI, MF regulations",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tMarket regulator <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/securities-and-exchange-board-of-india\" target=\"_blank\">Securities and Exchange Board of India </a>(Sebi) has cut the time for the announcement of price band for <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=initial+public+offers\" target=\"_blank\">initial public offers </a>(IPOs) from five days to two.</p>\n<p>\n\tIn a press meet post, its board meeting in Mumbai on Thursday, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/sebi\" target=\"_blank\">Sebi </a>chairman Ajay Tyagi also said that the market regulator has tweaked buyback norms and intends to rationalise regulations for <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/foreign-portfolio-investors\" target=\"_blank\">foreign portfolio investors </a>(FPIs) and mutual funds.<br><strong>ALSO READ: <a href=\"https://www.business-standard.com/article/markets/bse-seeks-clarity-from-sebi-on-licensing-with-dubai-deutsche-exchanges-118062001359_1.html\" target=\"_blank\">BSE seeks clarity from Sebi on licensing with Dubai, Deutsche exchanges</a></strong><br></p>\n<!-- INPAGE_BANNER -->\n\t<br>\"Under the new Regulations, the buy back period has been defined as the period between  board  of  directors  resolution/date  of  declaration  of  results  for  special resolution  authorizing  the  buyback  of  shares  and  the  date  on  which  payment consideration is made to the shareholders,\" a <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/sebi\" target=\"_blank\">Sebi </a>release said.<p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/pti-stories/sebi-initiates-enforcement-actions-in-nse-co-location-case-tyagi-118062100651_1.html\" target=\"_blank\">NSE co-location case: Sebi initiates enforcement actions, says Ajay Tyagi</a></strong></p>\n<p>\n\tThat apart, the shareholding of foreign holding will be harmonised to 15 per cent in <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=market+infrastructure+institutions\" target=\"_blank\">Market Infrastructure Institutions </a>(MIIs), Tyagi said. <br><strong>Here is the full text of the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/sebi\" target=\"_blank\">Sebi </a>board meeting</strong><br></p><p>\n\t\t<em><strong>SEBI Board Meeting </strong></em></p>\n\t<p>\n\t\t<em>The SEBI Board met in Mumbai today and took the following decisions: </em></p>\n\t<p>\n\t\t<em>I. Review of SEBI (Substantial Acquisition of Shares and Takeovers) Regulations, 2011 </em></p>\n\t<p>\n\t\t<em>The Board has approved certain amendments to SEBI (Substantial Acquisition of Shares and Takeovers) Regulations, 2011. As part of the amendments, it has been decided to grant additional time for upward revision of open offer price till one working day before the commencement of the tendering period. </em></p>\n\t<p>\n\t\t<em>SEBI earlier had issued a discussion paper on March 28, </em><em>2018</em><em> soliciting public comments for reviewing the SEBI Takeover Regulations. The amendments are mainly aimed at simplifying the language, removing redundant provisions and inconsistencies, updating the references to the Companies Act, 2013 / other new SEBI Regulations, and incorporating the relevant circulars, FAQs, informal guidance in the regulations. </em></p>\n\t<p>\n\t\t<em>II. Replacing SEBI (Buy-back of Securities) Regulations, 1998 with new SEBI (Buy-back of Securities) Regulations, 2018 </em></p>\n\t<p>\n\t\t<em>The Board has approved reframing a new set of SEBI (Buy-back of Securities) Regulations, 2018 (“new Buyback Regulations”) in lieu of the extant Buyback Regulations, 1998. Relevant provisions outlined under Sections 68 and 70 of the Companies Act, 2013 have been incorporated in the new Buyback Regulations to make it self-contained. </em></p>\n\t<p>\n\t\t<em>Under the new Regulations, the buy back period has been defined as the period between </em><em>board</em><em> of directors resolution/date of declaration of results for </em><em>special</em><em> resolution authorizing the buyback of shares and the date on which payment consideration is made to the shareholders. </em></p>\n\t<p>\n\t\t<em>SEBI earlier had issued a discussion paper on March 28, </em><em>2018</em><em> soliciting public comments for reviewing SEBI (Buy-back of Securities) Regulations, 1998 (“Buyback Regulations 1998). The review was carried out with an objective to simplify the language, remove redundant provisions and inconsistencies, update the references to the Companies Act, 2013/ other new SEBI Regulations, and incorporate the relevant circulars, FAQs, informal guidance in the regulations. </em></p>\n\t<p>\n\t\t<em>III. Review of SEBI (Issue of Capital and Disclosure Requirements) Regulations, </em></p>\n\t<p>\n\t\t<em>2009 </em></p>\n\t<p>\n\t\t<em>1. The Board approved the proposed SEBI (Issue of Capital and Disclosure Requirements) Regulations, (“ICDR Regulations”) 2018. </em></p>\n\t<p>\n\t\t<em>2. The Board, while approving the ICDR Regulations, 2018, considered the recommendations of the Primary Market Advisory Committee (PMAC) and the public comments on the Consultation Paper. </em></p>\n\t<p>\n\t\t<em>3. Some of the key proposals approved by the Board are as follows: </em></p>\n\t<p>\n\t\t<em>3.1 The requirement of announcing price band five working days before </em><em>opening</em><em> of the issue would be reduced to two working days before </em><em>opening</em><em> of the issue. </em></p>\n\t<p>\n\t\t<em>3.2 Financial Disclosures in case of public issues/ rights issues: </em></p>\n\t<p>\n\t\t<em>a) Financial disclosures to be made for 3 years as against the present duration of 5 years. </em></p>\n\t<p>\n\t\t<em>b) Restated and audited financial disclosures in the offer document to be made on </em><em>consolidated</em><em> basis only. Audited standalone financials of the issuer and material subsidiaries to be disclosed on the website of the issuer company. </em></p>\n\t<p>\n\t\t<em>c) Incorporation of the principles governing disclosures of Indian Accounting Standards (IndAS) on Indian GAAP (</em><em>IGAAP</em><em>) Financials. </em></p>\n\t<p>\n\t\t<em>3.3 Threshold for submission of </em><em>draft</em><em> letter of offer to SEBI in case of rights issues to be increased to Rs. 10 Crores as against the earlier prescribed Rs. 50 Lakhs. </em></p>\n\t<p>\n\t\t<em>3.4 Shortfall of up to 10% in minimum promoters’ contribution may be met by institutional investors such as by foreign venture capital investors, scheduled commercial banks, public financial institutions and insurance companies registered with Insurance Regulatory and Development Authority of India, in addition to Alternative Investment Funds, without being identified as “Promoters”. </em></p>\n\t<p>\n\t\t<em>3.5 For a company to be eligible to make a fast track rights issue, it should not have any audit qualifications or adverse opinion. </em></p>\n\t<p>\n\t\t<em>3.6 It has been decided to delete: </em></p>\n\t<p>\n\t\t<em>a) </em><em>Chapter</em><em> on Institutional Placement Programme </em></p>\n\t<p>\n\t\t<em>b) Provisions pertaining to Safety net and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/ipo\" target=\"_blank\">IPO </a>grading </em></p>\n\t<p>\n\t\t<em>3.7 SME-<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/ipo\" target=\"_blank\">IPO </a></em></p>\n\t<p>\n\t\t<em>Minimum Anchor investor size to be reduced to Rs. 2 Crore from the existing Rs. 10 Crore. </em></p>\n\t<p>\n\t\t<em>3.8 Promoter group </em></p>\n\t<p>\n\t\t<em>a) </em><em>Concept</em><em> of immediate relative to be retained as against the proposed concept of ‘relative’. </em></p>\n\t<p>\n\t\t<em>b) The shareholding threshold for identifying promoter group has been revised from 10 </em><em>percent</em><em> to 20 </em><em>percent</em><em>. Now in </em><em>case</em><em> the promoter is a body corporate, any body corporate in which the promoter holds twenty </em><em>percent</em><em> or more or which holds twenty </em><em>percent</em><em> or more of the promoter would be classified as being part of the same promoter group. </em></p>\n\t<p>\n\t\t<em>c) Also, in case the promoter is a body corporate, any body corporate in which a group of individuals or companies or combinations thereof, </em></p>\n\t<p>\n\t\t<em>which holds twenty per cent or more of the equity share capital in that body corporate, also holds 20 </em><em>percent</em><em> or more of the issuer, can be classified as promoter group only if they are acting in concert. </em></p>\n\t<p>\n\t\t<em>3.9 Disclosures of group companies </em></p>\n\t<p>\n\t\t<em>Definition of group companies has been made more specific by clarifying that group company/</em><em>ies</em><em>, shall include such companies (other than promoter(s) and subsidiary (</em><em>ies</em><em>)) with which there were related party transactions, during the period for which financial information is disclosed (3 years), as covered under the applicable accounting standards and also other companies as considered material by the board of the issuer. </em></p>\n\t<p>\n\t\t<em>3.10 Addition to Anchor Investor Category </em></p>\n\t<p>\n\t\t<em>Insurance Companies and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/foreign-portfolio-investors\" target=\"_blank\">Foreign Portfolio Investors </a>except for Category III, promoted by entities related to the lead manager permitted to participate in the Anchor Investor category, in addition to mutual funds promoted by lead managers. </em></p>\n\t<p>\n\t\t<em>3.11 Main Board – <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/ipo\" target=\"_blank\">IPO </a>- Underwriting provisions to be aligned to requirements of minimum subscription </em></p>\n\t<p>\n\t\t<em>If 90 per cent of the fresh issue is subscribed in </em><em>a main</em><em> board IPO, underwriting will be restricted to that portion only and accordingly the requirement to underwrite 100% of the issue without regard to the minimum subscription requirements has been deleted. </em></p>\n\t<p>\n\t\t<em>4. The contents of the new Regulations have been streamlined as follows: </em></p>\n\t<p>\n\t\t<em>a) All the chapters have been categorized on the basis of the type of offering so that all relevant information pertaining to regulations relating to a particular type of offering are available at one place. </em></p>\n\t<p>\n\t\t<em>b) The procedural requirements have been specified through Schedules to the draft regulations. </em></p>\n\t<p>\n\t\t<em>c) The provisions have been rearranged based on their sequence in the public issue process and relevance. </em></p>\n\t<p>\n\t\t<em>d) The provisions of Companies Act, 1956 (wherever applicable), Companies Act, 2013, SEBI (Substantial Acquisition of Shares and </em></p>\n\t<p>\n\t\t<em>Takeovers) Regulations, 2011, SEBI (</em><em>Share Based</em><em> Employee Benefits) Regulations, 2014 have been suitably incorporated. </em></p>\n\t<p>\n\t\t<em>e) Various informal guidance / interpretative letters / frequently asked questions / Circulars regarding </em><em>interpretation</em><em> of various provisions of the regulations issued by SEBI from time to time have been suitably incorporated. </em></p>\n\t<p>\n\t\t<em>IV. </em><em>Decision</em><em> on review of regulation and relevant circulars pertaining to Stock Exchanges, Clearing Corporations and Depositories (‘Market Infrastructure Institutions’) </em></p>\n\t<p>\n\t\t<em>The Board took note of the recommendations of the Gandhi Committee constituted by SEBI for ‘Review of regulation and relevant circulars pertaining to MIIs’ and the proposals thereon. The Board, after deliberation, approved the following proposals: </em></p>\n\t<p>\n\t\t<em>1. In order to bring parity across MIIs, the shareholding limits, which can be held by both eligible domestic and foreign entities in a Market Infrastructure Institution (‘MII’), have been harmonized across MIIs. </em></p>\n\t<p>\n\t\t<em>- Eligible domestic and foreign </em><em>entities,</em><em> may be permitted to hold </em><em>upto</em><em> 15% shareholding in case of Depository and Clearing Corporation, as is the case for Stock Exchanges; Additionally, multilateral and bilateral financial institutions, as notified by the Government, have also been recommended to hold </em><em>upto</em><em> 15% in an MII. </em></p>\n\t<p>\n\t\t<em>- </em><em>Concept</em><em> of Sponsor has been removed in case of Depository, with existing sponsor entities being allowed </em><em>upto</em><em> 5 years to reduce their respective shareholding. They can hold </em><em>upto</em><em> 15%. </em></p>\n\t<p>\n\t\t<em>2. Given the special role of Public Interest Directors (PIDs) and Managing Director (MD) in the governance of </em><em>a MII</em><em>, norms relating to their tenure and directorships at MIIs have been modified. </em></p>\n\t<p>\n\t\t<em>- A person may serve as a PID across MIIs, for a maximum of three terms of three years each, or </em><em>upto</em><em>seventy five</em><em> years of age, whichever is earlier, with not more than two terms in one MII. </em></p>\n\t<p>\n\t\t<em>- The first term in an MII may be extendable by another term, subject to satisfactory performance review. </em></p>\n\t<p>\n\t\t<em>- A cooling-off period of one year shall be </em><em>applicable</em><em> prior to nomination as PID in another MII. </em></p>\n\t<p>\n\t\t<em>- A cooling-off period of three years shall be applicable for a PID to become a shareholder director in the same MII or a director in the subsidiary of the said MII. </em></p>\n\t<p>\n\t\t<em>- A PID shall not act simultaneously as a director on the board of </em><em>subsidiary</em><em> of an MII, any other MII or their subsidiary, or relevant / linked participants i.e. Trading Member, Clearing Member, Depository Participant, as applicable. </em></p>\n\t<p>\n\t\t<em>- A PID on the Board of a Stock </em><em>Exchange,</em><em> shall keep the Governing Board of the Stock Exchange apprised of any conflict of interest which may arise as a result of a PID providing services to or being associated with any company listed on that Stock Exchange. </em></p>\n\t<p>\n\t\t<em>- A person may serve as Managing Director of </em><em>a MII</em><em>, for a for a maximum of two terms of </em><em>upto</em><em> 5 years each or </em><em>upto</em><em> 65 years of age, whichever is earlier. The said requirement would also be applicable to existing MDs of MIIs. </em></p>\n\t<p>\n\t\t<em>- After the first term, the appointment process for MD should be conducted afresh. </em></p>\n\t<p>\n\t\t<em>3. The composition of the Governing Board and regulatory committees of MIIs has been modified with an aim to balance between the number of PIDs, who serve the interest of </em><em>public</em><em> at large and the number of shareholder directors. </em></p>\n\t<p>\n\t\t<em>- The number of PIDs, on the Governing Board and the committees of the MIIs, should be at least equal to the number of shareholder directors (including the Managing Director) and in case of an equality of votes, the Chairperson of the Board/Committee (who is a PID), shall have a second or casting vote. </em></p>\n\t<p>\n\t\t<em>- The above composition shall also be applicable to the quorum for voting of the Governing Board and the committees. </em></p>\n\t<p>\n\t\t<em>4. In order to enhance the transparency in the utilization of resources, </em><em>a MII</em><em> should disclose the resources committed towards regulatory functions and towards ensuring regulatory compliance, backed by </em><em>activity based</em><em> accounting. Also, the </em></p>\n\t<p>\n\t\t<em>charges and fees levied by an MII shall be placed for review before the Oversight Committee of the MII. </em></p>\n\t<p>\n\t\t<em>5. To avoid the requirement of repetitive regulatory approvals and to provide adequate flexibility to the MIIs in deciding their day to day investments, it has been decided that activities in the nature of treasury investment may be as per the investment policy approved by the Governing Board of a MII. Any other activity whether involving deployment of funds or otherwise would need prior permission of the regulator. </em></p>\n\t<p>\n\t\t<em>6. Considering the fundamental importance of the role played by Key Management Personnel (KMP), the definition and norms relating to disclosure of their compensation have been modified. </em></p>\n\t<p>\n\t\t<em>- The definition is modified to include, any person who directly reports to CEO or director of the Governing Board of the </em><em>MII,</em><em> or any person </em><em>upto</em><em> two levels below MD/CEO, or as identified by the Nomination and Remuneration Committee. </em></p>\n\t<p>\n\t\t<em>- MIIs shall disclose the ratio of compensation paid to them vis-a-vis median of compensation paid to all employees of the MIIs. </em></p>\n\t<p>\n\t\t<em>7. Considering that the scope of work of some of the existing committees of MIIs is inter-related and overlapping, the various committees of MIIs have been </em><em>merged / restructured</em><em>, reducing the number of </em><em>committee</em><em> from existing 15 to 7. </em></p>\n\t<p>\n\t\t<em>- Functional Committees, comprising of three committees, viz. Member Selection Committee, Investor Grievance Redressal Committee and Nomination and Remuneration Committee; and </em></p>\n\t<p>\n\t\t<em>- Oversight Committees, comprising of four committees, viz. Standing Committee on Technology, Advisory Committee, Regulatory Oversight Committee and Risk Management Committee. </em></p>\n\t<p>\n\t\t<em>8. In order to adequately capture the risks faced by a Clearing Corporation, it has been decided to adopt a </em><em>risk based</em><em> approach towards computation of Net-worth of a Clearing Corporation. Instead of a higher minimum net worth of INR 300 crores, the Clearing Corporations may be required to maintain a net worth at all times of either INR 100 crores or such other amount to cover the various risks (operational, market, credit, etc.) as notified by SEBI from time to time. </em></p>\n\t<p>\n\t\t<em>V. Role of Sub-broker vis-a-vis Authorized Person </em></p>\n\t<p>\n\t\t<em>The Board considered and approved the proposal to discontinue the category of Sub-Brokers as Market Intermediaries. No fresh registration shall be granted as Sub-Brokers. Registered Sub-Brokers shall migrate to Authorised Persons or Trading Members as the case may be and Sub-Brokers, who do not choose to migrate, shall be deemed to have surrendered their registration as Sub-Broker. Suitable time shall be permitted to facilitate this transition. </em></p>\n\t<p>\n\t\t<em>VI. Consultation Paper for the Amendment of various SEBI Regulations in respect of entities undertaking </em><em>third party</em><em> assignment under securities laws. </em></p>\n\t<p>\n\t\t<em>1. Investor confidence is fundamental to the successful operation of the securities market and it stems largely from credible and reliable reporting of disclosure, financial information, compliance with securities regulations. In this regard, fiduciaries in the securities <a class=\"storyTags\" href=\"https://www.business-standard.com/markets\" target=\"_blank\">markets </a>have a very significant role to play. The absence of credible and reliable reporting of such information has the potential to adversely impact confidence in the securities <a class=\"storyTags\" href=\"https://www.business-standard.com/markets\" target=\"_blank\">markets </a>and the financial system. </em></p>\n\t<p>\n\t\t<em>2. While some fiduciaries such as Merchant Bankers, Credit Rating Agencies, Custodian, Debenture Trustees, Registrar to an Issue, etc. are registered with SEBI under specific Regulations notified for the purpose, certain other fiduciaries such as practicing Chartered Accountants, practicing Company Secretaries, Cost Accountants, Valuers, Monitoring Agencies, etc. who undertake </em><em>third party</em><em> fiduciary duty/assignment/engagement from Issuers or Intermediaries as required under various SEBI Regulations, are not registered with SEBI. </em></p>\n\t<p>\n\t\t<em>3. The Board approved the proposal to issue </em><em>consultation</em><em> paper to amend various regulations in respect of entities who undertake </em><em>third party</em><em> fiduciary duty/assignment/engagement under the securities laws, in respect of any Issuer, Pooled Investment Vehicle, Intermediaries, Market Infrastructure Entities. </em></p>\n\t<p>\n\t\t<em>VII. Establishment of National Centre for Financial Education (NCFE) as Section 8 Company - subscription to its Share Capital </em></p>\n\t<p>\n\t\t<em>The Board approved the establishment of National Centre for Financial Education (NCFE) as a Company under Section 8 of the Companies Act, 2013 limited by shares. The Board also approved subscription to 30% of the </em><em>paid up</em><em> capital of the company amounting to Rs.30 crores, by SEBI. </em></p>\n\t<p>\n\t\t<em>NCFE is co-promoted by SEBI, Reserve Bank of India (RBI), Insurance Regulatory and Development Authority of India (IRDAI) and Pension Fund Regulatory and Development Authority (PFRDA). NCFE is mandated to undertake financial education activities in terms of the National Strategy for Financial Education (NSFE) as approved by the Sub-Committee of Financial Stability and Development Council (FSDC-SC). </em></p>\n\t<p>\n\t\t<em>VIII. SEBI Annual Report 2017-18 </em></p>\n\t<p>\n\t\t<em>The Board considered and approved the SEBI Annual Report 2017-18. In compliance with Section 18(2) of SEBI Act, 1992, the Annual Report would be submitted to the Central Government. </em></p>\n\t<p>\n\t\t<em>Mumbai June 21, 2018</em></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "foreign",
        "15",
        "harmonised"
    ],
    "nouns": [
        "Shareholding",
        "Market",
        "will",
        "15",
        "Infrastructure",
        "IPO",
        "MF",
        "holding"
    ],
    "verbs": [
        "Market",
        "rationalise",
        "will"
    ]
}