{
    "title": "Internet of Things: Smart & smarter homes",
    "link": "https://www.financialexpress.com/industry/technology/internet-of-things-smart-smarter-homes/1196406/",
    "pubDate": "Thu, 07 Jun 2018 01:48:49 +05:30",
    "content": "Indian consumers are turning towards progressive offerings such as smart robo-vacuum cleaners.",
    "contentSnippet": "Indian consumers are turning towards progressive offerings such as smart robo-vacuum cleaners.",
    "guid": "https://www.financialexpress.com/?p=1196406",
    "categories": [
        "Industry",
        "Technology"
    ],
    "isoDate": "2018-06-06T20:18:49.000Z",
    "sentiment": {
        "score": 3,
        "comparative": 0.42857142857142855,
        "tokens": [
            "internet",
            "of",
            "things",
            "smart",
            "",
            "smarter",
            "homes"
        ],
        "words": [
            "smarter",
            "smart"
        ],
        "positive": [
            "smarter",
            "smart"
        ],
        "negative": []
    },
    "article": {
        "title": "Internet of Things: Smart & smarter homes",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1196408\" src=\"https://images.financialexpress.com/2018/06/future.jpg\" alt=\"internet of things, smart homes, AI powered home assistants\" srcset=\"https://images.financialexpress.com/2018/06/future.jpg 660w, https://images.financialexpress.com/2018/06/future-300x200.jpg 300w, https://images.financialexpress.com/2018/06/future-620x413.jpg 620w, https://images.financialexpress.com/2018/06/future-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> It’s a Friday evening and you’re on your way to a long-awaited house party with friends.</figure>\n\t\t\t</section></div><span>\n</span><p>It’s a Friday evening and you’re on your way to a long-awaited house party with friends. But there’s a complication: You’ve just realised that the entrance to your house would be dusty and dirty, thanks to the ongoing construction next door, and you surely do not want to start the party on the wrong foot. So, you take the matter in your hands, grab your smartphone and put your vacuum cleaner to work before you reach. You also switch on the music and the AC, and set the perfect ambience for the party through smart lighting.</p><span>\n</span><p><strong>Welcome to the future!</strong></p><span>\n</span><p>Thanks to the Smart Cities Mission, we will soon be witness to the rise of new, high-tech smart cities that will have state-of-the-art technologies as the core component of their underlying framework. And this change has already started with the smallest unit of these cities: Individual households, which are becoming smarter each day. How? Let’s have a look.</p><span>\n</span><p>Smart devices are digital gadgets or appliances that have the ability to connect with other devices across a broader network. Such devices are the building blocks of connected smart homes and can be controlled using smartphones, tablets, or virtual home assistants. Full-fledged smart homes have become a not-so-distant reality in India. And Indian tech enthusiasts are already making their homes ‘smarter’ and future-ready by using an array of such Internet of Things (IoT) devices. These devices include smart door locks, smart electrical appliances, smart lighting systems, smart home assistants, and smart home cleaning solutions.</p><span>\n</span><p>Indian consumers are turning towards progressive offerings such as smart robo-vacuum cleaners. These Wi-Fi connected devices pacing about the length and breadth of your house have powerful multistage cleaning systems and come loaded with adaptive navigation and patented technologies. Using advanced optical and acoustic sensors, they identify dust, mites, and allergens that are as small as 10 microns and invisible to the human eye.</p><span>\n</span><p>Again, modern smart lighting systems can sync with the movie that you are watching, a game that you are playing, and even the music that you are listening to, so that you can get a truly immersive, out-of-the-world experience. The intelligent system adds a unique touch of ambience through its colour gamut and can also be changed through preconfigured settings or manually by a user. Such systems are remotely operable and have light schedule configurations, which provides superlative control to the user.</p><span>\n</span><p>Wi-Fi connected smart electrical switches are being actively installed in many Indian homes and can be turned on/off remotely using a smartphone application. They also help users control their power usage, monitor home energy utilisation, prevent device overheating, and set-up multiple scheduled timers for multiple appliances (such as ACs and geysers). But when you have an entire ensemble of smart devices installed at your home, how do you control them? Using your smartphone, obviously. After all, even robots need a boss!</p><span>\n</span><p>AI-powered smart solutions and virtual home assistants, such as <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/amazon/\">Amazon</a> Alexa, can solve all your worries. You merely have to give voice commands such as “Alexa, turn off the lights and clean home after I leave for the office”. Alexa would smartly notice when your smart door lock gets locked and do the needful.</p><span>\n</span><p>The level of inconvenience that we still have to face in this day and age when technology is trickling down to nearly every aspect of life is nothing short of disappointing. Thankfully, smart gadgets are helping us become more efficient and effective by reducing our workload and doing away with our physical constraints – one task at a time!</p><span>\n</span><p>By:&nbsp;Pulak Satish Kumar</p><span>\n</span><p>The writer is chief operating officer, Puresight Systems</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "Smart",
        "smart",
        "Indian",
        "progressive"
    ],
    "verbs": [
        "Smart",
        "smart",
        "vacuum"
    ]
}