{
    "title": "Rupee depreciates 0.55% to near its lowest ever on China-US trade war",
    "link": "https://www.business-standard.com/article/economy-policy/rupee-depreciates-0-55-to-near-its-lowest-ever-on-china-us-trade-war-118062701198_1.html",
    "pubDate": "Thu, 28 Jun 2018 01:40:00 +0530",
    "content": "The Indian rupee closed at 68.63 a dollar, about 0.29 per cent away from its record low closing of 68.83 a dollar reached on 28 August 2013",
    "contentSnippet": "The Indian rupee closed at 68.63 a dollar, about 0.29 per cent away from its record low closing of 68.83 a dollar reached on 28 August 2013",
    "guid": "https://www.business-standard.com/article/economy-policy/rupee-depreciates-0-55-to-near-its-lowest-ever-on-china-us-trade-war-118062701198_1.html",
    "isoDate": "2018-06-27T20:10:00.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.25,
        "tokens": [
            "rupee",
            "depreciates",
            "055",
            "to",
            "near",
            "its",
            "lowest",
            "ever",
            "on",
            "china-us",
            "trade",
            "war"
        ],
        "words": [
            "war",
            "lowest"
        ],
        "positive": [],
        "negative": [
            "war",
            "lowest"
        ]
    },
    "article": {
        "title": "Rupee depreciates 0.55% to near its lowest ever on China-US trade war",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\tThe rupee on Wednesday neared its all-time low, as most emerging market (EM) currencies fell to protect their relative competitive advantage vis-à-vis the Chinese renminbi after it depreciated, reacting to US tariff on Chinese goods.</p>\n<p>\n\tThe rupee closed at 68.63 a dollar, about 0.29 per cent away from its record low closing of 68.83 a dollar reached on August 28, 2013. While far from being a currency war, India does not have much of an option but to depreciate to accommodate its exports at a time when China shows its intent to let its currency depreciate. The renminbi depreciated 0.44 per cent against the dollar. The rupee depreciated most in the region, falling 0.55 per cent in the day against the dollar.</p>\n<p>\n\tConsidering China’s importance in the global trading system, “the moment the Chinese currency comes under pressure, there would be a contagion impact all over the world. The resulting uncertainty would also manifest in the safe haven play for the US dollar,” said Taimur Baig, managing director and group chief economist of DBS.</p>\n<p>\n\tCurrencies of countries in the region that run twin-deficits (fiscal and current account deficits) such as Indonesia, India, and the Philippines would likely be subjected to a double whammy.</p>\n<p>\n\tThere is a growing realisation that many more <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/us-federal-reserve\" target=\"_blank\">US Federal Reserve </a>rate hikes are probably in the pipeline, leading to the strength of the dollar. On top of it, the trade war-related developments would put further pressure on the rupee and other EM currencies.</p>\n<p>\n\t“We began 2018 expecting EM Fx to come under pressure. The dollar was going to strengthen as oil was firming up to some extent and the US Fed was going to hike rates. Because of those reasons, we thought the rupee would be in the 68-69 a dollar region this year. Our view now is slightly more bearish because of the additional trade war related development,” Baig said in an interview with <em>Business Standard</em>.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/markets/rupee-at-19-month-low-plunges-37-paise-on-oil-scare-trade-war-worries-118062700980_1.html\" target=\"_blank\">Rupee at 19-month low, plunges 37 paise on oil scare, trade war worries</a></strong></p>\n<p>\n\t\t<img align=\"left\" alt=\"graph\" class=\"imgCont\" height=\"423\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/28/full/1530130265-3892.jpg\" title=\"graph\" width=\"465\">\n\t\t</p><p>\n\t\t\tgraph</p>\n\tCurrency dealers say the rupee hitting 70 a dollar by August is a distinct possibility, but the Reserve Bank of India (RBI) won’t be coming much to support the currency, as that would be counter-productive at a time when other currencies in the region are falling. In relative terms, the rupee has depreciated marginally against its trading partners, and artificially propping it up would make the rupee uncompetitive. The real effective exchange rate of the rupee against its 36 trading partners fell to 114.36 in May, from 116.02 in April. “With the deficits and global uptick in Brent prices and India being an oil importer, there is no way that the rupee will stay static or appreciate. It was staring at us that the rupee will depreciate and we can clearly see this happening,” said Prabal Banerjee, group <a class=\"storyTags\" href=\"https://www.business-standard.com/finance\" target=\"_blank\">finance </a>director at the Bajaj Group.\n<p>\n\tHowever, the rupee reaching 70 would be troublesome for many Indian companies. Most of them are unhedged for the longer period, even as the hedging discipline is better for the short-term, say experts.</p>\n<p>\n\t“The rupee came under pressure due to month-end demand. Many companies are finding themselves under-covered. The problem is, when exporters were selling dollars at 66-67 level, importers were not hedging as much as required, thinking the rupee won’t depreciate much,” said Harihar Krishnamurthy, head of treasury at <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=first+rand+bank\" target=\"_blank\">First Rand Bank.</a></p>\n<p>\n\tKrishnamurthy expects strong exporter selling at around the present level, which would be matched by importer demand too. That would help the rupee gain some strength. <br></p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/markets/rbi-pumped-in-2-5-billion-in-april-to-cut-rupee-volatility-118061200052_1.html\" target=\"_blank\">RBI pumped in $2.5 billion in April to cut rupee volatility</a></strong></p>\n<p>\n\t\t<img align=\"left\" alt=\"graph\" class=\"imgCont\" height=\"281\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/28/full/1530130344-6694.jpg\" title=\"graph\" width=\"444\"></p>\n\tAccording to many in the market, if the rupee comes under huge pressure, the RBI might swiftly introduce a dollar deposit scheme along the same lines that it did in 2013.\n<p>\n\tAround $30-35 billion can be mobilised through that and may compensate for continued sell-off by the foreign investors who have so far year-to-date sold $6.9 billion equivalent in both equity and debt. But for now, the RBI inaction could be causing some stress in the markets.</p>\n<p>\n\t“Earlier the RBI used to intervene and stabilise the rupee, but these days we do not see much RBI intervention and that is also causing further depreciation of the rupee. With limited dollar inflow through capital raising - either debt or equity – the situation is worsening. I do not see a reversal of trend in the near future unless the Centre steps in with some drastic measures,” said Banerjee.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Indian",
        "lowest",
        "low",
        "29",
        "55",
        "closed",
        "closing",
        "near",
        "68",
        "63",
        "away",
        "83",
        "28",
        "August"
    ],
    "verbs": [
        "trade",
        "low",
        "record",
        "war",
        "near"
    ],
    "nouns": [
        "trade",
        "Indian",
        "low",
        "cent",
        "29",
        "record",
        "closing",
        "dollar",
        "war",
        "Rupee",
        "rupee",
        "China",
        "US",
        "28",
        "August"
    ]
}