{
    "creator": "FE Bureau",
    "title": "Crowdsourcing growing but few start-ups able to gain from it",
    "link": "https://www.financialexpress.com/market/crowdsourcing-growing-but-few-start-ups-able-to-gain-from-it/1223067/",
    "pubDate": "Thu, 28 Jun 2018 03:56:07 +05:30",
    "dc:creator": "FE Bureau",
    "content": "In 2014, Sebi, in a consultation paper, appeared to be leaning towards a restrictive and tightly regulated model of equity crowdfunding, where ‘accredited investors’ or qualified institutional buyers could participate in the equity crowdfunding.",
    "contentSnippet": "In 2014, Sebi, in a consultation paper, appeared to be leaning towards a restrictive and tightly regulated model of equity crowdfunding, where ‘accredited investors’ or qualified institutional buyers could participate in the equity crowdfunding.",
    "guid": "https://www.financialexpress.com/?p=1223067",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-27T22:26:07.000Z",
    "sentiment": {
        "score": 3,
        "comparative": 0.3,
        "tokens": [
            "crowdsourcing",
            "growing",
            "but",
            "few",
            "start-ups",
            "able",
            "to",
            "gain",
            "from",
            "it"
        ],
        "words": [
            "gain",
            "growing"
        ],
        "positive": [
            "gain",
            "growing"
        ],
        "negative": []
    },
    "article": {
        "title": "Crowdsourcing growing but few start-ups able to gain from it",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1223068\" src=\"https://images.financialexpress.com/2018/06/1-221.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/1-221.jpg 660w, https://images.financialexpress.com/2018/06/1-221-300x200.jpg 300w, https://images.financialexpress.com/2018/06/1-221-620x413.jpg 620w, https://images.financialexpress.com/2018/06/1-221-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Crowdsourcing growing but few start-ups able to gain from it</figure>\n\t\t\t</section></div><span>\n</span><p>Crowdsourcing is slowly becoming popular in India but is far less evolved than in developed markets, which is why few start-ups have been able to raise resources through it. In India so far, donation-based crowdfunding is the most common — other forms of crowdfunding are less popular. Most donations are made towards social, philanthropic or artistic causes. Aspiring entrepreneurs aren’t able to access too much money.</p><span>\n</span><p>A regulatory framework relating to equity crowdfunding is on the cards. In 2014, Sebi, in a consultation paper, appeared to be leaning towards a restrictive and tightly regulated model of equity crowdfunding, where ‘accredited investors’ or qualified institutional buyers can participate in the equity crowdfunding. For the time being, equity crowdfunding is not permitted. Sebi, while recognising the potential and benefits of equity crowdfunding has raised red flags.</p><span>\n</span><p>Anoj Viswanathan, co-founder and president of Milaap, a crowdfunding platform, believes there are enough firms in the crowdfunding space for regulators to seriously consider a formalised structure for equity crowdfunding.</p><span>\n</span><p>Chet Jain, founder of Crowdera, also a crowdfunding platform, says crowdfunding platforms in India should form a “group”. “We should all join hands together and recommend something to Sebi.”<br>GV Anand Bhushan, partner and head at law firm Shardul Amarchand Mangaldas, also said a draft law may be on the anvil around the next two years. “Sebi’s approach is correct. Indians are just entering the primary stock market itself with mutual funds and shifting from traditional investments like gold and land,” Bhushan said. However, the lack of knowledge and awareness among many investors can put them at risk while engaging in equity crowdfunding.</p><span>\n</span><p>Jain said the highly-regulated mechanism for equity crowdfunding as proposed by Sebi would be a good start. But he said the scope and definition of ‘accredited investors’ should be expanded in a balanced way.</p><span>\n</span><p>Crowdfunding platforms in India have been gaining traction and receiving attention from investors. Crowdera raised an undisclosed pre-series funding round in June this year. Impactguru raised $2 million in May from Apollo Hospitals Group and Venture Catalysts.</p><span>\n</span><p>In the US, start-ups have been hugely successful in raising early funding from crowdfunding platforms like Kickstarter, IndieGoGo and Fundable, among others. Virtual reality and software firm Oculus VR, which was bought by Facebook in 2014 for $2.3 billion and was started through crowdfunding, and 3D pen maker WobbleWorks are some notable examples of start-ups raised through equity crowdfunding.</p><span>\n</span><p>By-</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "regulated",
        "growing",
        "few",
        "able",
        "In",
        "leaning",
        "restrictive",
        "model",
        "accredited",
        "qualified",
        "institutional"
    ],
    "nouns": [
        "growing",
        "few",
        "start",
        "In",
        "consultation",
        "gain",
        "paper",
        "leaning",
        "model",
        "equity"
    ],
    "verbs": [
        "start",
        "gain",
        "paper",
        "model",
        "participate"
    ]
}