{
    "title": "Crisis of confidence in banking provides an opportunity to unleash reforms",
    "link": "https://www.business-standard.com/article/finance/crisis-of-confidence-in-banking-provides-an-opportunity-to-unleash-reforms-118062100276_1.html",
    "pubDate": "Thu, 21 Jun 2018 22:16:00 +0530",
    "content": "The government's response to the issue of bad loans has been to bail out the errant banks with taxpayer's money",
    "contentSnippet": "The government's response to the issue of bad loans has been to bail out the errant banks with taxpayer's money",
    "guid": "https://www.business-standard.com/article/finance/crisis-of-confidence-in-banking-provides-an-opportunity-to-unleash-reforms-118062100276_1.html",
    "isoDate": "2018-06-21T16:46:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.09090909090909091,
        "tokens": [
            "crisis",
            "of",
            "confidence",
            "in",
            "banking",
            "provides",
            "an",
            "opportunity",
            "to",
            "unleash",
            "reforms"
        ],
        "words": [
            "opportunity",
            "confidence",
            "crisis"
        ],
        "positive": [
            "opportunity",
            "confidence"
        ],
        "negative": [
            "crisis"
        ]
    },
    "article": {
        "title": "Crisis of confidence in banking provides an opportunity to unleash reforms",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tIndia's banking sector has been hogging the headlines for all the wrong reasons. It started with the mounting problem of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/non-performing-assets\" target=\"_blank\">non-performing assets </a>(NPAs) across banks; then came a revelation of systemic fraud in the second-largest state-owned bank; and most recently, topping it all off are damning allegations of irregularities against the head of one of the largest private-sector <a class=\"storyTags\" href=\"https://www.business-standard.com/category/finance-features-banks-1030201.htm\" target=\"_blank\">banks.</a></p>\n<p>\n\tAll of these issues point towards a pandemic problem ailing the Indian banking sector, which cannot be resolved with quick-fix solutions.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe government's response to the issue of bad loans has been to bail out the errant <a class=\"storyTags\" href=\"https://www.business-standard.com/category/finance-features-banks-1030201.htm\" target=\"_blank\">banks </a>with taxpayer's money. A massive recapitalisation plan of Rs 1.35 trillion was announced last year, bringing the total capital infusion into <a class=\"storyTags\" href=\"https://www.business-standard.com/category/finance-features-banks-1030201.htm\" target=\"_blank\">banks </a>over the past decade to an astounding Rs 2.65 trillion. Clearly, such hand-outs only amount to value destruction on a colossal scale and go nowhere close to resolving the underlying problem that gives rise to the very problem of bad lending practices.</p>\n<p>\n\tMeanwhile, the case of fraud at <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/punjab-national-bank\" target=\"_blank\">Punjab National Bank </a>of Rs 110 billion, which involved the connivance of at least 54 employees over a period of time, is experiencing no headway either. The main perpetrator of the crime, Nirav Modi, has long fled the country. No penalty has been imposed on the bank yet and there has been no management shake-up as well. Eventually, it will be the taxpayers who will bear the cost of it all.</p>\n<p>\n\tFinally, the latest case of alleged malpractice arising out of ICICI Bank involves a quid pro quo between its former MD and CEO, Chanda Kochhar, and one of its borrowers, the Videocon Group, that has dealings with a firm promoted by Kochhar's husband. A detailed investigation will bring more clarity, but there are obvious grounds for conflict of interests as <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/chanda-kochhar\" target=\"_blank\">Chanda Kochhar </a>herself sat on the committee that sanctioned loans to Videocon.<br></p>\n\n<p>\n\tWhen the problems were just limited to bad loans and even the PNB fraud, most of the guns were trained at the inefficient working of the public-sector banks. But after the ICICI case, it is evident that private sector banks fare no better. This is even more problematic because public sector banks have an implicit assurance of having the government's backing in times of uncertainty. In case of private banks, even a small problem can trigger a panic as depositors begin to flee to government banks for safety. The <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/banking-system\" target=\"_blank\">banking system </a>runs on people's trust and if that is affected in any way, the repercussions will be costly.</p>\n<p>\n\tSo, it has become all the more important to address the core issue ailing Indian banks. All of these three instances are nothing more than a failure of governance on the part of the banks and their top management.</p>\n\n<p>\n\tA major problem in Indian financial institutions is the lack of effectiveness in supervisory oversight. The <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=board+of+directors\" target=\"_blank\">Board of Directors </a>are usually meant to conduct supervisory duties in any corporate set-up, including banking, but in India they are hardly held accountable for it.</p>\n<p>\n\tIn the United States, for instance, the central bank holds the power to dismiss a member of a bank board in case of misconduct, negligence or corruption. The boards of Indian companies similarly need to be held accountable for their role in times when the top management is found to be engaged in dubious activities.</p>\n<p>\n\tHistorically, India has not held the boards to as much media and public scrutiny as it has done for the CEOs of any company. This is especially true for the independent directors on the board. Independent board members by definition need to stay independent of the influence of the CEO and be the de facto torchbearers of corporate governance. A mechanism needs to be set up to make the board more accountable in case of any wrongdoing by the top management.</p>\n<p>\n\tOn a related note, if the 2008 banking crisis taught us anything it is that a defined regulatory framework and swift corrective measures are extremely crucial. For instance, the United Kingdom has a separate regulatory authority, the Financial Conduct Authority, to oversee the behaviour of financial entities in the country. In May, the CEO of Barclays was fined a heavy sum by the body for trying to establish the identity of the whistleblower who had complained against him. Such sound regulation can strengthen the trust in the system and improve its resilience to momentary shocks.</p>\n<p>\n\tIndia is undergoing a crisis of confidence in its <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/banking-system\" target=\"_blank\">banking system.</a> In these bleak times lies an opportunity to unleash reforms and strengthen governance. The government must refrain from temporary fixes like throwing more and more money at lenders. Such solutions only amount to kicking the can down the road. The real problem lies elsewhere.</p>\n<hr>\n<p>\n\t<em>(Amit Kapoor is chair, Institute for Competitiveness India. He can be contacted at amit.kapoor@competitiveness.in and tweets @kautiliya. Chirag Yadav is </em><em>senior</em><em> researcher, Institute for Competitiveness, India).</em></p>\n\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "verbs": [
        "unleash",
        "issue",
        "bail"
    ],
    "adjectives": [
        "bad",
        "errant"
    ],
    "nouns": [
        "money",
        "banking",
        "banks",
        "Crisis",
        "confidence",
        "opportunity",
        "government",
        "response",
        "issue",
        "bad",
        "bail",
        "taxpayer"
    ]
}