{
    "creator": "Bhavik Nair",
    "title": "Hard-hitting: Probe report on Fortis indicts ex-promoters",
    "link": "https://www.financialexpress.com/market/hard-hitting-probe-report-on-fortis-indicts-ex-promoters/1223096/",
    "pubDate": "Thu, 28 Jun 2018 05:02:21 +05:30",
    "dc:creator": "Bhavik Nair",
    "content": "Fortis Healthcare, which is currently in the midst of a takeover battle, terminated the September 2016 appointment of former executive chairman Malvinder Singh as ‘lead: strategic initiatives’. ",
    "contentSnippet": "Fortis Healthcare, which is currently in the midst of a takeover battle, terminated the September 2016 appointment of former executive chairman Malvinder Singh as ‘lead: strategic initiatives’.",
    "guid": "https://www.financialexpress.com/?p=1223096",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-27T23:32:21.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "hard-hitting",
            "probe",
            "report",
            "on",
            "fortis",
            "indicts",
            "ex-promoters"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Hard-hitting: Probe report on Fortis indicts ex-promoters",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1223097\" src=\"https://images.financialexpress.com/2018/06/1-230.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/1-230.jpg 660w, https://images.financialexpress.com/2018/06/1-230-300x200.jpg 300w, https://images.financialexpress.com/2018/06/1-230-620x413.jpg 620w, https://images.financialexpress.com/2018/06/1-230-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Hard-hitting: Probe report on Fortis indicts ex-promoters</figure>\n\t\t\t</section></div><span>\n</span><p>Indicting the former promoters of Fortis Healthcare, Malvinder and Shivinder Singh, an investigation report by law firm Luthra &amp; Luthra has said a subsidiary of the company had granted three companies affiliated to the Singh brothers an unsecured loan worth Rs 445 crore. The loan had been given without the board’s approval and despite objections from the management. The report, however, absolved the executives of any blame and said they processed the payments under duress.</p><span>\n</span><p>What is damaging for the Singh brothers is the observation that the entities which received the inter-corporate deposits (ICD) qualified as ‘related parties’; the promoters, the report said, were considering selling assets owned by them to settle the ICDs.</p><span>\n</span><p>The company said that it has initiated legal action to recover the outstanding ICDs. The findings of the investigation report and the firm’s earnings in FY18 were intimated to the stock exchanges early on Wednesday morning following a two-day board meeting.</p><span>\n</span><p>Fortis Healthcare, which is currently in the midst of a takeover battle, terminated the September 2016 appointment of former executive chairman Malvinder Singh as ‘lead: strategic initiatives’. It also decided to recover payments made to him in that role as well as any company asset in his possession.</p><span>\n</span><p>As is known, the Singh brothers had resigned as directors from the board of Fortis Healthcare in February this year, following the <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/delhi-high-court/\">Delhi High Court</a> order upholding the `3,500-crore arbitral award in favour of Daiichi Sankyo in the Ranbaxy Laboratories sale case.</p><span>\n</span><p>Malvinder Singh, who was appointed lead: strategic initiatives for five years with effect from October 1, 2016, at a remuneration of Rs 12 crore per annum, had received Rs 6 crore during 2016-17 and a proportionate sum for 2017-18.</p><span>\n</span><p>“Objections on record indicate that management personnel and other persons involved were forced into undertaking the ICD transactions under the repeated assurance of due repayment and it could not be said that the management was in collusion with the promoters to give ICDs to the borrower companies. Relevant documents/information and interviews also indicate that the management’s objections were overruled,” Fortis said in its filings.</p><span>\n</span><p>The report could not come to a conclusion on the utilisation of funds by the borrower companies, but suggested the ICDs were utilised for granting/repayment of loans to certain additional entities. These included those whose current and/or past promoters/directors are either known to or are connected with the promoters of the company.</p><span>\n</span><p>FHSL, a wholly-owned subsidiary of Fortis Healthcare, had placed inter-corporate secured short-term investments with three companies aggregating Rs 494.14 crore in July 2017. These ICDs were given for a period of 90 days and remained outstanding together with an interest accrued till March 31, 2018, of Rs 445.03 crore. This amount has been provided for in the financial results.</p><span>\n</span><p>The investigation report has come at a time when Fortis Healthcare is in the process of finding a new investor for which four parties — Manipal-TPG, the Munjals-Burmans combine, IHH Healthcare and KKR-backed Radiant Life Care — are in the fray. The deadline for submission of bids was June 28, which reports suggest will now be extended.</p><span>\n</span><p>Fortis had initiated an independent investigation through an external legal firm in February this year, following allegations of cash being siphoned out by the Singh brothers. It said on Wednesday the probe report has been submitted to the Securities and Exchange Board of India and Serious Fraud Investigation Office of the government.</p><span>\n</span><p>Meanwhile, for the January-March quarter of FY18, Fortis reported a net loss of Rs 932.02 crore (attributable to the owners of the company) against a loss of Rs 67.83 crore in the same period last year.<br>It said that the fourth-quarter net income after minority interest and share in associates was primarily impacted by provisions and impairment losses. “Provisions in Q4FY18 related to certain amounts totalling to approximately Rs 580 crore due to the company, the recoverability of which is doubtful,” it said.</p><span>\n</span><p>A late evening statement by Malvinder Singh said, “While we await the Luthra &amp; Luthra report from Fortis Healthcare, we would like to mention that there has been no mismanagement or misuse of funds and position. Treasury operations has been a profitable part of the Fortis business for the past many years. All decisions on ICDs, which were part of the treasury operations, were collectively taken by the respective decision making bodies at Fortis after deliberations. Presently there is a vindictive approach from parties with vested interest towards the former Fortis Promoters in these challenging times.”</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "terminated",
        "Hard",
        "former",
        "ex",
        "executive",
        "strategic"
    ],
    "nouns": [
        "Probe",
        "hitting",
        "report",
        "former",
        "ex",
        "Healthcare",
        "midst",
        "takeover",
        "battle",
        "September",
        "appointment",
        "executive",
        "chairman",
        "lead"
    ],
    "verbs": [
        "Probe",
        "report",
        "battle",
        "chairman",
        "lead"
    ]
}