{
    "creator": "FE Bureau",
    "title": "Walmart project aims to raise 6k farmers’ income",
    "link": "https://www.financialexpress.com/market/commodities/walmart-project-aims-to-raise-6k-farmers-income/1222991/",
    "pubDate": "Thu, 28 Jun 2018 01:37:44 +05:30",
    "dc:creator": "FE Bureau",
    "content": "Walmart Foundation has granted close to $2 million for the project as part of an ongoing initiative to improve market access for India’s small-holder farmers. ",
    "contentSnippet": "Walmart Foundation has granted close to $2 million for the project as part of an ongoing initiative to improve market access for India’s small-holder farmers.",
    "guid": "https://www.financialexpress.com/?p=1222991",
    "categories": [
        "Commodities",
        "Market"
    ],
    "isoDate": "2018-06-27T20:07:44.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "walmart",
            "project",
            "aims",
            "to",
            "raise",
            "6k",
            "farmers’",
            "income"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Walmart project aims to raise 6k farmers’ income",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1222992\" src=\"https://images.financialexpress.com/2018/06/1-201.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/1-201.jpg 660w, https://images.financialexpress.com/2018/06/1-201-300x200.jpg 300w, https://images.financialexpress.com/2018/06/1-201-620x413.jpg 620w, https://images.financialexpress.com/2018/06/1-201-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Walmart project aims to raise 6k farmers’ income</figure>\n\t\t\t</section></div><span>\n</span><p>Over 6,000 farmers in Andhra Pradesh will move to an improved business model for better value chains and improved incomes through an intensive two-year project supported by the Walmart Foundation in partnership with Hyderabad-based International Crops Research Institute for the Semi-Arid Tropic (Icrisat).</p><span>\n</span><p>Walmart Foundation has granted close to $2 million for the project as part of an ongoing initiative to improve market access for India’s small-holder farmers. Funds from Walmart Foundation of close to $4 million have now been allocated to projects in Andhra Pradesh in the past six months.</p><span>\n</span><p>While Walmart has stores in 28 countries, employing more than 2.3 million associates and doing business with thousands of suppliers who, in turn, employ millions of people, Icrisat is a non-profit organisation that conducts agricultural research for development in Asia and sub-Saharan Africa with a wide array of partners throughout the world.</p><span>\n</span><p>Senior representatives from Walmart launched Icrisat’s programme focussed on two key national priorities which include doubling farmers’ income and addressing malnutrition in rural areas. Over the next two years, Icrisat will work in Andhra Pradesh’s dryland farming areas with 6,100 small-holder farmers, 2,000 of whom are women. The project will set up community-based millet and legume processing facilities, provide access to training and more productive plant varieties and educate buyers in the market about the nutritional value of grain legumes to help boost demand.</p><span>\n</span><p>“Many of the six million farmers in Andhra Pradesh have very limited access to formal markets. We believe sustainable development in farming communities can be accelerated through direct skills building and growth of entrepreneurship, which creates new opportunities for farming communities across Andhra Pradesh,” Julie Gehrki, Vice President of Philanthropy, Walmart Foundation said in a statement.</p><span>\n</span><p>An international scientific research institution with UN status in India, Icrisat has been working in 17 countries across semi-arid tropics of Asia and sub-Saharan Africa, for over 45 years. A key component of its Walmart Foundation-funded project is the establishment of networks of small enterprise centres where small-holder-produced grain legumes can be collected and jointly processed. These centres will be run by farmer organisations and, youth and women entrepreneurs, with appropriate training and support.</p><span>\n</span><p>“Supporting small-holder farmers to better harness markets is a powerful way to help communities move from poverty to prosperity. Icrisat’s Inclusive Market Oriented Development has supported millions of farmers across India towards better livelihoods. The support of Walmart Foundation is a great opportunity to further enhance the lives of small-holder farmers in Andhra Pradesh to build a better future,” said Peter Carberry, Director General (Acting), Icrisat.</p><span>\n</span><p>“Walmart has a long-term commitment to India that is based on supporting domestic businesses and empowering local communities. We believe that helping India’s small farmers unlock their potential is one of the most effective ways for us to do this, with a ripple effect that will bring positive benefits for generations to come,” Paul Dyck, Walmart Vice President of Global Public Policy and Government Affairs, said in a statement.</p><span>\n</span><p>Walmart and the Walmart Foundation work to support farmers in many countries. Walmart Foundation focuses on efforts to address systemic barriers that prevent farmers from increasing their productivity and market access. This includes support for programmes that build infrastructure, introduce market-enabling technology, increase access to finance, and provide training on business and farming skills and international food standards.</p><span>\n</span><p>Between 2011 and 2017, Walmart Foundation funded training for 1.2 million farmers and farm workers in 15 countries. Women farmers made up more than half of those trained, with more than 600,000 benefitting directly. Walmart Foundation’s focus is now on programmes to support farmers in India and Mexico. Walmart is committed to improving the livelihoods of small and medium-sized farmers around the world through its global sourcing programmes and by providing assistance and training.</p><span>\n</span><p>In India, this includes the Sunhara Prayas market readiness project, which was launched in September 2017 in Uttar Pradesh to provide 750 mango and banana farmers with knowledge, resources and services to enhance their market-readiness, share best practices, and help increase their productivity.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "granted",
        "million",
        "ongoing",
        "initiative",
        "small",
        "close"
    ],
    "nouns": [
        "project",
        "raise",
        "income",
        "Foundation",
        "close",
        "part",
        "million",
        "initiative",
        "market",
        "access",
        "India",
        "small",
        "holder"
    ],
    "verbs": [
        "project",
        "raise",
        "part",
        "improve",
        "market",
        "access",
        "close"
    ]
}