{
    "creator": "Shayan Ghosh",
    "title": "One-day rule: Defaults jump, hit Rs 1.2 lakh crore",
    "link": "https://www.financialexpress.com/economy/one-day-rule-defaults-jump-hit-rs-1-2-lakh-crore/1223100/",
    "pubDate": "Thu, 28 Jun 2018 05:09:47 +05:30",
    "dc:creator": "Shayan Ghosh",
    "content": "More than 4,000 borrowers with outstanding loans of Rs 1.2 lakh crore have defaulted under the Reserve Bank of India’s (RBI) one-day default norms as on April 30. ",
    "contentSnippet": "More than 4,000 borrowers with outstanding loans of Rs 1.2 lakh crore have defaulted under the Reserve Bank of India’s (RBI) one-day default norms as on April 30.",
    "guid": "https://www.financialexpress.com/?p=1223100",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-27T23:39:47.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "one-day",
            "rule",
            "defaults",
            "jump",
            "hit",
            "rs",
            "12",
            "lakh",
            "crore"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "One-day rule: Defaults jump, hit Rs 1.2 lakh crore",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1223101\" src=\"https://images.financialexpress.com/2018/06/1-231.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/1-231.jpg 660w, https://images.financialexpress.com/2018/06/1-231-300x200.jpg 300w, https://images.financialexpress.com/2018/06/1-231-620x413.jpg 620w, https://images.financialexpress.com/2018/06/1-231-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> An RBI circular of February 12 required banks to classify borrowers as defaulters if their repayments are late even by a day.</figure>\n\t\t\t</section></div><span>\n</span><p>More than 4,000 borrowers with outstanding loans of Rs 1.2 lakh crore have defaulted under the Reserve Bank of India’s (<a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a>) one-day default norms as on April 30. An RBI circular of February 12 required banks to classify borrowers as defaulters if their repayments are late even by a day. These relate to exposures of Rs 5 crore or more and would not be bad loans; they would be classified as Special Mention Accounts (SMAs). However, if payments are not regularised within 90 days, they would turn bad and be added the existing `10.2 lakh crore pool of non-performing assets.</p><span>\n</span><p>Responding to a right to information query, the RBI noted 4,210 borrowers were classified as defaulters under the one-day default norm. The central bank added that 2,810 borrowers had been late on repayments on April 1, 2018, and they owed banks Rs 1.18 lakh crore.</p><span>\n</span><p>Meanwhile, data released by the RBI in its financial stability report (FSR) showed a 277% jump in SMA-0 loans — where repayments have been delayed between 1 and 30 days — between March 2017 and March 2018.</p><span>\n</span><p>The power sector accounted for at least Rs 70,000 crore of system-wide stressed loans. According to a report on stressed /non-performing assets in the electricity sector tabled in Parliament by the Standing Committee on Energy on March 7, 2018, 34 power projects with a capacity of 40,130 MW are stressed.</p><span>\n</span><p>Last month, a senior State Bank of India (SBI) executive had observed lower-rated borrowers account for a large chunk of one-day defaults at the bank. According to him several small companies and lower-rated borrowers have missed interest payments in April. “The bigger and better-rated companies have stronger cash flows than the smaller firms and we have not seen major deadline misses from them,” he said, adding that the new circular has made borrowers more disciplined.</p><span>\n</span><p>In February, the RBI had asked banks, either singly or jointly, to initiate a resolution plan as soon as a corporate default is spotted. In other words, banks have several options to revive the defaulting companies but these must be exercised within 180 days.</p><span>\n</span><p>Going by the new framework for resolution of stressed accounts, the fate of a defaulting entity will be sealed within 465 days.</p><span>\n</span><p>If lenders are not able to work out a solution to revive a company within 180 days, the account must be referred to the National Company Law Tribunal and the case would be decided under the Insolvency and Bankruptcy Code.</p><span>\n</span><p>RBI deputy governor NS Vishwanathan had said in April that a large number of borrowers, including some highly-rated ones, have defaulted on loans repayments under the one-day default norm. Citing “first few reports received from banks” under the new reporting system, he had said that non-payment on the due date appears to be seen as par for the course by banks and borrowers.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "One",
        "one",
        "More",
        "outstanding",
        "30"
    ],
    "nouns": [
        "One",
        "one",
        "day",
        "rule",
        "default",
        "jump",
        "hit",
        "lakh",
        "crore",
        "More",
        "Reserve",
        "India",
        "Bank",
        "RBI",
        "30",
        "April"
    ]
}