{
    "creator": "PTI",
    "title": "Talent surplus! India to be lone economy facing suppressed wages by 2030 – Here is what the study says",
    "link": "https://www.financialexpress.com/economy/talent-surplus-india-to-be-lone-economy-facing-suppressed-wages-by-2030-here-is-what-the-study-says/1215323/",
    "pubDate": "Thu, 21 Jun 2018 20:50:59 +05:30",
    "dc:creator": "PTI",
    "content": "India would be the only economy that will not face an upward revision of wages by 2030, as it has a talent surplus, bucking the global trend of a talent crunch, a report noted.",
    "contentSnippet": "India would be the only economy that will not face an upward revision of wages by 2030, as it has a talent surplus, bucking the global trend of a talent crunch, a report noted.",
    "guid": "https://www.financialexpress.com/?p=1215323",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-21T15:20:59.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.10526315789473684,
        "tokens": [
            "talent",
            "surplus",
            "india",
            "to",
            "be",
            "lone",
            "economy",
            "facing",
            "suppressed",
            "wages",
            "by",
            "2030",
            "–",
            "here",
            "is",
            "what",
            "the",
            "study",
            "says"
        ],
        "words": [
            "talent"
        ],
        "positive": [
            "talent"
        ],
        "negative": []
    },
    "article": {
        "title": "Talent surplus! India to be lone economy facing suppressed wages by 2030 – Here is what the study says",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1215325\" src=\"https://images.financialexpress.com/2018/06/1-145.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/1-145.jpg 660w, https://images.financialexpress.com/2018/06/1-145-300x200.jpg 300w, https://images.financialexpress.com/2018/06/1-145-620x413.jpg 620w, https://images.financialexpress.com/2018/06/1-145-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> India to be lone economy facing suppressed wages by 2030</figure>\n\t\t\t</section></div><span>\n</span><p>India would be the only economy that will not face an upward revision of wages by 2030, as it has a talent surplus, bucking the global trend of a talent crunch, a report noted.</p><span>\n</span><p>“Unlike any other country in the study India will have a highly skilled talent surplus by 2030,” the report said.</p><span>\n</span><p>Globally, a shortage of highly skilled employees could dramatically drive up salaries for the most in-demand workers by 2030, according to a study.</p><span>\n</span><p>This is likely to add more than USD 2.5 trillion in annual labour costs by 2030, for organisations around the world, according to Korn Ferry’s ‘The Salary Surge’.</p><span>\n</span><p>The report revealed that largest economies, including the US, China and Germany are likely to face the rapidly escalating employee costs.</p><span>\n</span><p>The Global Talent Crunch analysed global demand for labour at three key milestones, 2020, 2025 and 2030, in 20 markets, including in India, across three sectors, financial and business services, technology, media and telecommunications (TMT) and manufacturing.</p><span>\n</span><p>Globally, US companies can expect to pay the most globally facing a wage premium of more than USD 531 billion by 2030, while Germany will be the worst affected, facing a potential wage premium of approximately USD 176 billion by 2030.</p><span>\n</span><p>Meanwhile, in the Asia Pacific, the salary surge could add more than USD 1 trillion to annual payrolls by 2030, jeopardising companies’ profitability and threatening business models if kept unchecked, the Korn Ferry study said.</p><span>\n</span><p>“The new era of work is one of scarcity in abundance, there are plenty of people, but not enough with the skills their organisations will need to survive. While overall wage increases are just keeping pace with inflation, salaries for in-demand workers will skyrocket if companies choose to compete for the best and brightest on salary alone,” Korn Ferry Head of rewards and benefits for the APAC region<br>Dhritiman Chakrabarti said.</p><span>\n</span><p>Meanwhile, the study found that Japan would be expected to pay the most, an additional USD 468 billion by 2030. However, smaller markets with limited workforces are likely to feel the most pressure and by 2030, Singapore andHong Kong could expect salary premiums equivalent to more than 10 per cent of their 2017 GDP, it said.</p><span>\n</span><p>Also, by 2030, China could see an additional wage bill of more than USD 342 billion, it added.</p><span>\n</span><p>By 2030, the average pay premium across Asia Pacific per worker is USD 14,710 per year, however, Hong Kong could face a staggering USD 40,539 per year per highly skilled worker, Singapore could expect to pay an extra USD 29,065 and Australia USD 28,625 more.</p><span>\n</span><p>At a sector level, manufacturing, a critical driver of growth for emerging economies, may be stalled by the huge impact of the salary surge.</p><span>\n</span><p>In China the highly skilled worker shortage is expected to exceed one million workers by 2030, meaning that the wage premium could reach nearly USD 51 billion by the same date, higher than any other country analysed.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "lone",
        "surplus",
        "Here",
        "suppressed",
        "noted",
        "upward",
        "global"
    ],
    "nouns": [
        "India",
        "Talent",
        "talent",
        "surplus",
        "economy",
        "facing",
        "face",
        "Here",
        "study",
        "will",
        "wages",
        "revision",
        "report",
        "trend",
        "crunch"
    ]
}