{
    "creator": "FE Bureau",
    "title": "Stick to short-term debt funds: Fund managers",
    "link": "https://www.financialexpress.com/market/stick-to-short-term-debt-funds-fund-managers/1196431/",
    "pubDate": "Thu, 07 Jun 2018 03:06:18 +05:30",
    "dc:creator": "FE Bureau",
    "content": "Some industry players also think that, fixed maturity plans (FMPs) and hybrid funds are best bet during the current times.",
    "contentSnippet": "Some industry players also think that, fixed maturity plans (FMPs) and hybrid funds are best bet during the current times.",
    "guid": "https://www.financialexpress.com/?p=1196431",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-06T21:36:18.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.2857142857142857,
        "tokens": [
            "stick",
            "to",
            "short-term",
            "debt",
            "funds",
            "fund",
            "managers"
        ],
        "words": [
            "debt"
        ],
        "positive": [],
        "negative": [
            "debt"
        ]
    },
    "article": {
        "title": "Stick to short-term debt funds: Fund managers",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1196437\" src=\"https://images.financialexpress.com/2018/06/debt-1.jpg\" alt=\"debt funds, short term debt funds, RBI, fund managers\" srcset=\"https://images.financialexpress.com/2018/06/debt-1.jpg 660w, https://images.financialexpress.com/2018/06/debt-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/debt-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/debt-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Following a hike in the repo rate by the Reserve Bank of India (RBI) on Wednesday and expectations of a few more increases in the current financial year, fund managers insist that investors should stick to short-term debt funds.</figure>\n\t\t\t</section></div><span>\n</span><p>Following a hike in the repo rate by the Reserve Bank of India (<a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a>) on Wednesday and expectations of a few more increases in the current financial year, fund managers insist that investors should stick to short-term debt funds. Apart from short-term debt funds, fixed maturity plans (FMPs) and debt-oriented hybrid funds can be opted by investors in current scenario.</p><span>\n</span><p>The RBI, in its second bi-monthly policy of 2018-19, has raised the key repo rate by 25 basis points to 6.25%. In the past three years, RBI has cut repo rate down by 200 basis points (100 basis points=1%).<br>Mahendra Kumar Jajoo, head of fixed income at Mirae Asset Global Investments (India), says: “The policy was in line with expectations and three key reasons led to increase in rate hike. First is turbulence in emerging markets, then rise in oil prices and finally pick-up in the core inflation last month. These were some of the key reasons for rate hike.” He also added investors should look at short-term products with average maturity of two-three years if they have investment horizon of 18-20 months.</p><span>\n</span><p>Short-term bond funds invest in debt securities that mature in about a year to three years. They can invest in a mix of short-term instruments like commercial paper and certificates of deposits. In the last one year, short-term debt funds like Franklin India Low Duration Fund, Baroda Pioneer Short Term Bond Fund and Franklin India Short Term Income Plan have given returns in the range of 6.5% to 7.75%, data from Value Research showed.</p><span>\n</span><p>On an average, returns on short-term debt funds were around 5.25% in the past one year, while returns of longer duration funds like income and gild-medium and long-term funds have given average returns of 3.2% and 0.44% respectively. On Wednesday, the 10-year benchmark government securities (G-Sec) closed at 7.92%. R Sivakumar, head of fixed income at Axis Mutual Fund, says: “Its very unlikely that RBI will stop with just one rate hike. We might see few more in this financial year. So we would suggest investors to stay away from longer duration funds and stay in short-term or money market securities.”</p><span>\n</span><p>Market participants also added that, 10- year yield will continue to remain in the range of 7.75-8% in the next two-three months. The prices of fixed income securities are governed by interest rates prevailing in the markets. Interest rates and price of fixed income securities are inversely proportional. When interest rates decline, the prices of fixed income securities increase. Similarly, when there is hike in interest rates, the prices of fixed income securities come down.</p><span>\n</span><p>Some industry players also think that, fixed maturity plans (FMPs) and hybrid funds are best bet during the current times. “Investors can lock-in money at the higher yields in FMPs at this point of time. Even hybrid funds which have equity exposure of 10-15% can be attractive at this point of time,” said Dwijendra Srivastava, CIO-Debt at Sundaram Asset Management Company. Such hybrid funds invest in both debt and equity, but around 70-80% of the corpus is invested in debt instruments while remaining in equity.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "current",
        "short",
        "Some",
        "fixed",
        "hybrid",
        "best"
    ],
    "verbs": [
        "Fund",
        "Stick",
        "short",
        "term",
        "think",
        "best",
        "bet"
    ],
    "nouns": [
        "industry",
        "current",
        "funds",
        "Fund",
        "times",
        "Stick",
        "short",
        "term",
        "debt",
        "think",
        "maturity",
        "best",
        "bet",
        "hybrid"
    ]
}