{
    "title": "NCLAT stays order on appointment of govt nominated directors to 63 Moons",
    "link": "https://www.business-standard.com/article/markets/nclat-stays-order-on-appointment-of-govt-nominated-directors-to-63-moons-118062800026_1.html",
    "pubDate": "Thu, 28 Jun 2018 00:34:00 +0530",
    "content": "This interim relief came after the corporate affairs ministry and the company had appealed against the NCLT's decision disqualifying the three directors the government had appointed",
    "contentSnippet": "This interim relief came after the corporate affairs ministry and the company had appealed against the NCLT's decision disqualifying the three directors the government had appointed",
    "guid": "https://www.business-standard.com/article/markets/nclat-stays-order-on-appointment-of-govt-nominated-directors-to-63-moons-118062800026_1.html",
    "isoDate": "2018-06-27T19:04:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "nclat",
            "stays",
            "order",
            "on",
            "appointment",
            "of",
            "govt",
            "nominated",
            "directors",
            "to",
            "63",
            "moons"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "NCLAT stays order on appointment of govt nominated directors to 63 Moons",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>Staying a decision by the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/national-company-law-tribunal\" target=\"_blank\">National Company Law Tribunal </a>(NCLT), the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=national+company+law+appellate+tribunal\" target=\"_blank\">National Company Law Appellate Tribunal </a>(NCLAT) has ruled that government representatives on the board of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/63-moons-technologies\" target=\"_blank\">63 Moons Technologies </a>Ltd (earlier FTIL) will continue to have veto powers on the company’s financial decisions. This has given the ministry of corporate affairs interim relief.</p><p>\nHowever, 63 Moons see this judgment as a stay on government appointing nominees on its board.\n\n\n</p>\n<!-- INPAGE_BANNER --><p>\nThis interim relief came after the corporate affairs ministry and the company had appealed against the NCLT’s decision disqualifying the three directors the government had appointed.</p><p>\nThe appellate tribunal has stayed this order. With this, even though its directors will be a minority on the board of the company, the government will be able to veto its decisions.</p>\n <br>Retired Supreme Court judge G P Mathur and former Mines Secretary Anup Pujari will be part of the committee overseeing the board’s decision.<p>\nThe <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nclt\" target=\"_blank\">NCLT </a>made it clear that the relief sought by the petitioner (Central Government) — for oppression and mismanagement (of the company) — under Section 397 and 398 of Companies Act 1956 were “not sustainable”. This is because the petitioner cannot be treated as a member for the purpose of the petition under Sections 397 and 398, the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nclt\" target=\"_blank\">NCLT </a>had said in its order.</p><p>\n63 Moons said in a statement: “The <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nclat\" target=\"_blank\">NCLAT </a>today also stayed the entire operation of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nclt\" target=\"_blank\">NCLT </a>order which had disqualified the previous directors as ‘not fit and proper’. Simultaneously and purely as an interim arrangement, the Committee appointed by NCLT in June 2016 is continued only to look into the matters pertaining to funding of subsidiaries and management of treasury operations of the Company.”<br>The Chennai bench of the NCLT appointed the committee to oversee the functioning of the company in 2016.</p><p>\nThe NCLT had also stated that the present board of the company could not be held responsible for the National Spot Exchange Ltd (NSEL) fraud. In a series of tweets, 63 Moons has said that recovery should begin from 24 defaulters as spotted by investigative agencies such as the economic offences wing and Enforcement Directorate.</p><p>\nThis is the first high-profile case after Satyam Computer where the government wanted to disband the board and take over the functioning of the company in the public interest.</p><p>\nIn a separate petition, the government opposed the merger between NSEL and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/ftil\" target=\"_blank\">FTIL </a>(Financial Technologies India Ltd). The central government had moved the Company Law Board (before it was upgraded to the NCLT) to supersede the board of 63 moons after the ~56-billion NSEL scam came to light in July 2013. The NSEL is a subsidiary of 63 Moons.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "appointed",
        "nominated",
        "63",
        "interim",
        "corporate",
        "disqualifying",
        "three"
    ],
    "nouns": [
        "order",
        "stays",
        "appointment",
        "government",
        "interim",
        "relief",
        "affairs",
        "ministry",
        "company",
        "decision",
        "three"
    ],
    "verbs": [
        "order",
        "company"
    ]
}