{
    "title": "The curious case of India's trade with 'Hermit Kingdom' North Korea",
    "link": "https://www.business-standard.com/article/economy-policy/the-curious-case-of-india-s-trade-with-hermit-kingdom-north-korea-118061300618_1.html",
    "pubDate": "Thu, 14 Jun 2018 01:31:00 +0530",
    "content": "Despite stringent economic sanctions in place, India is the 2nd largest exporter to North Korea",
    "contentSnippet": "Despite stringent economic sanctions in place, India is the 2nd largest exporter to North Korea",
    "guid": "https://www.business-standard.com/article/economy-policy/the-curious-case-of-india-s-trade-with-hermit-kingdom-north-korea-118061300618_1.html",
    "isoDate": "2018-06-13T20:01:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.09090909090909091,
        "tokens": [
            "the",
            "curious",
            "case",
            "of",
            "india's",
            "trade",
            "with",
            "'hermit",
            "kingdom'",
            "north",
            "korea"
        ],
        "words": [
            "curious"
        ],
        "positive": [
            "curious"
        ],
        "negative": []
    },
    "article": {
        "title": "The curious case of India's trade with 'Hermit Kingdom' North Korea",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p> Of the more than $36 billion worth of refined petroleum exported by India in 2017-18, a small trickle worth $16 million, managed to find its way to North Korea, despite economic sanctions currently in place. It constituted the largest component of India's exports measuring a significant $57.55 million to the country, something that policy experts feel may only increase now that the nation has agreed to neuter its nuclear weapons program.</p> <p> While official statistics from North Korea are hard to come by due to the ruling regimes limited contact with the larger global economy, India remains North Korea's 2nd-largest import source after China, according to several estimates by multilateral bodies. But there's a problem. \"Adhering to UNSC sanctions resolutions, India has banned all trade, except food and medicine, with Democratic Peoples Republic of Korea with effect from April this year,\" according to a statement from the Ministry of External Affairs said back in October 2017. However, official statistics from the Commerce and Industry Ministry show that bilateral trade reached $82.63 million in the last financial year.\n\n\n</p>\n<!-- INPAGE_BANNER --> <p> The majority of the trade is also not in the allowed categories of food and medicine. India's exports are mostly centered around commodities such as crude oil, cotton, and ores, crucial items that the regime needs access to for running its state-controlled industrial manufacturing complex.</p> <p> \"Since the threat of breaking international trade protocols remain high, Indian sellers of oil have continued to operate through a network of traders and banks in Dubai and Liaoning - the Chinese province that borders the country,\" a business leader from a national industry chamber who visited the Chinese port last year said. Little direct trade occurs for most of the other items including cotton and ores also, which take a circuitous route through China, he added.</p> <p> <img align=\"left\" alt=\"chart\" class=\"imgCont\" height=\"529\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/14/full/1528920097-0973.jpg\" title=\"chart\" width=\"620\"></p> <strong>Sanctions may</strong><strong> go?</strong> <p> India may also have found a new market to send out its excess produce in certain sectors, that is relatively close from home and has established trade linkages already in place.</p> <p> Hours after photos of vigorous handshakes and awkward smiles between North Korean leader Kim Jong Un and US President Donald Trump was sent out across the globe from their summit in Singapore, China officially suggested that the sanctions may now be removed gradually, pending discussions.</p> <p> \"It's early days yet. The government will take a call only after North Korea starts effectively dismantling its nuclear infrastructure. India is committed to international sanctions but we reserve the right to take bilateral action as well,\" a senior Commerce Department official said. </p><p>While there has not been any trade missions to the country, India has participated in the Pyongyang Autumn International Trade Fair that attracts sellers from Taiwan, China and Japan, multiple times, he added.</p> <p> While India may not have much use for most of the goods traditionally exported by the country such as coal and textiles, the availability of deep discounts on bulk shipments have been taken advantage of by Indian traders, people in the know said. As a result, machinery and electrical equipment sourced from sweatshops in North Korea is passed off as from China. The only demand from Kim regime is that payments be made in US Dollars which is much sought after in the country. The country has one of the lowest levels of foreign exchange and the country charges tourists and visiting journalists in US Dollars.</p> <p> <strong>Politics and beyond</strong></p> <p> Currently there are atleast 13 internationally recognized economic sanctions against trade, investment and transactions with North Korean government or citizens in effect. All of these sanctions, initiated by the United Nations Security Council, started getting aimed at Pyongyang since the North started to dabble with Nuclear weapons back in 2006. However, while the regime continued to reach out to erstwhile Soviet Bloc economies, the 2013 sanctions aimed at shutting the nation out of the international finance system has hit the nation hard.</p> <p> Experts have said that Kim's meeting with Trump in SIngapore has been necessitated by the fact that other trade embargoes by individual countries such as the United States, Japan and China have shut down the last remaining engines of factory led growth in the country.</p> <p> \"The trade figures could be much higher. It has less to do with current international sanctions and more with the fact that the government was miffed at the regime's support to Pakistan on certain geopolitical issues back in 2015. Before that, trade had reached a high of $ 208 million in 2014-15, after which it has continued to fall.\" a senior Foreign Ministry official earlier overseeing North Korean bilateral relations said.</p> \t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "curious",
        "stringent",
        "economic",
        "North",
        "2nd"
    ],
    "verbs": [
        "case",
        "trade",
        "place"
    ]
}