{
    "creator": "FE Bureau",
    "title": "Digital transformation is the new normal in India",
    "link": "https://www.financialexpress.com/industry/technology/digital-transformation-is-the-new-normal-in-india/1222967/",
    "pubDate": "Thu, 28 Jun 2018 01:03:25 +05:30",
    "dc:creator": "FE Bureau",
    "content": "India today is at the helm of digital transformation. Be it SMEs, enterprises, start-ups or the government, everyone has undergone or is thinking of digital transformation. ",
    "contentSnippet": "India today is at the helm of digital transformation. Be it SMEs, enterprises, start-ups or the government, everyone has undergone or is thinking of digital transformation.",
    "guid": "https://www.financialexpress.com/?p=1222967",
    "categories": [
        "Industry",
        "Technology"
    ],
    "isoDate": "2018-06-27T19:33:25.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "digital",
            "transformation",
            "is",
            "the",
            "new",
            "normal",
            "in",
            "india"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Digital transformation is the new normal In India",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1222968\" src=\"https://images.financialexpress.com/2018/06/1-196.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/1-196.jpg 660w, https://images.financialexpress.com/2018/06/1-196-300x200.jpg 300w, https://images.financialexpress.com/2018/06/1-196-620x413.jpg 620w, https://images.financialexpress.com/2018/06/1-196-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Digital transformation is the new normal In India</figure>\n\t\t\t</section></div><span>\n</span><p>India today is at the helm of digital transformation. Be it SMEs, enterprises, start-ups or the government, everyone has undergone or is thinking of digital transformation. Today, every business, irrespective of scale, size or industry, is adopting digital technologies to improve business efficiency, become competitive and provide a better experience to the tech-savvy end-consumer.</p><span>\n</span><p>The present government has also given significant impetus to businesses to invest in new technologies and harness the benefits of digital. The Union Budget 2018 was testament to the government’s focus on emerging technologies such as Artificial Intelligence (AI), Blockchain and more. Among the first actions the NDA-led government undertook was to launch the Pradhan Mantri Jan-Dhan Yojana (PMJDY or Jan Dhan) financial inclusion programme on August 28, 2014. On the very first day that Jan Dhan was implemented, the government created 10 million bank accounts using existing Aadhaar IDs in a paperless manner, at a fraction of the previous customer acquisition costs. Demonetisation in 2017 was also a huge push to accelerate digital payments. Considering how we have surpassed major countries in smartphone adoption, it only is a matter of time for us to adopt digital payments at a much larger scale.</p><span>\n</span><p>Businesses across the country have also made significant investment in digital technologies. The banking, financial services and insurance (BFSI) sector is the best example of digital transformation in India. For example, banks earlier used to pride on the number of branches they had, today banks like DBS have completely disrupted the sector. The concept of a digital bank and virtual debit/credit cards is soon becoming mainstream. Technology companies are heavily investing in AI and Blockchain among other technologies. Furthermore, as per Gartner, India’s IT spending is projected to total $87.1 billion in 2018, an increase of 9.2% from 2017 estimated spending of $79.7 billion.</p><span>\n</span><p>Today, businesses like PayPal have transformed the money transfer experience and made it simple and seamless; similarly, all leading telecom companies provide mobile applications making viewing of data plans, and bill plans simple for consumers. Technology today is the cornerstone of growth and it has disrupted traditional means and we are slowly witnessing incumbents also invest significant amounts in emerging technologies.</p><span>\n</span><p>According to the Avaya-commissioned IDC’s Digital Transformation: The Key to Getting it Right report, 74% of respondents from India feel that their organisation is able to meet their digital transformation goals successfully. Again, 62% respondents feel that the primary driver to take up digital transformation initiative into their business is to boost employee efficiency.</p><span>\n</span><p>People, technology and customer should be central to an organisation’s digital transformation strategy. Over 85% of Indian enterprises feel that the digital transformation initiatives are ensuring better customer service followed by acceleration of the pace of new product/service introduction and revenue growth, as per the Avaya/IDC research. Further, as organisations become ever more dependent on technology, there is an increased need to invest in training and skilling their workforce, and use technology more effectively to enable and empower its employees to be more efficient and productive.</p><span>\n</span><p>The stage is ripe for India. We have already made significant headway in pushing through a digital economy, and the next few years will see more investments in digital along with strengthening of a digital strategy. Another trend we expect to see is incumbents leading the next phase of digital growth in India.</p><span>\n</span><p>By- Vishal Agrawal. The writer is managing director, India and SAARC, Avaya</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "Digital",
        "digital",
        "new",
        "normal",
        "thinking"
    ],
    "verbs": [
        "helm",
        "Be",
        "start"
    ],
    "nouns": [
        "transformation",
        "normal",
        "India",
        "today",
        "helm",
        "start",
        "government",
        "thinking",
        "Be"
    ]
}