{
    "title": "How trade war unleashed by Trump is bringing old foes India & China closer",
    "link": "https://www.business-standard.com/article/economy-policy/how-trade-war-unleashed-by-trump-is-bringing-old-foes-india-china-closer-118062800120_1.html",
    "pubDate": "Thu, 28 Jun 2018 06:34:00 +0530",
    "content": "China has lowered import barriers on some Indian goods",
    "contentSnippet": "China has lowered import barriers on some Indian goods",
    "guid": "https://www.business-standard.com/article/economy-policy/how-trade-war-unleashed-by-trump-is-bringing-old-foes-india-china-closer-118062800120_1.html",
    "isoDate": "2018-06-28T01:04:00.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.14285714285714285,
        "tokens": [
            "how",
            "trade",
            "war",
            "unleashed",
            "by",
            "trump",
            "is",
            "bringing",
            "old",
            "foes",
            "india",
            "",
            "china",
            "closer"
        ],
        "words": [
            "war"
        ],
        "positive": [],
        "negative": [
            "war"
        ]
    },
    "article": {
        "title": "How trade war unleashed by Trump is bringing old foes India & China closer",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tPresident Donald Trump’s moves to protect US trade interests are creating unusual bedfellows in Asia.</p>\n<p>\n\tIndia and China, longstanding economic and strategic rivals, are seeing a thaw in relations less than a year after the most serious border flare-up since a war in 1962 threatened ties between the two Asian giants.</p>\n<p>\n\tSince May, China has made it easier for India to export non-Basmati rice, removed import duties on anti-cancer drugs and agreed to share data that predicts river flows between the two countries during the flood season. Chinese President <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/xi-jinping\" target=\"_blank\">Xi Jinping </a>and Indian Prime Minister Narendra Modi have met twice since April, pledging to strengthen bilateral ties.</p>\n<p>\n\tDriving the marriage of convenience is Trump’s unpredictable policy-making. The US has ratcheted up global trade tensions with tariff threats against China, Canada, Mexico and the European Union, prompting several to retaliate. Last week India also joined the fray, raising duties on a slew of US imports.</p>\n<p>\n\t“China understands that this <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/trade-war\" target=\"_blank\">trade war </a>situation isn’t going to end in a few days or even months,” said Bipul Chatterjee, executive director of an India-based trade think tank. “They wouldn’t want to open more than one battle front. The focus is now on confronting the US.”</p>\n<p>\n\t<strong>‘Trump Factor’</strong><br></p>\n<p>\n\tThe question many observers are asking is whether China’s cozier relationship with India can endure. The world’s two most-populous nations have had a tense history, marked by border disputes and China’s growing economic influence in South Asia.</p>\n<p>\n\t“I don’t think the fundamentals of the relationship are changing in any way, but the Trump factor is pushing them to coordinate their priorities more closely,” said Harsh Pant, an international relations professor at King’s College London.</p>\n<p>\n\tHere’s a look at some of the flashpoints that hinder stronger ties:</p>\n<p>\n\t<strong>Trade Gap</strong><br></p>\n<p>\n\tIndia’s two-way trade with China touched nearly $90 billion last year, making it the largest commercial partner of the South Asian economy. The bilateral trade gap was $63 billion -- India’s largest -- mainly due to imports of Chinese-made heavy machinery, telecom equipment and home appliances, according to commerce ministry data.</p>\n<p>\n\tRead about how Chinese goods have swamped Indian markets</p>\n<p>\n\tThe deficit widened from $36 billion in the financial year ended March 2014, driving up the current-account gap and adding to the economy’s vulnerability.</p>\n<p>\n\t<strong>Widening Gap</strong></p>\n<p>\n\tModi’s flagship ‘Make in India’ initiative to foster local manufacturing struggles in the face of low-priced imports from China, while at the same time India’s cost-competitive software services companies battle to get access to the Chinese market.</p>\n<p>\n\tTo curb the shortfall -- and counter to China’s easing of trade barriers -- India boosted tariffs on electronic goods, such as mobile phones, TVs and microwave ovens last year.</p>\n<p>\n\t<strong>Border Spat</strong><br></p>\n<!-- INPAGE_BANNER -->\n\t \n<p>\n\tCloser trade ties seem incongruous less than a year after troops from the two nuclear-armed nations faced off in a dispute in the remote Doklam Plateau between India, Bhutan and Tibet, triggered by China’s attempt to build a road there.</p>\n<p>\n\tTension eased after the two countries agreed to an “expeditious disengagement” of troops from the area in late August, with Modi and Xi later pledging to strengthen communication between their respective armies at the informal summit this April.</p>\n<p>\n\tSino-Indian relations have long been marred by disputes over large tracts of land along the border. India’s hosting of the Dalai Lama and the Tibetan government-in-exile in the mountain town of Dharamsala in northern India is also a source of anger in Beijing.</p>\n<p>\n\t<strong>Belt and Road</strong><br></p>\n<p>\n\tAnother sore point in the bilateral relationship has been China’s ambitious global infrastructure plans, which include projects in New Delhi’s Indian Ocean backyard that domestic analysts worry have a strategic dimension.</p>\n<p>\n\tUnder the so-called Belt and Road Initiative, China has financed ports and roads from Myanmar to Sri Lanka and Pakistan. India is one of the only holdouts globally.</p>\n<p>\n\tAt a recent foreign ministers meeting of the Shanghai Cooperation Organization, a China-led group, India was the only member country not to endorse China’s Belt and Road plans.</p>\n<p>\n\tDrawing the most alarm for India is the $60 billion China Pakistan Economic Corridor, which runs through Pakistan-administered land in the disputed border region of Kashmir. New Delhi claims the region as its own territory.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "lowered",
        "Indian",
        "old"
    ],
    "nouns": [
        "India",
        "Indian",
        "China",
        "trade",
        "import",
        "war",
        "Trump",
        "bringing",
        "old",
        "closer"
    ],
    "verbs": [
        "trade",
        "import",
        "war",
        "Trump"
    ]
}