{
    "creator": "Sudhir Chowdhary",
    "title": "Travel laptops: Stay connected on your journeys",
    "link": "https://www.financialexpress.com/industry/technology/stay-connected-on-your-journeys/1222958/",
    "pubDate": "Thu, 28 Jun 2018 00:53:26 +05:30",
    "dc:creator": "Sudhir Chowdhary",
    "content": "Smartphones have become immensely powerful and most of the tasks that required a laptop a few years ago can now be done with that little device in your pocket. ",
    "contentSnippet": "Smartphones have become immensely powerful and most of the tasks that required a laptop a few years ago can now be done with that little device in your pocket.",
    "guid": "https://www.financialexpress.com/?p=1222958",
    "categories": [
        "Industry",
        "Technology"
    ],
    "isoDate": "2018-06-27T19:23:26.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "travel",
            "laptops",
            "stay",
            "connected",
            "on",
            "your",
            "journeys"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Travel laptops: Stay connected on your journeys",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1222959\" src=\"https://images.financialexpress.com/2018/06/1-194.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/1-194.jpg 660w, https://images.financialexpress.com/2018/06/1-194-300x200.jpg 300w, https://images.financialexpress.com/2018/06/1-194-620x413.jpg 620w, https://images.financialexpress.com/2018/06/1-194-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Stay connected on your journeys</figure>\n\t\t\t</section></div><span>\n</span><p>It’s the holiday season and for many travellers, the need to travel with a notebook computer has dramatically decreased. Smartphones have become immensely powerful and most of the tasks that required a laptop a few years ago can now be done with that little device in your pocket. Still, there are times when you just can’t carry out tasks such as writing large amounts of texts, editing photos, video etc on a mobile device. A laptop becomes a must-have device on such occasions. Whether you are a busy work traveller, or an entertainment loving traveller en route vacation, here is a list of Intel-powered laptops known for their battery life, graphics, and storage, for modern nomads like you.</p><span>\n</span><p><strong>HP Pavilion x360-14-ba077tu (Rs 47,989)</strong></p><span>\n</span><p>A classy work companion, the HP Pavilion x360-14-ba077tu is powered by 7th Generation Intel Core i3 processor. It has a 14-inch diagonal FHD IPS WLED-backlit multitouch-enabled edge-to-edge glass (1920 x 1080) touchscreen display, 4 GB DDR4-2133 SDRAM/1TB 5400 rpm SATA Solid State Hybrid Drive (SSHD) and Windows 10 Home (64-bit) operating system. It is a great 2-in-1 laptop choice that strikes a balance between performance and battery life to ensure that you don’t miss out on anything even when on the road. A durable 360-degree geared hinge with sophisticated design adds more to the style factor.</p><span>\n</span><p><strong>Lenovo Yoga 520 (Rs 56,999)</strong></p><span>\n</span><p>The Lenovo Yoga 520 (14-inch), powered by 8th generation Intel Core i3 processor is ideal for entertainment. A true media buddy, this stylish 2-in-1 entertainment powerhouse has enough battery to binge-watch your favourite movies or series. Finished in sleek aluminum, the Yoga 520 is available in Mineral Grey, Onyx Black, and Metallic Gold. Its precision-cut bevelled edges were designed for a clean and modern look, and an updated touchpad provides smooth comfort and improved control. With up to a Full HD 14-inch IPS touchscreen display, you’ll be able to watch movies and browse the web in vivid detail from nearly every angle—whether you’re lounging on the couch, or travelling in a train. A battery life of 10.4 hours means you’ll never feel anchored to an outlet. Plus, the Yoga 520 comes with an always-on USB 3.0 port, which means you will be able to charge your other favourite devices even when your laptop is switched off.</p><span>\n</span><p><strong>Dell Inspiron 15 5570 (Rs 52,790)</strong></p><span>\n</span><p>The Dell Inspiron 15 5570 is suitable for someone who likes to multi-task. Equipped with 8th Generation Intel Core i5 processor, the Inspiron 15 lets you do multitasking like a pro. The latest Intel Core i processor delivers plentiful power in a compact package. The backlit smooth keyboard and roomy trackpad will ensure seamless work flow, no matter where you are travelling. You can enjoy the crisp detail of 39.6cm (15.6-inch) FHD non-touch anti-glare display to see everything better. With increased performance, boosted bandwidth and epic energy efficiency with up to 32GB DDR4 memory, you’ll be running all your apps and multitasking like a pro in no time. This Inspiron is a true versatile laptop. The laptop offers multiple storage options for responsive performance and plenty of backup, including up to 2TB HDD.</p><span>\n</span><p><strong>Acer Swift 3 (Rs 40,990)</strong></p><span>\n</span><p>The Acer Swift 3 meets the many demands of today’s modern, on-the-go lifestyle thanks to its super-fast connection speeds, great portability and sleek, thin design. The Acer Swift 3 is powered by Intel Core i3-7130 processor and can be called your productivity partner. It has a long battery life, dual-storage design, and compact size—all this makes all-day computing possible. The Swift 3 has a 14-inch Full HD (1920 x 1080) IPS Widescreen LED-backlit Display. You can type comfortably in dimly lit environments with the convenience of a backlit keyboard. This eye catching keyboard lets you get stuff done whether it is day or night. All in all, a combination of speed, efficiency and power.</p><span>\n</span><p><strong><a target=\"_blank\" href=\"http://www.financialexpress.com/tag/asus/\">Asus</a> ZenBook UX430UA (Rs 81,990)</strong></p><span>\n</span><p>The stylish Asus ZenBook UX430UA is a true always ‘on-the-go’ champion. It is designed to go wherever your busy lifestyle takes you – whether it’s a hectic round of meetings, a crammed international schedule, or a well-deserved vacation. Its sleek and compact 33.02cm (13-inch) chassis is a briefcase-friendly 15.9mm thick, and its advanced lightweight construction keeps the weight down to just 1.25 kg—so it’ll never be a burden when you’re on the go. The ZenBook UX430UA is a powerful machine when it comes to work. Powered by Intel Core i5 7200U processor, the laptop is equipped with Asus Eye Care technology for up to 30% blue-light reduction and the lightweight design makes it easy to carry in your bag.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "connected",
        "powerful",
        "required",
        "few",
        "ago",
        "done",
        "little"
    ],
    "nouns": [
        "Travel",
        "laptop",
        "Stay",
        "few",
        "years",
        "little",
        "device",
        "pocket"
    ],
    "verbs": [
        "Travel",
        "Stay",
        "become",
        "pocket"
    ]
}