{
    "title": "Microsoft, YouTube, Facebook, Google shake down the Indian language tree",
    "link": "https://www.business-standard.com/article/companies/microsoft-youtube-facebook-google-shake-down-the-indian-language-tree-118040501225_1.html",
    "pubDate": "Thu, 05 Apr 2018 21:14:00 +0530",
    "content": "Digital platforms look to engage brands and users beyond multi-lingual entertainment content",
    "contentSnippet": "Digital platforms look to engage brands and users beyond multi-lingual entertainment content",
    "guid": "https://www.business-standard.com/article/companies/microsoft-youtube-facebook-google-shake-down-the-indian-language-tree-118040501225_1.html",
    "isoDate": "2018-04-05T15:44:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "microsoft",
            "youtube",
            "facebook",
            "google",
            "shake",
            "down",
            "the",
            "indian",
            "language",
            "tree"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Microsoft, YouTube, Facebook, Google shake down the Indian language tree",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tLarge digital platforms such as Google, Microsoft, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=youtube\" target=\"_blank\">YouTube </a>and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=facebook\" target=\"_blank\">Facebook </a>have stepped up their efforts to engage the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=non+english+speaking+internet+user\" target=\"_blank\">non-English speaking internet user </a>by speaking in multiple tongues for a few years now. However entertainment is still the driving force behind much of the user engagement. Now many are looking at ways to lock in the next wave of internet users with language support for critical services, thereby increasing user stickiness and brand engagement on their platforms.</p>\n<p>\n\t“We’re making technology use the language of people, and not requiring people to first learn the traditional language of technology,” said Meetul Patel, COO, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=microsoft\" target=\"_blank\">Microsoft </a>India, during the launch of support for email in 15 Indian languages in February this year. The support will be available in a diverse set of languages including Bodo, Dogri, Konkani, Maithili, Sindhi and Manipuri among others across its email apps and services.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tNearly 205 million internet non-users are likely to go digital if internet is provided in a language of their choice, according to the recently released report by the Internet and Mobile Association of India (IAMAI) and Kantar IMRB. In the next four years, Marathi, Bengali, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=tamil\" target=\"_blank\">Tamil </a>and Telugu speaking Internet users will form 30 per cent of the total Indian language internet user base, according to a Google-KPMG report on Indian languages (2017).</p>\n<p>\n\t\t<img align=\"left\" alt=\"languages\" class=\"imgCont\" height=\"827\" src=\"http://bsmedia.business-standard.com/_media/bs/img/article/2018-04/05/full/1522943097-6389.jpg\" title=\"languages\" width=\"205\"></p>\n\tInternet platforms are turning polyglots not just because they see the rising importance of tapping into a user base that exists far beyond the top tier cities, but also brands are looking to ride their services to expand the customer base or improve employee efficiencies. Cab aggregator Ola has implemented language localisation across the board to an extent that around 80 per cent of the drivers use the language in the vernacular format. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=google\" target=\"_blank\">Google </a>recently rolled out support for a number of languages including those spoken by a few, such as Dhundhari, Kangri, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=malvi\" target=\"_blank\">Malvi </a>and Nimadi on their proprietary Android keyboard or G-board.\n<p>\n\tSocial media has played a key role in driving the language train. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=facebook\" target=\"_blank\">Facebook </a>has been actively prompting users to post content in their local language for years now. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=youtube\" target=\"_blank\">YouTube </a>is collaborating with content creators across major cities like Hyderabad and Mumbai through fan events and creative spaces in order to encourage regional content.</p>\n<p>\n\tThere are 300 regional language channels on <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=youtube\" target=\"_blank\">YouTube </a>in India with over a million subscribers mark. Of these, 133 are independent creators and the Google-owned video-sharing website says, that the top regional creators are seeing as much watch time per quarter as the top national creators. Almost 70 per cent music and video streamed online, 50 per cent of messaging service usage and 50 per cent news consumption across the country is done in regional languages, according to Kantar-IMRB I-Cube and All India Urban Internet Users Estimates, December 2017 report.</p>\n<p>\n\tOf all the critical factors for promoting digital adoption, the language of access is perhaps the most important factor notes the IAMAI-Kantar-IMRB report. Globally, China managed to achieve the highest number of internet users by using Mandarin script content, so much so that Chinese is the second most popular language on the Internet after English. In contrast, Indic content accounts for barely 0.1 per cent of the worldwide Internet content.</p>\n<p>\n\tThe potential for brands across the spectrum, not just advertisers and entertainers, is huge. At present, barely 15 per cent ticket booking, 17 per cent online job searching and 21 per cent banking services consumed online is done in regional languages. \"This reflects the restrictions of access of such critical internet services in Indic, which in turn is limiting Internet penetration in rural India and amongst the economically weaker sections,\" noted IAMAI. Out of 481 million <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=internet+users+in+india\" target=\"_blank\">internet users in India </a>almost 335 million consume online content in Indic languages the report said.</p>\n<p>\n\tBengaluru-based technology startup Reverie Language Technologies, which provides Language as a Service (LaaS) solutions notes that a user’s online journey starts with content consumption, followed by engagement, which is followed by transactions or conversions. “At this point in time, the Indian language Internet user base is sizeable and businesses are targeting to provide them with true local language experiences. When the number of ‘transaction-users’ grows, businesses will start looking into providing them with relevant localised solutions to solve their pain points,” said Rajesh Mehta, VP - Enterprise Business, Reverie.</p>\n<p>\n\tMehta adds that critical services like banking and transactions require much more than just the basic content to be localised. Since, all of the transactional steps are not within the control of one platform here; there is a chance of an incomplete local experience which might be a turn off for the end user.</p>\n<p>\n\tHe further adds that with 200 million rural users coming online this year, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=companies\" target=\"_blank\">companies </a>will have to take efforts to help these users navigate through the digital world.</p>\n<p>\n\tAnd this is where the global giants are hoping to step up their game.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "down",
        "Indian",
        "Digital",
        "lingual",
        "content"
    ],
    "nouns": [
        "Google",
        "shake",
        "down",
        "Indian",
        "language",
        "tree",
        "look",
        "lingual",
        "entertainment",
        "content"
    ],
    "verbs": [
        "Google",
        "shake",
        "down",
        "tree",
        "look",
        "engage",
        "content"
    ]
}