{
    "title": "Give police limited access to Aadhaar data: National Crime Records Bureau",
    "link": "https://www.business-standard.com/article/economy-policy/give-police-limited-access-to-aadhaar-data-national-crime-records-bureau-118062100841_1.html",
    "pubDate": "Thu, 21 Jun 2018 19:15:00 +0530",
    "content": "More than 40,000 unidentified bodies were recovered every year. With access to Aadhaar, these could be identified and handed over to their relatives",
    "contentSnippet": "More than 40,000 unidentified bodies were recovered every year. With access to Aadhaar, these could be identified and handed over to their relatives",
    "guid": "https://www.business-standard.com/article/economy-policy/give-police-limited-access-to-aadhaar-data-national-crime-records-bureau-118062100841_1.html",
    "isoDate": "2018-06-21T13:45:00.000Z",
    "sentiment": {
        "score": -4,
        "comparative": -0.36363636363636365,
        "tokens": [
            "give",
            "police",
            "limited",
            "access",
            "to",
            "aadhaar",
            "data",
            "national",
            "crime",
            "records",
            "bureau"
        ],
        "words": [
            "crime",
            "limited"
        ],
        "positive": [],
        "negative": [
            "crime",
            "limited"
        ]
    },
    "article": {
        "title": "Give police limited access to Aadhaar data: National Crime Records Bureau",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tLimited access to <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/aadhaar\" target=\"_blank\">Aadhaar </a><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/data\" target=\"_blank\">data </a>was needed to be given to police for the purpose of catching first time offenders and for identification of unidentified bodies, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=national+crime+records+bureau\" target=\"_blank\">National Crime Records Bureau </a>(NCRB) Director <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ish+kumar\" target=\"_blank\">Ish Kumar </a>said on Thursday.</p>\n<p>\n\tAt present around 5 million cases were registered every year in the country and most of them committed by first time offenders who leave their fingerprints, which would not be available in police records, he told the 19th All India Conference of Directors of Finger Prints Bureau here.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\t\"There is need for access to <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/aadhaar\" target=\"_blank\">Aadhaar </a><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/data\" target=\"_blank\">data </a>to police for the purpose of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=investigation\" target=\"_blank\">investigation.</a> This is essential because 80 to 85 per cent of the criminals every year are first time offenders with no records (of them available) with the police.</p>\n<p>\n\t\"But they also leave their fingerprints while committing crime there is need for limited access to Aadhaar, so that we can catch them,\" he said.</p>\n<p>\n\tSimilarly, more than 40,000 unidentified bodies were recovered every year. With access to Aadhaar, these could be identified and handed over to their relatives, he said.</p>\n<p>\n\tKumar said though the (Aadhaar) matter was pending before the Supreme Court, he has requested Union Minister of State for Home Hansraj Ahir (who participated in the meeting) to look into matter.</p>\n<p>\n\tWe will have to make some limited access for these two purposes it will be good for investigation,\" he said.</p>\n<p>\n\tAnother issue which requires an early intervention by the home ministry was the amendment to Identification of Prisoners Act, 1920 so that other modern biometrics such as IRIS, veins, signature and voice could also be captured, the official said.</p>\n<p>\n\tThere was also need to do away with the clause of one year rigorous imprisonment as very few sections in IPC have that provision, he said adding <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/ncrb\" target=\"_blank\">NCRB </a>had already sent a proposal to the Centre.</p>\n<p>\n\tHe also stressed the urgent need for modernisation of all state finger print bureaus.</p>\n<p>\n\tAt present, finger print experts were able to visit only around 55,000 crime scenes, which was just one per cent of the 50 lakh cases filed annually and \"grossly inadequate\", he said.</p>\n<p>\n\t\"This is because, many states neither have adequate finger print cadre strength nor proper equipment and labs,\" he said.</p>\n<p>\n\tFinger print experts should also be sent abroad for advance training with Interpol or FBI, Kumar added.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "verbs": [
        "access",
        "Give",
        "police"
    ]
}