{
    "title": "Cement companies under pressure; UltraTech Cement, Ambuja hit 52-week low",
    "link": "https://www.business-standard.com/article/markets/ultratech-cement-ambuja-acc-shree-cement-jk-cement-hit-52-week-low-118062100307_1.html",
    "pubDate": "Thu, 21 Jun 2018 12:14:00 +0530",
    "content": "India Cements, Sanghi Industries, Birla Corporation, Andhra Cements, Orient Cement, NCL Industries and Mangalam Cement were down 30% to 40% thus far in 2018.",
    "contentSnippet": "India Cements, Sanghi Industries, Birla Corporation, Andhra Cements, Orient Cement, NCL Industries and Mangalam Cement were down 30% to 40% thus far in 2018.",
    "guid": "https://www.business-standard.com/article/markets/ultratech-cement-ambuja-acc-shree-cement-jk-cement-hit-52-week-low-118062100307_1.html",
    "isoDate": "2018-06-21T06:44:00.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.1,
        "tokens": [
            "cement",
            "companies",
            "under",
            "pressure",
            "ultratech",
            "cement",
            "ambuja",
            "hit",
            "52-week",
            "low"
        ],
        "words": [
            "pressure"
        ],
        "positive": [],
        "negative": [
            "pressure"
        ]
    },
    "article": {
        "title": "Cement companies under pressure; UltraTech Cement, Ambuja hit 52-week low",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tShares of cement companies were under pressure with most of the frontline stocks hitting 52-week lows on concerns of a delay in the pickup of demand trends, lower-than-expected pricing realizations and higher-than-expected increases in costs.<br>UltraTech Cement, Ambuja Cement, ACC, JK Cements, Shree Cement, India Cements and Panyam Cement have hit their respective 52-week lows on the BSE in intra-day trade on Thursday.<br></p>\n<!-- INPAGE_BANNER -->\n\t<br>Thus far in the current calendar year 2018, the market values of mid and small-sized cement companies like India Cements, Sanghi Industries, Birla Corporation, Andhra Cements, Orient Cement, NCL Industries and Mangalam Cement were down 30% to 40%.<br>Shree Cement, UltraTech Cement, ACC, Ambuja Cement, JK Cement, Dalmia Bharat, Deccan Cements, OCL India and JK Lakshmi Cement have fallen in the range of 15% to 28%. On comparison, the S&amp;P BSE Sensex was 4% during the period.\n<p>\n\tCement demand in India is expected to grow by 7% in the year 2018 (grew around 6% in the year 2017) but intense competition and \"not enough\" consumption will lead to excess capacity, cement maker <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/acc\" target=\"_blank\">ACC </a>said in its annual report.<br>Cement industry is grappling with sub-optimal effective capacity utilization of around 70%, with capacity overhang of more than 100 MT. While cement plants in the northern, central and eastern regions of the country produced at levels above around 85% to 90% of capacity, excess capacity in the southern region has inhibited the industry’s average capacity utilization. </p>\n<p>\n\tIntense competition and not enough demand pull will continue to lead to excess capacity in 2018. However, this situation is expected to correct itself in 2019 with the increased outlays on housing, infrastructure development and agri-sector initiatives, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/acc\" target=\"_blank\">ACC </a>said.<br>The management of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/ultratech-cement\" target=\"_blank\">UltraTech Cement </a>is optimistic that demand will remain strong in FY19, driven by affordable housing and infrastructure sectors (elections due next year can kick-start activity).<br>“The cement prices are generally still weak because new capacities have become operational; however, prices rose in North and Central India in June, capacity addition (around 45mn tons) announced by peers is likely to keep industry utilization (currently around 70%) muted. These additions are also likely to stretch balance sheets and hurt ROCEs, especially of smaller players,” SBICAP Securities said in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/ultratech-cement\" target=\"_blank\">UltraTech Cement </a>management meet update.<br>Commissioning of new capacities, and muted demand growth has resulted in weak pricing since FY13. The cost pressure continues to rise for the cement industry with petcoke, coal and diesel prices increasing around 7-10% during the current quarter. Moreover, domestic petcoke availability is likely to be constrained once Reliance’s petcoke gasification project gets commissioned. Ultratech is gradually moving from petcoke to imported coal due to favorable economics (current petcoke usage at 65%), added report.<br></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "low",
        "30",
        "52",
        "down",
        "40",
        "far"
    ],
    "verbs": [
        "low",
        "pressure",
        "hit",
        "Cement",
        "Orient",
        "down"
    ],
    "nouns": [
        "India",
        "low",
        "Corporation",
        "pressure",
        "hit",
        "30",
        "thus",
        "Cement",
        "week",
        "down",
        "40",
        "far",
        "Orient"
    ]
}