{
    "title": "Not impossible at all for India to achieve a double-digit growth rate: Piyush Goyal",
    "link": "https://timesofindia.indiatimes.com/business/india-business/not-impossible-at-all-for-india-to-achieve-a-double-digit-growth-rate-piyush-goyal/articleshow/64687240.cms",
    "pubDate": "Thu, 21 Jun 2018 16:53:33 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/not-impossible-at-all-for-india-to-achieve-a-double-digit-growth-rate-piyush-goyal/articleshow/64687240.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64687240.cms\" /></a>Finance minister Piyush Goyal on Thursday expressed confidence that it was \"not impossible at all\" for India to achieve a double-digit growth rate given the country's demographic dividend and aspirational middle class.",
    "contentSnippet": "Finance minister Piyush Goyal on Thursday expressed confidence that it was \"not impossible at all\" for India to achieve a double-digit growth rate given the country's demographic dividend and aspirational middle class.",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/not-impossible-at-all-for-india-to-achieve-a-double-digit-growth-rate-piyush-goyal/articleshow/64687240.cms",
    "isoDate": "2018-06-21T16:53:33.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.14285714285714285,
        "tokens": [
            "not",
            "impossible",
            "at",
            "all",
            "for",
            "india",
            "to",
            "achieve",
            "a",
            "double-digit",
            "growth",
            "rate",
            "piyush",
            "goyal"
        ],
        "words": [
            "growth"
        ],
        "positive": [
            "growth"
        ],
        "negative": []
    },
    "article": {
        "title": "Not impossible at all for India to achieve a double-digit growth rate: Piyush Goyal",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>LONDON: Finance minister </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Piyush-Goyal\">Piyush Goyal</a><span> on Thursday expressed confidence that it was \"not impossible at all\" for India to achieve a double-digit </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/gross-domestic-product\">growth rate</a><p> given the country's demographic dividend and aspirational middle class.\n\n</p><p>Addressing the concluding day of the two-day UK-India Leadership Conclave in Latimer in Buckinghamshire via a live video-link from Delhi, Goyal, who is also the minister for railways and coal, also predicted that the BJP would win over 300 seats in the 2019 general election and clinch a majority with its coalition partners.\n</p><p>He said the ruling BJP government had created an \"honest and transparent\" system to make India \"future-ready\".\n</p><p>\"I don't want to be presumptuous and jump the gun in any way but what I will say is that I have immense faith in the people of India when it comes to elections,\" he said in response to a question on next year's elections.\n</p><p>\"On the back of our achievements, I believe the BJP will get more than 300 seats in the 2019 election,\" Goyal told the audience of business leaders and investors attending the Global Investors Forum at the conclave as part of the ongoing UK-India Week.\n</p><p>The minister also expressed confidence that double-digit growth rate was \"not impossible at all\" for India, given the country's demographic dividend and aspirational middle class.\n</p><p>\"The infrastructure push by the government will help the economy prepare for double digit growth ... Indian manufacturing is also set to leapfrog into more modern structures,\" he said.\n</p><p>Using a railways analogy, the senior BJP leader alleged that a fragile economy left by the previous Congress-led government had been brought back on the rails by the Narendra Modi-led government.\n</p><span>\"We never had the pride of place in the global economy that we have today. In almost every respect, India is becoming more and more attractive to global investors,\" he said.\n</span><br><span>\n</span><br><span>\"Another attraction is that India is becoming an honest economy and not having to worry about corruption in high places,\" he said.\n</span><br><span>\n</span><br><span>Goyal's live video-link concluded the two-day conclave, which included sessions on technology and innovation, renewables and climate change as well as foreign direct investment within the UK-India corridor.\n</span><br><span>\n</span><br><span>\"The message from the minister was that India is on the road to 10 per cent growth and that it is the most bankable economy in the world for investors.\n</span><br><span>\n</span><p>\"This right mix of optimism and realism helped wrap up the UK-India Conclave on the perfect note,\" said Manoj Ladwa, Founder &amp; CEO of India Inc - the organisers of the conclave. \n</p><span>\n</span></div></div>"
    },
    "adjectives": [
        "top",
        "right",
        "double",
        "impossible",
        "10",
        "left",
        "expressed",
        "demographic",
        "given",
        "middle"
    ],
    "verbs": [
        "rate",
        "top",
        "right",
        "double",
        "border",
        "align",
        "style",
        "Finance",
        "minister",
        "class",
        "achieve",
        "middle"
    ],
    "nouns": [
        "growth",
        "digit",
        "India",
        "india",
        "margin",
        "rate",
        "confidence",
        "top",
        "right",
        "business",
        "double",
        "impossible",
        "border",
        "10",
        "left",
        "style",
        "photo",
        "dividend",
        "Finance",
        "minister",
        "country",
        "demographic",
        "class",
        "Thursday",
        "given",
        "middle"
    ]
}