{
    "title": "To boost consumer spending or rein in inflation? A policy dilemma for RBI",
    "link": "https://www.business-standard.com/article/economy-policy/to-boost-consumer-spending-or-rein-in-inflation-a-policy-dilemma-for-rbi-118062100200_1.html",
    "pubDate": "Thu, 21 Jun 2018 12:34:00 +0530",
    "content": "While markets have already priced in one rate hike in the months ahead, further hikes could put a damper on growth as Asia's third-largest economy goes into an election year",
    "contentSnippet": "While markets have already priced in one rate hike in the months ahead, further hikes could put a damper on growth as Asia's third-largest economy goes into an election year",
    "guid": "https://www.business-standard.com/article/economy-policy/to-boost-consumer-spending-or-rein-in-inflation-a-policy-dilemma-for-rbi-118062100200_1.html",
    "isoDate": "2018-06-21T07:04:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "to",
            "boost",
            "consumer",
            "spending",
            "or",
            "rein",
            "in",
            "inflation?",
            "a",
            "policy",
            "dilemma",
            "for",
            "rbi"
        ],
        "words": [
            "dilemma",
            "boost"
        ],
        "positive": [
            "boost"
        ],
        "negative": [
            "dilemma"
        ]
    },
    "article": {
        "title": "To boost consumer spending or rein in inflation? A policy dilemma for RBI",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tFrom living off money collected by her 4-year old daughter to spending at least 50 per cent more on eating out and shopping, Indian housewife <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ruth+timmy+verghese\" target=\"_blank\">Ruth Timmy Verghese </a>says she's had a sharp lifestyle turnaround in the last few months.</p>\n<p>\n\tThe 32-year-old said she had to break into her daughter's <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=piggy+bank\" target=\"_blank\">piggy bank </a>to meet household expenses when <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/india\" target=\"_blank\">India </a>suddenly pulled most high-denomination currency notes out of circulation in November two years ago.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\t\"We're more confident to spend now on shopping and eating out than we were a year or two back because now our income flow has stabilised,\" said Verghese, referring to income from her husband's <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=advertising+job\" target=\"_blank\">advertising job </a>and his freelance work. \"How long can we hold off fulfilling our happiness?\"</p>\n<p>\n\tLike Verghese, many other middle-income Indians are splashing the cash on beauty salons, shopping, movies and eating out as the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/economy\" target=\"_blank\">economy </a>nomalises after disruptions from two big events - demonetisation and the introduction of a new goods and services tax (GST) last year.</p>\n<p>\n\tThis surge in expenditure is pushing core <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/inflation\" target=\"_blank\">inflation </a>higher and could keep overall consumer price <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/inflation\" target=\"_blank\">inflation </a>well above the Reserve Bank of India's 4.7 per cent target by March 2019, raising odds that the RBI may raise rates more than once in coming months.</p>\n<p>\n\tWhile markets have already priced in one rate hike in the months ahead, further hikes could put a damper on growth as Asia's third-largest <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/economy\" target=\"_blank\">economy </a>goes into an election year.</p>\n<p>\n\tSantosh Shetty, the owner of Mumbai's Satish Restaurant &amp; Bar, said business had declined by 50 per cent after the implementation of demonetisation and GST, but had returned to normal since January despite both raw material and menu prices rising.</p>\n<p>\n\t\"The raw material cost has gone up for all items for us, from vegetables to chicken, mutton, eggs and spices by 15-25 per cent, accordingly we have also raised our menu prices,\" he said. \"Customers are willing to pay higher rates as they know that prices are rising everywhere.\"</p>\n<p>\n\tThe expenditure boom is not just in cities.</p>\n<p>\n\tConglomerate Hindustan Unilever, which has a deep rural reach and whose sales are often taken as a barometer for rural demand, has seen strong growth in personal care and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=home+care+products\" target=\"_blank\">home care products </a>in the March quarter over last year.</p>\n<p>\n\tWith a good monsoon forecast this year, farm incomes are likely to rise, economists say.</p>\n<p>\n\t<strong><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/inflation\" target=\"_blank\">INFLATION </a>LANDMINE</strong></p>\n<p>\n\tEconomists note that while the surge in consumer spending helped <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/india\" target=\"_blank\">India </a>post robust 7.7 per cent growth in the March quarter, it is also a potential inflation landmine.</p>\n<p>\n\tIndia's May headline inflation rose to a four-month high of 4.87 per cent, driven by 6.20 per cent <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/core-inflation\" target=\"_blank\">core inflation </a>that excludes <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/food\" target=\"_blank\">food </a>and fuel. Within the core figure, recreation and amusement inflation, which has been on an uptrend since January, rose to an annual 4.93 percent in May. Personal care inflation rose for the third straight month to 5.61 per cent.</p>\n<p>\n\tThese, along with items including transport, clothing and household services, comprise nearly 40 per cent to the inflation basket, making it a concern for the RBI, which raised its policy rate for the first time in over four years in early June.</p>\n<p>\n\t\"<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/core-inflation\" target=\"_blank\">Core inflation </a>has recovered from the troughs hit after the twin shocks of demonetisation and GST,\" said A. Prasanna, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=chief+economist\" target=\"_blank\">chief economist </a>at <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=icici+securities+primary+dealership\" target=\"_blank\">ICICI Securities Primary Dealership.</a></p>\n<p>\n\t\"If core CPI momentum picks up and underlying inflation sustains around 5 percent, there could be a risk of the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/monetary-policy\" target=\"_blank\">monetary policy </a>committee raising rates more steeply than expected,\" he said, adding he expects another rate hike by October along with shift to a tightening stance.</p>\n<p>\n\tThe so-called demonetisation and GST implementation had hit businesses and households with wage growth slowing to 6 percent in April-June 2017 from 10 percent a year ago. It also sent the consumer confidence index for the year ahead sliding to 114.7 in November 2017 - its lowest level in four years, RBI data showed.</p>\n<p>\n\tHowever, 2018 is looking a lot rosier.</p>\n<p>\n\tWages have risen an average of 7-8 per cent and the consumer confidence index for the year ahead also improved to 118.4 in May. Consumer goods companies, including automobiles, have seen strong demand.</p>\n<p>\n\tPassenger vehicle sales rose by an annual 19.6 percent in May from 7.5 percent in April despite rising fuel prices. In June 2017, auto sales were down 11.2 percent from a year ago.</p>\n<p>\n\t\"The fact is there is demand and so these companies have pricing power,\" said Saion Mukherjee, head of equity research, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/india\" target=\"_blank\">India </a>at Nomura.</p>\n<p>\n\t\"Higher volumes in consumer discretionary companies, especially autos, staples are flowing into higher margins.\"</p>\n<p>\n\t<strong>GROWTH HEADWINDS</strong></p>\n<p>\n\tHowever, property prices remain muted, due to a huge overhang of unsold houses keeping a lid on prices.</p>\n<p>\n\tMeanwhile, risks loom from <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=high+oil+prices\" target=\"_blank\">high oil prices </a>and tighter financing conditions with rising interest rates.</p>\n<p>\n\tFurther rate hikes will add to higher costs of borrowing and stifle growth at a time when <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=prime+minister\" target=\"_blank\">Prime Minister </a><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/narendra-modi\" target=\"_blank\">Narendra Modi </a>is looking for a boost ahead of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=general+elections\" target=\"_blank\">general elections </a>due by May.</p>\n<p>\n\t\"Often a rate hike is equated with credibility,\" said Siddhartha Sanyal, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=chief+india+economist\" target=\"_blank\">chief India economist </a>at <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/barclays\" target=\"_blank\">Barclays.</a></p>\n<p>\n\t\"But the impact of rate hikes in India can be more direct on growth than on inflation. Rate hikes tighten financing conditions and often impact growth, but large part of the CPI basket like food, healthcare, education is relatively less sensitive to interest rates.\"</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "one",
        "third",
        "ahead",
        "further"
    ],
    "nouns": [
        "one",
        "consumer",
        "rate",
        "hike",
        "policy",
        "third",
        "boost",
        "spending",
        "rein",
        "inflation",
        "A",
        "dilemma",
        "RBI",
        "While",
        "put",
        "damper",
        "growth",
        "Asia",
        "economy",
        "election",
        "year"
    ],
    "verbs": [
        "rate",
        "hike",
        "boost",
        "rein",
        "further",
        "put"
    ]
}