{
    "title": "GST impact: Slow refunds, rising input costs paralyse Ludhiana businesses",
    "link": "https://www.business-standard.com/article/economy-policy/gst-impact-slow-refunds-rising-input-costs-paralyse-ludhiana-businesses-118062800043_1.html",
    "pubDate": "Thu, 28 Jun 2018 07:10:00 +0530",
    "content": "A series of jolts - starting with demonetisation, or note ban, in November 2016 to the roll-out of a new indirect tax regime in July 2017 - has cut to size the city's 50,000-strong MSME base",
    "contentSnippet": "A series of jolts - starting with demonetisation, or note ban, in November 2016 to the roll-out of a new indirect tax regime in July 2017 - has cut to size the city's 50,000-strong MSME base",
    "guid": "https://www.business-standard.com/article/economy-policy/gst-impact-slow-refunds-rising-input-costs-paralyse-ludhiana-businesses-118062800043_1.html",
    "isoDate": "2018-06-28T01:40:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "gst",
            "impact",
            "slow",
            "refunds",
            "rising",
            "input",
            "costs",
            "paralyse",
            "ludhiana",
            "businesses"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "GST impact: Slow refunds, rising input costs paralyse Ludhiana businesses",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tJaswant Singh Birdi spent more than four decades in the bicycle industry to finally become the president of the Cycle Trade Union in the industrial town of Ludhiana. But when it came to his two sons joining the business, Birdi took a contrary call. He bankrolled a fried food items shop for them. Rising and ever-fluctuating raw material costs, demonetisation and now the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/goods-and-services-tax\" target=\"_blank\">goods and services tax </a>(GST) have broken the back of the bicycle industry, he says, justifying his action.</p>\n<p>\n\t<strong>Disappearing units of Miller Ganj</strong></p>\n<p>\n\tThings have quietened drastically over the last two years in the serpentine lanes of Miller Ganj, which houses 1,000-odd small and medium businesses. Most of them are involved in sectors such as metal fabrication, sewing machine, cycle and automobile spare parts, plastic and polymer manufacturing and the wholesale business. What was once a noisy neighbourhood, teeming with workers, the locality has seen a number of smaller units either shutting shop or cutting down operations.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/gst-impact-e-way-bills-not-reducing-transporters-cost-and-travel-time-118062601340_1.html\" target=\"_blank\">GST impact: E-way bills not reducing transporters' cost and travel time</a></strong></p>\n<p>\n\tA series of jolts — starting with demonetisation, or note ban, in November 2016 to the roll-out of a new indirect tax regime in July 2017 — has cut to size the city’s 50,000-strong MSME base. Some industry experts point out that many of the units that closed down after demonetisation shut shop due to excessive dealings in black money. The <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gst\" target=\"_blank\">GST </a>levelled the playing field for all, they add.</p>\n<p>\n\t“It has been a mix of everything,” says Ashok Uppal, who along with his brother Rajinder Uppal owns a sewing machine parts manufacturing unit, which has an annual turnover of more than Rs 50 million.</p>\n<p>\n\tHowever, the implementation of the new tax regime has been a cause for concern for businesses. Most manufacturers in the area say getting tax refunds has been the biggest pain point. This has led to a cash crunch for the already cash-starved MSME sectors. <br></p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/gst-impact-surat-s-diamond-traders-and-weavers-see-no-thread-of-hope-118062400602_1.html\" target=\"_blank\">GST impact: Going gets rough for Surat's diamond, textile traders</a></strong></p>\n<p>\n\t“There are smaller manufacturers who have at least Rs 500,000 to Rs 20 million stuck with the tax authorities as they are not getting their <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gst\" target=\"_blank\">GST </a>refunds,” says Uppal. Experts say the issue of refunds is taking time due to the matching of inputs and output returns of sellers and buyers. The process would be simplified once the proposed single form becomes effective, which is still in the making.</p>\n<p>\n\t<strong>Tussle</strong><strong> between manufacturers, traders</strong></p>\n<p>\n\tThere are other problems as well, both related and unrelated to the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gst\" target=\"_blank\">GST </a>regime. In the last one year, the price of steel has been on the rise. This has led to a hike in the price of raw materials, prompting a tug of war between manufacturers and traders, as the former believe that they are being short-changed.</p>\n<p>\n\tMany manufacturers believe they are not getting the desired price, says SB Singh, CEO of Taaran Industries, which provides engineering, management consultancy and manufacturing solutions to firms. Industry experts believe that it might take another year for rates stabilise in the market.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/gst-impact-it-is-no-longer-raining-greenbacks-in-dollar-town-tirupur-118062501245_1.html\" target=\"_blank\">GST impact: Implementation blues take a toll on Tirupur businesses</a></strong></p>\n<p>\n\tDespite the transition woes, there are many supporters of the new indirect tax regime among businesses. “Thanks to the GST, the problem of people buying in black has gone down, which has helped in reducing competition, making it a level playing field,” says Hari Mittal, who runs a plastic and polymer manufacturing unit. Mittal says that in his sector, the prices have firmed up, which has led to an increase in profits.</p>\n<p>\n\tMany industry players point out that the GST has come as a shot-in-the-arm for those entrepreneurs who have kept their business legitimate. “I believe with the GST it is more of a perception problem than anything else,” adds Mittal.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "indirect",
        "starting",
        "strong",
        "cut",
        "rising",
        "50",
        "base",
        "new",
        "Slow",
        "size"
    ],
    "nouns": [
        "tax",
        "roll",
        "starting",
        "cut",
        "series",
        "ban",
        "rising",
        "50",
        "impact",
        "regime",
        "note",
        "city",
        "base",
        "July",
        "input",
        "costs",
        "A",
        "demonetisation",
        "November",
        "size"
    ],
    "verbs": [
        "tax",
        "roll",
        "cut",
        "ban",
        "impact",
        "note",
        "base",
        "paralyse",
        "input",
        "Slow",
        "size"
    ]
}