{
    "title": "CBDT proposes clear-cut timelines under transfer pricing",
    "link": "https://www.business-standard.com/article/finance/cbdt-proposes-clear-cut-timelines-under-transfer-pricing-118062001379_1.html",
    "pubDate": "Thu, 21 Jun 2018 07:00:00 +0530",
    "content": "the department, through a draft notification, suggested that the amount should be returned within 90 days of signing of APAs and MAPs.",
    "contentSnippet": "the department, through a draft notification, suggested that the amount should be returned within 90 days of signing of APAs and MAPs.",
    "guid": "https://www.business-standard.com/article/finance/cbdt-proposes-clear-cut-timelines-under-transfer-pricing-118062001379_1.html",
    "isoDate": "2018-06-21T01:30:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "cbdt",
            "proposes",
            "clear-cut",
            "timelines",
            "under",
            "transfer",
            "pricing"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "CBDT proposes clear-cut timelines under transfer pricing",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tThe income-tax (I-T) department has proposed clear-cut timelines by which excess amount assessed by <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=transfer+pricing+officials\" target=\"_blank\">transfer pricing officials </a>(TPOs) over what was declared by associated enterprises of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/multinational-corporations\" target=\"_blank\">multinational corporations </a>(MNCs) has to be brought in India. These timelines relate to advance pricing agreements (APAs) and mutual agreement procedures (MAPs).</p>\n<p>\n\tIn the Union Budget 2016-17, the government has come out with a concept of secondary adjustments. This basically means that if there is primary adjustment either made by the TPO or suo motu by the companies, which differs from what was declared by companies earlier, the excess amount over Rs 10 million has to be brought back to India within a stipulated time.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tOtherwise, there would be secondary adjustment, which means this excess amount will be deemed as loan by Indian entity to the associated enterprise and a notional interest would be levied on it.</p>\n<p>\n\tNow, the Central Board of Direct Taxes had earlier said that the excess amount has to be returned within 90 days of filing of returns. But, then the question arose over what will happen in case of APAs and MAPs.</p>\n<p>\n\tNow, the department, through a draft notification, suggested that the amount should be returned within 90 days of signing of APAs and MAPs.</p>\n<p>\n\tRakesh Nangia, managing partner, Nangia Advisors, said, “The proposed amendment would provide relief to MNCs, corporates who have opted for the APA or MAP programme to obtain certainty in their transfer pricing positions in India.”</p>\n<p>\n\tSanjay Kumar, senior director, Deloitte India, said certainty and predictability on tax matters are always useful and the draft intends to bring that. </p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "cut",
        "90",
        "clear"
    ],
    "verbs": [
        "transfer",
        "cut",
        "draft",
        "amount",
        "clear"
    ],
    "nouns": [
        "transfer",
        "notification",
        "cut",
        "days",
        "department",
        "signing",
        "pricing",
        "draft",
        "amount",
        "90",
        "clear"
    ]
}