{
    "creator": "M Sarita Varma",
    "title": "Kerela gears up for e-bus pact with Goldstone Infratech",
    "link": "https://www.financialexpress.com/industry/kerela-gears-up-for-e-bus-pact-with-goldstone-infratech/1196389/",
    "pubDate": "Thu, 07 Jun 2018 01:06:24 +05:30",
    "dc:creator": "M Sarita Varma",
    "content": "Kerala is teaming up with GIL is through ASRTU (Association of State Road Transport Undertakings). GIL, in its turn, has a vehicle assembly tie-up with Chinese company BYD Auto.",
    "contentSnippet": "Kerala is teaming up with GIL is through ASRTU (Association of State Road Transport Undertakings). GIL, in its turn, has a vehicle assembly tie-up with Chinese company BYD Auto.",
    "guid": "https://www.financialexpress.com/?p=1196389",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-06T19:36:24.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "kerela",
            "gears",
            "up",
            "for",
            "e-bus",
            "pact",
            "with",
            "goldstone",
            "infratech"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Kerela gears up for e-bus pact with Goldstone Infratech",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1196392\" src=\"https://images.financialexpress.com/2018/06/BYD-Main.png\" alt=\"kerala, e bus pact, goldstone infratech\" srcset=\"https://images.financialexpress.com/2018/06/BYD-Main.png 660w, https://images.financialexpress.com/2018/06/BYD-Main-300x200.png 300w, https://images.financialexpress.com/2018/06/BYD-Main-620x413.png 620w, https://images.financialexpress.com/2018/06/BYD-Main-401x267.png 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> As Kerala enters the club of five states that have electric buses on their public transport fleet, Hyderabad-based Goldstone Infratech (GIL) will run the terrain trial and probably wet-lease battery buses.</figure>\n\t\t\t</section></div><span>\n</span><p>As Kerala enters the club of five states that have electric buses on their public transport fleet, Hyderabad-based Goldstone Infratech (GIL) will run the terrain trial and probably wet-lease battery buses. The 15-day trial service, on routes including high ranges, starts next week. “We plan to enhance the fleet of KSRTC (Kerala State Road Transport Corporation) by 300 more battery electric buses (BEV) if the service proves to be profitable,” Tomin J Thackankari, CMD, KSRTC told FE.</p><span>\n</span><p>The cost of BEV varies between Rs 1.5 crore and Rs 2.5 crore per bus. “But the advantage is that the running cost is only Rs 5 per km,” he says. Indian states — through their transport corporations — have been in race to add electric buses to their fleet ever since the Union government announced subsidy under Faster Adoption and Manufacturing of (hybrid) &amp; Electric Vehicles (FAME) India scheme for BEV buses. Maharashtra, Karnataka, Andhra Pradesh, Telangana and Tamil Nadu have taken the e-bus plunge. GIL has bagged orders to supply 100 electric buses to Telangana, 150 to Bengaluru and 40 to Mumbai. In Chennai, Ashok Leyland is supplying the e-buses.</p><span>\n</span><p>Kerala is teaming up with GIL is through ASRTU (Association of State Road Transport Undertakings). GIL, in its turn, has a vehicle assembly tie-up with Chinese company BYD Auto. Last year, chief minister Pinarayi Vijayan had a discussion with the Chinese ambassador to India on buying low-cost battery buses from China. Besides the cost, the states will also have to create battery charging infrastructure. The lithium iron battery in BEV buses can run up to 350-475 km on one charging. The electricity consumption per km will be 1.5-1.8 kwh.</p><span>\n</span><p>According to Thachankari, KSRTC plans to procure its first set of 150 electric buses under a ‘gross contract model’, similar to the procurements by the state transport corporations of Bengaluru and Telangana. It is eyeing the Central subsidy of Rs 30-60 lakh that public transport BEV is entitled to. For the ailing KSRTC, this switchover may trim running costs to one-tenth.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "Chinese"
    ],
    "nouns": [
        "pact",
        "Goldstone",
        "bus",
        "Association",
        "assembly",
        "State",
        "Road",
        "Transport",
        "turn",
        "vehicle",
        "Chinese",
        "tie",
        "company",
        "Auto"
    ],
    "verbs": [
        "bus",
        "State",
        "Transport",
        "turn",
        "tie",
        "company"
    ]
}