{
    "creator": "FE Bureau",
    "title": "‘Stigmatised capital’ is India’s biggest roadblock, says chief economic adviser Arvind Subramanian",
    "link": "https://www.financialexpress.com/economy/stigmatised-capital-is-indias-biggest-roadblock-says-chief-economic-adviser-arvind-subramanian/1223103/",
    "pubDate": "Thu, 28 Jun 2018 05:25:52 +05:30",
    "dc:creator": "FE Bureau",
    "content": "“I do think that stigmatised capitalism is coming in the way of a lot of reforms to bring in the private sector as public officers fear that they might be questioned by investigative agencies later, says chief economic adviser Arvind Subramanian",
    "contentSnippet": "“I do think that stigmatised capitalism is coming in the way of a lot of reforms to bring in the private sector as public officers fear that they might be questioned by investigative agencies later, says chief economic adviser Arvind Subramanian",
    "guid": "https://www.financialexpress.com/?p=1223103",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-27T23:55:52.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "‘stigmatised",
            "capital’",
            "is",
            "india’s",
            "biggest",
            "roadblock",
            "says",
            "chief",
            "economic",
            "adviser",
            "arvind",
            "subramanian"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "‘Stigmatised capital’ is India’s biggest roadblock, says chief economic adviser Arvind Subramanian",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1223110\" src=\"https://images.financialexpress.com/2018/06/1-233.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/1-233.jpg 660w, https://images.financialexpress.com/2018/06/1-233-300x200.jpg 300w, https://images.financialexpress.com/2018/06/1-233-620x413.jpg 620w, https://images.financialexpress.com/2018/06/1-233-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> ‘Stigmatised capital’ is India’s biggest roadblock, says chief economic adviser Arvind Subramanian</figure>\n\t\t\t</section></div><span>\n</span><p>Apart from high oil prices, the biggest headwind for India’s growth prospects, outgoing chief economic adviser Arvind Subramanian said, was “stigmatised capitalism”, or the view that the private sector could not be trusted. This, he said, was the reason why the government was not able to make much progress in privatising PSUs, in lowering high telecom levies, writing off enough of Air India’s debt to make the sale alluring, etc. Subramanian was speaking at the Express Group’s Idea Exchange programme.</p><span>\n</span><p>“I do think that stigmatised capitalism is coming in the way of a lot of reforms to bring in the private sector as public officers fear that they might be questioned by investigative agencies later,” he said.</p><span>\n</span><p>Subramanian, who will be leaving at the end of July, said there was no truth to the view that he felt stifled in the ministry and that that was the reason why he was leaving. He said he had made his position known on a variety of issues, and through public documents like the Economic Survey. Had the government been uncomfortable with this, he said, he couldn’t have done as much as he has.</p><span>\n</span><p>While he had argued that the goods and services tax (GST) needed to be less complicated, and said he was happy with the way GST was evolving, he added that the 28% slab needed to be removed at the earliest. And while the cess had to be retained, having just one rate was better instead of the multiple rates right now. “I had proposed 18% and 40% slabs, and the cess is a different way of implementing the 40% rate,” he said.</p><span>\n</span><p>He said that while he had been an enthusiastic proponent of a “bad bank”, this may not have worked in India since the huge haircuts required for selling non-performing assets would have caused a huge backlash.</p><span>\n</span><p>The Insolvency and Bankruptcy Code, on the other hand, ensures these haircuts are judiciary-supervised, he said, and so have faced no problem.</p><span>\n</span><p>While not commenting on the government’s plan to hike minimum support prices of various crops and whether this would make the exports of several crops uncompetitive, the CEA talked of how the Telangana model of giving per-acre cash payments was an idea worth pursuing. He said the Reserve Bank of India’s (<a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a>) Prompt and Corrective Action was a good way to keep weak banks under check while, at the same time, ensuring that depositors’ money was absolutely safe. He reiterated the view that both recapitalisation and reform — privatising of some banks — had to move in tandem.</p><span>\n</span><p>In keeping with his roundabout criticism of the government’s new rules on cattle slaughter over a year ago, he said “solutions shouldn’t create their own problems” on the plan to get Life Insurance Corporation to buy a significant stake in IDBI Bank. Subramanian said he sympathised with the RBI’s view on it not having enough powers to effectively regulate public sector banks, but it was also true that there were huge problems in private sector banks where the government ownership was not an issue.</p><span>\n</span><p>A critic of the RBI’s policy of not cutting rates for a long time, Subramanian said the situation today — with so many headwinds — was different and both fiscal and monetary policy needed to be calliberated keeping this in mind.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "capital",
        "economic",
        "chief",
        "I",
        "coming",
        "private",
        "public",
        "investigative",
        "later"
    ],
    "nouns": [
        "India",
        "roadblock",
        "adviser",
        "capital",
        "capitalism",
        "chief",
        "coming",
        "I",
        "think",
        "lot",
        "public",
        "private",
        "sector",
        "fear"
    ],
    "verbs": [
        "think",
        "lot",
        "bring",
        "fear"
    ]
}