{
    "title": "Tax rates for consumer goods lower under GST: Chairman Godrej group",
    "link": "https://www.business-standard.com/article/economy-policy/tax-rates-for-consumer-goods-lower-under-gst-chairman-godrej-group-118062800050_1.html",
    "pubDate": "Thu, 28 Jun 2018 07:08:00 +0530",
    "content": "It will be very good if some consumer durables and other products in the 28 per cent bracket, such as paints, brought to 18 per cent, says Adi Godrej",
    "contentSnippet": "It will be very good if some consumer durables and other products in the 28 per cent bracket, such as paints, brought to 18 per cent, says Adi Godrej",
    "guid": "https://www.business-standard.com/article/economy-policy/tax-rates-for-consumer-goods-lower-under-gst-chairman-godrej-group-118062800050_1.html",
    "isoDate": "2018-06-28T01:38:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "tax",
            "rates",
            "for",
            "consumer",
            "goods",
            "lower",
            "under",
            "gst",
            "chairman",
            "godrej",
            "group"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Tax rates for consumer goods lower under GST: Chairman Godrej group",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\t<strong>Adi Godrej</strong>, chairman of the Godrej Group, has been a strong votary of the goods and services tax (GST), saying it will aid economic growth. In an interview with <em>Viveat Susan Pinto</em>, Godrej reiterated these views, adding he saw a pause in reforms now, owing to the general elections next year. <strong>Edited excerpts:</strong></p>\n<p>\n\t<strong>Your sense of the GST now that it has completed a year since launch?</strong></p>\n<p>\n\tI think the GST has done very well. It has helped GDP growth in the country. Some of the bugs that had cropped up in the GST have been rectified by the government and they (the GST Council) meet regularly. What is heartening is that the tax rates for a lot of consumer products are lower now (under the GST) than they used to be. And despite the lower GST rates, tax collections are on the rise.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/govt-notices-to-firms-for-wrongly-claiming-transitional-credit-under-gst-118062700056_1.html\" target=\"_blank\">Govt notices to firms for 'wrongly' claiming transitional credit under GST</a></strong></p>\n\n<p>\n\t<strong>There are talks that the list of items under the 28 </strong><strong>per cent</strong><strong> tax slab could be reduced further. Your views on this?</strong></p>\n<p>\n\tIt will be very good if some consumer durables and other products in the 28 per cent bracket, such as paints, are brought to 18 per cent. What can continue in the 28 per cent tax slab are ‘sin’ goods and luxury items. This would be a more prudent way to look at it.</p>\n<p>\n\t<strong>What are the benefits that have accrued to the Godrej Group due to the GST and what is the way forward for the group in the new tax regime?</strong></p>\n<p>\n\tMany of our products are taxed at lower rates than they used to be earlier. We have passed on the benefits to consumers. This is helping in increasing consumption. Growth rates in fast-moving consumer goods (FMCG) had slowed last year owing to demonetisation and other factors. Now, they are recovering, and the GST has a role to play in it. The monsoon has also been good. Rural and urban demands are also picking up. So, the FMCG market growth, in my view, will be better this year against last year because of all these reasons. And as a group, we are upping our investments (in the sector), since we need more capacity to cater to the needs of consumers.<br></p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/opinion/gst-still-work-in-progress-118062601298_1.html\" target=\"_blank\">GST still work in progress</a></strong></p>\n\n<p>\n\t<strong>What are the challenges you are seeing with the GST, given that anti-profiteering remains an issue with industry?</strong></p>\n<p>\n\tI think the GST Council is trying to resolve the issues. And the attitude is to make filing returns as simple and easy as possible to file returns. And, as far as passing on GST benefits is concerned, companies are doing that.</p>\n<p>\n\t<strong>But there is still a view that tax terrorism has increased in the last one year. Your views on this.</strong></p>\n<p>\n\tThose who were paying taxes earlier, are doing it now in the new tax regime. I don't think anything has changed. The ones who were evading taxes earlier are now finding it difficult under the GST, and therefore this view. They are the ones who are complaining.</p>\n<p>\n\t<strong>On Tuesday, in an address to captains of Indian industry, the Prime Minister said companies should invest in new technology and agriculture. What precisely can the Godrej group do here, given that you have an interest in the agricultural sector with Godrej Agrovet?</strong></p>\n<p>\n\tWe feel the best way the government can implement its policy of doubling farm income in five years is to encourage animal husbandries such as dairy, poultry-farming, and fisheries. This can really increase farmers' income. The other advantage of animal husbandry is that the income stays throughout the year as opposed to farming, which is seasonal.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/gst-impact-e-way-bills-not-reducing-transporters-cost-and-travel-time-118062601340_1.html\" target=\"_blank\">GST impact: E-way bills not reducing transporters' cost and travel time</a></strong></p>\n\n<p>\n\t<strong>Any more reforms you are looking at, now that the GST is behind us?</strong></p>\n<p>\n\tI think most of the major reforms have been implemented, including <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rera\" target=\"_blank\">RERA </a>and GST. Now that the general elections are coming, I don't expect any reforms till the new government is in place.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "good",
        "28",
        "18"
    ],
    "nouns": [
        "Tax",
        "rates",
        "consumer",
        "good",
        "lower",
        "Chairman",
        "group",
        "It",
        "will",
        "durables",
        "28",
        "cent",
        "bracket",
        "18"
    ],
    "verbs": [
        "Tax",
        "lower",
        "Chairman",
        "group",
        "will",
        "bracket"
    ]
}