{
    "creator": "Nanda Kasabe",
    "title": "Non-BT seeds to be mixed with BT to fight pink bollworm",
    "link": "https://www.financialexpress.com/market/commodities/non-bt-seeds-to-be-mixed-with-bt-to-fight-pink-bollworm/1222987/",
    "pubDate": "Thu, 28 Jun 2018 01:32:35 +05:30",
    "dc:creator": "Nanda Kasabe",
    "content": "The war against Pink Bollworm is getting stronger in Maharashtra. The year 2017 had seen pink bollworm (PBW) attacks on cotton, especially in Maharashtra, Telangana, Andhra Pradesh and Karnataka. ",
    "contentSnippet": "The war against Pink Bollworm is getting stronger in Maharashtra. The year 2017 had seen pink bollworm (PBW) attacks on cotton, especially in Maharashtra, Telangana, Andhra Pradesh and Karnataka.",
    "guid": "https://www.financialexpress.com/?p=1222987",
    "categories": [
        "Commodities",
        "Market"
    ],
    "isoDate": "2018-06-27T20:02:35.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.09090909090909091,
        "tokens": [
            "non-bt",
            "seeds",
            "to",
            "be",
            "mixed",
            "with",
            "bt",
            "to",
            "fight",
            "pink",
            "bollworm"
        ],
        "words": [
            "fight"
        ],
        "positive": [],
        "negative": [
            "fight"
        ]
    },
    "article": {
        "title": "Non-BT seeds to be mixed with BT to fight pink bollworm",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1222988\" src=\"https://images.financialexpress.com/2018/06/1-200.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/1-200.jpg 660w, https://images.financialexpress.com/2018/06/1-200-300x200.jpg 300w, https://images.financialexpress.com/2018/06/1-200-620x413.jpg 620w, https://images.financialexpress.com/2018/06/1-200-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Non-BT seeds to be mixed with BT to fight pink bollworm</figure>\n\t\t\t</section></div><span>\n</span><p>The war against Pink Bollworm is getting stronger in Maharashtra. The year 2017 had seen pink bollworm (PBW) attacks on cotton, especially in Maharashtra, Telangana, Andhra Pradesh and Karnataka. The infestation of this insect pest — whose larvae bore into cotton bolls through the lint fibre to feed on the seeds — happened during October, just when the crop was maturing and almost ready for its first-flush pickings, and further aggravated by unseasonal rains.</p><span>\n</span><p>To overcome this problem, the union government has recommended a unique RIB (Refugia In Bag) concept, wherein 25 grams of non-Bt Cotton seed is mixed with 450 grams of Bt Cotton seeds.</p><span>\n</span><p>‘Refuge’ plots are non-transgenic plants. However, these packs were separate and usually ignored by farmers who put them aside during sowing operations. As a result, the Pink Bollworm attacks became stronger. To combat and weaken the proliferation of Pink Bollworm, the government of Maharashtra may decide to stop the process of separate non-BT packs and instead provide these along with BT Cotton so that the farmers end up sowing these seeds along with BT cotton seeds.</p><span>\n</span><p>CB Mayee, president, South Asian Biotechnology Centre, had earlier pointed out that one way to reduce pest susceptibility is to plant non-Bt cotton as “refugia” in the vicinity of the main Bt crop. But farmers, especially with small holdings, don’t want to lose land in growing non-Bt plants that can act as hosts for the bollworm insects. It is important to note here that PBW exclusively feed on cotton, unlike other bollworm insect species that also attack other crops such as pigeon-pea, sorghum and sunflower.</p><span>\n</span><p>Without cultivating non-Bt cotton as refugia, PBW is bound to develop resistance to Bt toxins over time, as has happened in Maharashtra. Over the years, Bt Cotton’s resistance to PBW has reduced and during the last season alone the pest has caused 20-25% loss to the crop across the state. The strategy of growing ‘refuge’ plants around the GM plants is to prevent or delay the development of Bt-resistant insects. This enables planting non-BT cotton which can host PBW wild insects and prevent resistance build-up in PBW, industry experts pointed out.</p><span>\n</span><p>Last season onwards, the National Seeds Association of India (NSAI) has taken up the issue on a war footing and revived the RIB concept. Several seed and pesticide companies have also begun to distribute pheromone traps as part of their CSR projects.</p><span>\n</span><p>Recommending the RIB concept, MG Shembekar, vice president, NSAI, said that this would help weaken the proliferation of PBW on BT Cotton.</p><span>\n</span><p>He pointed out that since PBW exclusively feed on cotton, unlike other bollworm insect species that also attack other crops such as pigeon-pea, sorghum and sunflower.</p><span>\n</span><p>Due to RIB, the PBW will not get adequate nutrition and weaken over time, he said. Without cultivating non-Bt cotton as refugia, PBW is bound to develop resistance to Bt toxins over time, as has happened in Maharashtra, he pointed out.</p><span>\n</span><p>The Centre has granted permission for 5-10% of non-BT Cotton along with the BT Cotton seeds and should the farmers follow these methods for sowing along with other preventive measures, PBW will weaken over the season, he said.</p><span>\n</span><p>According to him, the cotton sowing is in full swing. More than 20-30% sowing operations have been completed in Yavatmal, Wardha, Amravati and Nagpur regions. However, the dry spell in between may see the need for resowing operations in some regions, he pointed out.</p><span>\n</span><p>This year, the Met department has been careful in its warning and had also issued an advisory that farmers should start Kharif sowing only by June end after regular spell of rains. Most farmers in the region seem to have heeded the advice. But in the last one week, districts like Yavatmal in the cotton belt, which received scattered rainfall, saw sowing operations picking up.</p><span>\n</span><p>Nationally, annual seed market for the legally approved varieties is estimated at around 4.5-4.8 crore packets (of 450 gram each) and the area under the fibre crop hovers around 120 lakh hectares. This season, Maharashtra is preparing 40 lakh hectares for cotton sowing and normally some 1.6 crore packets of seeds are required for a season. A major portion of the crop is in Vidarbha, Marathwada and Khandesh pockets of the state.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "mixed",
        "pink",
        "Pink"
    ],
    "verbs": [
        "fight",
        "pink",
        "Pink",
        "war",
        "cotton"
    ]
}