{
    "title": "ITAT: Can file revised return after notice issued by I-T",
    "link": "https://timesofindia.indiatimes.com/business/india-business/itat-can-file-revised-return-after-notice-issued-by-i-t/articleshow/64689438.cms",
    "pubDate": "Thu, 21 Jun 2018 22:34:26 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/itat-can-file-revised-return-after-notice-issued-by-i-t/articleshow/64689438.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64689438.cms\" /></a>A tax benefit claimed by a taxpayer in his revised income-tax return cannot be denied outright by an income-tax (I-T) officer merely because the revised return has been filed after issue of notice, income-tax appellate tribunal (ITAT) has said. However, the revised return needs to be filed within the time limits set out in the I-T Act.",
    "contentSnippet": "A tax benefit claimed by a taxpayer in his revised income-tax return cannot be denied outright by an income-tax (I-T) officer merely because the revised return has been filed after issue of notice, income-tax appellate tribunal (ITAT) has said. However, the revised return needs to be filed within the time limits set out in the I-T Act.",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/itat-can-file-revised-return-after-notice-issued-by-i-t/articleshow/64689438.cms",
    "isoDate": "2018-06-21T22:34:26.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "itat",
            "can",
            "file",
            "revised",
            "return",
            "after",
            "notice",
            "issued",
            "by",
            "i-t"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "ITAT: Can file revised return after notice issued by I-T",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>MUMBAI: A tax benefit claimed by a taxpayer in his revised income-tax return cannot be denied outright by an income-tax (</span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/I-T\">I-T</a><span>) officer merely because the </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/revised-return\">revised return</a><span> has been filed after issue of notice, income-tax appellate tribunal (</span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/ITAT\">ITAT</a><p>) has said. \n\n</p><p> However, the revised return needs to be filed within the time limits set out in the I-T Act. This order of the Mumbai bench of the ITAT, passed on June 20, will provide relief to several taxpayers. When a mistake is made in the original I-T return, such as not disclosing an income correctly or not claiming a tax deduction, section 139 (5) the I-T Act permits a revised return to be filed to correct the errors.\n</p><p> Currently, the time limit for filing a revised return is before the expiry of twelve months from the last day of the financial year or before the completion of I-T assessment, whichever is earlier. \n</p><span> \n</span><div class=\"image\" data-msid=\"64691624\"><img src=\"https://timesofindia.indiatimes.com/img/64691624/Master.jpg\" alt=\"ITreturns\"></div><p>In this case before the ITAT, Mahesh Hinduja had declared a total income of Rs 4.91 lakh in his original return for the financial year 2010-11. He later filed a revised return declaring a total income of Rs 6.24 lakh. In this revised return he also disclosed long-term capital gains (LTCG) of nearly Rs 50 lakh. However, as he had invested 1.15 crore in a new residential house, he claimed a deduction under Section 54 of the I-T Act. Thus, capital gains were not offered for tax. \n</p><span>\n</span><br><span>Under the Act, if an investment is made in another house in India, within the stipulated period of time, then the 'cost of the new house' is deducted and only the balance component of the LTCG is taxable. Thus, if the amount of capital gains is equal to or less than the cost of the new house, the entire sum of LTCG is not taxable. \n</span><br><span>\n</span><br><span>To ensure that the taxpayer has not underreported his income or paid less tax, the I-T Act empowers I-T officials to issue a notice asking for further evidence. As the revised return was filed by Hinduja after he had received a notice under section 143(2), the I-T official rejected his claim for deduction. The litigation finally reached the level of the ITAT.\n</span><br><span>\n</span><br><span> The ITAT noted that the I-T official had rejected the revised return of income as invalid but at the same time had accepted the higher income offered in the revised return, including the LTCGs. Only the claim of deduction under Section 54 had been rejected. \"The I-T official has adopted a very selective approach in respect of the revised return of income filed by the taxpayer,\" remarked the ITAT. \n</span><br><span>\n</span><br><span> The ITAT held that the I-T Act does not bar a taxpayer from filing a </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/revised-I-T-return\">revised I-T return</a><span> after issue of notice under Section 143 (2). Hinduja's case was sent back to the I-T official for examining and allowing the deduction, subject to the fulfilment of conditions prescribed for such claim. \n</span><br><span>\n</span></div></div>"
    },
    "adjectives": [
        "appellate",
        "revised",
        "I",
        "outright",
        "set",
        "10",
        "left",
        "top",
        "right"
    ],
    "nouns": [
        "benefit",
        "return",
        "Can",
        "notice",
        "T",
        "A",
        "I",
        "file",
        "issue",
        "income",
        "tax",
        "taxpayer",
        "officer",
        "tribunal",
        "time",
        "set",
        "Act",
        "india",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo"
    ],
    "verbs": [
        "benefit",
        "return",
        "Can",
        "file",
        "notice",
        "issue",
        "tax",
        "officer",
        "time",
        "set",
        "Act",
        "border",
        "align",
        "style",
        "top",
        "right"
    ]
}