{
    "creator": "Sandhya Michu",
    "title": "Data drive: Local data centre players spy big opportunity",
    "link": "https://www.financialexpress.com/industry/technology/data-drive-local-data-centre-players-spy-big-opportunity/1196407/",
    "pubDate": "Thu, 07 Jun 2018 01:54:47 +05:30",
    "dc:creator": "Sandhya Michu",
    "content": "Dimension Data recently helped automate the network of a bank in India, thereby enabling the bank to roll out new projects across thousands of their branches in less than five hours. ",
    "contentSnippet": "Dimension Data recently helped automate the network of a bank in India, thereby enabling the bank to roll out new projects across thousands of their branches in less than five hours.",
    "guid": "https://www.financialexpress.com/?p=1196407",
    "categories": [
        "Industry",
        "Technology"
    ],
    "isoDate": "2018-06-06T20:24:47.000Z",
    "sentiment": {
        "score": 3,
        "comparative": 0.3333333333333333,
        "tokens": [
            "data",
            "drive",
            "local",
            "data",
            "centre",
            "players",
            "spy",
            "big",
            "opportunity"
        ],
        "words": [
            "opportunity",
            "big"
        ],
        "positive": [
            "opportunity",
            "big"
        ],
        "negative": []
    },
    "article": {
        "title": "Data drive: Local data centre players spy big opportunity",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1196411\" src=\"https://images.financialexpress.com/2018/06/iStock_20538868_XLARGE.jpg\" alt=\"local DATA CENTRE, RBI, storing data domestically, third party data centre, digital india\" srcset=\"https://images.financialexpress.com/2018/06/iStock_20538868_XLARGE.jpg 660w, https://images.financialexpress.com/2018/06/iStock_20538868_XLARGE-300x200.jpg 300w, https://images.financialexpress.com/2018/06/iStock_20538868_XLARGE-620x413.jpg 620w, https://images.financialexpress.com/2018/06/iStock_20538868_XLARGE-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The recent notification by the Reserve Bank of India (RBI) ordering banks and financial institutions to store all data domestically instead of outsourcing the job to a third-party data centre may have put payment companies in a quandary.</figure>\n\t\t\t</section></div><span>\n</span><p>The recent notification by the Reserve Bank of India (<a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a>) ordering banks and financial institutions to store all data domestically instead of outsourcing the job to a third-party data centre may have put payment companies in a quandary. However, on the positive side, this has brought cheer to local datacentre players. With data needing to reside within the country, data centre providers see an opportunity to increase their capacities and expand. Since everything must reside within the country, data centre providers will have to re-assess their current business models and create more delivery centres out of India for data centre applications or operation services.</p><span>\n</span><p>Sharing his perspective on the recent guidelines, KN Murali, head—solutions, Dimension Data India, a leading data centre service provider, says, “The regulation implies that all the app workloads and the underlying data must reside within the data centre premise. This basically translates into the fact that data centres will have to increase their capacity to offer workload deliveries within the country. Last, but not the least, the back-up and disaster recovery segment is another huge area of opportunity for data centre providers.”</p><span>\n</span><p>Data security is a major focus of the government’s <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/digital-india/\">Digital India</a> initiative, which aims to secure access to electronic services and internet connectivity across the length and breadth of India. The dramatic increase in data being generated by financial institutions has had a significant impact on the infrastructure that is required to support such proliferation. This, combined with the fact that most banks have started embarking on a transformative digital journey, has increased substantially the urgency to transform their technology infrastructure. This means banks now need to transform their infrastructure, operations and even the way they construct commercial constructs in order to exploit the opportunity that the digital journey they are taking and the data being generated in the process presents them.</p><span>\n</span><p>“As an ICT company, we are helping banks transform their infrastructure into one that supports a hybrid IT environment that brings together both private and public clouds. We are helping banks redesign their networks and data centres into one that is more agile, flexible and scalable,” says Murali. Equally important, this transformation needs to be underpinned by a security transformation. Security needs to be embedded in every single layer of the IT infrastructure to ensure a seamless security operation that provides real-time response capabilities to mitigate any threat instantaneously, says Murali.</p><span>\n</span><p>Dimension Data recently helped automate the network of a bank in India, thereby enabling the bank to roll out new projects across thousands of their branches in less than five hours. The same thing took a week before the automation. Another data centre company is looking to expand its reach in coming times. Nitin Mishra, senior vice-president and chief product officer of Netmagic (an NTT Communications company) says, “We have been working towards increasing our data centre footprint in the last couple of years. Two new data centres will come up in Bengaluru and Mumbai.”</p><span>\n</span><p>The Bengaluru centre will come upon a 2,50,000 square feet space and the one in Mumbai on a 3,00,000 square feet area. “With our multi-cloud orchestration portal, we can deploy and manage multiple cloud platforms. Apart from this, we also have a strong security stance, stronger than what a customer can afford in his own environment – something that is of paramount importance for the BFSI sector,” he added.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "Local",
        "big",
        "enabling",
        "new",
        "less",
        "five"
    ],
    "nouns": [
        "Data",
        "data",
        "Local",
        "centre",
        "spy",
        "opportunity",
        "Dimension",
        "bank",
        "India",
        "drive",
        "network",
        "roll",
        "five",
        "hours"
    ],
    "verbs": [
        "drive",
        "centre",
        "spy",
        "Dimension",
        "automate",
        "network",
        "bank",
        "roll"
    ]
}