{
    "title": "Infy at 25 yrs of listing:What ex-CFO said on NRN",
    "link": "https://timesofindia.indiatimes.com/business/india-business/narayana-murthy-made-it-all-happen-says-infosys-ex-cfo-at-25-years-of-listing/articleshow/64647494.cms",
    "pubDate": "Tue, 19 Jun 2018 09:51:17 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/narayana-murthy-made-it-all-happen-says-infosys-ex-cfo-at-25-years-of-listing/articleshow/64647494.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64647494.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/narayana-murthy-made-it-all-happen-says-infosys-ex-cfo-at-25-years-of-listing/articleshow/64647494.cms",
    "isoDate": "2018-06-19T09:51:17.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "infy",
            "at",
            "25",
            "yrs",
            "of",
            "listingwhat",
            "ex-cfo",
            "said",
            "on",
            "nrn"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Narayana Murthy made it all happen, says Infosys ex-CFO at 25 years of listing",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>HYDERABAD: As IT major </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/infosys\">Infosys</a><span> completed 25 years of its listing on the stock exchange, a former senior official of the firm paid rich tributes to the co-founder N R Narayana </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Murthy\">Murthy</a><p> for creating the \"dream\" company.\n\n</p><span>\"I don't think the country is going to see one more Infosys again because Infosys has been a dream company for many generations,\" says ex-Chief Financial Officer </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/V-Balakrishnan\">V Balakrishnan</a><p>.\n</p><p>The Bengaluru-headquartered company, he said, created the middle class aspiration in the country and made them think global.\n</p><p>Balakrishnan saw it as an extraordinary story of how a few people with little background came together, built a global company and ran it in a legal and ethical manner, still creating enormous amount of wealth and share it with all stakeholders.\n</p><p>\"I think all this had been possible because of one iconic leader -- Murthy who had created the dream of Infosys which attracted the best talent to come and work and make their company much bigger,\" he told PTI.\n</p><p>Balakrishnan also said Infosys, which last week celebrated the silver jubilee of its listing in 1993, to some extent institutionalised the Capital market.\n</p><p>When Infosys was listed two-and-half decades ago, the Indian capital market was not institutionalised. With global aspiration, the then small company set benchmark for disclosures and value system and enhanced the profile for the whole corporate world in India, according to him.\n</p><span>\"If you look at the </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/SEBI\">SEBI</a><p>'s recommendations on corporate governance, most of them had been followed (earlier) by Infosys, which was later mandated by the regulator to all companies to follow. So, it improved the whole profile of the corporate world in India, and enhanced corporate governance standards\", Balakrishnan said.\n</p><span>Infosys put value before profits, and Murthy always demonstrated leadership by example which attracted a good team of people which came and made the dream much bigger, he said.\n</span><br><span>\n</span><br><span>As long as Infosys sticks to its core value system, and governance standards, it would continue to do well, he said.\n</span><br><span>\n</span><br><span>Infosys as a company, Balakrishnan said, has tremendous amount of goodwill of investors and stakeholders, and \"everyone wants the company to perform well.\"\n</span><br><span>\n</span><br><span>The company has done extraordinarily well in the last many years and created tremendous amount of wealth for investors.\n</span><br><span>\n</span><p>\"I don't see why it (the same thing) will not happen for the next 25 years. Key thing is they should not lose their sight on core value system and principles,\" he added.\n</p><span>\n</span></div></div>"
    },
    "adjectives": [
        "10",
        "left",
        "top",
        "right",
        "25",
        "ex",
        "made"
    ],
    "nouns": [
        "margin",
        "india",
        "border",
        "listing",
        "years",
        "business",
        "10",
        "left",
        "style",
        "top",
        "photo",
        "right",
        "25",
        "ex",
        "CFO",
        "cfo"
    ],
    "verbs": [
        "border",
        "align",
        "style",
        "top",
        "right",
        "happen"
    ]
}