{
    "title": "'Of course, top job had to be held by a man'",
    "link": "https://timesofindia.indiatimes.com/business/international-business/of-course-top-job-at-qatar-airways-is-held-by-a-man-ceo/articleshow/64467925.cms",
    "pubDate": "Tue, 05 Jun 2018 15:13:23 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/international-business/of-course-top-job-at-qatar-airways-is-held-by-a-man-ceo/articleshow/64467925.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64467925.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/international-business/of-course-top-job-at-qatar-airways-is-held-by-a-man-ceo/articleshow/64467925.cms",
    "isoDate": "2018-06-05T15:13:23.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.18181818181818182,
        "tokens": [
            "'of",
            "course",
            "top",
            "job",
            "had",
            "to",
            "be",
            "held",
            "by",
            "a",
            "man'"
        ],
        "words": [
            "top"
        ],
        "positive": [
            "top"
        ],
        "negative": []
    },
    "article": {
        "title": "'Of course' top job at Qatar Airways 'had to be held by a man': CEO",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>SYDNEY: </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Qatar-Airways\">Qatar Airways</a><p>' chief sparked disbelief Tuesday by saying his carrier was led by a man because \"it is a very challenging position\" -- even as airline bosses admitted more women should be in top roles.\n\n</p><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Akbar-Al-Baker\">Akbar Al Baker</a><p> said his airline had taken steps to address gender equality, but when asked why it was led by a man, he replied: \"of course it had to be led by a man because it is a very challenging position.\"\n</p><p>He later defended the carrier, saying it was the first Middle Eastern airline to have a female pilot and that other women were in senior roles.\n</p><p>\"We actually encourage women and we see that they have huge potential in... senior management positions,\" Baker said at the close of IATA's two-day annual meeting in Sydney -- during which he was anointed chairman of the global industry body.\n</p><p>\"IATA also has a similar position on promoting gender equality.\"\n</p><p>The organisation currently has just two female CEOs on its 31-member board -- Christine Ourmieres-Widener of British budget airline Flybe and Air Europa's Maria Jose Hidalgo Gutierrez, who was added Tuesday.\n</p><p>IATA's chief executive Alexandre de Juniac acknowledged that having more women in senior positions was a \"long-standing issue\" that required further efforts from airlines and the industry body.\n</p><span>It released figures in March showing just three percent of CEOs in the industry were female, compared with 12 percent in other sectors.\n</span><br><span>\n</span><br><span>Leading carriers in North America and Europe had the highest representation of women in senior roles at 16 percent and 14 percent respectively, IATA said.\n</span><br><span>\n</span><br><span>African, Asia-Pacific and South American airlines were at about eight percent, with the Middle East having the worst at four percent, the data showed.\n</span><br><span>\n</span><br><span>Qantas chief Alan Joyce said at the same press conference that the Australian carrier had achieved a strong turnaround in profits partly due to its pursuit of diversity, with women making up 40 percent of senior management.\n</span><br><span>\n</span><p>But he said it was \"going to take a long time to fix some of the issues that are inherent in our society\", such as girls not studying science and technology in schools, which impacted their numbers in engineering and flying roles.\n</p><span>\n</span></div></div>"
    },
    "adjectives": [
        "top",
        "held",
        "international",
        "10",
        "left",
        "right"
    ],
    "nouns": [
        "course",
        "top",
        "job",
        "man",
        "business",
        "international",
        "qatar",
        "ceo",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "right",
        "photo"
    ],
    "verbs": [
        "course",
        "top",
        "job",
        "man",
        "border",
        "align",
        "style",
        "right"
    ]
}