{
    "creator": "Anushree Bhattacharyya",
    "title": "HT Media seals £24-million ad-for-equity deal with Koovs",
    "link": "https://www.financialexpress.com/industry/ht-media-seals-24-million-ad-for-equity-deal-with-koovs/1211329/",
    "pubDate": "Tue, 19 Jun 2018 04:32:52 +05:30",
    "dc:creator": "Anushree Bhattacharyya",
    "content": "HT Media, the publisher of English dailies Hindustan Times and Mint, has inked an ad-for-equity deal valued at £24 million for a period of two years with UK-based online fashion retailer Koovs.",
    "contentSnippet": "HT Media, the publisher of English dailies Hindustan Times and Mint, has inked an ad-for-equity deal valued at £24 million for a period of two years with UK-based online fashion retailer Koovs.",
    "guid": "https://www.financialexpress.com/?p=1211329",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-18T23:02:52.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "ht",
            "media",
            "seals",
            "£24-million",
            "ad-for-equity",
            "deal",
            "with",
            "koovs"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "HT Media seals £24-million ad-for-equity deal with Koovs",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1211337\" src=\"https://images.financialexpress.com/2018/06/KOOVS-REUL-Copy.jpg\" alt=\"HT Media, koovs, ht media koovs deal, fashion retailer,&nbsp;\" srcset=\"https://images.financialexpress.com/2018/06/KOOVS-REUL-Copy.jpg 660w, https://images.financialexpress.com/2018/06/KOOVS-REUL-Copy-300x200.jpg 300w, https://images.financialexpress.com/2018/06/KOOVS-REUL-Copy-620x413.jpg 620w, https://images.financialexpress.com/2018/06/KOOVS-REUL-Copy-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> HT Media, the publisher of English dailies Hindustan Times and Mint, has inked an ad-for-equity deal valued at £24 million for a period of two years with UK-based online fashion retailer Koovs.</figure>\n\t\t\t</section></div><span>\n</span><p>HT Media, the publisher of English dailies Hindustan Times and Mint, has inked an ad-for-equity deal valued at £24 million for a period of two years with UK-based online fashion retailer Koovs. “Through such deals we are able to provide better rates to advertisers. It is like comparing wholesale price of a good versus retail rate, with the former always turning out to be a better deal,” Piyush Gupta, group CFO, HT Media, said. According to industry estimates, HT Media along with Hindustan Media Ventures, the publisher of Hindi daily Hindustan, in total earn advertising revenue of Rs 1,600 crore from the newspaper business. A full-page jacket advertisement in the Hindustan Times costs anywhere in the range of Rs 70 lakh-Rs 1 crore, while the same slot is priced between Rs 10 lakh and Rs20 lakh in the case of its English business daily Mint.</p><span>\n</span><p>The price increases to Rs 40-Rs 50 lakh in case of its Hindi daily Hindustan. As part of the agreement, Koovs will acquire four £6-million tranches of media from HT Media at six monthly intervals over a period of 24 months. Further, 70% of this at £4.2 million in each installment will be satisfied by the issuance of new ordinary shares in the company to HT Media. The agreement is conditional upon an initial cash raise of at least £6 million by Koovs. In aggregate Koovs will get £16.8 million worth media and advertising services from HT Media in exchange for the issuance of new ordinary shares in the company to HT Media. Additionally, Koovs will be allowed to commission media and advertising services from HT Media worth £7.2 million. This will be paid in cash and will be drawn in four tranches at £1.8 million over a period of two year.</p><span>\n</span><p>The conversion price for the first £4.2-million tranche of new shares to be issued to HT Media is to be 10 pence per Koovs share. Thereafter each tranche will be priced at the lower of Koovs, then three-month average closing share price or the price of the most recent round of equity fundraising by the company. The deal provides HT Media with 30% cash while the rest in equity in lieu of advertising. The deal will mark the successful completion of the first round of funding for our strategic acceleration plan, providing us with an important platform to support our future growth,” Mary Turner, CEO, Koovs, said. This isn’t the first deal for HT Media as the firm has signed similar ad-for-equity deals with about 50-60 firms, so far.</p><span>\n</span><p>However the nature of the deal changes in case of realty firms, with HT Media acquiring real-estate in lieu of advertising space. Besides Koovs, Kwality, Round One Network, 74 BC Technologies, TRAK Services, World Phone Internet Services, Sunil Mantri Realty, Priknit Retail and Rosebys Interiors are some of the companies that have signed ad/real-estate for equity deal with HT Media. HT Media reported an 81% jump in net profit to Rs 307.17 crore in FY18 from Rs 170.25 crore in FY17. The company’s net profit rose on the back off reduction in material cost, employees and other expenses. However, the company’s revenue reduced 3.4% to Rs 2,591.68 crore in FY18 from Rs 2,681.55 crore in FY17. As for Hindustan Media Ventures, the company’s net profit fell 11.6% to Rs 171.22 crore, while revenue decreased 5.6% to Rs 880.10 crore.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "24",
        "million",
        "English",
        "Mint",
        "valued",
        "two",
        "based",
        "online"
    ],
    "nouns": [
        "24",
        "ad",
        "equity",
        "million",
        "deal",
        "publisher",
        "English",
        "Hindustan",
        "Times",
        "Mint",
        "period",
        "two",
        "years",
        "UK",
        "retailer",
        "fashion"
    ],
    "verbs": [
        "deal",
        "Mint",
        "fashion"
    ]
}