{
    "creator": "PTI",
    "title": "Markets regulator Sebi asks mutual fund houses to disclose total expense charge on daily basis",
    "link": "https://www.financialexpress.com/market/markets-regulator-sebi-asks-mutual-fund-houses-to-disclose-total-expense-charge-on-daily-basis/1194860/",
    "pubDate": "Tue, 05 Jun 2018 22:24:47 +05:30",
    "dc:creator": "PTI",
    "content": "Markets regulator Sebi today asked mutual fund houses to prominently disclose on a daily basis total expenses charged to customers for all schemes under a separate head on their websites as well as industry body Amfi website. ",
    "contentSnippet": "Markets regulator Sebi today asked mutual fund houses to prominently disclose on a daily basis total expenses charged to customers for all schemes under a separate head on their websites as well as industry body Amfi website.",
    "guid": "https://www.financialexpress.com/?p=1194860",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-05T16:54:47.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "markets",
            "regulator",
            "sebi",
            "asks",
            "mutual",
            "fund",
            "houses",
            "to",
            "disclose",
            "total",
            "expense",
            "charge",
            "on",
            "daily",
            "basis"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Markets regulator Sebi asks mutual fund houses to disclose total expense charge on daily basis",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1194864\" src=\"https://images.financialexpress.com/2018/06/SEBI-REU-L-6-1-1.jpg\" alt=\"Sebi,&nbsp;GST,&nbsp;TER,&nbsp;Mutual Funds in India,&nbsp;AMFI, news on mutual fund, latest news on mutual fund\" srcset=\"https://images.financialexpress.com/2018/06/SEBI-REU-L-6-1-1.jpg 660w, https://images.financialexpress.com/2018/06/SEBI-REU-L-6-1-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/SEBI-REU-L-6-1-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/SEBI-REU-L-6-1-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Sebi said that scheme wise annual report will be hosted on the website of the fund houses and Amfi. (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>Markets regulator Sebi today asked mutual fund houses to prominently disclose on a daily basis total expenses charged to customers for all schemes under a separate head on their websites as well as industry body Amfi website. The fund houses need to disclose about name of the scheme, base as well as total TER, additional expense and Goods and Services Tax (GST) for regular and direct mutual funds plan in a prescribed format. The new directive will come into force with immediate effect, the Securities and Exchange Board of India (Sebi) said in a circular.</p><span>\n</span><p>“AMCs (Asset Management Companies) shall prominently disclose on a daily basis, the TER (schemewise, date-wise) of all schemes under a separate head – ‘Total Expense Ratio (TER) of mutual fund schemes’ on their website and on the website of Amfi,” the regulator added. It said that any change in the base TER (excluding additional expenses) and GST on investment and advisory fees in comparison to previous base TER charged to any scheme will have to be communicated to investors through notice via email or SMS at least three working days prior to effecting such change.</p><span>\n</span><p>However, Sebi said that any decrease in TER in a mutual fund scheme due to various regulatory requirements, would not require issuance of any prior notice to the investors. The TER is a percentage of a scheme’s corpus that a mutual fund house charges towards expenses including administrative and management. The move comes after Sebi observed that there are frequent changes carried out in total expense ratio and such changes are not prominently disclosed to investors.</p><span>\n</span><p>Separately, the regulator has asked AMCs to shall prominently disclose the net asset value (NAVs) of all schemes under a separate head on their respective website and on the website of Association of Mutual Funds in India (Amfi) Further, fund houses have been asked to extend facility of sending latest available NAVs to unitholders through SMS, upon receiving a specific request in this regard. These are part of Sebi’s effort to bring cost effectiveness in disclosing and providing information to unitholders and as a green initiative measure.</p><span>\n</span><p>The regulator has asked fund houses to comply with these directive within a period of 30 days, Sebi said in a separate circular. Fund houses will have to explain methodology with the help of a simple numerical example at all relevant places such as on their respective website, Amfi website and scheme information documents. Sebi said that scheme wise annual report will be hosted on the website of the fund houses and Amfi. Also, fund houises They need to e-mail the scheme annual reports or abridged summary to those unitholders, whose email addresses are registered with the them.</p><span>\n</span><p>In case of unitholders whose email addresses are not registered with the fund houses, such AMCs will have to an undertake an exercise of communicating to the unitholders, through a letter enclosing self-addressed envelope enabling unitholders to ‘opt-in’ within 30 days, to continue receiving a physical copy of the scheme-wise annual report or abridged summary thereof. They will have to provide a physical copy of the statement of its scheme portfolio, without charging any cost, on specific request received from a unit-holder.</p><span>\n</span><p>The ‘opt-in’ facility to receive physical copy of the scheme-wise annual report or abridged summary will be provided in the application form for new subscribers. Fund houses will have to disclose portfolio (along with ISIN) as on the last day of the month or half-year for all their schemes on their respective website and on the website of AMFI within 10 days from the close of each month or half-year respectively in a user-friendly manner.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "mutual",
        "total",
        "charged",
        "daily",
        "separate"
    ],
    "verbs": [
        "expense",
        "fund",
        "disclose",
        "total",
        "charge",
        "separate",
        "head",
        "body"
    ]
}