{
    "title": "MFIs turn aggressive lenders, signs of overborrowing emerge in microlending",
    "link": "https://www.business-standard.com/article/markets/mfis-turn-aggressive-lenders-signs-of-overborrowing-emerge-in-microlending-118062600888_1.html",
    "pubDate": "Tue, 26 Jun 2018 18:46:00 +0530",
    "content": "The present regulations governing over-indebtedness applies only to NBFCs MFIs and MFIs",
    "contentSnippet": "The present regulations governing over-indebtedness applies only to NBFCs MFIs and MFIs",
    "guid": "https://www.business-standard.com/article/markets/mfis-turn-aggressive-lenders-signs-of-overborrowing-emerge-in-microlending-118062600888_1.html",
    "isoDate": "2018-06-26T13:16:00.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.2,
        "tokens": [
            "mfis",
            "turn",
            "aggressive",
            "lenders",
            "signs",
            "of",
            "overborrowing",
            "emerge",
            "in",
            "microlending"
        ],
        "words": [
            "aggressive"
        ],
        "positive": [],
        "negative": [
            "aggressive"
        ]
    },
    "article": {
        "title": "MFIs turn aggressive lenders, signs of overborrowing emerge in microlending",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tWith multiple financial institutions chasing same set of borrowers in rural areas, signs of over-borrowing are now apparent in the microfinance sector. In fact, close to 20-30 per cent of applications received by micro <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/lending\" target=\"_blank\">lending </a>institutions are now getting rejected on account of existing excess borrowing.</p>\n<p>\n\tBanks now account for a major 37 per cent of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/mfi\" target=\"_blank\">MFI </a>portfolio, while <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/small-finance-banks\" target=\"_blank\">small finance banks </a>(SFBs) control another 22 per cent of the portfolio. The rest is accounted by NFBFC MFI, NBFCs and non-profit making MFIs.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe present regulations governing over-indebtedness applies only to NBFCs MFIs and MFIs (non-profit ones). According to RBI regulations, total loan amount to a single borrower should not exceed Rs 60,000 in the first cycle and Rs 100,000 in subsequent cycles by not more than two microfinance lenders at a time. However, as a part of self-regulation, the MFIN (Microfinance Institution Network), the representative body of MFIs, had kept the overall <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/lending\" target=\"_blank\">lending </a>bar at Rs 60,000, which was raised to Rs 80,000 in April this year in view of high demand for loans.</p>\n<p>\n\t“From the total number of applications we get, close to 30-35 per cent do not get shortlisted as the credit has reached a saturation level,” according to Sunil Prabhune, chief executive, Rural Finance, L&amp;T Financial Services.</p>\n<p>\n\tWhen most <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/mfi\" target=\"_blank\">MFI </a>regulations were framed, between 2012 and 2015, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nbfc\" target=\"_blank\">NBFC </a>MFIs used to command about 70 per cent of the microloan portfolio. However, over the years, the dynamics of the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/mfi\" target=\"_blank\">MFI </a>industry has changed. Now, NBFCs (other than <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nbfc\" target=\"_blank\">NBFC </a>MFIs), SFBs and banks are not in the purview of RBI regulations governing MFIs, and hence microlending. This is one of the reasons that MFIs are fast losing their <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/lending\" target=\"_blank\">lending </a>space to banks.</p>\n<p>\n\t“The regulations governing microlending only applies to MFIs. They do not apply to banks, leaving a scope of regulatory arbitrage. Therefore, it is possible for a customer to borrow from two MFIs and banks,” said Alok Prasad, former CEO MFIN.</p>\n<p>\n\tAccording to a report by rating agency CRIF High Mark, in March 2018, Tamil Nadu has the highest percentage (3 per cent) of borrowers who are associated with 4 or more lenders, as compared to UP (1.05 per cent), and West Bengal (0.67 per cent). However, the compliance in year on year terms has deteriorated the most for West Bengal, followed by Karnataka, Bihar &amp; Uttar Pradesh.</p>\n<p>\n\t“\"Gradually three lender – whether NBFC-MFIs or Banks - is becoming a norm in microlending as that has been accepted by MFIN now. While RBI regulations is stricter – limits to loans from 2 NBFC-MFIs. More banks (including SFBs) are active in this space, which could be the reason for multiple-borrowing in some pockets,\" according to Parijat Garg (Vice President), CRIF High Mark.</p>\n<p>\n\tAccording to data from MFIN, PAR &gt;180 days, (Portfolio at risk) (loans that have at least one payment for more than 180 days overdue) stood at around 2.83 per cent for the MFI industry as on 31st March 2018, against 0.23 per cent as on 31st March 2017.</p>\n<p>\n\t“In case of about 20 per cent of applications, we are now declining credit, because they have already availed loans from multiple borrowers,” said Ashwani Kumar, deputy chief financial officer, Utkarsh Small Finance Bank.</p>\n<p>\n\tAccording to a report by Bharat Financial Inclusion Limited, rejection rate for all microfinance products at an industry level, increased from about 18 per cent in Q4 of FY17 to about 22 per cent in Q4 of FY18. Also, about 47 per cent of rejection of loans are on account of loans taken from more than two MFIs, which flouts the RBI norm.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "governing",
        "aggressive",
        "present"
    ],
    "nouns": [
        "indebtedness",
        "governing",
        "turn",
        "present"
    ],
    "verbs": [
        "turn",
        "emerge",
        "present"
    ]
}