{
    "title": "Gujarat power regulator raises RPO to 17% for the next five years",
    "link": "https://www.business-standard.com/article/economy-policy/gujarat-power-regulator-raises-rpo-to-17-for-the-next-five-years-118060500023_1.html",
    "pubDate": "Tue, 05 Jun 2018 06:58:00 +0530",
    "content": "This puts Gujarat along with states like Andhra Pradesh, Karnataka and Madhya Pradesh with one of the highest RPOs in the country",
    "contentSnippet": "This puts Gujarat along with states like Andhra Pradesh, Karnataka and Madhya Pradesh with one of the highest RPOs in the country",
    "guid": "https://www.business-standard.com/article/economy-policy/gujarat-power-regulator-raises-rpo-to-17-for-the-next-five-years-118060500023_1.html",
    "isoDate": "2018-06-05T01:28:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "gujarat",
            "power",
            "regulator",
            "raises",
            "rpo",
            "to",
            "17",
            "for",
            "the",
            "next",
            "five",
            "years"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Gujarat power regulator raises RPO to 17% for the next five years",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p><a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=gujarat+electricity+regulatory+commission\" target=\"_blank\">Gujarat Electricity Regulatory Commission </a>(GERC) has enhanced the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=renewable+power+obligation\" target=\"_blank\">renewable power obligation </a>(RPO) from the current 10 per cent to 17 per cent for the next five years.</p><p>\nThe move comes at a time when the state is witnessing a marginal shortfall in honoring the obligation.\n\n\n</p>\n<!-- INPAGE_BANNER --><p>\nAccording to a senior official at state discom <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=gujarat+urja+vikas+nigam\" target=\"_blank\">Gujarat Urja Vikas Nigam </a>Ltd (GUVNL), the state’s RPO stands at 9.5 per cent as against the required 10 per cent.</p><p>\nTo be implemented in a phased manner, the RPO for the next five years will see the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=wind+energy\" target=\"_blank\">wind energy </a>being increased by a marginal 0.1 per cent as compared to solar power which saw an increase by 1.25 per cent every year.</p><p>\nAccording to Girishkumar Kadam, sector head and vice-president at ICRA, this puts Gujarat along with states like Andhra Pradesh, Karnataka and Madhya Pradesh with one of the highest RPOs in the country.</p><p>\n“Since it needs to be achieved over a period of five years, utilities in Gujarat will have to tie up with incremental power purchase agreements (PPAs) for wind and solar power. Based on the incremental requirement of RPOs, the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=state+utilities\" target=\"_blank\">state utilities </a>will have to award the projects and tie up for the PPAs. One needs to see traction at both central and state government levels, be it through MNRE or state <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=discoms\" target=\"_blank\">discoms </a>tying up directly.</p><p>\nAs such, policy support at the Centre’s level is pretty strong. In addition to the policy support, a significant improvement in tariff competitiveness of wind and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=solar+energy\" target=\"_blank\">solar energy </a>is also favourable for these utilities,” Kadam told Business Standard.</p><p>\nTo meet the requirement, the GUVNL official said that the state discom will continue to follow the competitive bidding process.</p><p>\n“Right now, we don’t have enough capacities. We will have to add it through the competitive bidding process as we did recently. We are making slow progress in this regard. We are not envisaging any shortfall but we plan to ramp up capacity to meet the 17 per cent RPO. We have time to fully achieve it. We will be planning accordingly to meet the obligations. We are slightly short of the 10 per cent target currently at roughly 9.5 per cent. This is not a big concern,” the official stated.</p><p>\nGiven that the PPAs will take 18 months to commission, energy experts believe the shortfall will continue for one more year before stabilising.</p><p>\n“All <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=discoms\" target=\"_blank\">discoms </a>have failed to achieve RPO targets fixed by <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=gerc\" target=\"_blank\">GERC </a>and over purchased <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=solar+energy\" target=\"_blank\">solar energy </a>to meet the shortfall in purchase of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=wind+energy\" target=\"_blank\">wind energy.</a> This has put unwarranted burden on consumers as differences in solar and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=wind+energy\" target=\"_blank\">wind energy </a>rates is as high as Rs 9 to 10 per unit. However, the shortfall will remain for another year. From next year, depending on the tie-ups, the shortfall will reduce in Gujarat,” said energy and regulatory expert K K <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=bajaj\" target=\"_blank\">Bajaj.</a></p><p>\nHowever, according to Bajaj, the increase in RPO by seven per cent during the next five years may affect performance of state-owned Gujarat State Electricity Corporation Ltd (GSECL)’s coal-based power plants, which are struggling to survive with drop in plant load factor (PLF) to less than 40 per cent.</p><p>\nMeanwhile, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=gerc\" target=\"_blank\">GERC </a>also approved the PPAs with eight wind energy generators that saw tariffs slide to their lowest at Rs 2.43 per unit.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "17",
        "next",
        "five",
        "one"
    ],
    "nouns": [
        "Gujarat",
        "power",
        "regulator",
        "17",
        "five",
        "years",
        "Karnataka",
        "one",
        "country"
    ],
    "verbs": [
        "power"
    ]
}