{
    "title": "RBI may raise rates again by year-end but August hike still in play: Poll",
    "link": "https://www.business-standard.com/article/finance/rbi-may-raise-rates-again-by-year-end-but-august-hike-still-in-play-poll-118061900183_1.html",
    "pubDate": "Tue, 19 Jun 2018 11:37:00 +0530",
    "content": "In a poll ahead of the central bank's June meeting the median consensus had shown no hike until August",
    "contentSnippet": "In a poll ahead of the central bank's June meeting the median consensus had shown no hike until August",
    "guid": "https://www.business-standard.com/article/finance/rbi-may-raise-rates-again-by-year-end-but-august-hike-still-in-play-poll-118061900183_1.html",
    "isoDate": "2018-06-19T06:07:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "rbi",
            "may",
            "raise",
            "rates",
            "again",
            "by",
            "year-end",
            "but",
            "august",
            "hike",
            "still",
            "in",
            "play",
            "poll"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "RBI may raise rates again by year-end but August hike still in play: Poll",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/reserve-bank-of-india\" target=\"_blank\">Reserve Bank of India </a>(RBI) is expected to raise interest rates again in the final three months of this year, according to a Reuters poll of economists, but over one-third of them predicted a hike as early as at the next meeting in August.</p>\n<p>\n\tAccelerating inflation and India retaining top spot as the fastest-growing major economy prompted the RBI to lift the repo rate by 25 basis points to 6.25 per cent at the June 4-6 meeting, wrong-footing a slim majority of economists polled by Reuters who had expected no change.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe latest poll, taken in the past week, showed 43 of 56 economists forecasting the RBI's repo rate at 6.50 per cent or higher in the quarter ending December.</p>\n\n<p>\n\tBut over a third, or 21 of 58 economists, expected the RBI to move earlier with a 25 basis-point hike in August.</p>\n<p>\n\tIn a poll ahead of the central bank's June meeting the median consensus had shown no hike until August.</p>\n<p>\n\tSome respondents in the latest poll said the next move won't come until 2019.</p>\n<p>\n\tThe common theme in recent Reuters polls showed there will be just two interest rate hikes through to the end of next year and the latest suggests economists have just brought forward expectations for tightening with the median consensus now for no move in 2019.</p>\n\n<p>\n\t\"Whether it is August or October will be determined by the evolution of inflation and crude prices in particular, but also by developments on growth and emerging markets sentiment,\" said Abhishek Upadhyay, an economist at ICICI Securities Primary Dealership Ltd.</p>\n<p>\n\tAlthough inflation has stayed above the RBI's target of 4 per cent for seven months running, upcoming seasonal monsoon rains and the Indian rupee, which has weakened over 6 per cent this year, could determine its path ahead.</p>\n<p>\n\tBut a separate Reuters poll of foreign exchange strategists showed the rupee will gain slightly over the coming year on stronger growth prospects after being one of the worst performing currencies this year.</p>\n\n<p>\n\tRBI Governor <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/urjit-patel\" target=\"_blank\">Urjit Patel </a>told reporters after the surprise June rate increase that the hike was a response to emerging risks to the inflation target. Minutes of the RBI's June meeting are due on Wednesday.</p>\n<p>\n\t\"We also await minutes for further cues, but for now it appears that the Monetary Policy Committee will prefer to spread out the rate hikes,\" ICICI's Upadhyay said.</p>\n<p>\n\tWhen asked if the RBI's June hike was the start of a tightening cycle, economists were split - 27 of 50 said it did but the remainder said it was not.</p>\n<p>\n\tEconomists didn't comment on when the central bank would change its neutral bias, which it maintained at this month's meeting to the surprise of some analysts.</p>\n<p>\n\t\"The upcoming weeks are the litmus test for whether or not the past rate hike is sufficient to tame markets and prevent further portfolio outflows and stabilize the INR,\" said Hugo Erken, senior economist at Rabobank.</p>\n<p>\n\t\"Meanwhile, the RBI will keep a close watch on the oil price and the Fed tightening cycle to see if an acceleration is needed.\"</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "verbs": [
        "raise",
        "hike",
        "Poll",
        "poll",
        "bank",
        "play",
        "end"
    ],
    "nouns": [
        "In",
        "raise",
        "consensus",
        "June",
        "rates",
        "hike",
        "may",
        "year",
        "RBI",
        "meeting",
        "Poll",
        "poll",
        "central",
        "bank",
        "play",
        "end",
        "August",
        "median",
        "no"
    ],
    "adjectives": [
        "In",
        "central",
        "ahead",
        "August",
        "median",
        "no"
    ]
}