{
    "title": "Three home loan options you may not be aware of",
    "link": "https://timesofindia.indiatimes.com/business/india-business/three-home-loan-options-you-may-not-be-aware-of/articleshow/64647559.cms",
    "pubDate": "Tue, 19 Jun 2018 09:55:19 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/three-home-loan-options-you-may-not-be-aware-of/articleshow/64647559.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64647559.cms\" /></a>After availing a home loan, you may aim to get rid of debt as soon as possible. For doing this you may use your surplus income for prepayments and reduce your loan tenure.",
    "contentSnippet": "After availing a home loan, you may aim to get rid of debt as soon as possible. For doing this you may use your surplus income for prepayments and reduce your loan tenure.",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/three-home-loan-options-you-may-not-be-aware-of/articleshow/64647559.cms",
    "isoDate": "2018-06-19T09:55:19.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "three",
            "home",
            "loan",
            "options",
            "you",
            "may",
            "not",
            "be",
            "aware",
            "of"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Three home loan options you may not be aware of",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>NEW DELHI: With property prices spiralling and interest rates on </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/home-loans\">home loans</a><p> also on the rise, home buyers may find it difficult to buy their dream house. As a result, they either settle down for a small house or delay their home buying. To help them decide, many lending institutions are now offering home loan variants that are customised to suit the needs of home loan borrowers.\n\n</p><p>In this article, we take a look at these innovative products.\n</p><span>\n</span><strong>Step Up Home Loan</strong><p>A step up home loan enables you to take a higher loan amount than what your loan eligibility allows under regular home loans. This option comes handy for those home loan borrowers who cannot afford a higher EMI in the beginning of their careers and fall short of eligibility criteria for getting the home loan sanctioned. This option allows a home buyer to pay lower EMIs in the initial year, and thereafter the EMI increases in the subsequent years. The lender takes into account the expected growth in your income during the loan period while giving you this repayment option. A prominent bank offers Step Up Home Loan for a tenure of 20 years and charges interest rates same as standard home loans.\n</p><span>\n</span><strong>Home Loan With Overdraft Facility</strong><p>After availing a home loan, you may aim to get rid of debt as soon as possible. For doing this you may use your surplus income for prepayments and reduce your loan tenure. Although this would certainly help you in reducing your liability faster, the part pre-payment money once paid will not come back to you. This is where a home loan overdraft helps. With this product, banks link your normal savings/current account to your home loan account, and funds in your savings account are considered prepayment, saving you interest on the loan. Later, if you have a fund requirement, you can simply withdraw the money from your account, and the loan balance and interest would be readjusted accordingly.\n</p><p>If you periodically make lump-sum earnings, a home loan with OD facility can save you interest. This is especially useful for businessmen whose income is irregular or seasonal, and they may periodically need their own money back. However, you should assess whether you would earn surplus income in future to reap in maximum benefits of this option. Under home loan with OD facility, you are not entitled to get the tax benefit under Sec 80 (C) against the surplus amount deposited, as it the amount deposited is not considered as home loan pre-payment.\n</p><span>\n</span><strong>Home Loan For Pensioners</strong><span>\n</span><br><span>\n</span><br><span>As the name suggests, this is for pensioners who may not be eligible for a standard home loan. Usually, when pensioners and retirees face such a situation, they add a co-borrower to increase the loan amount or look for a property with lower value. However, many banks now allow home loans for pensioners with the final repayment age up to 76 years. The loan tenure is fixed by the lenders. The EMI is directly debited from the pension account of the pensioner. Although the loan amount is low, you can club it with any surplus money you have to fulfil your desire of buying a home. However, assess if you can afford EMIs from your pension without affecting your normal expenses while taking this loan\n</span><br><span>\n</span><br><span>\n</span><strong>Other Home Loan Variants</strong><span>\n</span><br><span>\n</span><br><span>Suppose you are a middle-aged home buyer aged 48 years. Most bank will allow a loan tenure of up to 12 years considering your remaining lifespan after 60 as your retirement years. With a shorter loan tenure, the EMI increases due to which borrower may find difficult to repay the loan. To address this, some banks allow additional loan tenure to mid-aged borrowers that extends loan tenures beyond the age of 60. With such home loan product, the applicant easily fits into the eligibility criteria and finds it easier to repay the EMIs. There is another home loan product that offers waiver of a certain number of EMIs after timely repayment of all the instalments.\n</span><br><span>\n</span><p>If you want to apply for a home loan, do a thorough research on these home loan variants and choose the one that fits into your requirement.\n</p><span>\n</span></div></div>"
    },
    "adjectives": [
        "surplus",
        "possible",
        "Three",
        "three",
        "10",
        "left",
        "top",
        "right",
        "home",
        "aware",
        "After"
    ],
    "nouns": [
        "may",
        "india",
        "use",
        "surplus",
        "loan",
        "photo",
        "income",
        "margin",
        "possible",
        "border",
        "Three",
        "three",
        "aim",
        "10",
        "debt",
        "business",
        "left",
        "style",
        "top",
        "right",
        "home",
        "tenure"
    ],
    "verbs": [
        "use",
        "loan",
        "reduce",
        "border",
        "aim",
        "align",
        "style",
        "top",
        "right",
        "home",
        "rid",
        "tenure"
    ]
}