{
    "title": "India-China border dispute causing an ecological holocaust in Himalayas",
    "link": "https://www.business-standard.com/article/economy-policy/india-china-border-dispute-causing-an-ecological-holocaust-in-himalayas-118061900222_1.html",
    "pubDate": "Tue, 19 Jun 2018 11:10:00 +0530",
    "content": "China and India's geopolitical resources rush threatens the safety of this entire Brahmaputra River system",
    "contentSnippet": "China and India's geopolitical resources rush threatens the safety of this entire Brahmaputra River system",
    "guid": "https://www.business-standard.com/article/economy-policy/india-china-border-dispute-causing-an-ecological-holocaust-in-himalayas-118061900222_1.html",
    "isoDate": "2018-06-19T05:40:00.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.2222222222222222,
        "tokens": [
            "india-china",
            "border",
            "dispute",
            "causing",
            "an",
            "ecological",
            "holocaust",
            "in",
            "himalayas"
        ],
        "words": [
            "dispute"
        ],
        "positive": [],
        "negative": [
            "dispute"
        ]
    },
    "article": {
        "title": "India-China border dispute causing an ecological holocaust in Himalayas",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tChinese and Indian competition on their shared Himalayan border is more likely to create a slow-moving environmental catastrophe than a quick military or nuclear disaster.</p>\n<p>\n\tThe Himalayan plateau plays a crucial role in Asia. It generates the monsoonal rains and seasonal ice-melts that feed rivers and deliver nutrients to South, Southeast and East Asia. Almost <a href=\"https://www.washingtonpost.com/news/worldviews/wp/2013/05/07/map-more-than-half-of-humanity-lives-within-this-circle/?noredirect=on&amp;utm_term=.ab1ac6b83208\">half the world’s population</a> and <a href=\"http://databank.worldbank.org/data/download/GDP.pdf\">20% of its economy</a> depend on these rivers, and they are already threatened by <a href=\"https://www.nature.com/news/double-threat-for-tibet-1.15738\">climate change</a>. China and India’s competition for their headwaters increases this threat.<br><strong class=\"read_more\">ALSO READ:&nbsp;<a href=\"https://www.business-standard.com/article/current-affairs/india-china-cannot-afford-another-doklam-like-situation-chinese-envoy-118061800394_1.html\" target=\"_blank\">India, China cannot afford another Doklam-like situation: Chinese envoy</a></strong></p>\n<p>\n\tUntil the mid-20th century, the Himalaya’s high altitude prevented its large-scale development and conserved its environment. But after the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=republic+of+india\" target=\"_blank\">Republic of India </a>and the People’s Republic of China were created in the late 1940s, these two new states began competing for high ground in the western and eastern <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/himalayas\" target=\"_blank\">Himalayas.</a> They fought a <a href=\"https://yaleglobal.yale.edu/content/forgotten-war-himalayas\">war over their unresolved border in 1962</a>, and have scuffled ever since. The most recent clash was in 2017, when China built a road into <a href=\"https://theconversation.com/lessons-from-the-doklam-pass-how-little-bhutan-faced-down-china-over-a-border-dispute-84158\">Doklam</a>, an area claimed by <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bhutan\" target=\"_blank\">Bhutan </a>and protected by India.</p>\n<p>\n\tTensions rose again last week when China unveiled a new mine in Lhunze, near the de facto border with India’s northeastern state of Arunachal Pradesh, east of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bhutan\" target=\"_blank\">Bhutan.</a> The mine sits on a <a href=\"http://www.scmp.com/news/china/society/article/2146296/how-chinese-mining-himalayas-may-create-new-military-flashpoint\">deposit of gold, silver and other precious metals worth up to US$60 billion</a>.</p>\n\n<p>\n\tMost analysis of the Sino-Indian border dispute has focused on the potential for <a href=\"https://www.brookings.edu/opinions/asias-cold-peace-china-and-indias-delicate-diplomatic-dance/\">another war between these two nuclear-armed neighbours</a>. The environmental impacts of their continued entrenchment are rarely mentioned, despite the fact that they are significant and growing.<br></p>\n<!-- INPAGE_BANNER -->\n\t<br>All of this development along the border is built on the world’s third-largest ice-pack or in biodiversity hotspots. The region was militarised during the 1962 war, and has since been <a href=\"https://www.tandfonline.com/doi/abs/10.1080/09584930903108911?journalCode=ccsa20\">inundated by troops, roads, airports, barracks and hospitals</a>. These have caused deforestation, landslides, and – if a <a href=\"http://www.bioone.org/doi/abs/10.1659/0276-4741(2002)022%5B0316:ASPPTS%5D2.0.CO%3B2\">study on troop movements on other glaciers</a> is any guide – possibly even glacial retreat.\n<p>\n\tThe buildup of troops on the border has displaced local ethnic groups, and they have been encouraged to give up their land to make way for <a href=\"https://www.researchgate.net/publication/248903596_Agriculture_in_central_Tibet_an_assessment_of_climate_farming_systems_and_strategies_to_boost_production\">intensive farming</a>. Animal habitats have decreased and <a href=\"https://www.cambridge.org/core/journals/bjhs-themes/article/studying-the-snow-leopard-reconceptualizing-conservation-across-the-chinaindia-border/992F367FE853AA276EB4B229FE71A716\">clashes with tigers and snow leopards have increased</a>. Population transfers and agricultural intensification have even heightened the risk that <a href=\"https://theconversation.com/how-antibiotic-pollution-of-waterways-creates-superbugs-38046\">antibiotic-resistant superbugs and other toxic pollutants</a> will seep into the world’s most diffused watershed.</p>\n<p>\n\tDuring the past 20 years, first China and then India have increased this degradation by building large-scale mines and hydroelectric dams in this sensitive region. These projects have <a href=\"https://www.chinadialogue.net/article/show/single/en/4509-Tibet-s-mining-menace-\">not been profitable or environmentally sound</a>, but they have solidified state control by entrenching populations, upgrading transport networks, and integrating these fringes into national economies. The tightening of state control along the border has been further complicated by calls from the Tibetans and other ethnic groups for greater autonomy.</p>\n<p>\n\tMany of the projects have been developed within the transnational <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=brahmaputra+river\" target=\"_blank\">Brahmaputra River </a>basin. This river’s headwaters are in China, but most of its catchment is in Arunachal Pradesh, which is controlled by India but claimed by China. It then flows through Assam and Bangladesh, where it joins the Ganges River. Some 630 million people live in the Ganges-<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=brahmaputra+river\" target=\"_blank\">Brahmaputra River </a>catchment.</p>\n<p>\n\tChina and India’s geopolitical resources rush threatens the safety of this entire river system. The new Lhunze mine’s position among the Brahmaputra’s headwaters is so precarious that its owner, Hua Yu Mining, was only allowed to mine there under strict environmental conditions. To its credit, Hua Yu has agreed to be a <a href=\"https://www.youtube.com/watch?time_continue=7&amp;v=EeBprffFbic\">“green” miner, limiting emissions, water use and minimising “grassland disturbance”</a>. But even if the company does not inadvertently leak acid and arsenic into the environment like <a href=\"https://www.washingtonpost.com/world/asia_pacific/tibetans-in-anguish-as-chinese-mines-pollute-their-sacred-grasslands/2016/12/25/bb6aad06-63bc-11e6-b4d8-33e931b5a26d_story.html?utm_term=.d260cc80defa\">other mines in Tibet</a>, the mine is still liable to be damaged by the region’s frequent earthquakes. Any toxic leak from Lhunze will flow straight into the Brahmaputra and then into the lower Ganges.</p>\n<div><span>\n\t</span><img align=\"\" alt=\"The Conversation logo\" class=\"imgCont\" height=\"31\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2016-10/31/full/1477895933-7963.jpg\" title=\"The Conversation logo\" width=\"400\"></div>\n<p>\n\tOn its side of the border, India has concentrated on dams rather than mines. Between 2000 and 2016, the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/arunachal-pradesh\" target=\"_blank\">Arunachal Pradesh </a>government approved the <a href=\"https://www.thethirdpole.net/en/2016/02/25/private-dam-builders-back-out-of-brahmaputra-dams/\">construction of 153 dams</a>, before realising that it had overextended itself.</p>\n<p>\n\tSo far only one dam is complete, and all the other projects have stalled. One of these stalled dams is on the Subansiri River, the same river from which the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=lhunze+mine\" target=\"_blank\">Lhunze mine </a>draws water. India is racing to build these dams <a href=\"https://theconversation.com/china-and-indias-race-to-dam-the-brahmaputra-river-puts-the-himalayas-at-risk-65496\">without community consultation or environmental studies</a> because it sees itself as competing with China for the region’s water. China has already built four dams in the upper <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=brahmaputra+river\" target=\"_blank\">Brahmaputra River </a>basin.</p>\n<p>\n\t<a href=\"https://www.chinadialogue.net/article/show/single/en/4799-Fighting-India-s-mega-dams\">Indian strategists argue</a> that they can stop China building more dams by building hydroelectric projects whose need for water will be recognised under international law. Given China’s <a href=\"https://www.theguardian.com/world/2016/jul/13/china-damns-international-court-after-south-china-sea-slapdown\">dismissal of previous rulings by the International Court of Justice</a>, and its <a href=\"https://www.thethirdpole.net/en/2018/05/17/china-resumes-sharing-brahmaputra-water-flow-data-with-india/\">recent refusal to share water-flow data</a> with India after the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=doklam+incident\" target=\"_blank\">Doklam incident </a>(data that India needs to plan flood controls), this strategy seems unlikely to succeed.</p>\n<p>\n\tEven if it does, it is hard to see how building large hydropower projects in an earthquake-prone region will ultimately help India. It won’t stop China developing the borderland, and it could cause more problems than it solves.</p>\n<p>\n\t<img alt=\"The Conversation\" height=\"1\" src=\"https://counter.theconversation.com/content/97173/count.gif?distributor=republish-lightbox-basic\" width=\"1\">To keep Asia’s major rivers flowing and relatively non-toxic, both nations need to stop competing and start collaborating. Their leaders understand that neither nation would win a nuclear war. Now they need to realise that no one will benefit from destroying a shared watershed.</p>\n<hr>\n<p>\n\t<em>This article was originally published on <a href=\"http://theconversation.com/\">The Conversation</a>. Read the <a href=\"https://theconversation.com/china-and-indias-border-dispute-is-a-slow-moving-environmental-disaster-97173\">original article</a>.</em></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "ecological",
        "geopolitical",
        "rush",
        "entire"
    ],
    "verbs": [
        "dispute",
        "border",
        "rush"
    ]
}