{
    "title": "Government opts to go slow on Air India sell-off",
    "link": "https://timesofindia.indiatimes.com/business/india-business/government-opts-to-go-slow-on-air-india-sell-off/articleshow/64641649.cms",
    "pubDate": "Tue, 19 Jun 2018 01:13:20 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/government-opts-to-go-slow-on-air-india-sell-off/articleshow/64641649.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64641649.cms\" /></a>At a meeting of the group of ministers with Union minister Arun Jaitley on Monday, the view was that the elevated prices of crude had resulted in no airline, including some of the stronger players such as Emirates and Qatar Airways, responding to even the expression of interest.",
    "contentSnippet": "At a meeting of the group of ministers with Union minister Arun Jaitley on Monday, the view was that the elevated prices of crude had resulted in no airline, including some of the stronger players such as Emirates and Qatar Airways, responding to even the expression of interest.",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/government-opts-to-go-slow-on-air-india-sell-off/articleshow/64641649.cms",
    "isoDate": "2018-06-19T01:13:20.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "government",
            "opts",
            "to",
            "go",
            "slow",
            "on",
            "air",
            "india",
            "sell-off"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Government opts to go slow on Air India sell-off",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>NEW DELHI: With no suitors for </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Air-India\">Air India</a><p>, the government is likely to go slow on a strategic sale of the national carrier till oil prices soften, and will instead focus on improving its operating efficiency.\n\n</p><span>At a meeting of the group of ministers with Union minister </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Arun-Jaitley\">Arun Jaitley</a><span> on Monday, the view was that the elevated prices of crude had resulted in no airline, including some of the stronger players such as Emirates and </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Qatar-Airways\">Qatar Airways</a><p>, responding to even the expression of interest. As a result, sources suggested that the much-discussed disinvestment plan may be put on the backburner till global oil prices come down.\n</p><p>The group of ministers met to discuss the airline's future after the failed divestment bid where it decided to offload the government's stake in the Maharaja in small batches, while constantly trying to make it more attractive for potential bidders. \"Oil prices are climbing up and, at such a time, trying to offload a stake in an airline is not easy. The focus now will be on making AI more efficient and ensure that it does not lose its market share. While doing so, we will slowly offload stake in the airline,\" said a source.\n</p><span> \n</span><div class=\"image\" data-msid=\"64641666\"><img src=\"https://timesofindia.indiatimes.com/img/64641666/Master.jpg\" alt=\"Air India\"></div><span>An official said with no takers for the airline, the option before the government was to go for a distress sale, which was not advisable.\n</span><br><span>\n</span><br><span>The postponement of the sale plan also means that the government, which has less than a year to go, will have to pump capital into the airline, which is saddled with loans of over Rs 50,000 crore, leaving a big hole in its accounts due to interest outgo.\n</span><br><span>\n</span><br><span>While the disinvestment move did not see buyers lining up, equity infusion from the government dried up in this phase as it was felt that there will soon be a new owner. Also, four banks withdrew a Rs 1,000-crore loan. The combined impact has been a cash crunch for the airline where salaries are delayed and a host of economy measures have been announced, like making cabin crew share rooms.\n</span><br><span>\n</span><br><span>Senior airline officials said the government will need to revive the morale of AI employees. \"The AI board of directors has only two airline professionals - operations director Arvind Kathpalia and finance director Vinod Hejmadi. There is no commercial director. Three others are government officials, led by an IAS chairman, and two are independent directors. AI needs a team of professionals. First of all, fund infusion must begin so that everyone is paid on time. That is the basic thing if the government wants to run AI,\" said an airline insider.\n</span><br><span>\n</span><br><span>Another airline insider said, \"All Indian carriers like IndiGo, SpiceJet, </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Jet-Airways\">Jet Airways</a><p> have placed orders for hundreds of planes and Vistara is going to place its order for both narrow- and wide-bodied planes. AI has no planes on order. In this situation, AI will keep losing market share in coming years.\"\n</p><span>\n</span></div></div>"
    },
    "adjectives": [
        "off",
        "Union",
        "slow",
        "elevated",
        "10",
        "even",
        "crude",
        "no",
        "left",
        "top",
        "right",
        "go"
    ],
    "nouns": [
        "India",
        "india",
        "meeting",
        "Union",
        "Government",
        "government",
        "minister",
        "photo",
        "group",
        "interest",
        "Monday",
        "expression",
        "elevated",
        "sell",
        "margin",
        "border",
        "10",
        "Air",
        "airline",
        "air",
        "even",
        "crude",
        "no",
        "At",
        "business",
        "left",
        "style",
        "top",
        "right",
        "go",
        "view",
        "Qatar"
    ],
    "verbs": [
        "off",
        "minister",
        "group",
        "interest",
        "slow",
        "sell",
        "border",
        "Air",
        "air",
        "even",
        "align",
        "style",
        "top",
        "right",
        "go",
        "view"
    ]
}