{
    "title": "Footwear stocks extend rally; Relaxo hits new high, Bata nears record high",
    "link": "https://www.business-standard.com/article/markets/footwear-stocks-extend-rally-relaxo-hits-new-high-bata-nears-record-high-118061900186_1.html",
    "pubDate": "Tue, 19 Jun 2018 10:26:00 +0530",
    "content": "Bata India, Liberty Shoes, Relaxo Footwear, Superhouse and Khadim India were up 1% to 8% on the BSE",
    "contentSnippet": "Bata India, Liberty Shoes, Relaxo Footwear, Superhouse and Khadim India were up 1% to 8% on the BSE",
    "guid": "https://www.business-standard.com/article/markets/footwear-stocks-extend-rally-relaxo-hits-new-high-bata-nears-record-high-118061900186_1.html",
    "isoDate": "2018-06-19T04:56:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.08333333333333333,
        "tokens": [
            "footwear",
            "stocks",
            "extend",
            "rally",
            "relaxo",
            "hits",
            "new",
            "high",
            "bata",
            "nears",
            "record",
            "high"
        ],
        "words": [
            "extend"
        ],
        "positive": [
            "extend"
        ],
        "negative": []
    },
    "article": {
        "title": "Footwear stocks extend rally; Relaxo hits new high, Bata nears record high",
        "content": "<div><span>\n\t\n\tShares of </span><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/footwear\" target=\"_blank\">footwear </a><span>companies were trading higher for the second straight day in a row with </span><a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=relaxo+footwear\" target=\"_blank\">Relaxo </a><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/footwear\" target=\"_blank\">Footwear </a><span>hitting new high, while </span><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bata-india\" target=\"_blank\">Bata India </a><span>trading close to its record high on the BSE in an otherwise weak market today.</span><p>\n\tBata India, Liberty Shoes, Relaxo Footwear, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=superhouse\" target=\"_blank\">Superhouse </a>and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/khadim-india\" target=\"_blank\">Khadim India </a>were up 1% to 8% on the BSE. On comparison, the S&amp;P BSE Sensex was down 0.34% or 122 points at 35,440 at 09:58 am.\n\n\n</p><span>\n</span><!-- INPAGE_BANNER --><p>\n\tThe Indian <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/footwear\" target=\"_blank\">footwear </a>industry is valued at Rs 500-550 billion, which is expected to grow at a CAGR of around 15% going ahead. One third of the industry is mainly dominated by the unorganized sector. However, organized segment is expected to grow at a faster pace compared to the unorganized segment on the back of increase in household income and rising brand consciousness amongst Indian consumers, according to Angel Broking.</p><p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/liberty-shoes\" target=\"_blank\">Liberty Shoes </a>rallied 11% to Rs 222 on the BSE in intra-day trade, extending its Monday’s 18% surge on back of heavy volumes. The trading volumes on the counter jumped more than 20-fold with a combined 2.38 million shares representing 14% of total equity of the company changed hands on the NSE and BSE so far.</p><p>\n\tRelaxo Footwears hit a new high of Rs 812, up 14%, surpassing its previous high of Rs 751 recorded on May 9, 2018 on the BSE in intra-day trade.</p><p>\n\tAnalysts at Dolat Capital believe that Goods and Services Tax (GST) headwinds are over and the footwear market would grow hereon. Although neither the channel trader nor the company is confirming about the shift in market from unorgnised to organized, the brokerage firm believe the organised market is growing faster compared to unorganised.</p><p>\n\t“Relaxo being one of the largest and recognized brand in the economy and mid segment, is likely to gain from the market shift in favor of organized market,” the brokerage firm said in result update. The stock however, is currently trading above its 12-month target price of Rs 775 per share.</p><p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bata-india\" target=\"_blank\">Bata India </a>was up 2% to Rs 831, trading close to its record high of Rs 833 recorded on November 1, 2017 on the BSE in intra-day deal. The stock rallied 5% on Monday.</p><p>\n\tAngel Broking initiates coverage on <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bata-india\" target=\"_blank\">Bata India </a>with a ‘buy’ rating on the stock and 12 month price target of Rs 896 per share.</p><p>\n\t“We expect Bata India to report net revenue CAGR of around 16% to around Rs 36 billion over FY2018-20E mainly due increasing brand consciousness amongst Indian consumers, new product launches, higher number of stores addition in tier – II and III cities and focus on women’s segment (high growth segment). Further, on the bottom-line front, we expect CAGR of around 19% to Rs 3 billion over the same period on the back of margin improvement (increasing premium product sales),” the brokerage firm said in a report.</p><span>\n</span></div>"
    },
    "adjectives": [
        "high",
        "new"
    ],
    "verbs": [
        "record",
        "rally",
        "extend"
    ]
}