{
    "title": "Govt prepares standardisation plan to boost economy",
    "link": "https://timesofindia.indiatimes.com/business/india-business/govt-prepares-standardisation-plan-to-boost-economy-promote-brand-india/articleshow/64651870.cms",
    "pubDate": "Tue, 19 Jun 2018 14:37:35 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/govt-prepares-standardisation-plan-to-boost-economy-promote-brand-india/articleshow/64651870.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64651870.cms\" /></a>The government today came out with a product and services standardisation strategy, which includes promoting brand India, developing quality norms for services sector and ease compliance burden for small and medium enterprises.",
    "contentSnippet": "The government today came out with a product and services standardisation strategy, which includes promoting brand India, developing quality norms for services sector and ease compliance burden for small and medium enterprises.",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/govt-prepares-standardisation-plan-to-boost-economy-promote-brand-india/articleshow/64651870.cms",
    "isoDate": "2018-06-19T14:37:35.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.14285714285714285,
        "tokens": [
            "govt",
            "prepares",
            "standardisation",
            "plan",
            "to",
            "boost",
            "economy"
        ],
        "words": [
            "boost"
        ],
        "positive": [
            "boost"
        ],
        "negative": []
    },
    "article": {
        "title": "Govt prepares standardisation plan to boost economy, promote brand India",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>NEW DELHI: The government today came out with a product and services standardisation strategy, which includes promoting </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/brand-India\">brand India</a><p>, developing quality norms for services sector and ease compliance burden for small and medium enterprises.\n\n</p><p>It is expected that all elements of the strategy would be undertaken and completed over a five-year period (2018-23).\n</p><p>\"The rapid growth of the Indian economy, its size and emerging relevance in global trade, makes it essential to establish a robust quality ecosystem in India with a harmonised, dynamic and mature standards framework,\" according to the strategy paper.\n</p><p>The strategy would focus on four areas - standards development, conformity assessment and accreditation, technical regulations, and awareness and education.\n</p><p>It intends to develop a comprehensive ecosystem for standards and quality development besides using standards for providing a level-playing field to domestic industry and enhancing the competitiveness of Indian goods and services in domestic and global markets.\n</p><p>Releasing the strategy, Commerce Minister Suresh Prabhu said at a CII function that standards of goods and services would help promote exports and boost the domestic economy.\n</p><span>The implementation of the strategy would be monitored by a high-level committee with quarterly reviews.\n</span><br><span>\n</span><br><span>As part of standards development, it has set eight goals including the convergence of all standards development activities in India, harmonising standards with international norms, and development of services sector standards.\n</span><br><span>\n</span><br><span>\"The topic of standardisation in services is relatively new and is also weakly addressed in trade law...with services accounting for a major share in the Indian and global economy, there is an urgent need to develop standards in services,\" it said.\n</span><br><span>\n</span><br><span>It has also proposed to set up a national task force with the mandate to identify the service quality gaps in the 12 champion sectors, including IT and communication.\n</span><br><span>\n</span><p>Further, it said that to expand the outreach of the products for a global audience, the 'brand India' label would need to be significantly large in scale, and operated on professional lines.\n</p><span>\n</span></div></div>"
    },
    "adjectives": [
        "medium",
        "developing",
        "10",
        "left",
        "top",
        "right",
        "quality",
        "small"
    ],
    "nouns": [
        "India",
        "india",
        "medium",
        "boost",
        "sector",
        "compliance",
        "government",
        "photo",
        "economy",
        "product",
        "developing",
        "strategy",
        "margin",
        "standardisation",
        "border",
        "brand",
        "10",
        "ease",
        "business",
        "left",
        "style",
        "top",
        "right",
        "today",
        "quality",
        "plan",
        "services",
        "burden",
        "small"
    ],
    "verbs": [
        "boost",
        "promote",
        "border",
        "brand",
        "ease",
        "align",
        "style",
        "top",
        "right",
        "plan",
        "burden"
    ]
}