{
    "title": "India will add 225 GW renewable energy by 2022: Power Minister",
    "link": "https://www.business-standard.com/article/economy-policy/india-will-add-225-gw-renewable-energy-by-2022-power-minister-118060501021_1.html",
    "pubDate": "Tue, 05 Jun 2018 23:10:00 +0530",
    "content": "Coal shortage due to lack of other energy sources",
    "contentSnippet": "Coal shortage due to lack of other energy sources",
    "guid": "https://www.business-standard.com/article/economy-policy/india-will-add-225-gw-renewable-energy-by-2022-power-minister-118060501021_1.html",
    "isoDate": "2018-06-05T17:40:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "india",
            "will",
            "add",
            "225",
            "gw",
            "renewable",
            "energy",
            "by",
            "2022",
            "power",
            "minister"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "India will add 225 GW renewable energy by 2022: Power Minister",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tBuoyant with rapid growth of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=renewable+energy\" target=\"_blank\">renewable energy </a>in India, the government is aiming to add 225 Gw by 2022. Addressing a press conference on Tuesday on four years of achievements of the BJP government in the power and renewable sector, Union Minister of State for Power and New &amp; <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=renewable+energy\" target=\"_blank\">Renewable Energy </a><a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=r+k+singh\" target=\"_blank\">R K Singh </a>said India would achieve the earlier target of 175-Gw in the next two years.</p>\n<p>\n\t“India’s current renewable-based power capacity stands at 70 Gw, and we will cross the 175-Gw target well before 2022. We have new schemes like offshore wind, floating solar, which will help us over-achieve the current target,\" said Singh.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tEnlisting the achievements, the minister said after 48 years of achievements of the other governments, the 48 months of the current government was an “eye opener”.</p>\n<p>\n\t\"We added a 24,000 Mw power generation capacity per year, compared to 4,800 Mw by earlier governments. Besides, a 25,000 circuit km transmission capacity was added per year, compared to 3,400 ckm during the previous governments,\" he said.</p>\n<p>\n\tOn complaints of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=coal+shortage\" target=\"_blank\">coal shortage </a>by power plants, Singh said there was pressure on coal-based power generation as other sources were not operating at the optimum level. \"Hydro-capacity is not up to the mark as snow melting has been slow. So wind is the resource helping during peak demand. Power demand has increased, and that is a good sign. We are in discussion with the coal and railways ministries every day for maintaining regular coal supply,\" said Singh.</p>\n<p>\n\tHe said 400 million households without electricity would have power connection by December this year, as against the March 2019 deadline under the SAUBHAGYA scheme. On the financial and operational health of state-owned power distribution companies, the minister said interest cost of more than Rs 200 billion  was saved by discoms under the scheme, whereas technical and commercial losses had been reduced in 17 states within one year of operation.</p>\n<p>\n\tThe minister enlisted 11 stressed power assets, which are under the resolution scheme by the banks.</p>\n<p>\n\tThis paper reported the same recently.</p>\n\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "renewable",
        "due"
    ],
    "verbs": [
        "will",
        "add",
        "Power",
        "Minister",
        "Coal",
        "lack"
    ],
    "nouns": [
        "India",
        "will",
        "add",
        "energy",
        "Power",
        "Minister",
        "shortage",
        "due",
        "lack",
        "Coal"
    ]
}