{
    "title": "Bad bank = Bad idea: There's dubious merit in a rehab clinic for toxic debt",
    "link": "https://www.business-standard.com/article/finance/bad-bank-bad-idea-there-s-dubious-merit-in-a-rehab-clinic-for-toxic-debt-118061201352_1.html",
    "pubDate": "Tue, 12 Jun 2018 21:27:00 +0530",
    "content": "The whole point of having a bad bank is to discover and recover the steady-state economic value of assets that may be currently depressed",
    "contentSnippet": "The whole point of having a bad bank is to discover and recover the steady-state economic value of assets that may be currently depressed",
    "guid": "https://www.business-standard.com/article/finance/bad-bank-bad-idea-there-s-dubious-merit-in-a-rehab-clinic-for-toxic-debt-118061201352_1.html",
    "isoDate": "2018-06-12T15:57:00.000Z",
    "sentiment": {
        "score": -13,
        "comparative": -0.8666666666666667,
        "tokens": [
            "bad",
            "bank",
            "",
            "bad",
            "idea",
            "there's",
            "dubious",
            "merit",
            "in",
            "a",
            "rehab",
            "clinic",
            "for",
            "toxic",
            "debt"
        ],
        "words": [
            "debt",
            "toxic",
            "dubious",
            "bad",
            "bad"
        ],
        "positive": [],
        "negative": [
            "debt",
            "toxic",
            "dubious",
            "bad",
            "bad"
        ]
    },
    "article": {
        "title": "Bad bank = Bad idea: There's dubious merit in a rehab clinic for toxic debt",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tBad ideas keep returning to the corridors of power in New Delhi with the unfailing regularity of migratory birds. This year is no exception. According to media reports, some kind of a state-blessed asset manager to take over the distressed assets of Indian lenders is being considered again.</p>\n<p>\n\tThe proposal to set up a <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bad-bank\" target=\"_blank\">bad bank </a>looked senseless even when it was first mooted in early 2016. It looked downright silly when the <a class=\"storyTags\" href=\"https://www.business-standard.com/finance\" target=\"_blank\">finance </a>ministry floated the idea of raiding the central bank’s reserves to run the rehab clinic for toxic debt.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tAs much as 90 percent of nonperforming assets are with state-run <a class=\"storyTags\" href=\"https://www.business-standard.com/category/finance-news-banks-1030101.htm\" target=\"_blank\">banks.</a> Suppose they’re asked to unload the mess into something like Sareb, the Spanish <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bad-bank\" target=\"_blank\">bad bank </a>whose shareholders include <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=banco+santander+sa\" target=\"_blank\">Banco Santander SA </a>and CaixaBank SA, among others. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=sareb\" target=\"_blank\">Sareb </a>investors are set to lose 73 percent of their original investment. If the same happens to Indian lenders’ equity, taxpayers might end up paying over and above the $32 billion recapitalization for which they’re already on the hook.</p>\n<p>\n\tThe whole point of having a <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bad-bank\" target=\"_blank\">bad bank </a>is to discover and recover the steady-state economic value of assets that may be currently depressed. In Sareb’s case, the task was relatively easy because boom-bust cycles in real estate – the recipient of Spain’s lending binge – are fairly predictable, certainly more so than the economics of Indian power plants. (About 12 percent of the country’s total power generation capacity is in financial distress.)</p>\n<p>\n\t<strong>Skeletons Still in the Closet</strong></p>\n<p>\n\tBesides, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=sareb\" target=\"_blank\">Sareb </a>assumed the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/loans\" target=\"_blank\">loans </a>of savings <a class=\"storyTags\" href=\"https://www.business-standard.com/category/finance-news-banks-1030101.htm\" target=\"_blank\">banks </a>after a 45.6 percent reduction in their carrying value. To compensate the proposed Indian bad bank for under-recovery risk, exposing lenders to a haircut of even 50 percent may not be adequate, according to Jefferies analysts Nilanjan Karfa and Harshit Toshniwal. Given just how capital-starved some of the 21 state-run <a class=\"storyTags\" href=\"https://www.business-standard.com/category/finance-news-banks-1030101.htm\" target=\"_blank\">banks </a>are, having them book steep upfront losses on sales would necessitate immediate consolidation or, in some cases, closure. That would mean taking on powerful unions.</p>\n<p>\n\tThe maneuver makes sense only if unclogging balance sheets restores lenders’ profitability to a point where they can absorb future losses on their bad-bank investment. With a respected former central bank governor saying that confidence in state-controlled lenders is at a historic low, miracles can’t be the base-case scenario.</p>\n<p>\n\tBesides, for a decisive turnaround, there must be parallel efforts to improve governance, risk management and underwriting standards. The urgency with which politicians and bureaucrats are looking for a solution is directly proportional to the existential threat to India’s government-dominated banking sector. Take away the hanging sword, and the pressure to reform may also ebb.</p>\n<p>\n\t<strong>Lost Decade</strong></p>\n<p>\n\tSo why then a bad bank? A year has elapsed, and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bankruptcy\" target=\"_blank\">bankruptcy </a>resolution, which was supposed to take no more than 270 days, has so far been successful with only two large debtors out of an original list of a dozen. Meanwhile, the central bank – the regulator – has taken away lenders’ leeway to extend and pretend. They’re now being forced to make aggressive loan-loss provisions. But where’s the money? Hardening yields are inflicting mark-to-market losses on state-run banks’ outsize holdings of government debt, crimping their ability to climb out of the hole.</p>\n<p>\n\tA bad bank will buy some time, and give the impression something is being done. With general elections due next year, this looks like a politically expedient proposal of dubious economic merit.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "whole",
        "Bad",
        "bad",
        "dubious",
        "toxic",
        "steady",
        "economic",
        "depressed"
    ],
    "nouns": [
        "whole",
        "assets",
        "bank",
        "state",
        "value",
        "may",
        "There",
        "idea",
        "point",
        "Bad",
        "bad",
        "merit",
        "clinic",
        "debt",
        "steady"
    ],
    "verbs": [
        "recover",
        "bank",
        "state",
        "value",
        "discover",
        "point",
        "merit",
        "steady"
    ]
}