{
    "title": "LIC may enter banking space; eyes majority stake in IDBI Bank",
    "link": "https://www.business-standard.com/article/finance/lic-may-enter-banking-space-eyes-majority-stake-in-idbi-bank-118062600788_1.html",
    "pubDate": "Tue, 26 Jun 2018 19:18:00 +0530",
    "content": "While a final decision is yet to emerge on whether LIC would be snapping up over 50 per cent stake in IDBI Bank, official sources said the preliminary contours of such a plan is being worked out",
    "contentSnippet": "While a final decision is yet to emerge on whether LIC would be snapping up over 50 per cent stake in IDBI Bank, official sources said the preliminary contours of such a plan is being worked out",
    "guid": "https://www.business-standard.com/article/finance/lic-may-enter-banking-space-eyes-majority-stake-in-idbi-bank-118062600788_1.html",
    "isoDate": "2018-06-26T13:48:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "lic",
            "may",
            "enter",
            "banking",
            "space",
            "eyes",
            "majority",
            "stake",
            "in",
            "idbi",
            "bank"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "LIC may enter banking space; eyes majority stake in IDBI Bank",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\tInsurance behemoth <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/lic\" target=\"_blank\">LIC </a>is looking to enter the banking space by acquiring majority stake in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/idbi\" target=\"_blank\">IDBI </a>Bank as the deal is expected to provide business synergies despite the lender's stressed balance sheet, sources said.</p>\n<p>\n\tAs the government makes efforts to revive the fortunes of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/idbi\" target=\"_blank\">IDBI </a>Bank, which is saddled with huge amounts of bad loans, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/lic\" target=\"_blank\">LIC </a>becoming a major stakeholder in the lender could be beneficial for both state-owned financial players in the long run, they added.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tWhile a final decision is yet to emerge on whether <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/lic\" target=\"_blank\">LIC </a>would be snapping up over 50 per cent stake in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/idbi\" target=\"_blank\">IDBI </a>Bank, official sources said the preliminary contours of such a plan is being worked out.</p>\n<p>\n\tA possible scenario would be the insurance major making IDBI Bank as a subsidiary on the line of its housing <a class=\"storyTags\" href=\"https://www.business-standard.com/finance\" target=\"_blank\">finance </a>and mutual fund businesses.</p>\n<p>\n\tAccording to the sources, there would be business synergies in case the LIC-IDBI Bank deal materialises.</p>\n<p>\n\tA listed entity, IDBI Bank is grappling with mounting toxic loans with gross non performing assets rising to a staggering Rs 556 bn at the end of latest March quarter. During the three months, the lender's net loss stood at Rs 56.63 bn.</p>\n<p>\n\tThe bank has a market capitalisation of nearly Rs 230 bn while its real estate assets as well as its investment portfolio are estimated to be worth over Rs 200 bn.</p>\n<p>\n\tAmong its non-core assets are investments in the National Stock Exchange, IDBI Federal Life Insurance IDBI Mutual Fund, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=idbi+capital+markets\" target=\"_blank\">IDBI Capital Markets </a>and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=national+securities+depository+ltd\" target=\"_blank\">National Securities Depository Ltd.</a></p>\n<p>\n\tTaking into consideration these factors, the current valuation of the bank does not reflect its \"inherent fundamentals\" and at this juncture, it would be a better proposition to rope in a state-owned entity as a strategic investor, the sources said.</p>\n<p>\n\tShares of the bank slumped nearly 7 per cent to close at Rs 54.50 on the BSE today.</p>\n<p>\n\tOn Monday, a senior <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/finance-ministry\" target=\"_blank\"></a><a class=\"storyTags\" href=\"https://www.business-standard.com/finance\" target=\"_blank\">Finance </a>Ministry official had said that both LIC and IDBI Bank have independent boards, which would take a call on the possible deal.</p>\n<p>\n\tIn his Budget speech for 2016-17, then <a class=\"storyTags\" href=\"https://www.business-standard.com/finance\" target=\"_blank\">Finance </a>Minister Arun Jaitley had said the process of transformation of IDBI Bank has already started. \"Government will take it forward and also consider the option of reducing its stake to below 50 per cent,\" he had said.</p>\n<p>\n\tIDBI Bank has already done valuation of its real estate assets at the market price, sources said.</p>\n<p>\n\tThey noted that in a stake sale, the government would not get the proceeds and the money would be utilised for the bank's revival. It could happen through issuance of fresh equity so that the government's stake which is presently at 80.96 per cent would come down below 50 per cent as announced in the Budget.</p>\n<p>\n\tSources said some private sector players are also eyeing strategic stake in IDBI Bank at lower valuations.</p>\n<p>\n\tAccording to market analysts, private insurance companies might be wary of LIC entering banking space as that could further bolster the presence of the state insurer since IDBI Bank's bancassurance would bring in captive customers but also increase their sale points through the branches.</p>\n<p>\n\tAnalysts also opined that going forward, IDBI Bank investors are likely to see good appreciation of their investments due to various factors, including resolution of bad loans.</p>\n<p>\n\tLast year, Jaitley had said that India is not ready for privatisation of public sector <a class=\"storyTags\" href=\"https://www.business-standard.com/category/finance-news-banks-1030101.htm\" target=\"_blank\">banks </a>and their present characteristics would continue except for IDBI Bank.</p>\n<p>\n\tEarlier this year, the government infused Rs 106.10 bn into IDBI Bank.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "final",
        "preliminary",
        "official",
        "50"
    ],
    "nouns": [
        "banking",
        "Bank",
        "final",
        "stake",
        "cent",
        "may",
        "preliminary",
        "plan",
        "official",
        "majority",
        "50",
        "decision",
        "space",
        "eyes",
        "While"
    ],
    "verbs": [
        "Bank",
        "stake",
        "emerge",
        "plan",
        "enter",
        "space"
    ]
}