{
    "title": "Govt puts off debt-laden Air India stake sale for now; to fund operations",
    "link": "https://www.business-standard.com/article/economy-policy/govt-puts-off-debt-laden-air-india-stake-sale-for-now-to-fund-operations-118061900379_1.html",
    "pubDate": "Tue, 19 Jun 2018 14:01:00 +0530",
    "content": "The government is looking at turning around the company to ensure that it makes profits on an overall basis",
    "contentSnippet": "The government is looking at turning around the company to ensure that it makes profits on an overall basis",
    "guid": "https://www.business-standard.com/article/economy-policy/govt-puts-off-debt-laden-air-india-stake-sale-for-now-to-fund-operations-118061900379_1.html",
    "isoDate": "2018-06-19T08:31:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "govt",
            "puts",
            "off",
            "debt-laden",
            "air",
            "india",
            "stake",
            "sale",
            "for",
            "now",
            "to",
            "fund",
            "operations"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Govt puts off debt-laden Air India stake sale for now; to fund operations",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tThe government has decided not to go ahead with <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/air-india-stake-sale\" target=\"_blank\">Air India stake sale </a>in an election year and will provide required funds for its operations, a senior official said on Tuesday.</p>\n<p>\n\tThe decision comes less than 3 weeks after the proposed 76 per cent strategic stake sale in debt-laden national carrier failed to attract any bidder.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tAir India will very soon get funds from the government for its day to day operations and will even place orders for a couple of aircraft, the government official said.</p>\n<p>\n\tThe decision was taken at the high-level meeting convened by Union Minister Arun Jaitley yesterday. The meeting was attended by Piyush Goyal, who has been temporarily given the charge of the finance ministry, Civil Aviation Minister Suresh Prabhu, Transport Minister <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nitin-gadkari\" target=\"_blank\">Nitin Gadkari </a>and other senior officials of finance and civil aviation ministries.</p>\n\n<p>\n\t\"The airline is posting operational profits. None of the flights goes empty. With all the cost-efficient mechanism in place, we will continue improving its operational efficiency. There is no need to rush in for disinvestment as of now,\" the official told <em>PTI</em>.</p>\n<p>\n\tThe government is looking at turning around the company to ensure that it makes profits on an overall basis before going in for listing.</p>\n<p>\n\t\"Certain conditions have to be met before listing a company. Once Air India fulfils those, we will go in for an initial public offering and subsequent listing,\" the source said.</p>\n\n<p>\n\tAccording to Sebi norms, a company has to post a profit in previous three financial years before it can list itself in the stock exchanges.</p>\n<p>\n\t\"The focus is on improving operational efficiency. We will continue to boost employee morale, starting from the top level, to better the functioning of the airline. Funds would be provided as and when required,\" the source added.</p>\n<p>\n\tThe government had originally proposed to offload 76 per cent equity share capital of the national carrier as well as transfer the management control to private players. The buyer would have had to take over Rs 240 billion debt or the carrier along with over Rs 80 billion of liabilities.</p>\n<p>\n\tHowever, the stake sale failed to attract any bidders when the bidding process got completed on May 31.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "off",
        "overall",
        "laden",
        "looking"
    ],
    "nouns": [
        "India",
        "fund",
        "company",
        "government",
        "profits",
        "stake",
        "Air",
        "operations",
        "overall",
        "basis",
        "debt",
        "sale",
        "looking",
        "turning"
    ],
    "verbs": [
        "fund",
        "off",
        "company",
        "stake",
        "Air",
        "laden",
        "ensure"
    ]
}