{
    "title": "Explained in 9 charts: How India got thousands of railway passengers to fly",
    "link": "https://www.business-standard.com/article/economy-policy/explained-in-9-charts-how-india-got-thousands-of-railway-passengers-to-fly-118060500228_1.html",
    "pubDate": "Tue, 05 Jun 2018 12:14:00 +0530",
    "content": "A mix of clever railway ticket pricing and fortunate global conditions pushed thousands of Indians to start flying",
    "contentSnippet": "A mix of clever railway ticket pricing and fortunate global conditions pushed thousands of Indians to start flying",
    "guid": "https://www.business-standard.com/article/economy-policy/explained-in-9-charts-how-india-got-thousands-of-railway-passengers-to-fly-118060500228_1.html",
    "isoDate": "2018-06-05T06:44:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "explained",
            "in",
            "9",
            "charts",
            "how",
            "india",
            "got",
            "thousands",
            "of",
            "railway",
            "passengers",
            "to",
            "fly"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Explained in 9 charts: How India got thousands of railway passengers to fly",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>There are a few things about the Indian railways’ performance and the boom in India’s <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/aviation-sector\" target=\"_blank\">aviation sector </a>under the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/narendra-modi\" target=\"_blank\">Narendra Modi </a>government that catch the eye.</p><p>\nFor one, in an unprecedented development, the number of rail passengers travelling in 2nd AC compartments in 2016-17 saw a steep decline from a year earlier. Secondly, fewer people have been using the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/indian-railways\" target=\"_blank\">Indian Railways </a>services than during the last few years of the Manmohan Singh-led United Progressive Alliance (UPA) government.</p><p>\nThirdly, the exponential growth seen in the number of India’s <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/air-travellers\" target=\"_blank\">air travellers </a>lately has as much to do with the pricing of railway tickets as with rising incomes and falling jet fuel prices leading to air tickets being more affordably priced.</p><p>\nAnd, finally, if India’s per capita income continues to increase at the pace it has over the past decade, and airlines continue to price tickets within the levels of decency – in addition to <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/indian-railways\" target=\"_blank\">Indian Railways </a>aiding airlines by providing poor services on trains despite rail tickets costing almost the same as air fares – there is little doubt that more Indians will pay a bit more and fly.</p><p>\nSo, how were Indians forced to abandon railway tracks and take to the skies in greater numbers? The following nine charts will answer this question in greater detail: <br><strong>India is flying, and so are Indians </strong><br></p>\n<!-- INPAGE_BANNER -->\n <br>There was a considerable dip in railway ridership on the broad gauge across all divisions during the first year of the Modi government. Even though the dip was reversed the following the year, the number of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=railway+passengers\" target=\"_blank\">railway passengers </a>in 2016-17 was still lower than in recent past. At the same time the number of air passengers in India rose quite sharply. The chart shows that at least a part of lost ridership of the railways could have potentially migrated to airlines.<p>\n<strong>No train. No cry. Just fly</strong><br>One of the most striking aspects of the stagnating ridership of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/indian-railways\" target=\"_blank\">Indian railways </a>is the fall in not just the number of 2nd class (sleeper) passengers in ordinary trains – the most used class of travel – but also a decline in the number of 2nd AC passengers in 2016-17. This indicates that at least some passengers preferred to book air tickets rather than similarly priced railway tickets in 2nd AC. The decline is also prominently visible in the second sleeper class of travel in ordinary trains. The chart captures these trends along with a significant rise in the number of 3rd AC passengers over the past few years.</p><p>\n<strong>Declining ridership but increasing revenue</strong><br>Even though the number of 2nd AC passengers declined by almost 3 per cent in 2016-17, the Indian Railways earned 5 per cent more from passengers travelling in this class. This trend of rising revenues in the face of declining ridership further indicates that <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=railway+passengers\" target=\"_blank\">railway passengers </a>are closely evaluating the trade-off among cost, time and convenience while making a decision to either travel in higher AC class by train or quite simply flying to their destination. A similar trend is visible in the sleeper class of ordinary trains. The chart below shows how revenues in all classes have increased even though the ridership has increased only in certain classes.</p><p>\n<strong>More proof – Rising cost of train travel </strong><br>While many <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=railway+passengers\" target=\"_blank\">railway passengers </a>have often noted the spiralling cost of train travel after the introduction of dynamic fares by the Modi government, there is little doubt that travelling by train has become more expensive over the years. As the ensuing chart shows, ticket prices across classes have increased by 48 per cent since 2011-12. Surprisingly, the highest increase in fares has been in the most used sleeper class of travel. Ironically, 1st AC, the highest class of train travel, which is also the most expensive, has recorded the lowest increase in fares during the same period.</p><p>\n<strong>Modi vs Manmohan: Who made rail tickets expensive? </strong><br>The chart above demonstrated the rise in railway fares over a period of time. But a further analysis of the rise would show that railway fares were hiked substantially during the last three years of the erstwhile Manmohan Singh-led UPA-2 government. Since 2014, when the Modi government assumed power, there have been less severe hikes in railway fares. In fact, the fares in the highest and most expensive class of travel have actually declined by as much as six per cent.</p><p>\n<strong>Enter the airlines</strong><br>So, even as railway tickets became more expensive, the gravitation of higher class of railway passengers to airlines was accentuated by the falling cost of air travel. The following chart reveals that the operational revenue per passenger per kilometre of all airlines started falling from 2013-14. The fall in operational revenue per passenger is a fair indicator of the declining cost of air tickets. Also note the decline in operational expenses of all airlines per passenger per kilometre, which was to a large extent helped by declining aviation turbine fuel (ATF) costs (shown in the last chart).</p><p>\n<strong>In perspective: Railway tickets vs airline tickets </strong><br>While there is and will always be a significant gap between the cost of railway and air travel, the scenario in India has quite simply shifted in airlines’ favour. Juxtaposing the average cost of ticket per passenger per kilometre in railways with that of airlines gives a bird’s eye view of this assertion. As shown by the chart below, the trend in railway ticket pricing saw a steady rise every year. The trend in airline pricing suggests declining ticket costs over time. At least for the moment.</p><p>\n<strong>More proof: More people fly and revenues zoom </strong><br>The buoyancy in airline travel is vindicated by the astronomical rise in the revenues of all <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=airlines+in+india\" target=\"_blank\">airlines in India.</a> Compare this to the growth in railway revenue and the story becomes clearer. A crucial aspect of the boom in airline flyers is the ever increasing passenger load factor of airlines. The chart below shows that while airlines’ passenger revenues in 2016-17 saw a 9.3 per cent year-on-year rise, the revenue increase for railways during the year seemed more modest at 4.8 per cent.</p><p>\n<strong>So what’s the real answer? </strong><br>As you have seen till now, railway ticket pricing played a crucial role in pushing more people to take to the skies. So did the falling cost of air travel. One cannot only credit higher railway ticket pricing for this shift. So, what caused this fall in cost of air travel in India? Two things: the declining cost of ATF and rising per capita incomes. As the chart below will show, lower fuel prices meant cheaper air tickets and rising per capita incomes meant more people with the pockets to shell out money for airline tickets. But the tide is turning and the ATF price is again going skywards, in line with global crude oil prices. The question is, with both air travel and railway travel becoming more expensive, what will the traveller do now? More importantly, will the Modi government reduce railway ticket prices, if not for the common man, at least for his party’s chances in the 2019 Lok Sabha elections?\n</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "fly",
        "flying",
        "clever",
        "fortunate",
        "global"
    ],
    "nouns": [
        "railway",
        "India",
        "fly",
        "flying",
        "A",
        "mix",
        "pricing",
        "conditions",
        "start",
        "ticket"
    ],
    "verbs": [
        "fly",
        "mix",
        "ticket",
        "start"
    ]
}