{
    "creator": "Shubham Verma",
    "title": "Oppo Find X shows why notches shouldn’t be there on 2018 bezel-less phones",
    "link": "https://www.financialexpress.com/industry/technology/oppo-find-x-shows-why-notches-shouldnt-be-there-on-2018-bezel-less-phones/1212218/",
    "pubDate": "Tue, 19 Jun 2018 17:56:04 +05:30",
    "dc:creator": "Shubham Verma",
    "content": "Oppo Find X looks like Samsung Galaxy S9+ because of its edge-to-edge OLED display, which gives a resolution of 1080 pixels",
    "contentSnippet": "Oppo Find X looks like Samsung Galaxy S9+ because of its edge-to-edge OLED display, which gives a resolution of 1080 pixels",
    "guid": "https://www.financialexpress.com/?p=1212218",
    "categories": [
        "Industry",
        "Technology"
    ],
    "isoDate": "2018-06-19T12:26:04.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "oppo",
            "find",
            "x",
            "shows",
            "why",
            "notches",
            "shouldn’t",
            "be",
            "there",
            "on",
            "2018",
            "bezel-less",
            "phones"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Oppo Find X shows why notches shouldn’t be there on 2018 bezel-less phones",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1212239\" src=\"https://images.financialexpress.com/2018/06/oppo_find_x_the_verge.jpg\" alt=\"oppo find x, find x specs\" srcset=\"https://images.financialexpress.com/2018/06/oppo_find_x_the_verge.jpg 660w, https://images.financialexpress.com/2018/06/oppo_find_x_the_verge-300x200.jpg 300w, https://images.financialexpress.com/2018/06/oppo_find_x_the_verge-620x413.jpg 620w, https://images.financialexpress.com/2018/06/oppo_find_x_the_verge-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Oppo Find X images show the camera module that has been fitted on the top of the phone. (Source: The Verge)</figure>\n\t\t\t</section></div><span>\n</span><p>Oppo Find X, the company’s highly ambitious phone, is slated to launch in Paris today. The launch event is scheduled to begin at 8:45 pm CEST, which should be 12:15 am the next day in India. However, ahead of the launch, we have been treated with the first live images of the Oppo Find X, thanks to the folks at The Verge. The Oppo Find X is the second such phone – after Vivo Nex – to courageously let go of the notch fad – for good and for bad. The Oppo Find X comes with a slider that houses both the front and rear cameras, which enables the phone to cram a 6.4-inch display into a reasonably-sized body.</p><span>\n</span><p>The Oppo Find X images show the camera module that has been fitted on the top of the phone. While this year has been all about catching up on the notch design to make space for larger display on an otherwise proportionally sized body, Oppo has a neat workaround to ditch the notch for a motorised slider. The Oppo Find X’s cameras reside in a slider that remains hidden unless the camera app is launched.</p><span>\n</span><span>\n\t\t</span><span>\n\t</span><span>\n</span><p>Once the camera app is opened, the camera module rises from inside the phone flaunting a 25-megapixel shooter on the front while a combination of 16-megapixel and 20-megapixel shooters on the rear. Oppo says that the camera can open in 0.5 seconds, which is passable.</p><span>\n</span><p>This setup is very much similar to what Vivo did with Nex smartphone, which was launched last week, except that the rear cameras also remain hidden when not in use. The front portion of the slider also houses a 3D facial recognition module, which is the only biometric solution available on the phone – there is no fingerprint scanner on the phone (not even under the display). So, when the display of Oppo Find X is turned on followed by a swipe to unlock, the cameras pop up, scan the face and the phone is unlocked.</p><span>\n</span><p>The hidden camera slider has allowed Oppo to cram a display as large as 6.4-inch fit into the body of the phone without having to go for a notch, which some people could find as a respite. According to The Verge, the Oppo Find X looks like Samsung Galaxy S9+ because of its edge-to-edge OLED display, which gives a resolution of 1080 pixels. Not only the front is covered, the rear also sports the same curvy design. Since there is no camera on the rear panel, Oppo Find X sits flush on an even surface due to the lack of the bump.</p><span>\n</span><p>For the specifications, the Oppo Find X is powered by a Qualcomm Snapdragon 845 processor, which makes it the first Oppo phone to have a flagship chipset yet. It packs 8GB of RAM and up to 256GB of onboard storage. Oppo has been teasing the ability of the Find X to charge the battery quickly, thanks to the company’s own VOOC fast charging technology. There is a 3730mAh battery under the hood. The smartphone runs Android 8.0 Oreo-based ColorOS skin.</p><span>\n</span><p>The Oppo Find X is likely to come with global LTE capability, according to the report, since the company is launching the device in North American and European markets, in addition to its home country China, India, and a few other Asian markets. The report says that the Oppo Find X will go on sale in China starting today, while its India launch is scheduled for July 12, as the company has begun sending out media invites.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "less",
        "X"
    ],
    "nouns": [
        "Find",
        "X",
        "why",
        "bezel",
        "Galaxy",
        "edge",
        "OLED",
        "resolution",
        "display"
    ],
    "verbs": [
        "Find",
        "edge",
        "display"
    ]
}