{
    "title": "Root cause of India's banking crisis: A non-existent corporate bond market",
    "link": "https://www.business-standard.com/article/finance/root-cause-of-india-s-banking-crisis-a-non-existent-corporate-bond-market-118061900104_1.html",
    "pubDate": "Tue, 19 Jun 2018 07:52:00 +0530",
    "content": "Both banks and India Inc have incentives to stop the creation of a bond market",
    "contentSnippet": "Both banks and India Inc have incentives to stop the creation of a bond market",
    "guid": "https://www.business-standard.com/article/finance/root-cause-of-india-s-banking-crisis-a-non-existent-corporate-bond-market-118061900104_1.html",
    "isoDate": "2018-06-19T02:22:00.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.2727272727272727,
        "tokens": [
            "root",
            "cause",
            "of",
            "india's",
            "banking",
            "crisis",
            "a",
            "non-existent",
            "corporate",
            "bond",
            "market"
        ],
        "words": [
            "crisis"
        ],
        "positive": [],
        "negative": [
            "crisis"
        ]
    },
    "article": {
        "title": "Root cause of India's banking crisis: A non-existent corporate bond market",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tThis quarter, all <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/public-sector-banks\" target=\"_blank\">public sector </a><a class=\"storyTags\" href=\"https://www.business-standard.com/category/finance-news-banks-1030101.htm\" target=\"_blank\">banks </a>(PSBs) returned losses and many have sunk deeper into the quagmire of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bad-loans\" target=\"_blank\">bad loans.</a> Even the private sector banks, hitherto considered as poster boys of efficiency, have shown increased non-performing assets (NPAs) of 2 per cent to 5 per cent of their advances, with enhanced provision of Rs 1.05 trillion (doubled from Rs 436 billion from the previous year).</p>\n<p>\n\tRecent examples of conflict of interest and adventurous lending in some private sector <a class=\"storyTags\" href=\"https://www.business-standard.com/category/finance-news-banks-1030101.htm\" target=\"_blank\">banks </a>point to the fragility of their operations.</p>\n<p>\n\tPrivate <a class=\"storyTags\" href=\"https://www.business-standard.com/category/finance-news-banks-1030101.htm\" target=\"_blank\">banks </a>which took a leaf out of the page of the PSB playbook from 2010 onwards – by investing in infrastructure although often there was an asset-liability mismatch – are facing the heat too.</p>\n<p>\n\tThe Indian banking system’s <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bad-loans\" target=\"_blank\">bad loans </a>have reached Rs 10.25 trillion. <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gross-npas\" target=\"_blank\">Gross NPAs </a>have become 10.5 per cent by March 2018, up from 9.5 per cent of March 2017. It is expected that currently stressed loans can deteriorate to NPAs worth Rs 11.5 trillion or 14 per cent of advances during the present financial year.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/bond-market-awaits-signals-to-go-dovish-118060200039_1.html\" target=\"_blank\">Bond market awaits signals to go dovish</a></strong></p>\n\tThe net NPA of banks is Rs 4.95 trillion when only two-thirds of the bank assets are reviewed. The number of banks under ‘prompt corrective action’ are 34 now. This will result in the deterioration of their capital which will impact their loan growth. IBC (insolvency and bankruptcy code) cases will also add to their woes as the banks are likely to take a haircut in each case. They will have to go for higher provisioning, which reduces their headroom for increasing advances.<br>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/pti-stories/sebi-re-constitutes-panel-on-corporate-bond-market-118030700843_1.html\" target=\"_blank\">Sebi re-constitutes panel on corporate bond market to be headed by H R Khan</a></strong><br></p>\n<p>\n\tWeak credit loss absorption capacity will force the government to infuse new capital of Rs 60 billion, as some estimate. This will be in addition to Rs 90 billion infused already. The merry-go-round we see so frequently will recur again because the fundamental principles of risk control management and supervision have not been addressed yet. Already plans are afoot to amalgamate small and weak banks. The clamour for independent evaluation within RBI is going up and the chorus for the privatisation of PSBs will only grow louder.</p>\n<p>\n\tThe thing is, remedial proposals may achieve some improvement but they do not address the design flaws of corporate lending.</p>\n<p>\n\tWhat do banks do ordinarily? They essentially intermediate between the deposits that people bring in and the borrowers who take it as loan at an interest rate. Depositors are mostly common and middle-class people. The borrowers are mostly well-heeled industrialists or businessmen.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/opinion/wanted-a-vibrant-corporate-bond-market-118012401562_1.html\" target=\"_blank\">Wanted: A vibrant corporate bond market</a></strong></p>\n<p>\n\tThe bank has got two choices – one, lend a lot of money to the big guys who come with their plan. Or two, lend smaller amounts of money to a hundreds of ordinary people.</p>\n<p>\n\tIn a country like India, the small guys often get refused and the banker is happy in lending it to a few big guys. This is the beginning of lazy banking. The banker need not pursue hundreds of cases. Prima facie the big guys look credible and then they default. Earlier, the banker used to do credit restructuring which helped the banker in cleaning his books of accounts and the borrower to escape the defaulter tag when he is already a defaulter. Now, the position has changed once the Reserve Bank of India changed the rules for recast schemes. Stressed accounts therefore become visible now as non-performing assets and the banks need to make provision for them.<br><strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/finance/npa-write-offs-by-psbs-surge-140-per-cent-over-their-losses-in-fy-18-118061500644_1.html\" target=\"_blank\">NPA write-offs by PSBs surge 140 per cent over their losses in FY'18</a></strong><br></p>\n<p>\n\tSince 70 per cent of the banks are PSBs, the government cannot allow them to fail or remain non-functioning. Hence, infusion of the capital becomes inevitable. Though theoretically banks can offload part of their equity or sell their non-core assets, all these require decisions which will not be forthcoming in time. Meanwhile, PSBs continue to bleed and fall short of the Basel-III capital requirements. The government therefore further infuses funds and the lending shenanigans go on for ailing institutions, all the while allowing the to escape business process re-engineering.</p>\n<p>\n\t<strong>Banking’s original sin</strong></p>\n<p>\n\tWhat is the design problem of lending in India? After 40 per cent of the priority sector lending, banks are free to lend money to any one on business consideration. In many Western countries, big industries access funds from either equity or the bond market. Banks do not lend them money beyond working capital requirement. In India, under the pretext that the bond market is not developed, they access it from the commercial banks.<br></p>\n<p>\n\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/finance/banks-to-face-bigger-challenges-than-npas-in-the-coming-years-says-sbi-118061101083_1.html\" target=\"_blank\">Banks to face bigger challenges than NPAs in the coming years, says SBI</a></strong><br></p>\n<p>\n\tOnce you access the market, you will have to provide a coupon rate reflecting risk. The need for a <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/corporate-bond-market\" target=\"_blank\">corporate bond market </a>for diversifying risk, enhancing financial stability and for better matching risk-return preferences of the borrowers cannot be more emphasised. Since corporate loans from <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/indian-banks\" target=\"_blank\">Indian banks </a>are easy to get, investors like Essar and Videocon find it better to access banks rather than going to a bond market. With India’s formal economy being fairly developed, it is surprising that a bond market has not developed.</p>\n<p>\n\tTruth be told, on the lending side, bankers have an incentive to stall any attempt to develop this market. And on the borrowing side, investors have no incentive or interest to access a bond market. After all, where else can an investor get loans, default on them, get those loans restructured and then go for a one-time settlement or declare bankruptcy?<br></p>\n<p>\n\tWhile markets punish bad behaviour, when it comes to banks, corporates get away with chronic bad behaviour. The basket cases now have a dubious record of treating their investors shabbily, stopping payment of interest under court orders and short-changing them after trying their patience. Dubious promoters become preferred customers in the banks because of political intervention, corruption and possible quid pro quo. All together, this creates a lethal combination even though PSBs have so-called sound processes to prevent this.</p>\n<p>\n\tWhy can’t the rules of the game be such that there will be no lending to any industry beyond small and medium industries except for working capital? Why has this not yet happened in India? All this while start-ups, the technology industry and small and medium industries are starved for funds in the process.</p>\n<p>\n\tConsequently, predatory carpet baggers have prospered at the cost of the common depositor. The middle class and the common folks lose money when banks fail and their money in taxes gets used up as capital infusion when banks are not allowed to fail. Cheating – euphemistically called ‘getting more for less’ – is a primordial human preference.</p>\n<p>\n\tPublic institutions India have become victims of robber-baron-era practices. How else do you explain recent lending to a diamantaire – fraudulent lending that no self-respecting international bank would have done – was done in a hurry by several banks including a private bank?</p>\n<p>\n\tEven though it is inherently risky and no rational and transparent evaluation is possible – private sector banks do not do it usually – instances of such aggressive lending are surfacing. What would happen if that same money – which goes to big industrialists, ends up as an NPA and results in a tax on depositors – had been left lying idle? What would have been the result? Some of it could have gone to SMEs, where most jobs are created, or to agriculture where the investment would have mitigated India’s agrarian distress. That money could have even gone towards self-help groups where it would have helped in reducing poverty of several millions. Dependence on money lenders and usurious interest rates would have come down.</p>\n<p>\n\tAssuming some amount of the deposit money would not have been deployed at all, it would have resulted in more money chasing less proposals resulting in a lessening of the cost of funds and reduction of the cost of borrowing. All these would have been welfare and equality enhancing.</p>\n<p>\n\tNow with an effective credit squeeze around the corner, this is the time to give a big push for the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/corporate-bond-market\" target=\"_blank\">corporate bond market </a>to find its feet.</p>\n<p>\n\tA bond market will help in diversifying <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=credit+risk\" target=\"_blank\">credit risk </a>away from the banks by spreading it across the economy and by shielding the banking sector at the time of stress. It functions like a second line of defence when the banks’ balance sheet is weak and they are likely to <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ration+credit\" target=\"_blank\">ration credit.</a></p>\n<p>\n\tA well-functioning bond market can lead to efficient pricing of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=credit+risk\" target=\"_blank\">credit risk </a>as expectations of all bond market participants are incorporated into the bond price. It will also help in infrastructure financing and development of municipal bond market. India already has a well-developed G-sec market which provides benchmark yield curve for bond pricing. It also has a well-functioning depository system, a credible system of rating and adequate legal framework necessary for the development of bond market.</p>\n<p>\n\tWith a robust bankruptcy framework in place and more money chasing market instruments, the potential risks are mitigated. A comprehensive insolvency regime for the banks and financial institutions needs to be expedited. It is likely that most banks looking to meet Basel II norms will also need to float bonds. All this can happen if the tap is closed for <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bank-loans\" target=\"_blank\">bank loans </a>for big-ticket items and SEBI and the Centre push for a bond market regardless of opposition from the banks and big borrowers.</p>\n<p>\n\tA crisis provides an opportunity for reforms. Today’s <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/banking-crisis\" target=\"_blank\">banking crisis </a>has embedded in it possibility of change from business as usual. When the focusing event of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/banking-crisis\" target=\"_blank\">banking crisis </a>exists, can the policymakers make the political stream, problem stream and policy stream to interact to create policy windows for the creation of bond market and restricting lending to bigger industries and enterprises?</p>\n<p>\n\tThis changes the incentives for Great Indian Bank Robbery which we are currently witnessing.</p>\n<p>\n\tInstead of tinkering with the rules of the game, forcing the big borrowers to access the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/corporate-bond-market\" target=\"_blank\">corporate bond market </a>rather than banks will change the game.<br></p><hr>\n\t<em><strong>Published in arrangement with The Wire</strong></em>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "existent",
        "corporate",
        "Both"
    ],
    "nouns": [
        "banking",
        "banks",
        "Inc",
        "creation",
        "stop",
        "bond",
        "India",
        "market",
        "crisis",
        "Root",
        "cause",
        "A"
    ],
    "verbs": [
        "stop",
        "bond",
        "market",
        "Root",
        "cause"
    ]
}