{
    "title": "Dollar nearing peak but oil remains a headwind: Morgan Stanley's Garner",
    "link": "https://www.business-standard.com/article/economy-policy/dollar-nearing-peak-but-oil-remains-a-headwind-morgan-stanley-s-garner-118061200809_1.html",
    "pubDate": "Tue, 12 Jun 2018 16:34:00 +0530",
    "content": "In a Q&A, the Asia and emerging market equity strategist at Morgan Stanley says India is losing out to other EMs on metrics such as dividend yield and valuations",
    "contentSnippet": "In a Q&A, the Asia and emerging market equity strategist at Morgan Stanley says India is losing out to other EMs on metrics such as dividend yield and valuations",
    "guid": "https://www.business-standard.com/article/economy-policy/dollar-nearing-peak-but-oil-remains-a-headwind-morgan-stanley-s-garner-118061200809_1.html",
    "isoDate": "2018-06-12T11:04:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "dollar",
            "nearing",
            "peak",
            "but",
            "oil",
            "remains",
            "a",
            "headwind",
            "morgan",
            "stanley's",
            "garner"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Dollar nearing peak but oil remains a headwind: Morgan Stanley's Garner",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/morgan-stanley\" target=\"_blank\">Morgan Stanley </a>forecasts <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/oil-price\" target=\"_blank\">oil price </a>to move beyond $90 a barrel. <strong>Jonathan Garner</strong>, the chief Asia and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/emerging-market\" target=\"_blank\">emerging market </a>(EM) equity strategist at Morgan Stanley, tells <strong>Jash</strong><strong> Kriplani </strong>the dollar could be nearing its peak but oil remains a headwind for India and that the country loses out to other EMs on metrics such as dividend yield and valuations. <strong>Edited excerpts: </strong></p>\n<p>\n\t<strong>Your global strategy mid-year outlook is titled 'The End of Easy'. Can you explain what exactly you mean by this?</strong>\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/central-bank\" target=\"_blank\">Central bank </a>policy dynamics are changing significantly, globally. We are entering a period where the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/us-fed\" target=\"_blank\">US Fed </a>is trying to reduce the size of its balance-sheet for the first time since the 2008 <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/global-financial-crisis\" target=\"_blank\">global financial crisis.</a> Other central banks are also tightening, particularly in China, where the People’s Bank of China (PBoC) is engaged in increasing interest rates and is also reducing the size of the shadow banking sector. We can see credit growth slowing down there. Risk assets that had been doing well for the last nine years with the exception of a brief interruption in 2015-2016 and some headwinds emerging from European sovereign crisis, are finding the going much tougher. <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/corporate-earnings\" target=\"_blank\">Corporate earnings </a>and economic activity had been seeing a strong sustained recovery from the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/global-financial-crisis\" target=\"_blank\">global financial crisis.</a> However, this is unlikely to continue. We are already seeing this happening in Asia and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/emerging-markets\" target=\"_blank\">emerging markets.</a> Overly-bullish consensus earnings estimates are starting to come under pressure. This often happens late in the cycle that the bottom-up analysts’ estimates move to a euphoric territory. The challenges are piling up. The widening of credit spreads in US, its effects on <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/emerging-markets\" target=\"_blank\">emerging markets </a>and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/emerging-market\" target=\"_blank\">emerging market </a>currencies, the US dollar reversing its course from being weak to now becoming strong since the beginning of the year. All of this means a less easy environment for risk assets such as equities. From the very low levels last year, the volatility in the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/emerging-markets\" target=\"_blank\">emerging markets </a>has more than doubled.</p>\n<p>\n\t<strong>What does all of this mean for return expectations from emerging markets, particularly India?</strong></p>\n<p>\n\tAs I mentioned, we have cut our target price for MSCI EM. For the first time in over two years, we made a target price reduction earlier this year. We think it is time to be strategically cautious about the market. We have a small overweight on India, as we expect earnings growth to pick up significantly from here. If you look at earnings growth, most emerging markets are expected to see a slowdown. India, which witnessed a slowdown last year, is expected to see 20 per cent back-to-back earnings growth in FY19 and FY20. For emerging markets, whose earnings grew 30 per cent in FY18, we expect to see a deceleration to 10 per cent in FY19 and then five per cent FY20. Indian headline earnings were not very strong due to various reasons, ranging from fiscal tightening, GST, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/demonetisation\" target=\"_blank\">demonetisation </a>and banking sector reforms. However, with the difficult part now behind, the earnings cycle should come through in a decisive manner.</p>\n<p>\n\t<strong><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/morgan-stanley\" target=\"_blank\">Morgan Stanley </a>has drastically cut its overweight position on India in the past one year. What are the key reasons for the change </strong><strong>in stance</strong><strong>? Is there a possibility that you will go down further?</strong></p>\n<p>\n\tWe are still overweight India but less than before. We obviously assess India versus opportunities in all other markets. One of the things we have been looking at is the sensitivity to oil that may be one of the reasons behind the recent rate hike. India has the third-highest oil-to-<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gdp\" target=\"_blank\">GDP </a>ratio among the countries in our universe. We have recently revised our <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/oil-price\" target=\"_blank\">oil price </a>forecast. Last year, we forecasted <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/oil-price\" target=\"_blank\">oil price </a>would hover around $75 a barrel. We now think oil would move around the mid-90s. So, oil remains one of the headwinds for India. While we don’t think it as a strong enough headwind that would derail India’s earnings story, it has certainly tempered our bullishness.</p>\n<p>\n\t<strong>How big is the political risk for India given the tight election calendar running up to the general elections in 2019? Do you think the ruling BJP’s defeat will be </strong><strong>big</strong><strong> setback?</strong></p>\n<p>\n\tWe are going through a very busy period for politics for emerging markets and there have been some unexpected changes. I think the reform agenda in India has been well executed. Trying to bring down the fiscal deficit has been an important feature of this reform push. Banking sector reforms, the corporate bankruptcy code, GST, Aadhaar, are some other noteworthy reforms. Whoever forms the next Government, for foreign investors it would be important that we don’t see a significant expansion in fiscal deficit because that would lead to high inflation. One of the achievements of the past few years has been the participation in financial markets from domestic investors. However, that process would slow down considerably if inflationary pressures start resurfacing. This would reduce financial savings. So, fiscal discipline would a key monitorable from foreign investors’ point of view.</p>\n<p>\n\t<strong>The Indian rupee has among the worst-performing currencies this year. What is causing it to weaken against the dollar?</strong></p>\n<p>\n\tThe dollar has been strong against most currencies and rupee is not the worst performing currency in recent weeks. The Turkish Lira, Argentine Peso and Brazilian Real have all been weakening more. It again boils down to the current account position and oil sensitivity. We think the dollar is nearing the peak of its cycle right now, but oil price is going to continue to be a headwind. Hopefully, it’ll be a manageable headwind for India.</p>\n<p>\n\t<strong>Do you see foreign flows into India getting impacted due to a weak rupee?</strong></p>\n<p>\n\tWhen you look at emerging markets, you've been seeing large inflows which peaked in early January. Since then, they have moderated and have now turned negative. One reason we became cautious on emerging markets was this: we thought these strong inflows were unsustainable as valuations were overstretched across the emerging markets. Now, India is also seeing investors reduce their positions. Investors were running an exceptionally high overweight position around three years back. In early 2015, they were double-weighted versus the benchmark. Now, they have moderated to a five-year low.</p>\n<p>\n\t<strong>How do India’s macro fundamentals look compared to other EMs and Asian peers? Which is your most-favoured EM?</strong></p>\n<p>\n\tOur India growth outlook looking forward is the strongest among EMs and we expect 7.5 per cent <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gdp\" target=\"_blank\">GDP </a>growth this year. India’s fiscal adjustment has been promising compared to its own track-record. Inflation reduction is quite impressive, but there is still a long way to go in terms of exports from the manufacturing sector, generating sustained infrastructure improvement and formal sector employment. Another factor that could work against India is low dividend payout. One of the features of a volatile market condition is shift from growth investing to value investing where dividend income becomes an attractive feature for investors. In a volatile environment, the return from dividend is quite attractive for investors. Dividend payout is quite low in India compared to its peers in the EM space. Markets like Thailand and Singapore, which are our top picks, have much higher dividend yield. In terms of valuations, India is not much undervalued. On one-year forward basis, India is trading at about a 30 per cent price-to-earnings premium to <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/emerging-market\" target=\"_blank\">emerging market </a>which is a similar premium when India’s one-year forward estimated ROEs are compared to its EM peers. We are also more bullish on Singapore and Thailand equities as these economies have higher sensitivity to rising oil prices and are running current account surpluses. We also like China, but it is a small overweight versus our benchmark. China and India are moderately overweight. We are underweight on Australia and South Korea.</p>\n<p>\n\t<strong>How have recent changes like introduction of long-term capital gains tax on equities and measures taken to curb trading in offshore derivatives impacted FII sentiment? Do you see index providers like MSCI cutting India's weight following these measures?</strong></p>\n<p>\n\tThe MSCI issue is not a major feature in our discussion with clients. But, the dispute between the Singapore Exchange and National Stock Exchange of India does seem to be against what we are seeing elsewhere. For example, the Singapore and Malaysian exchanges have done a tie-up, Shanghai and Hong Kong exchanges and Shenzhen-Hong Kong exchanges have done tie-up. But, I don’t think it is as important for the market direction as the things we have been talking about so far in this interview.</p>\n<p>\n\t<strong>How significant is </strong><strong>inclusion</strong><strong> of China-A shares in MSCI EM for EMs like India? By when do you see China’s inclusion factor going to 100 </strong><strong>per cent</strong><strong>? How much of an outflow can India expect?</strong></p>\n<p>\n\tIn case of China, 100 per cent inclusion can happen over next 5-7 years, slightly faster than other markets where it has taken a 10-year time frame. As this process starts getting underway, we could see the whole structure of the EM index changing. China already has the largest weight in the EM index. But over the next 5-7 years, it can become 50 per cent. But this could well lead to the concept of a separate China allocation in global portfolios. Today, we broadly have four regions--North America, Europe and Asia Ex-Japan combined with EMs and Japan. So, you would probably move to five regions as China emerges as a region itself. So, you can see it in two ways. As this process takes place, it will lead to diminishing weightings of other larger markets in the EM index, but over time it may actually increase the likelihood that China itself becomes an investment region. China is also expected to become a high-income region with high <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gdp\" target=\"_blank\">GDP </a>per capita by 2027 which will also push the case for China as a separate region.</p>\n<p>\n\t<strong>Lastly, what has your takeaway been from RBI’s recent repo rate hike after a gap of more than four years?</strong></p>\n<p>\n\tThe rate hike taken by RBI was a pre-emptive decision and it was the right thing to do. Rising oil prices is one of the reasons for this. It is good to see equity markets reacting positively instead of in a knee-jerk manner.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "In",
        "emerging"
    ],
    "verbs": [
        "peak",
        "oil",
        "Garner",
        "market",
        "yield"
    ],
    "nouns": [
        "In",
        "India",
        "Dollar",
        "oil",
        "remains",
        "headwind",
        "Morgan",
        "Stanley",
        "Q",
        "A",
        "Asia",
        "market",
        "equity",
        "strategist",
        "metrics",
        "yield",
        "peak",
        "dividend",
        "Garner"
    ]
}