{
    "creator": "Bloomberg",
    "title": "India’s deadly ‘new normal’: How disruptive weather is shaking the $2.3 trillion economy",
    "link": "https://www.financialexpress.com/economy/indias-deadly-new-normal-how-disruptive-weather-is-shaking-the-2-3-trillion-economy/1211885/",
    "pubDate": "Tue, 19 Jun 2018 14:07:05 +05:30",
    "dc:creator": "Bloomberg",
    "content": "Deadly dust storms sweeping over the densely-populated north Indian plains are part of a \"new normal\" of disruptive weather events worsening the country’s already-lethal air pollution and causing disruption in the $2.3 trillion economy.",
    "contentSnippet": "Deadly dust storms sweeping over the densely-populated north Indian plains are part of a \"new normal\" of disruptive weather events worsening the country’s already-lethal air pollution and causing disruption in the $2.3 trillion economy.",
    "guid": "https://www.financialexpress.com/?p=1211885",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-19T08:37:05.000Z",
    "sentiment": {
        "score": -5,
        "comparative": -0.38461538461538464,
        "tokens": [
            "india’s",
            "deadly",
            "‘new",
            "normal’",
            "how",
            "disruptive",
            "weather",
            "is",
            "shaking",
            "the",
            "23",
            "trillion",
            "economy"
        ],
        "words": [
            "disruptive",
            "deadly"
        ],
        "positive": [],
        "negative": [
            "disruptive",
            "deadly"
        ]
    },
    "article": {
        "title": "India’s deadly ‘new normal’: How disruptive weather is shaking the $2.3 trillion economy",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1211902\" src=\"https://images.financialexpress.com/2018/06/thunderstorm-4.jpg\" alt=\"indian economy, indian weather, duststorm, air pollution, delhi economy, delhi politics \" srcset=\"https://images.financialexpress.com/2018/06/thunderstorm-4.jpg 660w, https://images.financialexpress.com/2018/06/thunderstorm-4-300x200.jpg 300w, https://images.financialexpress.com/2018/06/thunderstorm-4-620x413.jpg 620w, https://images.financialexpress.com/2018/06/thunderstorm-4-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> In recent months, dust clouds and storms have killed hundreds of people, destroyed thousands of homes and farmers’ crops and led to flight cancellations.</figure>\n\t\t\t</section></div><span>\n</span><p>Deadly dust storms sweeping over the densely-populated north Indian plains are part of a “new normal” of disruptive weather events worsening the country’s already-lethal air pollution and causing disruption in the $2.3 trillion economy.</p><span>\n</span><p>In recent months, dust clouds and storms have killed hundreds of people, destroyed thousands of homes and farmers’ crops and led to flight cancellations. The government in New Delhi, a city of more than 20 million people, ordered a halt to construction activities as the airborne sand significantly worsened north India’s air quality, far outside the winter months that usually herald the region’s descent into a months-long toxic haze.</p><span>\n</span><p>“It’s definitely a new normal — the frequency and intensity of these storms is unprecedented,” said Sunita Narain, director general of New Delhi’s Centre for Science and Environment, who added that recent weather is related to desertification, deforestation and an over-extraction of groundwater.</p><span>\n</span><p>In India, extreme weather events can quickly lead to dozens of deaths and cause economic hardship, with the World Bank estimating that environmental degradation costs India roughly $80 billion each year. At the same time, soaring levels of tiny, deadly particulate matter have prompted concern about a brewing public health emergency in the politically-gridlocked capital, where doctors warn of rising lung cancer and heart disease cases.</p><span>\n</span><p>Economic Threat</p><span>\n</span><p>In 2018 alone, there have been 50 severe storms across 16 Indian states that have led to more than 500 deaths, compared to 22 storms between 2003 and 2017, and only nine between 1980 and 2003, the CSE said. Nearly 5,000 houses collapsed, while livestock were killed and crops were ruined across the states of Uttar Pradesh, Madhya Pradesh, Bihar and others, according to a report by the CSE.</p><span>\n</span><p>Flights were canceled across north India on airlines including Air India, Indigo and Spice Jet, said Kapil Sabharwal, a spokesman for New Delhi’s airport.</p><span>\n</span><p>The worsening air pollution across north India in the summer has also prompted renewed concerns that it’s no longer just a winter phenomenon, but a year-long public health crisis. In March, April and May, air monitoring stations in Delhi recorded just one day of “satisfactory” air quality, data compiled by the Central Pollution Control Board show.</p><span>\n</span><p>Poor air quality also poses a threat to Delhi’s economy.</p><span>\n</span><p>“When there is such visible pollution, the danger is certain steps may be taken that hamper business continuity,” said Seema Arora, deputy director general of the Delhi-based CII-ITC Centre of Excellence for Sustainable Development, citing past bans on the entry of trucks carrying ‘non-essential’ goods into the capital. “Such actions can result in a huge amount of impact, especially for small and medium businesses”</p><span>\n</span><p>Political Fallout</p><span>\n</span><p>Any response to worsening pollution levels has been complicated by gridlock in India’s capital, where New Delhi’s political leaders have sparred with their own bureaucracy and representatives of the national government.</p><span>\n</span><p>The local <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/aam-aadmi-party/\">Aam Aadmi Party</a> led by chief minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/arvind-kejriwal/\">Arvind Kejriwal</a> — a political opponent of Prime Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/narendra-modi/\">Narendra Modi</a> — has been holding a hunger strike in the waiting room of the state’s lieutenant governor. They allege administrators in Delhi’s bureaucracy have boycotted their work, including combating pollution, while bureaucrats claim AAP lawmakers assaulted Delhi’s chief secretary.</p><span>\n</span><p>The political crisis has drawn in a variety of opposition leaders, including the chief minister of West Bengal <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/mamata-banerjee/\">Mamata Banerjee</a>, who tweeted that they had urged the prime minister to resolve the problems immediately.</p><span>\n</span><p>Still, Narain said all parties managed to unite to implement a ban on construction in the national capital. “It has transcended politics,” she said, adding she has met with Delhi’s lieutenant governor and chief minister. “The policies are moving. Air pollution is something that’s reached the highest level.”</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "Indian",
        "weather",
        "populated",
        "deadly",
        "Deadly",
        "new",
        "normal",
        "north",
        "disruptive",
        "trillion",
        "sweeping",
        "worsening",
        "lethal"
    ],
    "nouns": [
        "India",
        "Indian",
        "weather",
        "pollution",
        "economy",
        "normal",
        "north",
        "disruption",
        "shaking",
        "trillion",
        "part",
        "worsening",
        "country",
        "dust",
        "sweeping",
        "air",
        "causing"
    ],
    "verbs": [
        "weather",
        "dust",
        "part",
        "air"
    ]
}