{
    "title": "Turnaround king: IDBI Bank's M K Jain named new RBI deputy governor",
    "link": "https://www.business-standard.com/article/finance/incoming-rbi-deputy-governor-m-k-jain-is-turnaround-king-118060401153_1.html",
    "pubDate": "Tue, 05 Jun 2018 02:20:00 +0530",
    "content": "He is expected to be put in charge of banking supervision, among other duties",
    "contentSnippet": "He is expected to be put in charge of banking supervision, among other duties",
    "guid": "https://www.business-standard.com/article/finance/incoming-rbi-deputy-governor-m-k-jain-is-turnaround-king-118060401153_1.html",
    "isoDate": "2018-06-04T20:50:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "turnaround",
            "king",
            "idbi",
            "bank's",
            "m",
            "k",
            "jain",
            "named",
            "new",
            "rbi",
            "deputy",
            "governor"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Turnaround king: IDBI Bank's M K Jain named new RBI deputy governor",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p> <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=idbi+bank\" target=\"_blank\">IDBI Bank </a>managing director <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=m+k+jain\" target=\"_blank\">M K Jain </a>will be the fourth deputy governor of the Reserve Bank of India, filling the vacacy after S S Mundra retired on July 31 last year. His term is three years.</p> <p> He is expected to be put in charge of banking supervision, among other duties. In which case, he will have his hands full. The Basel-III norms took effect on May 17 and Jain will have to lead <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=banks\" target=\"_blank\">banks </a>in implementation on the new requirements on liquidity. In the medium to long term, he will have to grapple with bad debts of the banking system and guide on corrective action. Transmission of rate changes by RBI is another policy challenge.\n\n\n</p>\n<!-- INPAGE_BANNER --> <p> Jain is also expected to be a communication bridge between governor <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=urjit+patel\" target=\"_blank\">Urjit Patel </a>and bankers on various issues, most importantly on the bankruptcy code and the stricter <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=non+performing+asset\" target=\"_blank\">Non-Performing Asset </a>(NPA) recognition norms RBI instituted on February 12. Under these, even a day’s default could lead a company to bankruptcy proceedings.</p> <p> Jain has a little over 30 years of experience as a banker and was managing director and chief executive of government-owned <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=idbi+bank\" target=\"_blank\">IDBI Bank </a>since March 2017. He was previously heading Indian Bank, for two years. A deputy governor gets a fixed salary of Rs 2.25 lakh a month, plus allowances.</p> <p> Analysts say Jain is known as a person with out-of-box ideas. </p><p>He is also considered a 'turnaround king' for the way he proceeded to clean Chennai-based Indian Bank's bad debt. He reportedly disposed of Rs 30 billion worth of bad debt to asset reconstruction companies in no more than a couple of meetings. <span></span> </p> <p> <img align=\"left\" alt=\"New RBI deputy governor M K Jain is Turnaround King\" class=\"imgCont\" height=\"532\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/04/full/1528129090-9964.jpg\" title=\"graph\" width=\"404\"></p> “He dictated his terms, and made an offer that was fair to all parties, and left very little scope for negotiation. He made Indian Bank relatively healthy and that is why he was brought to IDBI Bank,” said an analyst, aware of his negotiation style. <p> Generally, the appointments are for three years, after which the government decides on renewal if the incumbent has not reached the retirement age of 62. Jain, aged 55, qualifies for reappointment on that front when his three years end.</p> <p> Jain has also served on the boards of Exim Bank and National Institute of Bank Management. He has also been a part of several committees in the banking sector, including as a secretary to the Basant Seth committee on review and revamp of the audit system in public sector <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=banks\" target=\"_blank\">banks </a>(PSBs). And, as a member on a government-constituted committee on public interest litigation related to NPAs. He also played a role in redesigning the annual performance appraisal reports at PSBs.</p> <p> The <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=finance\" target=\"_blank\">finance </a>ministry had 37 applications for the post. Under the RBI Act, the central bank should have four deputy governors — two from within the ranks, one commercial banker and one economist.</p> <p> Beside Jain, UCO Bank executive director Charan Singh and State Bank of India managing directors B Sriram and P K Gupta were among contenders for the post. Some bureaucrats had also applied and were interviewed. K P Krishnan, secretary, skill development and entrepreneurship; Yaduvendra Mathur additional secretary, NITI Aayog, and T V Somanathan, a principal secretary in Tamil Nadu, were among the shortlisted candidates in the bureaucracy.</p> <span></span>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "new",
        "expected",
        "M",
        "K",
        "Jain"
    ],
    "nouns": [
        "Bank",
        "banking",
        "governor",
        "charge",
        "RBI",
        "put",
        "supervision",
        "king",
        "deputy",
        "Turnaround",
        "M",
        "K",
        "He"
    ],
    "verbs": [
        "Bank",
        "charge",
        "put"
    ]
}