{
    "title": "Tata Motors' market-cap falls below that of Bajaj Auto, Eicher Motors",
    "link": "https://www.business-standard.com/article/markets/tata-motors-market-cap-fall-below-of-bajaj-auto-eicher-motors-118062600487_1.html",
    "pubDate": "Tue, 26 Jun 2018 14:02:00 +0530",
    "content": "At 01:33 pm; Tata Motors market-cap stood at Rs 799.65 billion, lower than Bajaj Auto (Rs 812.19 billion) and Eicher Motors (Rs 799.71 billion), the BSE data shows.",
    "contentSnippet": "At 01:33 pm; Tata Motors market-cap stood at Rs 799.65 billion, lower than Bajaj Auto (Rs 812.19 billion) and Eicher Motors (Rs 799.71 billion), the BSE data shows.",
    "guid": "https://www.business-standard.com/article/markets/tata-motors-market-cap-fall-below-of-bajaj-auto-eicher-motors-118062600487_1.html",
    "isoDate": "2018-06-26T08:32:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "tata",
            "motors'",
            "market-cap",
            "falls",
            "below",
            "that",
            "of",
            "bajaj",
            "auto",
            "eicher",
            "motors"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Tata Motors' market-cap falls below that of Bajaj Auto, Eicher Motors",
        "content": "<div><span>\n\t\n\tTata Motors market capitalisation (market-cap) has fallen below that of Bajaj Auto and Eicher Motors after a 10% decline in the market price of the company amid concerns over auto tariff threat by the US.</span><p>\n\tAt 01:33 pm; Tata Motors market-cap stood at Rs 799.65 billion, lower than Bajaj Auto (Rs 812.19 billion) and Eicher Motors (Rs 799.71 billion), the BSE data shows.\n\n\n</p><span>\n</span><!-- INPAGE_BANNER --><p>\n\tHowever, if one includes the Tata Motors DVR market cap of Rs 84 billion, the truck maker would still rank third, after Maruti Suzuki India (Rs 2.68 trillion) and Mahindra &amp; Mahindra (Rs 1.13 trillion).</p><p>\n\tTata Motors slipped 5% to Rs 276, falling 10% in past two trading sessions from Rs 308 on Friday. The stock trading at its lowest level since February 12, 2016, declined 36% thus far in the current calendar year 2018. On comparison, the S&amp;P BSE Sensex was up 4% during the same period.</p><p>\n\tUS President Donald Trump on Friday threatened to slap a 20% duty on all cars imported from Europe unless the European Union removed its trade barriers and tariffs on dozens of American products which took effect.</p><p>\n\tMeanwhile, Tata Motors-owned Jaguar Land Rover (JLR) has lined up investment worth 13.5 billion pounds (around Rs 1.2 lakh crore) in the next three years on new models, technology development and capacity addition.</p><p>\n\tManagement commentary during JLR’s investor day reaffirms our core concern on free cash flow (FCF) due to the higher-than-expected capex and lower volumes. Moreover, we perceive normalising margin in China as an incremental negative, analysts Edelweiss Securities said in a visit note.</p><p>\n\tGiven competitive intensity, we expect profitability to lag volume growth. Electric vehicles remain a key event as it is unclear as of now the extent of success all the traditional players are likely to achieve, the brokerage firm said.</p><p>\n\tOn the positive front, JLR has effectively bridged the technological gap with peers over the past eight years, enabling it to be at the fore front of electrification and adopt flexible manufacturing, it added.</p><span>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            \n\t           \n\t\t\t\t\t\t\t\t\t\t\t\t\n            </span><span>\n          </span><span>\n         \t\t\n\t\t\t\t     </span><span>\n\t\t\t\t\t         </span></div><p>\n\t\t\t  <style>.pubDate{color:#000!important;font-size:14px!important;border-top:solid 1px #cecece;font-style:italic;font-family:'open sans';padding:10px 0 2px 0}</style>\n\t\t\t\tFirst Published: Tue, June 26 2018. 14:02 IST\t\t\t\t</p>"
    },
    "adjectives": [
        "65",
        "billion",
        "33",
        "19",
        "71"
    ],
    "verbs": [
        "lower",
        "market",
        "cap"
    ]
}