{
    "title": "Bharat-22 ETF: Investors put in Rs 5,163 cr bids, subscribe 3.44 times",
    "link": "https://timesofindia.indiatimes.com/business/india-business/bharat-22-etf-anchor-investors-put-in-rs-5163-crore-bids-subscribe-3-44-times/articleshow/64651861.cms",
    "pubDate": "Tue, 19 Jun 2018 14:36:46 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/bharat-22-etf-anchor-investors-put-in-rs-5163-crore-bids-subscribe-3-44-times/articleshow/64651861.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64651861.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/bharat-22-etf-anchor-investors-put-in-rs-5163-crore-bids-subscribe-3-44-times/articleshow/64651861.cms",
    "isoDate": "2018-06-19T14:36:46.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "bharat-22",
            "etf",
            "investors",
            "put",
            "in",
            "rs",
            "5163",
            "cr",
            "bids",
            "subscribe",
            "344",
            "times"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Bharat-22 ETF: Anchor investors put in Rs 5,163 crore bids, subscribe 3.44 times",
        "content": "<div class=\"Normal\"><p>NEW DELHI: The second tranche of Bharat-22 ETF follow-on offer was lapped up by institutional investors on Tuesday, with the portion reserved for anchor bidders getting subscribed 3.44 times to the tune of Rs 5,163 crore.\n\n</p><p>The government today launched the follow-on fund offer (FFO) of Bharat-22 Exchange Traded Fund (ETF), comprising shares of 22 companies, to raise up to Rs 8,400 crore from the market.\n</p><p>The issue opened for anchor investors today, and received subscriptions from investors including mutual funds houses, foreign portfolio investors (FPI), insurance and retirement funds.\n</p><p>The FFO will open for subscription for retail and other institutional investors tomorrow and will remain open till June 22.\n</p><p>Secretary in the Department of Investment and Public Asset Management Atanu Chakraborty said, \"The Bharat-22 FFO is another opportunity for the investors to participate in the India growth story as represented by the industry leading stocks of the ETF.\"\n</p><p>ICICI Prudential Mutual Fund managed Bharat-22 ETF's fund offer, through which the government aims to mop up Rs 6,000 crore with a green shoe option of raising another Rs 2,400 crore.\n</p><p>As much as 25 per cent of total issue size, or Rs 1,500 crore, was reserved for anchor investors who put in bids worth about Rs 5,163 crore, ICICI Prudential AMC said.\n</p><p>\"We are happy to see the continued support received from anchor investors towards the FFO... Now, we look forward to active participation from non-anchor investor category, over the next three days, whereby one has the opportunity to own some of the jewels of Corporate India at a discounted price,\" ICICI Prudential AMC MD and CEO Nimesh Shah said.\n</p><p>The government had in November last year launched Bharat-22 ETF comprising shares of 22 companies, including public sector undertakings (PSUs), public sector banks, ITC, Axis Bank and L&amp;T.\n</p><p>The fund had garnered bids to the tune of Rs 32,000 crore, although the government retained only Rs 14,500 crore.\n</p><p>The state-owned companies that are part of the new Bharat ETF-22 include ONGC, IOC, SBI, BPCL, Coal India and Nalco.\n</p><span>The other central public sector enterprises on the list are Bharat Electronics, Engineers India, NBCC, NTPC, NHPC, SJVNL, GAIL, PGCIL and NLC India. Only three public sector banks -- SBI, Indian Bank and Bank of Baroda -- feature in the Bharat-22 index.\n</span><br><span>\n</span><br><span>The government plans to raise Rs 80,000 crore in the current fiscal from disinvestment, lower than over Rs 1 lakh crore raised last year.\n</span><br><span>\n</span><br><span>Besides, the government will launch the initial public offering of railway consultancy firm RITES tomorrow through which it will divest 12 per cent stake. The IPO is expected to fetch over Rs 460 crore to the exchequer.\n</span><br><span>\n</span><br><span>Prior to the launch of Bharat-22 ETF, which has a diversified portfolio, the government had floated the CPSE ETF comprising stocks of 10 bluechip PSUs -- ONGC, Coal India, IOC, GAIL (India), Oil India, PFC, Bharat Electronics, REC, Engineers India and Container Corporation of India.\n</span><br><span>\n</span><p>Through the CPSE ETF, the government had raised Rs 11,500 crore in three tranches -- Rs 3,000 crore from the first tranche in March 2014, Rs 6,000 crore from the second tranche in January 2017 and Rs 2,500 crore from the third tranche in March 2017.\n</p><span>\n</span></div>"
    },
    "adjectives": [
        "10",
        "left",
        "top",
        "right",
        "22",
        "44"
    ],
    "nouns": [
        "Bharat",
        "bharat",
        "india",
        "times",
        "photo",
        "margin",
        "border",
        "10",
        "crore",
        "put",
        "business",
        "left",
        "style",
        "top",
        "right",
        "22",
        "ETF",
        "etf",
        "cr",
        "anchor"
    ],
    "verbs": [
        "subscribe",
        "border",
        "put",
        "align",
        "style",
        "top",
        "right",
        "anchor"
    ]
}