{
    "title": "How companies are using Neuromarketing to influence what brands you buy",
    "link": "https://www.business-standard.com/article/companies/how-companies-are-using-neuromarketing-to-influence-what-brands-you-buy-118041000279_1.html",
    "pubDate": "Tue, 10 Apr 2018 11:02:00 +0530",
    "content": "Neuromarketing - the analysis and optimisation of marketing strategies using methods from neuroscience - is a relatively new addition to the marketing expert's arsenal",
    "contentSnippet": "Neuromarketing - the analysis and optimisation of marketing strategies using methods from neuroscience - is a relatively new addition to the marketing expert's arsenal",
    "guid": "https://www.business-standard.com/article/companies/how-companies-are-using-neuromarketing-to-influence-what-brands-you-buy-118041000279_1.html",
    "isoDate": "2018-04-10T05:32:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "how",
            "companies",
            "are",
            "using",
            "neuromarketing",
            "to",
            "influence",
            "what",
            "brands",
            "you",
            "buy"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "How companies are using Neuromarketing to influence what brands you buy",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=shopping\" target=\"_blank\">Shopping </a>is a long series of decisions; not necessarily right or wrong decisions, just decisions.</p>\n<p>\n\tAs we roam through shops, our brain unceasingly processes incoming stimuli, compares this information with past experiences, makes a decision and finally translates it into muscle movement. Outwardly, we pick an item and add it to our <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=shopping\" target=\"_blank\">shopping </a>cart.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tWhether in the supermarket or at the mall, we have to choose at every turn, for or against garments in all shapes and colours, between laundry detergents in different price ranges and shower gels in many fragrances. However, whether we can smell a whiff of lemon or almond while taking a shower hardly matters (for most of us). Making a decision then becomes almost arbitrary – and this opens the doors for someone to manipulate us into believing there’s a decision to be made when there might not be.</p>\n<p>\n\tThe goal of any <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=marketing\" target=\"_blank\">marketing </a>campaign is to bias this process in the customer’s mind to make an essentially meaningless decision in favour of some brand.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=neuromarketing\" target=\"_blank\">Neuromarketing </a>– the analysis and optimisation of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=marketing\" target=\"_blank\">marketing </a>strategies using methods from neuroscience – is a relatively new addition to the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=marketing\" target=\"_blank\">marketing </a>expert’s arsenal. Only a decade has passed since the term first appeared in marketing journals.</p>\n<p>\n\t<strong>A fluid definition</strong></p>\n<p>\n\tAdvertisers have longed to look directly into the consumer’s mind, to know what she’s going to decide before she knows it herself, to find the ultimate “buy-button” and to create the completely see-through consumer. With the advent of neurological imaging techniques in the 1990s, ‘scientific’ marketing seemed to promise these advertisers success.</p>\n<p>\n\tMany newspaper articles have since predicted that ‘neuromarketing’ will change the advertising industry in the second half of the noughties.</p>\n<p>\n\tHowever, the consumer has not experienced many of these neurologically optimised sales strategies just yet, and a lack of financial resources in the advertising industry alone isn’t the reason. Just in India, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=advertisement\" target=\"_blank\">advertisement </a>expenditure is expected to reach Rs 61,204 crore in 2017, 10% higher than the year before, according to a report by the media agency GroupM. Worldwide, expenditure on marketing is expected to hit almost Rs 38 lakh crore ($580 billion).</p>\n<p>\n\tUsing the keyword ‘neuromarketing’, some marketing <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=companies\" target=\"_blank\">companies </a>have tried to stake their claim in this giant pie. Currently, over a hundred <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=companies\" target=\"_blank\">companies </a>offer their services for <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=neuromarketing\" target=\"_blank\">neuromarketing </a>worldwide, ten-times as many as just 10 years ago. It is no wonder that the media and marketing agencies have pounced on this imposing term, in alternating modes of panic and enthusiasm.</p>\n<p>\n\tAn exhaustive examination of the subject is difficult because <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=neuromarketing\" target=\"_blank\">neuromarketing </a>links various overlapping disciplines: economics, marketing and management, the behavioural sciences, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=psychology+and+neurology\" target=\"_blank\">psychology and neurology.</a> Few experts have profound knowledge of all these disciplines and are able to draw sound conclusions about neuromarketing. Even a professor at the Indian Institute of Management, Ranchi, who recently co-authored a book on neuromarketing, struggled to explain what neuromarketing could do.</p>\n<p>\n\t“The application of neuroscience will help understand consumers’ behaviour better,” she said when asked what she thought of the efficacy of neuromarketing as a tool in marketing. And what eventually changes for the consumers when a campaign has been designed with the help of neuromarketing will be “mostly their experience.”</p>\n<p>\n\tIn addition, there is no clear line between science and private services. Researchers become marketing providers and vice versa; the literature and supposedly scientific lectures may turn out to be self-marketing for offered services. So how feasible is it to understand what neuromarketing is and how it works? How can one differentiate between valid results and hocus-pocus made attractive?</p>\n<p>\n\t<strong>‘Seeing’ decisions in the making</strong></p>\n<p>\n\tNeuromarketing rests on one assumption: that information can be gleaned directly from the brain. This includes information that consumers are incapable of articulating into words as well as information they are not willing to disclose. To gather this information, traditional marketing tools like customer surveys, product presentations and advertisements are combined with electroencephalography (EEG) recordings, eye-tracking apparatuses and skin conductance measurements.</p>\n<p>\n\tHowever, it wasn’t until the introduction of functional magnetic resonance imaging (fMRI) that neuromarketing studies gained momentum. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=fmri\" target=\"_blank\">fMRI </a>made it easier than ever to interpret scan data.</p>\n<p>\n\tIn fact, a brain scanner can track parts of the decision-making process running in the head of a consumer quite well. In an early neuromarketing study in 2007, psychologist Brian Knutson at Stanford University had his test participants conduct the so-called SHOP task. The experimenter gave the participants a certain amount of money. They could spend it on specific products. They simply had to do make each purchasing decision inside the brain scanner. A monitor in the scanner first displayed a product, then the price and finally a choice box through which the participants could decide for or against the purchase.</p>\n<p>\n\tKnutson assigns various decision-making sub-tasks to activation patterns in the participants’ brains as recorded by the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=fmri\" target=\"_blank\">fMRI.</a> Based on these samples, he was able to predict whether the respondent would buy a particular product or not.</p>\n<p>\n\tFollowing Knutson’s experiment, and many others similar ones since, scientists were able to create a neuronal map outlining the decision-making processes for purchasing and the corresponding areas involved in the brain. In fact, brain research has failed to detect the activation of certain processes only in individual cases, particularly those involving spatially limited areas.</p>\n<p>\n\tBy observing that the same networks are activated every time for certain tasks, scientists were able to say that the task’s performance is correlated with specific activation patterns. Several such individual processes add up to a purchase decision. The brain calculates a reward value, called the pleasure of acquisition, and a deterring value called the pain of paying, and various other conditions to decide whether or not to make a purchase.</p>\n<p>\n\tThe reward value is a measure of how much a product is able to stimulate the deep-seated reward pathway in the brain. One structure, the nucleus accumbens, is activated when an action performed is rated as particularly positive, like when you drink water when thirsty. The nucleus accumbens is also activated when a pleasant visual stimulus is processed. So based on the activation patterns of the nucleus accumbens, Knutson could visualise how attractive test subjects found a product presented to them and if they wanted it.</p>\n<p>\n\tBut the attractiveness of a product alone does not decide a purchase. Shortly after presenting a product on the monitor, Knutson also showed the participants the price tag. This is where the pain of paying comes into play. It turned out that the price’s display was associated with activity in the insular cortex, a buried part of the cerebral cortex, approximately at the level of the temples. In the supermarket, the insula is, so to speak, an opponent of the reward pathway: the stronger its activation, the more likely it is that the product remains on the shelf.</p>\n<p>\n\tThere are other factors that influence a purchasing decision. For example, the ambience in the store, the behaviour of the sales staff, the customer’s own mood and the brand value. Their respective weights are combined and computed in the prefrontal cortex. It is the hub that eventually extracts a conclusion from the various neuronal processes and makes the decision: Ariel or Surf, lime or almond, Coca Cola or Pepsi.</p>\n<p>\n\t<strong>Tall claims</strong></p>\n<p>\n\tIt is tempting to conclude that finding the perfect recipe, the best design for the packaging, the most attractive <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=advertisement\" target=\"_blank\">advertisement </a>and the most compelling logo for all products should be easy using neuromarketing tools. All you need is 20 people and an <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=fmri\" target=\"_blank\">fMRI </a>machine to test your variables. The degrees of activation of their reward pathways should be clear indicators, visible to everyone in the form of prepared fMRI images.</p>\n<p>\n\tIn fact, neuromarketing <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=companies\" target=\"_blank\">companies </a>have a line of reasoning that’s almost a template: Show picture A in the scanner, see activation in the areas B and C, and conclude – on the basis of previous scientific results and our own research – that situation D is given.</p>\n<p>\n\t“Per second in the scanner we typically collect one million data points,” says Peter Kenning, a professor of business administration at the University of Düsseldorf and a renowned expert on “consumer neuroscience,” a field of research that is superordinate to neuromarketing. That is a lot of data, which can be evaluated only with sophisticated statistical methods and years of practice.</p>\n<p>\n\tKenning studies general questions on consumer behaviour from a neurological perspective. Neuromarketing is only part of the discipline, and Kenning is quite skeptical about its practical execution. “The transfer of scientific findings into corporate activities often fails not only due to methodological deficits of the companies, but also simply due to a lack of knowledge,” the economist said. “Only few companies – the Italian chocolatier Ferrero, for example, which recently created a management position titled ‘Shopper Neuroscience’ – really have the skills to use the obtained results in a strategic way. Nevertheless, high budgets are regularly allocated to these projects.”</p>\n<p>\n\t<strong>In search of ghosts</strong></p>\n<p>\n\tIn many of these projects, participants are confronted with certain products or advertisements while in an fMRI machine or while wearing EEG caps. The aim is to identify what is pleasurable and what isn’t. One guiding principle often used in such studies is based on product-specific emotional patterns. Using brain activation patterns, neuromarketers claim to be able to find out if a participant, consciously or subconsciously, associates positive emotions like joy and trust or negative ones like anger and disgust with the product that she is seeing.</p>\n<p>\n\tThis approach was used in a recent commercial neuromarketing exercise conducted in Germany. Twenty-five people were made to watch short movies of people cleaning while inside an fMRI scanner. Together with a marketing company and a well-known German manufacturer of cleaning equipment, researchers tried to prove that cleaning “exerts significantly higher attraction” when it is done using the brand’s products and triggers more “positive emotions such as longing and anticipation” in the participants.</p>\n<p>\n\tThe neuromarketers presented their results as being indicative of a self-developed “emotional network” using impressive pictures of functional brain scans, thus creating some powerful selling points for the products.</p>\n<p>\n\tPeter Kirsch, a professor of clinical psychology at the Central Institute of Mental Health in Mannheim, Germany, however, has never heard of such an emotional network despite having investigated how the brains of healthy and sick people process emotions for many years. “I am not aware of anyone having ever described such an emotional network and having it empirically tested,” the psychologist said. “I think it is utopian that one can read out exact basic emotions.”</p>\n<p>\n\tIndeed, general negative and positive emotional states can be captured by an fMRI machine – but they can’t be precisely mapped on to those emotions we signify through language.</p>\n<p>\n\tKenning wonders what the real motivation for the cleaning study could have been: “Do the experimenters actually want to better understand neural processes? Or does the company simply want to place a product on the market?”</p>\n<p>\n\tBetween manufacturers and retailers, neuromarketing studies are often cited as the ultimate argument to include a certain product on the shelves of a retail outlet. The studies are considered to be scientifically proven sales guarantees.</p>\n<p>\n\t“Also the managers of the manufacturer are losing their voices, because they cannot grasp these highly theoretical methods,” Kenning pointed out. The neuromarketing company acts as a black box recommending certain actions as a result of their interpretations but which are incomprehensible to outsiders.</p>\n<p>\n\tMoreover, the methods themselves have pitfalls. fMRI measurements are definite but there is often more than one way to interpret them, especially without the right controls. Considering the large amount of data generated, false positives ought to be common.</p>\n<p>\n\tIn 2009, Californian scientists highlighted this problem in a humorous way. They introduced a dead salmon into an fMRI scanner and measured its brain activity in response to photos of people in different emotional states. They could detect typical activation patterns, which varied according to the faces shown. Of course, a sentimental dead salmon is pure nonsense, but the study showed easy it was to misinterpret such measurements.</p>\n<p>\n\tAnother fundamental problem is reverse inference. Detecting activation in certain neuronal networks while a participant solves a problem does not necessarily mean that the two events are correlated – but researchers often jump to this conclusion. This is like a sniper who draws a target around the bullet hole after the shot and then claims to have hit the bull’s eye. Neuroscientists often conclude that certain emotional networks are at work  from measured brain activation patterns. These results must be examined critically to understand their importance.</p>\n<p>\n\tUltimately, the question remains as to whether results measured in only a few subjects can be generalised for the population at large.</p>\n<p>\n\t<strong>A few successes</strong></p>\n<p>\n\tIn a 2011 study, the American neuroeconomist Gregory Berns, director for the Centre for Neuropolicy, Atlanta, was able to predict the success of previously unknown pop songs by testing 25 American teenagers via fMRI scans. He played short clips of the songs while the scanner measured the teenagers’ brain responses, and then computed average ‘values’. He found that activities measured in the reward pathways of the teenagers’ brains correlated with the success that these songs had on the market. He also found that the teenagers’ responses to questionnaires asking them to rate the songs, on the other hand, did not work just as well.</p>\n<p>\n\tThis study was considered proof that neuromarketing could reveal hidden information. However, it is reasonable to assume that the musical tastes of American teenagers – all of them having been shaped by similar cultural inputs – are fairly homogeneous. Additionally, music offers major advantages as an object of neuromarketing research. Most people like music; its emotional content is quite high; and it can easily be consumed in a brain scanner.</p>\n<p>\n\tThe truth, as usual, is more complex, particularly in India. Indian consumers come from a huge variety of cultural, religious, educational and economic backgrounds, speak hundreds of different languages and dialects, and have diverse preferences apropos food, clothing, fragrances and music.</p>\n<p>\n\tIn 2014, the Nielsen Corporation launched its first neuroscience lab in Mumbai to “study the subconscious mind of the respondent” in their trials, as Gayathri Swahar, the former director of Nielsen Consumer Neuroscience India, told the Indian Express.</p>\n<p>\n\tThe US-based Nielsen Corporation is one of the world’s biggest marketing research firms. After having bought two important neuromarketing companies, it is considered a world leader in commercial consumer neuroscience. The company claims to “offer the most complete suite of cutting-edge, neuroscience-based tools at global scale.”</p>\n<p>\n\tNot all those who neuromarket are lost</p>\n<p>\n\tIt remain to be seen if fMRI, EEG and other tools used in neuromarketing can overcome India’s diversity or, in fact, if the diversity will make it more difficult to generalise the data.</p>\n<p>\n\tIt is still unknown how far the results generated are representative of real consumer goods. Although modern EEG setups can be quite mobile and convenient, imaging methods are still limited to the narrow tube of the brain scanner, where real <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=shopping\" target=\"_blank\">shopping </a>situations can’t be simulated properly. A new method that is promising in this respect is the functional near-infrared spectroscopy (fNIRS), which has a potential similar to the fMRI’s but in the form of smaller and more portable scanners. Soon, purchase decisions can be tracked within the supermarket itself.</p>\n<p>\n\tKirsch believes that “we will eventually be able to predict decisions quite well by interpreting brain activation patterns. The technology is getting better, and certainly it can be used in practice at some point.” He is not concerned about the notion of a ‘see-through consumer’. “The data people happily share in social networks every day can be exploited much more effectively.”</p>\n<p>\n\tNick Lee, a professor of marketing at Warwick Business School in the UK and one of the world’s leading experts on consumer neuroscience, also insists that neuromarketing does not have any magical powers. “It is just another way of gaining information. There is no button in the brain that we can push and that would turn people into consumer zombies.”</p>\n<p>\n\tIn a paper published in May 2017, Lee reviewed a decade of neuromarketing research and concluded that it still is an “embryonic field”. He wrote that “we remain in the same basic position as we did in 2007” and that few articles appear to have addressed “whether neuroscientific insights can help us build new and improved explanations of marketing phenomena”.</p>\n<p>\n\tNeurologists still have a long way to go to understand in detail how our brain makes a decision, let alone predict it accurately. There are already some applications for neuromarketing, but studies need to be designed carefully and the measurable parameters defined very well. It must be noted that the scope of sound interpretation is narrow and that conclusions cannot be generalised. Thus, the results coming out of neuromarketing studies usually do not compensate for its high cost and the complicated procedures.</p>\n<p>\n\tHowever, neuromarketing will continue to evolve with new scientific findings in the coming years. But beware: not every marketing company that labels its services “brain research” is backed by legitimate brain research. Some of them just want to jack their prices up a little.</p>\n<hr>\n\n<p>\n\t<em>Bernd Eberhart is a science journalist in Tübingen, Germany.</em></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "new",
        "expert"
    ],
    "nouns": [
        "marketing",
        "using",
        "Neuromarketing",
        "neuroscience",
        "influence",
        "buy",
        "analysis",
        "optimisation",
        "addition",
        "expert",
        "arsenal"
    ],
    "verbs": [
        "influence",
        "buy"
    ]
}