{
    "creator": "FE Online",
    "title": "RITES IPO: First PSU IPO of FY19 opens tomorrow; know all about government’s latest disinvestment bid",
    "link": "https://www.financialexpress.com/market/rites-ipo-first-psu-ipo-of-fy19-opens-tomorrow-know-all-about-governments-latest-disinvestment-bid/1211775/",
    "pubDate": "Tue, 19 Jun 2018 13:18:27 +05:30",
    "dc:creator": "FE Online",
    "content": "In the first divestment exercise by the government this fiscal, state-owned railways consultancy firm Rail India Technical and Economic Services (RITES) will open its initial public offering for subscription on June 20.",
    "contentSnippet": "In the first divestment exercise by the government this fiscal, state-owned railways consultancy firm Rail India Technical and Economic Services (RITES) will open its initial public offering for subscription on June 20.",
    "guid": "https://www.financialexpress.com/?p=1211775",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-19T07:48:27.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "rites",
            "ipo",
            "first",
            "psu",
            "ipo",
            "of",
            "fy19",
            "opens",
            "tomorrow",
            "know",
            "all",
            "about",
            "government’s",
            "latest",
            "disinvestment",
            "bid"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "RITES IPO: First PSU IPO of FY19 opens tomorrow; know all about government’s latest disinvestment bid",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1196400\" src=\"https://images.financialexpress.com/2018/06/Quess-Corp-IPO-reu-L-2.jpg\" alt=\"cavinkare, ipo\" srcset=\"https://images.financialexpress.com/2018/06/Quess-Corp-IPO-reu-L-2.jpg 660w, https://images.financialexpress.com/2018/06/Quess-Corp-IPO-reu-L-2-300x200.jpg 300w, https://images.financialexpress.com/2018/06/Quess-Corp-IPO-reu-L-2-620x413.jpg 620w, https://images.financialexpress.com/2018/06/Quess-Corp-IPO-reu-L-2-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> RITES is a leading player in the transport consultancy and engineering sector in the country (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p><strong>RITES IPO:</strong> In the first divestment exercise by the government this fiscal, state-owned railways consultancy firm Rail India Technical and Economic Services (RITES) will open its initial public offering for subscription on June 20. It would be the first state-owned company to hit the IPO market in FY19. The IPO will be launched with a price band of Rs 180-185 per share. At the upper price band of the offer, the company aims to raise Rs 466.2 crore. The company is a leading player in the transport consultancy and engineering sector in the country, according to its DRHP. The equity shares are proposed to be listed on both BSE and NSE.</p><span>\n</span><p><b>About the offer and fundraising</b></p><span>\n</span><p>The IPO will be launched with a price band of Rs 180-185 per share with a face value of Rs 10. The is no fresh issuance of shares, but OFS (offer for sale) of 2.52 crore shares. Retail discount and employee discount is Rs 6 per equity share on offer price. The floor price is 18.0 times the face value of the equity shares and the cap price is 18.5 times the face value of equity shares. Bids can be made for a minimum of 80 equity shares and in multiples of 80 equity shares thereafter. 0.12 crore shares are reserved for eligible employees. The promoter holds 100 per cent stake in the company and this shareholding will reduce to 87.4 percent post listing. The paid-up share capital of RITES, at present, stands at Rs 200 crore.</p><span>\n</span><p><b>Issue closure</b></p><span>\n</span><p>The issue will close on June 22.</p><span>\n</span><p><b>Lead managers</b></p><span>\n</span><p>Elara Capital India, IDBI Capital Markets &amp; Securities, SBI Capital Markets and IDFC Bank.</p><span>\n</span><p><b>Objective</b></p><span>\n</span><p>1) To carry out the disinvestment of 24,000,000 Equity Shares held by the selling shareholder in the company, equivalent to 12 percent of the issued, subscribed and paid up equity share capital of the company as part of the net offer, and such equity shares that may be reserved for employee reservation portion, if any, subject to necessary approvals.</p><span>\n</span><p>2) To achieve the benefits of listing the equity shares on the stock exchanges. Further, company expects that listing of the equity shares will enhance visibility and brand image and provide liquidity to its shareholders. Listing will also provide a public market for the equity shares in India. The company will not receive any proceeds from the offer and all the proceeds will go to the selling shareholder.</p><span>\n</span><p><b>Financials</b></p><span>\n</span><p>In fiscal year 2017, the company reported a 9.1 percent CAGR increase in total operating revenue over fiscal year 2013-17 to Rs 1,353.36 crore. The consulting business surged by 10.2 percent CAGR. The export business increased by 5.3 percent during the period. The topline stood at Rs 936.15 crore for the nine month ended December 2017.</p><span>\n</span><p><b>Risk to investors</b></p><span>\n</span><p>According to different brokerages, here are the main risks:</p><span>\n</span><p>1)The four book running lead managers associated with the offer have handles 31 public offers in the past three years, out of which 10 issues closed below the offer price on listing date.</p><span>\n</span><p>2)There are no comparable listed companies in India engaged in the same line of business as the company, hence comparison with industry peers are not applicable.</p><span>\n</span><p>3)Average cost of acquisition of equity shares for the selling shareholder in offer is Rs 0.005 per equity share and offer price at upper end of the price band is Rs 185.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "First",
        "first",
        "firm",
        "open",
        "latest",
        "In",
        "fiscal",
        "owned",
        "Technical",
        "Economic",
        "initial",
        "public",
        "20"
    ],
    "verbs": [
        "firm",
        "open",
        "know",
        "bid",
        "exercise",
        "state",
        "Rail",
        "will",
        "initial"
    ]
}