{
    "creator": "Abhijeet Singh",
    "title": "Sell-off dents Dalal Street! Sensex tumbles 452 points in 4 days; 4 reasons why",
    "link": "https://www.financialexpress.com/market/sell-off-dents-dalal-street-sensex-tumbles-452-points-in-4-days-4-reasons-why/1212002/",
    "pubDate": "Tue, 19 Jun 2018 16:25:52 +05:30",
    "dc:creator": "Abhijeet Singh",
    "content": "The benchmark Sensex index has lost about 452 points in the last 4 days due to the widening of trade deficit and jittery over trade tensions between two biggest economies of the world. We take a look at four reasons for the Sensex losses.",
    "contentSnippet": "The benchmark Sensex index has lost about 452 points in the last 4 days due to the widening of trade deficit and jittery over trade tensions between two biggest economies of the world. We take a look at four reasons for the Sensex losses.",
    "guid": "https://www.financialexpress.com/?p=1212002",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-19T10:55:52.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "sell-off",
            "dents",
            "dalal",
            "street",
            "sensex",
            "tumbles",
            "452",
            "points",
            "in",
            "4",
            "days",
            "4",
            "reasons",
            "why"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Sell-off dents Dalal Street! Sensex tumbles 452 points in 4 days; 4 reasons why",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"wp-image-1212114 size-full\" src=\"https://images.financialexpress.com/2018/06/BSE-Reuters-2-2.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/BSE-Reuters-2-2.jpg 660w, https://images.financialexpress.com/2018/06/BSE-Reuters-2-2-300x200.jpg 300w, https://images.financialexpress.com/2018/06/BSE-Reuters-2-2-620x413.jpg 620w, https://images.financialexpress.com/2018/06/BSE-Reuters-2-2-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The S&amp;P BSE Sensex has lost 452 points to&nbsp;35,286.74 in 4 days from a level of&nbsp;35,739.16 as on 13 June 2018. (Image: Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>The global turmoil over the escalated concerns about the&nbsp;trade war between the United States and China have impacted India’s equity markets time and again following which the key equity indices Sensex and Nifty have fallen into negative territories. The benchmark Sensex index has lost about 452 points in the last 4 days due to the widening of trade deficit and jittery over trade tensions between two biggest economies of the world.&nbsp;Indian stock market extended losses after opening lower on Tuesday with <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/bse-sensex/\">BSE Sensex</a> closing down 261.52 points or&nbsp;0.74% at&nbsp;35,286.74 after plunging 299.2 points to a day’s bottom of 35,249.06.</p><span>\n</span><p>The S&amp;P BSE Sensex has lost 452 points to&nbsp;35,286.74 in 4 days from a level of&nbsp;35,739.16 as on 13 June 2018. We take a look at four reasons for the Sensex losses.</p><span>\n</span><p><strong>FPI’s dumping stocks</strong></p><span>\n</span><p>Foreign Portfolio Investors (FPIs) have been in a continuous sell-off mode in the first two months of the fiscal year 2018-2019 and up until now, in the month of June, FPIs have emerged as net sellers. Yesterday, only FPIs dumped Rs 754.43 crore worth of equities. This follows an outflow of about Rs 5,500 crore from India’s debt and equity markets in the first 15 days of June and an outflow of Rs 45,000 crore in April and May.</p><span>\n</span><p><strong>Trade war renews!</strong></p><span>\n</span><p>The trade war between the United States and China have spooked investors around the globe. Initially, US President Donald Trump imposed a tariff of 25% on $50 billion worth of Chinese imports to the US. Following the action, China, in a retaliatory move, hiked duties on $34 billion of American products including crude oil. Earlier yesterday, Donald Trump directed the government to prepare fresh tariffs of 10% on $200 billion worth of Chinese imports.</p><span>\n</span><p>Donald Trump accused Beijing of being unwilling to resolve the dispute over complaints it steals or pressures foreign companies to hand over technology. China’s Commerce Ministry criticized the White House action as blackmail and said Beijing was ready to retaliate, Associated Press said in a report.</p><span>\n</span><p>Donald Trump’s threat to impose a 10%&nbsp;tariff on another $200 billion of Chinese goods drew warnings from Beijing about $50 billion of retaliatory penalties on US goods, Reuters reported.</p><span>\n</span><p><strong>Asian stock markets collapse</strong></p><span>\n</span><p>Most of the Asian stock markets witnessed the heat emerging out of the trade war with China and Hong Kong markets bearing the major brunt on Tuesday. Chinese stock markets slid to a 2-year low with the benchmark equity index Shanghai Composite Index crashing 5% intraday. Shanghai Composite Index slipped below 3,000 level plummetting more than 5% in the late trade before settling down 3.8% at 2,907.82 whereas CSI 300 index shed 3.6% to end at 3,612.12.</p><span>\n</span><p>Stirring memories of the 2015 equity market crash, more than 1,000 stocks slumped by their 10% daily limit as Chinese investors dumped stocks across the board, which sent jitters through China’s retail investment community, Reuters said in a report.&nbsp;Washington’s fresh tariff threats against China raised the spectre of a full-blown trade war, the report added.</p><span>\n</span><p><strong>Heavyweights crack</strong></p><span>\n</span><p>Following the market-wide sell-off, industry heavyweight stocks such as Reliance Industries (RIL), Infosys, IndusInd Bank, State Bank of India (SBI), <a target=\"_blank\" href=\"http://www.financialexpress.com/auto/new-cars/marutisuzuki/\">Maruti Suzuki</a>, M&amp;M, Vedanta, Sun Pharma and L&amp;T contributed heavily to the Sensex losses. On a collective basis, these nine stocks alone wiped off about 199 points out of the&nbsp;261.52- point drop. On Tuesday, out of the 2,776 total traded companies on BSE, as many as&nbsp;1,923 stocks ended in red,&nbsp;703 scrips finished in positive territory while 150 concluded flat.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "off",
        "due",
        "lost",
        "last",
        "jittery",
        "two",
        "world",
        "four"
    ],
    "nouns": [
        "trade",
        "Street",
        "index",
        "due",
        "Sell",
        "days",
        "why",
        "benchmark",
        "lost",
        "losses",
        "last",
        "widening",
        "deficit",
        "two",
        "world",
        "look",
        "four"
    ],
    "verbs": [
        "trade",
        "off",
        "index",
        "Sell",
        "last",
        "look"
    ]
}