{
    "creator": "PTI",
    "title": "Bankers chalk out strategy to promote lending to corporates, MSME, says Piyush Goyal",
    "link": "https://www.financialexpress.com/industry/banking-finance/bankers-chalk-out-strategy-to-promote-lending-to-corporates-msme-says-piyush-goyal/1212461/",
    "pubDate": "Tue, 19 Jun 2018 21:24:41 +05:30",
    "dc:creator": "PTI",
    "content": "The minister assured bankers that government is behind the honest employees. ",
    "contentSnippet": "The minister assured bankers that government is behind the honest employees.",
    "guid": "https://www.financialexpress.com/?p=1212461",
    "categories": [
        "Banking & Finance",
        "Industry"
    ],
    "isoDate": "2018-06-19T15:54:41.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.07692307692307693,
        "tokens": [
            "bankers",
            "chalk",
            "out",
            "strategy",
            "to",
            "promote",
            "lending",
            "to",
            "corporates",
            "msme",
            "says",
            "piyush",
            "goyal"
        ],
        "words": [
            "promote"
        ],
        "positive": [
            "promote"
        ],
        "negative": []
    },
    "article": {
        "title": "Bankers chalk out strategy to promote lending to corporates, MSME, says Piyush Goyal",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1212464\" src=\"https://images.financialexpress.com/2018/06/piyush.jpg\" alt=\"Finance Minister Piyush Goyal ,  Piyush Goyal \" srcset=\"https://images.financialexpress.com/2018/06/piyush.jpg 660w, https://images.financialexpress.com/2018/06/piyush-300x200.jpg 300w, https://images.financialexpress.com/2018/06/piyush-620x413.jpg 620w, https://images.financialexpress.com/2018/06/piyush-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Finance Minister Piyush Goyal (PTI)</figure>\n\t\t\t</section></div><span>\n</span><p>Bankers today decided to embark on a two-stage strategy to push lending to genuine corporate borrowers and small businesses to support the uptick in the economic activity, Finance Minister Piyush Goyal said.</p><span>\n</span><p>“One of the thoughts before the public sector banks has been that they have to once again get into the act of working to support MSMEs and genuine good companies who need working capital finances or loans on investment in fixed assets and have some difficulties in the past,” Goyal said after meeting heads of public sector banks here.</p><span>\n</span><p>So, all the banks have collectively decided that in two stages they will take up the credit needs of genuine, deserving and well performing good companies, he said.</p><span>\n</span><p>“In the first stage, who have borrowing between Rs 200-2,000 crore, there are about 4,500 such good accounts in the PSU banks, most of them in consortium lending. The PSU banks over the next 3-4 weeks going to do focused study of the credit needs of these good borrowers,” the minister said.</p><span>\n</span><p>In the second stage, he said, banks will take up accounts with borrowings up to Rs 200 crore, which will also cover a large section of MSMEs and look at the genuine credit needs of all these companies.</p><span>\n</span><p>MSME sector contributes 40 per cent to India’s exports and 45 per cent in the manufacturing sector.</p><span>\n</span><p>Banks have decided to work collectively as a team and support businesses, which is already showing very good signs of revival, Goyal said.</p><span>\n</span><p>“The bankers have decided that they will do a creditors’ arrangement amongst the bankers so that earlier problems which was faced in consortium lending can be ironed out more smoothly,” he added.</p><span>\n</span><p>Bankers have resolved that they will also follow a decision taken by 66 per cent of the lenders as followed in case of cases under Insolvency and Bankruptcy Code, he said, adding that as a result roadblocks will not be created to faster growth of business and industry in system.</p><span>\n</span><p>The various proposal in this regard will be formalised in the next two-three weeks, the minister said.</p><span>\n</span><p>He further said that a proposal on having an oversight committee, comprising of retired judges, vigilance officers, regulators and external experts, to help faster decision making in the banking system was also discussed during the meeting.</p><span>\n</span><p>Lenders discussed on a process to ensure credit flow to good borrowers or good accounts, where some of the banks under Prompt Corrective Action framework of <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a> are also the part of consortium, do not face any difficulty in meeting their working capital needs.</p><span>\n</span><p>The RBI has put 11 banks, including Allahabad Bank, United Bank of India, Corporation Bank and IDBI Bank, among others, under PCA framework.</p><span>\n</span><p>“The government, the owner of 21 PSBs, stands committed to support each and everyone of these banks. We believe that these banks have a very important role to play in the economic and social development of the country,” the minister said.</p><span>\n</span><p>India clocked 7.7 per cent growth rate in the fourth quarter of FY18, as against 5.6 per cent, 6.3 per cent and 7 per cent, respectively, in the first three quarters of 2017-18.</p><span>\n</span><p>Emphasising that government is ready to play the role of facilitator, Goyal said adequate capital would be provided to them if they require.</p><span>\n</span><p>Banks have sufficient liquidity in the system and no bank would be allowed to default on payment of bond interest.</p><span>\n</span><p>He also assured bankers that government is behind the honest employees and will not spare dishonest one.</p><span>\n</span><p>“Anybody who does honest job there is nothing to fear…government is behind them,” he said.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "assured",
        "behind",
        "honest"
    ],
    "nouns": [
        "chalk",
        "strategy",
        "lending",
        "behind",
        "minister",
        "government"
    ],
    "verbs": [
        "promote",
        "chalk",
        "minister"
    ]
}