{
    "title": "Banks gross NPA may touch 11.5% in FY19 compared to 11.2% in FY18: Crisil",
    "link": "https://www.business-standard.com/article/economy-policy/banks-gross-npa-may-touch-11-5-in-fy19-compared-to-11-2-in-fy18-crisil-118060500625_1.html",
    "pubDate": "Tue, 05 Jun 2018 17:24:00 +0530",
    "content": "In FY18, the banking system reported a net loss of Rs 400 billion because of the sharp rise in NPAs",
    "contentSnippet": "In FY18, the banking system reported a net loss of Rs 400 billion because of the sharp rise in NPAs",
    "guid": "https://www.business-standard.com/article/economy-policy/banks-gross-npa-may-touch-11-5-in-fy19-compared-to-11-2-in-fy18-crisil-118060500625_1.html",
    "isoDate": "2018-06-05T11:54:00.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.14285714285714285,
        "tokens": [
            "banks",
            "gross",
            "npa",
            "may",
            "touch",
            "115",
            "in",
            "fy19",
            "compared",
            "to",
            "112",
            "in",
            "fy18",
            "crisil"
        ],
        "words": [
            "gross"
        ],
        "positive": [],
        "negative": [
            "gross"
        ]
    },
    "article": {
        "title": "Banks gross NPA may touch 11.5% in FY19 compared to 11.2% in FY18: Crisil",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tGross non-performing assets in the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=banking\" target=\"_blank\">banking </a>system, which stood at 11.2 per cent in FY2018, is likely to touch 11.5 per cent in this fiscal, says a report.</p>\n<p>\n\tIn FY18, GNPAs increased to around Rs 10.3 trillion, or 11.2 per cent of advances compared with Rs 8 trillion, or 9.5 per cent of advances, as on March 31, 2017.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\t\"We expect gross NPAs in the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=banking\" target=\"_blank\">banking </a>system to peak at around 11.5 per cent this fiscal and then start reducing,\" rating agency <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=crisil\" target=\"_blank\">Crisil </a>said in report today.</p>\n<p>\n\tIn FY18, the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=banking\" target=\"_blank\">banking </a>system reported a net loss of Rs 400 billion because of the sharp rise in NPAs and the resulting increase in provisioning costs.</p>\n<p>\n\tIn the previous fiscal, as much as Rs 5 trillion of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=bank+loans\" target=\"_blank\">bank loans </a>slipped into the non-performing assets (NPAs) category, taking the total <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=slippages\" target=\"_blank\">slippages </a>in the past three fiscals to Rs 13.6 trillion.</p>\n<p>\n\tAbout a fifth of the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=slippages\" target=\"_blank\">slippages </a>in FY18 was due to withdrawal of various structuring schemes by the Reserve Bank in February, after the Insolvency and Bankruptcy Code (IBC) process came into force, the report said.</p>\n<p>\n\tThe rating agency, however, said the tide is slowly turning and it expects moderation in slippages, better recoveries from NPAs and improved provision coverage to bode well for banks.</p>\n<p>\n\tThe accounts which are in the special mention account-2 (SMA-2, where exposures are overdue by 60-90 days), have more than halved to 0.8 per cent of advances as of last fiscal-end, compared with 2 per cent a year before, indicating considerable reduction in stressed loans that can potentially regress into NPAs, it said.</p>\n<p>\n\t\"Further, prospects of recovery from stressed accounts referred to the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=national+company+law+tribunal\" target=\"_blank\">National Company Law Tribunal </a>(NCLT) are improving. More than a quarter of the Rs 3.3 trillion worth of cases referred to NCLT for resolution are from the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=steel+sector\" target=\"_blank\">steel sector </a>which has seen heightened bidding interest due to improving prospects for the sector,\" the rating agency's senior director, Krishnan Sitaraman, said.</p>\n<p>\n\tThe agency's director, Rama Patel, said the banking systems provisioning cover (excluding write-offs) for NPAs increased to 50 per cent as on March 31, 2018, compared with 45 per cent a year back, and it is expected to improve further in this fiscal.</p>\n<p>\n\tIt further said state-run banks remain highly dependent on the government for capital to meet Basel III norms.</p>\n<p>\n\t\"Given the higher-than-expected losses last fiscal, probable loss in the current fiscal, and recall of the additional tier 1 instruments by a few PSBs, the Rs 2.1 trillion recapitalisation program announced in October 2017 may be insufficient to meet the capital requirements of PSBs by the end of this fiscal,\" the report said.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "reported",
        "gross",
        "11",
        "In",
        "net",
        "400",
        "billion",
        "sharp"
    ],
    "nouns": [
        "Banks",
        "banking",
        "gross",
        "NPA",
        "may",
        "touch",
        "11",
        "In",
        "system",
        "net",
        "loss",
        "billion",
        "sharp",
        "rise"
    ],
    "verbs": [
        "gross",
        "touch",
        "net",
        "rise"
    ]
}