{
    "title": "Marksheet of market: A half-yearly performance review and what lies ahead",
    "link": "https://www.business-standard.com/article/economy-policy/marksheet-of-market-a-half-yearly-performance-review-and-what-lies-ahead-118061900119_1.html",
    "pubDate": "Tue, 19 Jun 2018 08:26:00 +0530",
    "content": "The Indian stock market has been resilient and comfortably trades within a range. The capital market is now at a mature stage, able to navigate the shoals of a global disruption",
    "contentSnippet": "The Indian stock market has been resilient and comfortably trades within a range. The capital market is now at a mature stage, able to navigate the shoals of a global disruption",
    "guid": "https://www.business-standard.com/article/economy-policy/marksheet-of-market-a-half-yearly-performance-review-and-what-lies-ahead-118061900119_1.html",
    "isoDate": "2018-06-19T02:56:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "marksheet",
            "of",
            "market",
            "a",
            "half-yearly",
            "performance",
            "review",
            "and",
            "what",
            "lies",
            "ahead"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Marksheet of market: A half-yearly performance review and what lies ahead",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\t\t\n\t\t\tTill end-January 2018, returns in Indian equity markets were very good, driven by a broad-based rally in all sectors, apart from pharma. Companies dealing in industrial commodities and cyclicals, too, saw very good returns in FY 2017-18 (Apr 17 to Mar 18) as commodity prices bounced up from their lows. Also, chemicals companies benefitted from production cuts in China because of environmental concerns.</p>\n\t\t<p>\n\t\t\tCome February, though, and global markets seemed to be in a tail-spin within a short span.  The introduction of long-term capital-gains tax in Budget 2018 on profits earned from investment in listed equity shares dulled the market; rising bond yields, higher crude oil prices and a weakening rupee roiled it further.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n\t\t<p>\n\t\t\tThe Rs 130-billion Punjab National Bank scam, followed by ICICI Bank’s controversy over loans and questions raised on quality of advance, came as a grinding shock to markets which made the sentiments even weaker for investments.</p>\n\t\t<p>\n\t\t\tProtectionist policies in the United States triggered fears of a trade war between two giant economies — the US and China. Besides, the lowering of the corporate tax by the US and the rising 10-year US bond yield made the developed markets more attractive to Emerging Markets.</p>\n\t\t<p>\n\t\t\tNevertheless, with all this, the Indian stock market has been resilient and comfortably trades within a range, shored up by strong earnings in autos and auto-ancillaries, consumption and banking and finance.  The Indian capital market is now at a mature stage, able to navigate the shoals of a global disruption. And, for the first time in four-and-a-half years, the RBI saw fit to raise the benchmark interest rates, by 25bps, though still holding to a neutral stance in June 2018.</p>\n\t\t<p>\n\t\t\tA good monsoon (widespread and adequate rainfall) will be crucial in containing inflation, boosting earnings growth and shoring up rural demand. We believe monsoons and Q1 FY19 results will be next triggers for markets to take the direction forward.</p>\n\t\t<p>\n\t\t\tSuccessful resolutions under the Insolvency and Bankruptcy Code and NCLT proceedings, such as Bhushan Steel and Electrosteel cases, will help ease the stress on banks and set them on a growth trajectory. The forthcoming elections (in early 2019) will heighten the cautious elements in the markets. Besides, US macro-economic data reflects a growing economy which is indicated by the Federal Reserve’s interest-rate hike. Hence, in our view with medium to long-term perspective markets will be stock specific and will reward those companies which have sustainable earnings with robust business outlook and quality management.</p>\n\t\t<p>\n\t\t\tWe are positive on Financials, Automobiles, and Agrochemical sectors for medium to long-term view. We prefer to remain with sectors where there are earnings growth and better business prospects.</p>\n\t\t<p>\n\t\t\tAs per our technical research, we expect Nifty to trade in the range of 11300 on the upper side and 10200 on the lower side for remaining half of the calendar year 2018.</p>\n<hr>\n\t<br><em>Siddharth Sedani is the Vice President - Equity Advisory, Anand Rathi Shares and Stock Brokers</em>\t\t\t\t\n\t\t\t\t    \t\t\t\t     <p>\n\t\t\t\t\t\t\t\t<em>Disclaimer: Views expressed are personal. They do not reflect the view/s of Business Standard.</em></p>\n\t\t\t\t\t\t</span>"
    },
    "adjectives": [
        "Indian",
        "mature",
        "yearly",
        "stock",
        "resilient",
        "half",
        "ahead",
        "capital",
        "able",
        "global"
    ],
    "verbs": [
        "mature",
        "stock",
        "review",
        "market",
        "range",
        "stage",
        "navigate"
    ],
    "nouns": [
        "Indian",
        "performance",
        "yearly",
        "stock",
        "review",
        "disruption",
        "market",
        "A",
        "half",
        "range",
        "capital",
        "stage"
    ]
}