{
    "title": "Don't set targets to prosecute us: Industry tells Income Tax department",
    "link": "https://timesofindia.indiatimes.com/business/india-business/dont-set-targets-to-prosecute-us-industry-tells-income-tax-department/articleshow/64467367.cms",
    "pubDate": "Tue, 05 Jun 2018 14:25:43 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/dont-set-targets-to-prosecute-us-industry-tells-income-tax-department/articleshow/64467367.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64467367.cms\" /></a>“We want the department to collect more in taxes and we will support you. However, I want you to assure us that you will not take a lenient view so far as penalties and prosecutions go,” IS Prasad, chairman, central taxes of FKCCI told BR Balakrishnan, Principal Chief Commissioner of I-T.",
    "contentSnippet": "“We want the department to collect more in taxes and we will support you. However, I want you to assure us that you will not take a lenient view so far as penalties and prosecutions go,” IS Prasad, chairman, central taxes of FKCCI told BR Balakrishnan, Principal Chief Commissioner of I-T.",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/dont-set-targets-to-prosecute-us-industry-tells-income-tax-department/articleshow/64467367.cms",
    "isoDate": "2018-06-05T14:25:43.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.09090909090909091,
        "tokens": [
            "don't",
            "set",
            "targets",
            "to",
            "prosecute",
            "us",
            "industry",
            "tells",
            "income",
            "tax",
            "department"
        ],
        "words": [
            "prosecute"
        ],
        "positive": [],
        "negative": [
            "prosecute"
        ]
    },
    "article": {
        "title": "Don't set targets to prosecute us: Industry tells Income Tax department",
        "content": "<div class=\"Normal\"><span>BENGALURU: Members of the Federation of Karnataka Chamber of Commerce and Industry (FKCCI), on Tuesday urged the </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/income-tax\">income tax</a><p> (I-T) department not to set targets to levy penalties and prosecute them. \n\n</p><p>“We want the department to collect more in taxes and we will support you. However, I want you to assure us that you will not take a lenient view so far as penalties and prosecutions go,” IS Prasad, chairman, central taxes of FKCCI told BR Balakrishnan, Principal Chief Commissioner of I-T.\n</p><p>Balakrishnan was part of an interaction with the FKCCI, the Institute of Chartered Accountants of India and the Karnataka State Chartered Accountants Association. Prasad, while pointing out the achievements of the department in the state, argued that Karnataka is among the most compliant states in the country and that the department must ensure its businessmen run operations without fear of prosecution.\n</p><span>\n</span><strong>Rs 12k-cr evasion</strong><p>“We don’t prosecute people with a sadistic pleasure, even we do not like prosecuting people based on technical grounds, but you must understand that it is one of the tools of our process. If there are cases of deliberate attempts to evade tax, or those having illicit income coming from drugs and corruption, I don’t think it is fair to not prosecute them,” Balakrishnan said.\n</p><p>He further pointed out that while Karnataka is among the most compliant states, it also has a lot of people trying to evade taxes every year. He said that between December 2016 and March 2018, the department has detected tax evasion of Rs 12,000 crore.\n</p><p>“Of this, the assesses have admitted to having unaccounted income of Rs 5,300 crore, which is a record,” he said, adding that prosecution is a form of deterrent and that the department wishes to use it to its full potential.\n</p><p>Prasad, while claiming that his appeal to the department was based on requests from the members of FKCCI—it has more than 3,000 members—also said that the department needs to look into issues plaguing its e-assessment system and those concerning the Central Processing Centre.\n</p><p>Balakrishnan, while conceding that there are several issues, said that the department is working overtime to resolve them.\n</p><span>\n</span><strong>Election duty: “We were non-partisan”</strong><p>Balakrishnan, who’s also the Director General of Investigations, Karnataka and Goa region, on Tuesday reiterated that the department was non-partisan while performing its duties during the elections.\n</p><p>“We are proud of what we’ve achieved despite all the criticisms. I want to tell you again that we were not favouring anybody and we conducted searches and made seizures from all parties. However, I cannot bring out a list and share it as it is confidential information,” he said.\n</p><span>\n</span><br><span>He also said that in some specific cases, the department was able to document the entire process of cash movement. “From the time it was collected from contractors to the time it reached the constituencies, we’ve documented everything and that should tell you a lot,” he said.\n</span><br><span>\n</span><br><span>\n</span><strong>Rs 12,000 cr collected in 2 months<br></strong><span>\n</span><br><span>The income tax (I-T) department has already collected Rs 12,000 crore as income tax in the first two months—April and May—of this financial year and is all geared up to meet its target of Rs 1.23 lakh crore for the year.\n</span><br><span>\n</span><br><span>“While the collections for the first two months increased by more than 20% compared to last year, meeting the target would be challenging,” Balakrishnan said.\n</span><br><span>\n</span><p>Claiming that collections in Karnataka show the state’s high compliance, he said: “In places like Gujarat, Tamil Nadu and Andhra Pradesh, the economic activity is significantly more than that in Karnataka, and yet the collections here are more.”\n</p><span>\n</span></div>"
    },
    "adjectives": [
        "set",
        "collect",
        "I",
        "lenient",
        "far",
        "go",
        "central",
        "Principal",
        "Chief",
        "10",
        "left",
        "top",
        "right"
    ],
    "nouns": [
        "Don",
        "set",
        "us",
        "Industry",
        "india",
        "industry",
        "Income",
        "income",
        "Tax",
        "tax",
        "department",
        "want",
        "collect",
        "will",
        "support",
        "I",
        "view",
        "so",
        "far",
        "go",
        "chairman",
        "central",
        "BR",
        "Principal",
        "Chief",
        "Commissioner",
        "T",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo"
    ],
    "verbs": [
        "Don",
        "set",
        "prosecute",
        "Tax",
        "tax",
        "want",
        "collect",
        "will",
        "support",
        "assure",
        "view",
        "go",
        "chairman",
        "border",
        "align",
        "style",
        "top",
        "right"
    ]
}