{
    "creator": "PTI",
    "title": "WhatsApp leak: SEBI to take action against operators, senior staff of about twelve listed blue chip firms",
    "link": "https://www.financialexpress.com/market/whatsapp-leak-sebi-to-take-action-against-operators-senior-staff-of-about-twelve-listed-blue-chip-firms/1194424/",
    "pubDate": "Tue, 05 Jun 2018 16:42:20 +05:30",
    "dc:creator": "PTI",
    "content": "Sebi will soon take action against some market operators and senior staff members of about a dozen listed blue-chip firms for their alleged involvement in leak of price-sensitive information through WhatsApp. ",
    "contentSnippet": "Sebi will soon take action against some market operators and senior staff members of about a dozen listed blue-chip firms for their alleged involvement in leak of price-sensitive information through WhatsApp.",
    "guid": "https://www.financialexpress.com/?p=1194424",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-05T11:12:20.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.058823529411764705,
        "tokens": [
            "whatsapp",
            "leak",
            "sebi",
            "to",
            "take",
            "action",
            "against",
            "operators",
            "senior",
            "staff",
            "of",
            "about",
            "twelve",
            "listed",
            "blue",
            "chip",
            "firms"
        ],
        "words": [
            "leak"
        ],
        "positive": [],
        "negative": [
            "leak"
        ]
    },
    "article": {
        "title": "WhatsApp leak: SEBI to take action against operators, senior staff of about twelve listed blue chip firms",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1193482\" src=\"https://images.financialexpress.com/2018/06/sebi-2.jpg\" alt=\"sebi, insolvency\" srcset=\"https://images.financialexpress.com/2018/06/sebi-2.jpg 660w, https://images.financialexpress.com/2018/06/sebi-2-300x200.jpg 300w, https://images.financialexpress.com/2018/06/sebi-2-620x413.jpg 620w, https://images.financialexpress.com/2018/06/sebi-2-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Sebi had asked HDFC bank to conduct internal investigations to identify those guilty of the leak. (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>Sebi will soon take action against some market operators and senior staff members of about a dozen listed blue-chip firms for their alleged involvement in leak of price-sensitive information through <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/whatsapp/\">WhatsApp</a>. The companies may also face censure action by the market watchdog for alleged lapses in safeguard mechanism to check leak of unpublished price sensitive information (UPSI), including financial results before they were made public for all investors, regulatory sources said.</p><span>\n</span><p>The regulator is close to completing its probe into the matter, including for suspected unlawful gains through insider trading on the basis of leaked information, and is collating the details it had sought from all concerned companies, the officials said. Almost all the companies have replied to Sebi’s queries in this regard.</p><span>\n</span><p>According to top officials, the regulator is taking a tough stand on the companies that fail to fix individual responsibility for any leak of price-sensitive information. Besides, the market operators, including staff members of some brokerage firms, are also under the scanner for colluding with the company executives in the case, which came to light late last year.</p><span>\n</span><p>Among various companies from which Sebi had sought details through its interim orders, HDFC Bank last week disclosed in a regulatory filing that it has submitted the requisite information to the regulator.</p><span>\n</span><p>Referring to Sebi’s February 23 directions, HDFC Bank said, “In this regard, and keeping with its commitment to the highest standards of corporate governance and the integrity of its systems, controls and processes, the Bank has submitted the requisite information and reports to Sebi in compliance with the Sebi directions and within the timelines prescribed therein.”</p><span>\n</span><p>Sebi had asked the bank to conduct internal investigations to identify those guilty of the leak and take steps to check any recurrence, and also provide necessary information to the regulator within three months.</p><span>\n</span><p>Apart from HDFC Bank, the regulator has already passed preliminary orders against <a target=\"_blank\" href=\"http://www.financialexpress.com/auto/new-cars/tata/\">Tata</a> Motors, Axis Bank and Bata India in this high-profile case, wherein they were asked to conduct internal probes and report back to the regulator. The probe concerns about a dozen listed firms.</p><span>\n</span><p>Soon after the preliminary orders were passed by Sebi, the four companies had said that they would comply with the directions from the regulator.The preliminary probe by Sebi found that the firms’ quarterly financial results were matching with the figures that were in circulation on WhatsApp groups prior to the official announcement.</p><span>\n</span><p>Sebi began a probe in November 2017 after a media report surfaced with respect to circulation of unpublished price sensitive information in various private WhatsApp groups about certain companies before their official announcements.</p><span>\n</span><p>The regulator had also conducted search and seizure operations in this regard at various places, including on the premises of various market entities. Those being probed by Sebi include auditors, brokers, analysts and investment advisors, besides the company executives, with whom the financial information was shared before being made public through regulatory disclosure on stock exchanges.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "senior",
        "sensitive",
        "twelve",
        "listed",
        "blue",
        "dozen",
        "alleged"
    ],
    "nouns": [
        "price",
        "chip",
        "will",
        "action",
        "leak",
        "senior",
        "sensitive",
        "staff",
        "market",
        "dozen",
        "involvement",
        "information",
        "twelve",
        "blue"
    ],
    "verbs": [
        "price",
        "chip",
        "will",
        "action",
        "leak",
        "staff",
        "blue",
        "market"
    ]
}