{
    "creator": "PTI",
    "title": "Patanjali gets UP’s nod to give land to subsidiary firm to set up food park",
    "link": "https://www.financialexpress.com/industry/patanjali-gets-ups-nod-to-give-land-to-subsidiary-firm-to-set-up-food-park/1212156/",
    "pubDate": "Tue, 19 Jun 2018 17:10:29 +05:30",
    "dc:creator": "PTI",
    "content": " The state government decision enables the Haridwar-based firm to meet the Centre's June 30 deadline to fulfill its various conditions, including the acquisition of land, for its final nod to set up the food park.",
    "contentSnippet": "The state government decision enables the Haridwar-based firm to meet the Centre's June 30 deadline to fulfill its various conditions, including the acquisition of land, for its final nod to set up the food park.",
    "guid": "https://www.financialexpress.com/?p=1212156",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-19T11:40:29.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "patanjali",
            "gets",
            "up’s",
            "nod",
            "to",
            "give",
            "land",
            "to",
            "subsidiary",
            "firm",
            "to",
            "set",
            "up",
            "food",
            "park"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Patanjali gets UP’s nod to give land to subsidiary firm to set up food park",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1212178\" src=\"https://images.financialexpress.com/2018/06/patanjali.jpg\" alt=\" Patanjali, Uttar Pradesh, Uttar Pradesh government, Greater Noida, Rs 6,000-crore, food park, Yogi Adityanath, Amit Shah, Ramdev, Acharya Balakrishna, Ayurved, Herbal Park\" srcset=\"https://images.financialexpress.com/2018/06/patanjali.jpg 660w, https://images.financialexpress.com/2018/06/patanjali-300x200.jpg 300w, https://images.financialexpress.com/2018/06/patanjali-620x413.jpg 620w, https://images.financialexpress.com/2018/06/patanjali-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The Uttar Pradesh government today gave its nod to Patanjali Ayurveda Pvt Ltd to transfer its land to its subsidiary company in Greater Noida for setting up a Rs 6,000-crore mega food park.</figure>\n\t\t\t</section></div><span>\n</span><p>The Uttar Pradesh government today gave its nod to Patanjali Ayurveda Pvt Ltd to transfer its land to its subsidiary company in Greater Noida for setting up a Rs 6,000-crore mega food park. The state government decision enables the Haridwar-based firm to meet the Centre’s June 30 deadline to fulfil its various conditions, including acquisition of land, for its final nod to set up the food park. A decision to allow Patanjali to transfer its land to its subsidiary firm was taken at a state Cabinet meeting chaired by Chief Minister Yogi Adityanath here, an official spokesperson told mediapersons.</p><span>\n</span><p>The decision comes against the backdrop of the pressure of Patanjali group which had threatened to shift its food park out of the state at a time when it was trying to showcase its investor-friendly image. A day after the group had threatened to cancel the project, <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/bharatiya-janata-party/\">BJP</a> president <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/amit-shah/\">Amit Shah</a> met Ramdev under the party’s ‘Sampark for Samarthan’ campaign and Chief Minister Yogi Adityanath had called up Ramdev and Patanjali Group CEO Acharya Balakrishna personally to assure them of all possible help and co-operation.</p><span>\n</span><p>Along with its request for transfer of land to its subsidiary company, Patanjali had also asked for a government subsidy of Rs 150 crore for setting up the food park even though the subsidiary company had no land in its name. As the deadline was about to expire, the Centre decided to give 15 days more time till June 30 to Patanjali Ayurved for meeting conditions like acquisition of land, required for the final nod for setting up the proposed mega food park. As the earlier deadline to meet the required conditions was to expire on June 15, the Uttar Pradesh government had requested the Union Food Processing Ministry to give more time to the leading FMCG firm and extend the deadline till June 30.</p><span>\n</span><p>“Since the company is already taking action and requested for 15 days extra time to meet the conditions, the ministry will grant the time as requested,” Food Processing Secretary JP Meena had said. The company had proposed to invest up to Rs 6,000 crore to set up a plant over 425 acres of land along the Yamuna Expressway through its step-down firm Patanjali Food and Herbal Park. The conditions that were to be complied with include acquisition and transfer of land in the name of Patanjali Ayurved’s subsidiary. Patanjali wanted to transfer 91 acres of this land to its subsidiary, Patanjali Food and Herbal Park Noida Pvt Ltd, for setting up a mega food park.</p><span>\n</span><p>The permission had earlier been withheld as the infrastructure and industrial development policy of 2012, under which land had been allocated to Patanjali along the Yamuna Expressway in 2016, did not allow for land to be subleased. On June 6, Patanjali had said that its mega food park would produce goods worth Rs 25,000 crore annually on full capacity running. It is envisaged to create 10,000 direct jobs. Patanjali is presently investing in mega food park projects, including those in Nagpur (Maharashtra) and Tezpur (Assam).</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "UP",
        "firm",
        "subsidiary",
        "based",
        "set",
        "meet",
        "30",
        "various",
        "final"
    ],
    "nouns": [
        "give",
        "firm",
        "land",
        "nod",
        "food",
        "subsidiary",
        "government",
        "set",
        "park",
        "decision",
        "state",
        "30",
        "meet",
        "Centre",
        "June",
        "deadline",
        "acquisition",
        "conditions",
        "final"
    ],
    "verbs": [
        "nod",
        "give",
        "UP",
        "firm",
        "land",
        "set",
        "park",
        "state",
        "Centre",
        "meet",
        "fulfill"
    ]
}