{
    "title": "DSK Group scam: Pune court reserves bail plea of BoM's CEO Ravinder Marathe",
    "link": "https://www.business-standard.com/article/finance/dsk-group-scam-pune-court-reserves-bail-plea-of-bom-s-ceo-ravinder-marathe-118062600023_1.html",
    "pubDate": "Tue, 26 Jun 2018 08:58:00 +0530",
    "content": "Marathe and other top officials of the nationalised bank were arrested last week",
    "contentSnippet": "Marathe and other top officials of the nationalised bank were arrested last week",
    "guid": "https://www.business-standard.com/article/finance/dsk-group-scam-pune-court-reserves-bail-plea-of-bom-s-ceo-ravinder-marathe-118062600023_1.html",
    "isoDate": "2018-06-26T03:28:00.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.15384615384615385,
        "tokens": [
            "dsk",
            "group",
            "scam",
            "pune",
            "court",
            "reserves",
            "bail",
            "plea",
            "of",
            "bom's",
            "ceo",
            "ravinder",
            "marathe"
        ],
        "words": [
            "scam"
        ],
        "positive": [],
        "negative": [
            "scam"
        ]
    },
    "article": {
        "title": "DSK Group scam: Pune court reserves bail plea of BoM's CEO Ravinder Marathe",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tA special sessions court here on Monday reserved its order on the bail plea of Bank of Maharashtra's MD and CEO Ravindra Marathe, after his counsel argued that the top banker's arrest was \"illegal\" as the police had failed to secure the prior permission from the Reserve Bank of India (RBI).</p>\n<p>\n\tMarathe and other top officials of the nationalised bank were arrested last week in connection with a cheating case lodged against Pune-based builder D S Kulkarni, popularly known as DSK, and his wife Hemanti.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\t\"The arrest of Marathe is illegal. Since he is the CEO and MD of a nationalised bank, he holds the rank of a secretary. A permission of the Reserve Bank was mandatory before starting his arrest procedure. The CBI's anti-corruption branch is the competent agency to investigate such cases, where a public servant of a nationalised bank is involved,\" senior advocate Harshad Nimbalkar, appearing on behalf of Marathe, told the court.</p>\n<p>\n\tThe prosecution did not oppose Marathe's bail plea and submitted that his custody was no longer required as the necessary documents were already seized by the officials of the Economic Offence Wing (EOW) of Pune Police.</p>\n<p>\n\tJudge S N Sardesai reserved the order till Tuesday.</p>\n<p>\n\tMarathe is accused of misusing his powers to sanction a loan to DSK, who is in jail, along with his wife.</p>\n<p>\n\tNimbalkar said sanctioning the loan of Rs 100 million to DSK's firm DSKDL (D S <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=kulkarni\" target=\"_blank\">Kulkarni </a>Developers Ltd) was not an individual decision of Marathe, but a \"business decision\" and all the rules were followed while sanctioning and disbursing it.</p>\n<p>\n\tHe contended that charges under the Maharashtra Protection of Interest of Depositors (MPID) Act and the IPC could not be pressed against his client as the depositors had deposited their money with DSKDL and not with the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bank-of-maharashtra\" target=\"_blank\">Bank of Maharashtra.</a></p>\n<p>\n\t\"When the loan of Rs 100 million was sanctioned, the bank, while following the rules, had secured it by having a collateral security of Rs 105.2 million from the firm.</p>\n<p>\n\t\"After DSKDL failed to repay the loan, the account was declared a Non-Performing Asset (NPA), <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=kulkarni\" target=\"_blank\">Kulkarni </a>and his firm were declared wilful defaulters and further action has already been initiated by the bank,\" Nimbalkar told the court.</p>\n<p>\n\tHe added that the auction of some of DSKs properties was scheduled for July 23.</p>\n<p>\n\tNimbalkar also told the court that the day-to-day functioning of the bank was getting affected due to Marathe's arrest.</p>\n<p>\n\tMarathe is currently undergoing treatment at a private hospital while in judicial custody.</p>\n<p>\n\tMeanwhile, DSK's son Shirish Kulkarni, one of the accused in the cheating case against his father, surrendered before the sessions court today, a week after his pre-arrest bail plea was rejected by the Supreme Court.</p>\n<p>\n\tShirish, the managing director and CEO of DSKDL, was remanded to police custody till July 2.</p>\n<p>\n\tBesides Marathe, the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/eow\" target=\"_blank\">EOW </a>has arrested Bank of Maharashtra's Executive Director Rajendra Gupta, Zonal Manager Nityanand Deshpande, former CMD Sushil Muhnot, DSK's CA Sunil Ghatpande and Rajiv Newaskar, the vice president of the engineering department of DSKDL, under various sections of the MPID Act and IPC.</p>\n<p>\n\tAccording to the police, the bank officials allegedly colluded with DSKDL by misusing their powers and authority with a \"dishonest and fraudulent intention\" to sanction and disburse the amount under the garb of a loan.</p>\n<p>\n\tIn May, the city police had filed a 37,000-page chargesheet against DSK and his wife in the case.</p>\n<p>\n\tAs per the charge sheet, the total \"scam\" is worth Rs 20.43 billion, wherein the accused floated nine different firms to siphon off the funds collected from 33,000 investors and fixed-deposit (FD) holders, who were promised good returns on their FDs.</p>\n<p>\n\tThe police are probing the role of the bank officials in sanctioning loans to the builder without following due diligence.</p>\n<p>\n\tAccording to the complaint filed with the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/eow\" target=\"_blank\">EOW </a>by one of the depositors, investors had put lakhs of rupees in a fixed-deposit scheme of DSK Developers, but they neither received the interest nor the principal amount.</p>\n<p>\n\tThe developer and his wife were arrested from Delhi on February 17 by the Pune Police.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "top",
        "last"
    ],
    "nouns": [
        "week",
        "reserves",
        "Group",
        "scam",
        "court",
        "bail",
        "plea",
        "CEO",
        "top",
        "bank",
        "last"
    ],
    "verbs": [
        "Group",
        "scam",
        "court",
        "bail",
        "top",
        "bank",
        "last"
    ]
}