{
    "title": "Hot Wheels hits the road to reach its fans",
    "link": "https://www.business-standard.com/article/companies/hot-wheels-hits-the-road-to-reach-its-fans-118052201311_1.html",
    "pubDate": "Tue, 22 May 2018 20:43:00 +0530",
    "content": "Mattel goes all out to keep its best-selling brand connected with the young fans even as they gravitate towards mobile devices from traditional toys",
    "contentSnippet": "Mattel goes all out to keep its best-selling brand connected with the young fans even as they gravitate towards mobile devices from traditional toys",
    "guid": "https://www.business-standard.com/article/companies/hot-wheels-hits-the-road-to-reach-its-fans-118052201311_1.html",
    "isoDate": "2018-05-22T15:13:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.1111111111111111,
        "tokens": [
            "hot",
            "wheels",
            "hits",
            "the",
            "road",
            "to",
            "reach",
            "its",
            "fans"
        ],
        "words": [
            "reach"
        ],
        "positive": [
            "reach"
        ],
        "negative": []
    },
    "article": {
        "title": "Hot Wheels hits the road to reach its fans",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tAfter six billion vehicles sold, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=hot+wheels\" target=\"_blank\">Hot Wheels </a>is looking for one more car to race down those plastic orange tracks. And it could be yours.</p>\n<p>\n\tMattel, the toymaker that owns the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=hot+wheels\" target=\"_blank\">Hot Wheels </a>brand, is searching for the best custom car in the United States. The chosen vehicle will be made into a miniature die-cast car to celebrate the 50th anniversary of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=hot+wheels\" target=\"_blank\">Hot Wheels.</a>\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe search, called the Legends Tour, is part of Mattel’s effort to stay connected with Hot Wheels fans at a time when children are gravitating more toward mobile devices and away from traditional <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=toys\" target=\"_blank\">toys.</a></p>\n<p>\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=legends+tour\" target=\"_blank\">Legends Tour </a>began at the company’s headquarters in El Segundo, Calif., and will end in October at an automotive convention, the SEMA Show in Las Vegas. Along the way, fans can enter their custom vehicles, which will be judged on flair and originality. The winning car will be available at retailers worldwide in the fall of 2019.</p>\n<p>\n\t“It is going to be an extravaganza,” said Chris Down, a senior vice president and global brand general manager for Hot Wheels. “There is crazy enthusiasm around the brand.”<br></p>\n<p>\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=legends+tour\" target=\"_blank\">Legends Tour </a>comes at a crucial time for <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=mattel\" target=\"_blank\">Mattel.</a> Hot Wheels is the No. 1 selling toy in the world, but Mattel’s sales have been in a prolonged slump as the company struggles to adapt to the rise of technological competitors for children’s attention and the decision by <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=toys\" target=\"_blank\">Toys </a>“R” Us, one of its biggest customers, to close or sell all of its stores in the United States.<br></p>\n<p>\n\tThose challenges contributed to Mattel’s loss last year of $1.1 billion, which also included a charge related to a change in United States taxes. Its stock has plummeted about 30 percent in the last year. Hoping for a turnaround, the company hired Ynon Kreiz, a former studio executive, as chief executive in April, making him the fourth person to hold the job in four years.</p>\n<p>\n\tToymakers have to find a new way to reach children because TV no longer provides the same level of engagement, said Jim Silver, chief executive and editor in chief of TTPM, a toy industry website. Live events like the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=legends+tour\" target=\"_blank\">Legends Tour </a>can help raise a company’s profile.</p>\n<p>\n\t“What these events do is create an experience,” he said. “You see things larger than life, which is different than seeing it on screen.”</p>\n<p>\n\tHot Wheels began in 1968 when Elliot Handler, a co-founder of Mattel, wanted to diversify the company’s products with a line of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=toy+cars\" target=\"_blank\">toy cars.</a></p>\n<p>\n\t“The toy market was more about collect and display and less about play,” Mr. Down said. “Elliot Handler had that vision that there was a greater opportunity with those cars.”</p>\n<p>\n\tMr. Handler wanted to make cars that were flashy and fun, Mr. Down said, but he also kept an eye on the engineering side, making sure the cars had realistic features like rolling wheels.</p>\n<p>\n\t“Hot Wheels have some element of fantasy and amp up the design aesthetics,” Mr. Down said. Mattel’s Matchbox brand, by contrast, offers more straightforward representations of what children and adults see on the open road, he added.</p>\n<p>\n\tRevered for their auto culture sensibility, Hot Wheels can sometimes cross over into pop culture, thanks to Mattel’s partnerships with brands like DC, Marvel and Star Wars. These character “mash-up” cars are popular among fans because the Hot Wheels design team has a keen eye for detail, Mr. Down said.</p>\n<p>\n\t“They will design it from the ground up to capture the look,” he said. The Hot Wheels Darth Vader car, for instance, uses his face cowl as an air intake.</p>\n<p>\n\tThe Darth Vader car is one of the few miniature speedsters converted into a full-size replica that was introduced in 2014 at Comic-Con International in San Diego. It is fully operational, with an LS3 engine, 526 horsepower and custom red-line tires.</p>\n<p>\n\tThe first full-scale vehicle was a 2001 replica of the Hot Wheels Twin Mill, a car introduced in 1969 that had twin V8 engines poking out of the hood.</p>\n<p>\n\tThe attention to detail has kept collectors fascinated with Hot Wheels for the last five decades. <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=mattel\" target=\"_blank\">Mattel </a>started a collectors website in 2001, and a members-only group with premium content, the Red Line Club, a year later.</p>\n<p>\n\t “These are the people who love the brand the most and advocate for the brand,” said Matt Brutocao, the director of global brand marketing for Hot Wheels.</p>\n<p>\n\tFans have even organized their own conventions throughout the year; the biggest is in Mexico City, attracting 30,000 people from all over the world.</p>\n<p>\n\tMr. Brutocao said the collector community was “incredibly diverse,” crossing age, race and gender. “One in three girls owns a Hot Wheels car, whether they have a brother or not,” he said.</p>\n<p>\n\tBruce Pascal, a 56-year-old commercial real estate broker in Washington, is a lifelong collector. He was 7 when he started playing with Hot Wheels. As an adult, he rediscovered his love for the tiny roadsters and started collecting them.</p>\n<p>\n\t“I was the kid who played with Hot Wheels the week they came out,” he said. “It was the personal connection that made them special.”</p>\n<p>\n\tHe now has about 3,500 cars in custom-built display cases and cabinets in his collection, which was once appraised at $1.8 million. After compiling more than 1,000 early blueprints, internal company memos, pencil drawings of proposed cars and advertising items, he wrote a book about his obsession, “Hot Wheels Prototypes.”</p>\n<p>\n\tEvents like the Legends Tour offer an opportunity for collectors like Mr. Pascal to meet in person. “Everyone has a Hot Wheels car story, and they are happy to share it,” Mr. Down said.</p>\n<hr>\n\t<em><strong>©2018 The New York Times <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=news\" target=\"_blank\">News </a>Service</strong></em>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "connected",
        "even",
        "traditional",
        "Hot",
        "best",
        "young",
        "mobile"
    ],
    "nouns": [
        "reach",
        "even",
        "devices",
        "keep",
        "road",
        "best",
        "selling",
        "brand",
        "young",
        "mobile"
    ],
    "verbs": [
        "reach",
        "even",
        "keep",
        "best",
        "brand",
        "gravitate"
    ]
}