{
    "title": "Renewable Energy ministry sets 30 Gw offshore wind energy target by 2030",
    "link": "https://www.business-standard.com/article/economy-policy/renewable-energy-ministry-sets-30-gw-offshore-wind-energy-target-by-2030-118061900855_1.html",
    "pubDate": "Tue, 19 Jun 2018 20:36:00 +0530",
    "content": "MNRE recently invited Expressions of Interest (EoI) for the first 1 Gw offshore wind project in India, which has evoked a keen response from the industry, both global and Indian",
    "contentSnippet": "MNRE recently invited Expressions of Interest (EoI) for the first 1 Gw offshore wind project in India, which has evoked a keen response from the industry, both global and Indian",
    "guid": "https://www.business-standard.com/article/economy-policy/renewable-energy-ministry-sets-30-gw-offshore-wind-energy-target-by-2030-118061900855_1.html",
    "isoDate": "2018-06-19T15:06:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "renewable",
            "energy",
            "ministry",
            "sets",
            "30",
            "gw",
            "offshore",
            "wind",
            "energy",
            "target",
            "by",
            "2030"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Renewable Energy ministry sets 30 Gw offshore wind energy target by 2030",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=ministry+of+new+and+renewable+energy\" target=\"_blank\">Ministry of New and </a><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/renewable-energy\" target=\"_blank\">Renewable Energy </a>(MNRE) on Thursday announced medium and long-term offshore wind energy target of 5 Gw by 2022 and 30 Gw by 2030, respectively, to provide confidence to the industry.</p>\n<p>\n\tThe MNRE recently invited Expressions of Interest (EoI) for the first 1 Gw offshore wind project in India, which has evoked a keen response from the industry, both global and Indian, the ministry said in a statement.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tIn order to give confidence to the wind industry, the ministry has declared medium and long-term target for off-shore wind power capacity additions, which are 5 Gw by 2022 and 30 Gw by 2030, the statement said.</p>\n<p>\n\tWhile this may look moderate in comparison to India's on-shore wind target of 60 Gw and its achievement of 34 Gw, and solar target of 100 Gw by 2022, this would still be challenging considering the difficulties in installing large wind power turbines in open seas, it added.</p>\n\n<p>\n\tIt may be mentioned that offshore wind turbines are of much larger dimensions and capacities than onshore turbines. The offshore wind power will add a new element to the already existing basket of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/renewable-energy\" target=\"_blank\">renewable energy </a>for the country.</p>\n<p>\n\tThe MNRE had notified National Off-Shore Wind Policy in October 2015 to realise the offshore wind power potential in the country. Preliminary studies have indicated good wind potential for off-shore wind power both in the southern tip of Indian peninsula and west coast.</p>\n<p>\n\tTwo regions where preliminary studies have been conducted are off the&nbsp;coast of Gujarat and that of Tamil Nadu. For precise wind quality measurements, one <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=lidar\" target=\"_blank\">LiDAR </a>has been installed near Gujarat coast, which is generating data about the quality of off-shore wind since November 2017.</p>\n\n<p>\n\tEncouraged by the quality of off-shore wind, a private sector player has also installed <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=lidar\" target=\"_blank\">LiDAR </a>in Gulf of Kutch in Gujarat for offshore wind resource measurements. Plans are afoot to install more of such equipment in Tamil Nadu and Gujarat. Surveys to understand the oceanographic and sea bed condition within identified zones off the coast of Gujarat and Tamil Nadu have been planned.</p>\n<p>\n\tGlobally there has been an installation of about 17 to 18 Gw of off-shore wind power led by countries such as UK, Germany, Denmark, Netherlands &amp; China. Recent years have witnessed fall in off-shore wind tariff in some of these markets, the statement said.</p><p id=\"auto_disclaimer\">(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Indian",
        "offshore",
        "first",
        "global",
        "keen",
        "Renewable",
        "30",
        "evoked"
    ],
    "nouns": [
        "India",
        "industry",
        "Indian",
        "first",
        "ministry",
        "Interest",
        "project",
        "response",
        "target",
        "wind",
        "keen",
        "Energy",
        "energy",
        "30"
    ],
    "verbs": [
        "Interest",
        "project",
        "target",
        "wind",
        "keen"
    ]
}