{
    "creator": "AFP",
    "title": "US Senate votes to reimpose ban on China’s ZTE, shares plunge",
    "link": "https://www.financialexpress.com/industry/us-senate-votes-to-reimpose-ban-on-chinas-zte-shares-plunge/1212034/",
    "pubDate": "Tue, 19 Jun 2018 15:51:02 +05:30",
    "dc:creator": "AFP",
    "content": "The US Senate defied President Donald Trump today by voting to overrule his administration's deal with Chinese telecom firm ZTE.",
    "contentSnippet": "The US Senate defied President Donald Trump today by voting to overrule his administration's deal with Chinese telecom firm ZTE.",
    "guid": "https://www.financialexpress.com/?p=1212034",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-19T10:21:02.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.09090909090909091,
        "tokens": [
            "us",
            "senate",
            "votes",
            "to",
            "reimpose",
            "ban",
            "on",
            "china’s",
            "zte",
            "shares",
            "plunge"
        ],
        "words": [
            "shares",
            "ban"
        ],
        "positive": [
            "shares"
        ],
        "negative": [
            "ban"
        ]
    },
    "article": {
        "title": "US Senate votes to reimpose ban on China’s ZTE, shares plunge",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1212038\" src=\"https://images.financialexpress.com/2018/06/ZTE.jpg\" alt=\"us, china, zte, us senate, china stock markets, us stock markets\" srcset=\"https://images.financialexpress.com/2018/06/ZTE.jpg 660w, https://images.financialexpress.com/2018/06/ZTE-300x200.jpg 300w, https://images.financialexpress.com/2018/06/ZTE-620x413.jpg 620w, https://images.financialexpress.com/2018/06/ZTE-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> ZTE said soon after the ban was imposed that its major operations had “ceased”, raising the possibility of its collapse. (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>The US Senate defied President Donald Trump today by voting to overrule his administration’s deal with Chinese telecom firm ZTE and reimpose a ban on hi-tech chip sales to the company.&nbsp;Senators added an amendment targeting ZTE into a sweeping, must-pass national defense spending bill that cleared the chamber on an 85-10 vote.</p><span>\n</span><p>The company has been on life support since Washington said it had banned US companies from selling crucial hardware and software components to ZTE for seven years.</p><span>\n</span><p>US officials imposed the ban because of what they said were false statements by the firm over actions it claimed to have taken regarding the illegal sale of goods to Iran and North Korea. ZTE pleaded guilty to those charges in March last year and was hit with USD1.2 billion in fines.</p><span>\n</span><p>Earlier this month the Trump administration gave ZTE a lifeline by easing the sanctions in exchange for a further USD 1.4 billion penalty.</p><span>\n</span><p>But the Senate measure nullifies that action, proposing an outright ban on the government buying products and services from ZTE and another Chinese telecoms firm, Huawei.</p><span>\n</span><p>“We’re heartened that both parties made it clear that protecting American jobs and national security must come first when making deals with countries like China, which has a history of having little regard for either,” a bipartisan group of senators said.</p><span>\n</span><p>Hong Kong-listed shares in ZTE plunged 25.81 per cent to end at HKD 9.85 today. The company has lost nearly two-thirds of its value since it resumed trading last week after a two-month suspension that followed the initial ban.</p><span>\n</span><p>The lawmakers who introduced the amendment include top Democrat Chuck Schumer and Republican Marco Rubio.</p><span>\n</span><p>However, the bill — which provides USD 716 billion in funding for national defense for fiscal year 2019 and gives policy guidance to the Pentagon — is not a done deal.</p><span>\n</span><p>The House of Representatives passed its own version of the measure, and the two chambers must now hash out a compromise.</p><span>\n</span><p>“It is vital that our colleagues in the House keep this bipartisan provision in the bill as it heads towards a conference,” Schumer and Rubio said.</p><span>\n</span><p>Trump’s intervention to help the firm was seen at the time as part of a move to smooth over trade tensions with Beijing as they embarked on talks to avert a trade war, with the president tweeting on May 13 that too many Chinese jobs were at threat.</p><span>\n</span><p>“This is the first time <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/congress/\">Congress</a> has really stood up to (Trump) on a trade issue, and it’s clear they are angry,” Bill Reinsch, a senior adviser at the Center for Strategic and International Studies in Washington, told Bloomberg News.</p><span>\n</span><p>“There will be a lot of congressional resistance to weakening the ZTE amendment, but I would not be surprised to see a compromise.” ZTE, which employs 80,000 people, said soon after the ban was imposed that its major operations had “ceased”, raising the possibility of its collapse.</p><span>\n</span><p>Its fiberoptic networks depend on US components and its cheap smartphones sold en masse abroad are powered by US chips and the Android operating system.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "Chinese",
        "firm"
    ],
    "verbs": [
        "ban",
        "plunge",
        "reimpose",
        "Trump",
        "overrule",
        "deal",
        "firm"
    ],
    "nouns": [
        "ban",
        "Senate",
        "plunge",
        "President",
        "US",
        "today",
        "voting",
        "China",
        "Chinese",
        "Trump",
        "administration",
        "deal",
        "firm",
        "telecom"
    ]
}