{
    "title": "Videocon, Gitanjali Gems among 430 stocks trading below their face value",
    "link": "https://www.business-standard.com/article/markets/videocon-gitanjali-gems-among-430-stocks-trading-below-their-face-value-118062600271_1.html",
    "pubDate": "Tue, 26 Jun 2018 23:48:00 +0530",
    "content": "Thus far in CY18, both the S&P BSE Small-cap and the S&P BSE Midcap indices have underperformed by falling 15 per cent and 12 per cent respectively.",
    "contentSnippet": "Thus far in CY18, both the S&P BSE Small-cap and the S&P BSE Midcap indices have underperformed by falling 15 per cent and 12 per cent respectively.",
    "guid": "https://www.business-standard.com/article/markets/videocon-gitanjali-gems-among-430-stocks-trading-below-their-face-value-118062600271_1.html",
    "isoDate": "2018-06-26T18:18:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "videocon",
            "gitanjali",
            "gems",
            "among",
            "430",
            "stocks",
            "trading",
            "below",
            "their",
            "face",
            "value"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Videocon, Gitanjali Gems among 430 stocks trading below their face value",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tA sharp correction in small-cap stocks over the past few months has pushed 430 actively traded stocks on the Bombay Stock Exchange (BSE) below their respective face value, as compared to 336 scrips at the beginning of calendar year 2018 (CY18).</p>\n<p>\n\tGitanjali Gems, Videocon Industries, Jai Balaji Industries, GTL, Orchid Pharma, IVRCL, Jaypee Infratech, PBA Infrastructure, Gammon Infrastructure Project, Tantia Constructions, ABG Shipyard, Shilpi Cable Technologies, Hindustan Dorr-Oliver, Andhra Cements, Burnpur Cement and Tree House Education are some of the prominent stocks quoting below their respective face value.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThus far in CY18, both the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=s+p+bse+small+cap\" target=\"_blank\">S&amp;P BSE Small-cap </a>and the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=s+p+bse+midcap\" target=\"_blank\">S&amp;P BSE Midcap </a>indices have underperformed by falling 15 per cent and 12 per cent respectively, as compared to four per cent rise in the S&amp;P BSE Sensex.</p>\n<p>\n\tGitanjali Gems, Diamond Power Infrastructure, KSK Energy Ventures, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/ivrcl\" target=\"_blank\">IVRCL </a>and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/jaypee-infratech\" target=\"_blank\">Jaypee Infratech </a>from the S&amp;P BSE Smallcap and S&amp;P BSE 500 index companies, have seen market price erosion of more than 75 per cent thus far in CY18.</p>\n<p>\n\tAnalysts remain cautious on small-caps and suggest investors stay away from companies where there is no / little earnings visibility and valuation comfort.</p>\n<p>\n\t“Small-and mid-cap stocks witnessed a sharp rally in the last quarter of CY17. Many market participants justified even 35 to 40 price-to-earnings (PE) on one-year forward basis. In CY18, however, these stocks corrected. Unfortunately, this led to significant fall even in good quality stocks. We expect select stocks to start performing well soon once the valuation bubble we are seeing now in the large-cap stocks starts bursting,” says G Chokkalingam, founder and managing director, Equinomics Research.<br></p><p>\n\t\t<img align=\"left\" alt=\"chart\" class=\"imgCont\" height=\"454\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/26/full/1530037052-2205.jpg\" title=\"chart\" width=\"555\" data-pagespeed-url-hash=\"306884420\" onload=\"pagespeed.CriticalImages.checkImageForCriticality(this);\"></p>\n<p>\n\tThe fall in some cases, such as Gitanjali Gems, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/jaypee-infratech\" target=\"_blank\">Jaypee Infratech </a>and Videocon Industries, has been news-driven.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gitanjali-gems\" target=\"_blank\">Gitanjali Gems </a>hit an all-time low of Rs 2.75 on May 4, 2018, and has lost around 96 per cent from Rs 62.85, since February 14, the day the Punjab National Bank (PNB) fraud came into public domain. Likewise, debt-ridden <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/jaypee-infratech\" target=\"_blank\">Jaypee Infratech </a>is currently under the Corporate Insolvency Resolution Process of the Insolvency and Bankruptcy Code 2016.</p>\n<p>\n\tVideocon Industries, too, hit a record low of Rs 6.84 in June and has seen its market price more than halve thus far in CY18. The company also been referred to the National Company Law Tribunal (NCLT) for debt resolution.</p>\n<p>\n\t“Of the lot, stocks of companies on a solid fundamental footing are likely to bounce back. In cases where the <a class=\"storyTags\" href=\"https://www.business-standard.com/category/markets-news-1060101.htm\" target=\"_blank\">news </a>flow is found to be false and financials are strong are the ones that will see a faster rebound. However, the rebound will take time and test the patience of investors,” cautions Kunj Bansal, partner and chief investment officer at Sarthi Group.</p>\n<p>\n\tOver the next one year, A K Prabhakar, head of research at IDBI Capital expects the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/markets\" target=\"_blank\">markets </a>to remain choppy in the backdrop of global cues and developments back home such as monsoon progress, economic data and the upcoming general elections in 2019. Small-cap segment, he says, will underperform, though there will be stock specific outperformance where companies deliver on earnings.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "far",
        "Small",
        "falling",
        "15",
        "12"
    ],
    "nouns": [
        "trading",
        "cent",
        "stocks",
        "face",
        "value",
        "Thus",
        "far",
        "S",
        "P",
        "BSE",
        "Small",
        "cap",
        "15",
        "12"
    ],
    "verbs": [
        "face",
        "value",
        "cap"
    ]
}