{
    "creator": "FE Online",
    "title": "India services output falls for 1st time in 3 months; 6 key takeaways from services PMI data for May",
    "link": "https://www.financialexpress.com/economy/india-services-output-falls-for-1st-time-in-3-months-6-key-takeaways-from-services-pmi-data-for-may/1193924/",
    "pubDate": "Tue, 05 Jun 2018 12:42:29 +05:30",
    "dc:creator": "FE Online",
    "content": "The seasonally adjusted Nikkei India Services Business Activity Index fell from 51.4 in April to below 50 in May due to a broad stagnation in new orders, IHS Markit -- the publisher of PMI data -- said. ",
    "contentSnippet": "The seasonally adjusted Nikkei India Services Business Activity Index fell from 51.4 in April to below 50 in May due to a broad stagnation in new orders, IHS Markit -- the publisher of PMI data -- said.",
    "guid": "https://www.financialexpress.com/?p=1193924",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-05T07:12:29.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "india",
            "services",
            "output",
            "falls",
            "for",
            "1st",
            "time",
            "in",
            "3",
            "months",
            "6",
            "key",
            "takeaways",
            "from",
            "services",
            "pmi",
            "data",
            "for",
            "may"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "India services output falls for 1st time in 3 months; 6 key takeaways from services PMI data for May",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-617139\" src=\"https://images.financialexpress.com/2017/04/nikkei-l-ap-1.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2017/04/nikkei-l-ap-1.jpg 660w, https://images.financialexpress.com/2017/04/nikkei-l-ap-1-300x200.jpg 300w, https://images.financialexpress.com/2017/04/nikkei-l-ap-1-620x413.jpg 620w, https://images.financialexpress.com/2017/04/nikkei-l-ap-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> India’s services PMI fell to 49.6 for the month of May, indicating the first contraction in services activity in three months, IHC Markit data showed.</figure>\n\t\t\t</section></div><span>\n</span><p><span>The latest services sector data has brought some bad news for the Indian economy which is cheering the stellar fourth quarter GDP and May’s robust manufacturing output. India’s services Purchasing Managers’ Index (PMI) fell to 49.6 for the month of May, indicating the first contraction in services activity in three months. “The performance of the service sector was disappointing in May, as output dipped into contraction for the first time in three months,” Aashna Dodhia, Economist, IHS Markit, said.</span></p><span>\n</span><p><span>The seasonally adjusted Nikkei India Services Business Activity Index fell from 51.4 in April to below 50 in May due to a broad stagnation in new orders, IHS Markit — the publisher of PMI data — said. According to anecdotal evidence, competitive demand conditions was the key factor behind a decline in output, the survey said.</span></p><span>\n</span><p><span>An index reading of above 50 indicates an overall increase in activity and below 50 an overall decrease. Here are six key takeaways from the latest IHS Markit Services PMI data for May:</span></p><span>\n</span><span>\n</span><ol>\n<li><span>While the services activity contracted in May, the </span><b>overall economy grew</b><span>, albeit at the weakest pace in three months, the data showed. “India saw the slowest improvement in the health of the overall economy since February in May,” the survey report said. The Nikkei India Composite PMI Output Index fell to 50.4 in May from 51.9 in April. Overall, growth in the manufacturing sector outweighed the marginal decline in the service sector.</span></li>\n<li><b>Job growth lagged </b><span>the most in the last five months since December, even as new business at Indian manufacturing companies rose for the seventh consecutive month. “The slowdown in service activity fed into the labour market, as jobs growth moderated from April’s seven-year high,” the survey report said. Despite weak demand conditions, service providers continued to recruit employees further during May. Jobs growth was nonetheless evident across all monitored broad sectors, with the sharpest increase in Information &amp; Communications.</span></li>\n<li><span>During May, </span><b>input prices rose </b><span>across the service sector, thereby extending the current sequence of inflation to 21 months. Higher salaries, as well as prices for fuel and vegetables were reported to have increased in the latest survey period. Input cost inflation picked up from April’s eight-month low. “The latest survey showed the effects of higher global oil prices as the private sector recorded the most marked input cost inflation for three months.” Indian manufacturing companies faced </span><b>higher cost burdens </b><span>for the 32nd consecutive month in May amid reports of higher oil and steel costs.</span></li>\n<li><span>Despite a sharper rise in input prices, service sector </span><b>output charge inflation moderated </b><span>to an 11-month low which highlighted that firms were unable to fully pass on higher cost burdens to price-sensitive customers.</span></li>\n<li><span>Business confidence towards the 12-month outlook for output among service providers was the strongest since January 2015. “A bright spot of the services PMI data was that business sentiment was the strongest since January 2015, rooted in expectations of improvements in demand conditions in the year ahead,” the report said.</span></li>\n<li><b>Economist’s take: </b><span>While the latest data was not too encouraging in terms of the services index dipping below 50, the trend was “not entirely out of line”, Aditi Nayar, Principal Economist, ICRA said to CNBC TV18. ”What we have been seeing over the last three to four quarters is that we have a temporary dip and then immediately in the next month it goes back into expansion mode,” Aditi Nayar said. Further, she said that the index is just marginally below 50. “So I’m not terribly disappointed, but it is not an encouraging number either,” Nayar said.</span></li>\n</ol><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "broad",
        "1st",
        "key",
        "adjusted",
        "fell",
        "51",
        "50",
        "due",
        "new"
    ],
    "nouns": [
        "India",
        "Index",
        "broad",
        "data",
        "Activity",
        "stagnation",
        "falls",
        "services",
        "Services",
        "output",
        "time",
        "key",
        "May",
        "Business",
        "fell",
        "April",
        "50",
        "due",
        "publisher"
    ],
    "verbs": [
        "Index",
        "output",
        "time",
        "key",
        "fell"
    ]
}