{
    "creator": "FE Online",
    "title": "Modi’s Digital India at play? Digital payments triple to 7% of GDP in just 3 years, says Morgan Stanley",
    "link": "https://www.financialexpress.com/economy/modis-digital-india-at-play-digital-payments-triple-to-7-of-gdp-in-just-3-years-says-morgan-stanley/1194207/",
    "pubDate": "Tue, 05 Jun 2018 13:33:47 +05:30",
    "dc:creator": "FE Online",
    "content": "Digital payments in India: Riding high on the success of UPI-based payments system, the digital payments in India has tripled to 7% of GDP from 2.5% three years ago, according to Anil Agarwal of Morgan Stanley.",
    "contentSnippet": "Digital payments in India: Riding high on the success of UPI-based payments system, the digital payments in India has tripled to 7% of GDP from 2.5% three years ago, according to Anil Agarwal of Morgan Stanley.",
    "guid": "https://www.financialexpress.com/?p=1194207",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-05T08:03:47.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "modi’s",
            "digital",
            "india",
            "at",
            "play?",
            "digital",
            "payments",
            "triple",
            "to",
            "7",
            "of",
            "gdp",
            "in",
            "just",
            "3",
            "years",
            "says",
            "morgan",
            "stanley"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Modi’s Digital India at play? Digital payments triple to 7% of GDP in just 3 years, says Morgan Stanley",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"wp-image-1194212 size-full\" src=\"https://images.financialexpress.com/2018/06/scan.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/scan.jpg 660w, https://images.financialexpress.com/2018/06/scan-300x200.jpg 300w, https://images.financialexpress.com/2018/06/scan-620x413.jpg 620w, https://images.financialexpress.com/2018/06/scan-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> “But the thing that stands out at least from our vantage point is UPI,” Anil Agarwal said.</figure>\n\t\t\t</section></div><span>\n</span><p><span><strong>Digital payments in India:</strong> Riding high on the success of UPI-based payments system, the digital payments in India has tripled to 7% of GDP from 2.5% three years ago, according to Anil Agarwal of Morgan Stanley. “The whole thrust of the government, banks, regulator on banks is actually paying off. Everything is growing, whether is debit card transactions or credit card transactions. But the thing that stands out at least from our vantage point is UPI,” Anil Agarwal, Managing Director, Morgan Stanley told ET Now. &nbsp;&nbsp;</span></p><span>\n</span><p><span>Started in 2016 by the <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/narendra-modi/\">Narendra Modi</a>-led government, UPI-based payments system allows mobile apps run by retailers, airlines and other firms to take payment directly from customers’ bank accounts. According to a recent Bloomberg report, there has been a surge in UPI transactions, and has also hurt major digital payment players such as Mastercard and Visa, who have lost market share built over the last 3 decades. BHIM (Bharat Interface for Money) is a <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/mobile-app/\">mobile app</a> developed by National Payments Corporation of India (NPCI), based on the Unified Payment Interface (UPI), which allows users to make digital payments even without internet.</span></p><span>\n</span><p><span> “If you look at UPI, it started in August-16. The first 3-4 quarters, it was relatively slow. But since last September, it has gone up 8 times. It’s doubling every 2-3 months. The reason is that new players have come in, so U.S cheque companies, the local wallets have banks etc. So they’re able to offer relatively intuitive interface on UPIs,” Anil Agarwal told the channel.</span></p><span>\n</span><p><span>Renowned economist Nouriel Roubini took note of India’s innovative and free homegrown digital payments ecosystem BHIM UPI (Unified Payments Interface) saying that it is the future of digital payments. Nouriel Roubini said in a recent tweet that the India’s UPI-based systems, &nbsp;are the “future of digital payments…” and are “already used by billions of folks”, along with other such payment modes in China, Kenya, US and Europe. “Indeed virtually free &amp; used by hundreds of millions of Indians,” Nouriel Roubini tweeted referring to UPI. Nouriel Roubini said India’s BHIM UPI is the true Fin Tech revolution in digital payment systems.</span></p><span>\n</span><p><span>However, while India has grown by leaps and bounds, it is still way behind China. “If you ask where else we have this kind of a pick-up, it would be China. &nbsp;China today is 355 of GDP,. and that’s just the third party apps, not digital payments as a whole,” Agarwal said. Notably, Morgan Stanley expects India’s digital payments to be at least 10% GDP by 2023. </span></p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "according",
        "Digital",
        "digital",
        "triple",
        "just",
        "high",
        "based",
        "three",
        "ago"
    ],
    "nouns": [
        "years",
        "India",
        "play",
        "Stanley",
        "triple",
        "GDP",
        "Morgan",
        "Riding",
        "high",
        "success",
        "system",
        "three",
        "Anil"
    ],
    "verbs": [
        "play",
        "triple"
    ]
}