{
    "title": "Emerging-market selloff may force RBI to hold interest rates in MPC meet",
    "link": "https://www.business-standard.com/article/economy-policy/emerging-market-selloff-may-force-rbi-to-hold-interest-rates-in-mpc-meet-118060500143_1.html",
    "pubDate": "Tue, 05 Jun 2018 09:03:00 +0530",
    "content": "Indian rupee is down about 5% against the dollar this year and yields have spiked on government and corporate bonds",
    "contentSnippet": "Indian rupee is down about 5% against the dollar this year and yields have spiked on government and corporate bonds",
    "guid": "https://www.business-standard.com/article/economy-policy/emerging-market-selloff-may-force-rbi-to-hold-interest-rates-in-mpc-meet-118060500143_1.html",
    "isoDate": "2018-06-05T03:33:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.08333333333333333,
        "tokens": [
            "emerging-market",
            "selloff",
            "may",
            "force",
            "rbi",
            "to",
            "hold",
            "interest",
            "rates",
            "in",
            "mpc",
            "meet"
        ],
        "words": [
            "interest"
        ],
        "positive": [
            "interest"
        ],
        "negative": []
    },
    "article": {
        "title": "Emerging-market selloff may force RBI to hold interest rates in MPC meet",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tAn <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=emerging+market+selloff\" target=\"_blank\">emerging-market selloff </a>that’s hit India hard presents its central bank with a choice: hold interest rates steady to keep the economy motoring or follow the example of the Philippines and Indonesia by raising to stem market pressure.</p>\n<p>\n\tThe nation’s currency is down about 5 per cent against the dollar this year and yields have spiked on government and corporate bonds. While those moves would argue for a rate increase, most economists aren’t convinced it will come on Wednesday. Of the 35 analysts surveyed by Bloomberg, 25 predict the monetary policy panel will hold the benchmark repurchase rate at 6 per cent.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tFor the inflation-targeting board -- which last met in April before the latest bout of emerging-market pressure forced Argentina, Turkey and Indonesia to raise borrowing costs -- rising prices are also a factor. Inflation accelerated to 4.6 per cent in April, above the central bank’s medium-term goal of 4 per cent.</p>\n<p>\n\t“The heat is now on the RBI to tighten monetary policy, not only due to the risks to domestic inflation but also due to the changing global financial landscape,” said Indranil Pan, chief economist at IDFC Bank in Mumbai.</p>\n<p>\n\tThe two rate hikes by Indonesia’s central bank are fanning expectations of similar moves by the RBI, he said. Both economies share a heavy reliance on foreign inflows that makes them vulnerable to rising U.S. interest rates.</p>\n<p>\n\tWhat’s keeping the RBI from hiking now is the nascent economic recovery and an uncertain inflation outlook. Growth is only now strengthening from the adverse impact of the 2016 ban on high-value currency notes intended to combat corruption and the chaotic implementation of a consumption tax last year.</p>\n<p>\n\t<strong>Oil Surge</strong></p>\n<p>\n\tThe inflation outlook is also uncertain given the surge in oil prices. The RBI forecast in April that inflation would tail off in the second half of the financial year, but Brent crude prices climbed to almost $80 a barrel in late May, driving up fuel costs in the world’s third-largest oil importer.</p>\n<p>\n\tFinancial markets have already tightened and banks are raising borrowing costs even before any central bank action. The yield on the 10-year government bond climbed to a three-year high of 7.94 per cent in May, while similar-maturity rates on top rated corporate bonds surged to 8.67 per cent, the highest since February 2016.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=rbi+policy\" target=\"_blank\">RBI policy </a>makers aren’t immune to the signals from the market. Michael Patra, one of the six officials on the rate-setting panel, said that the bond market is “telling us that we have fallen behind the curve,” according to minutes of the February policy meeting.</p>\n<p>\n\t“Bond yields and short-term borrowing costs have moved up and one of the MPC members is on record saying that fixed income markets are sending signals to policy makers,” said Priyanka Kishore, head of India and Southeast Asia economics at Oxford Economics Ltd. in Singapore. “The MPC risks falling behind the curve if they keep kicking the can down the road.”</p>\n<p>\n\tThe bond market is pricing in 50 to 75 basis points of increases in interest rates over the course of the fiscal year to March 2019, swaps show.</p>\n<p>\n\tWith the spreads between market rates and the central bank’s policy benchmark widening, the risk is the central bank may have to tighten at a faster pace later this year if inflation accelerates. Increasing policy uncertainty may weigh further on bonds.</p>\n<p>\n\t“The RBI has a balancing act in front of them and irrespective of what the RBI’s stance is, financing conditions have significantly tightened,” said Suyash Choudhary, head of fixed income at IDFC Asset Management Co. in Mumbai. There’s already “been a significant shock to interest rates” in the economy, he said.\n\t</p><hr>\n\t<p>\n\t\t<em>Bloomberg</em></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "down",
        "Indian",
        "meet",
        "corporate",
        "spiked",
        "Emerging"
    ],
    "verbs": [
        "down",
        "market",
        "meet",
        "force",
        "interest",
        "hold"
    ]
}