{
    "title": "ICICI Bank: Chanda Kochhar is no longer the boss and won't be missed",
    "link": "https://www.business-standard.com/article/finance/icici-bank-chanda-kochhar-is-no-longer-the-boss-and-won-t-be-missed-118061900296_1.html",
    "pubDate": "Tue, 19 Jun 2018 12:43:00 +0530",
    "content": "The ideal outcome for investors would no doubt have been for Bakhshi to be named CEO. But then, the board has to think about its own interests",
    "contentSnippet": "The ideal outcome for investors would no doubt have been for Bakhshi to be named CEO. But then, the board has to think about its own interests",
    "guid": "https://www.business-standard.com/article/finance/icici-bank-chanda-kochhar-is-no-longer-the-boss-and-won-t-be-missed-118061900296_1.html",
    "isoDate": "2018-06-19T07:13:00.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.23076923076923078,
        "tokens": [
            "icici",
            "bank",
            "chanda",
            "kochhar",
            "is",
            "no",
            "longer",
            "the",
            "boss",
            "and",
            "won't",
            "be",
            "missed"
        ],
        "words": [
            "missed",
            "no"
        ],
        "positive": [],
        "negative": [
            "missed",
            "no"
        ]
    },
    "article": {
        "title": "ICICI Bank: Chanda Kochhar is no longer the boss and won't be missed",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tChanda Kochhar, the chief executive officer of India’s second-biggest lender, has left the building, and her new deputy should waste no time in letting stakeholders know who the real boss is: It’s him.</p>\n<p>\n\tInvestors and commentators like me have been hoping since early April that <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/icici-bank\" target=\"_blank\">ICICI Bank </a>Ltd.’s board would remove the CEO to save the lender’s reputation. Kochhar’s husband and brother-in-law received an alleged quid pro quo in return for loans made by ICICI.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tBoth have denied any wrongdoing, though the cloud of suspicion hasn’t lifted. Last month, the market regulator queried ICICI and Kochhar in connection with a loan to <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=videocon+group\" target=\"_blank\">Videocon Group.</a> The Indian conglomerate, whose main business is facing bankruptcy, had dealings with a renewable energy firm in which Kochhar’s husband has economic interests.</p>\n<p>\n\tICICI’s directors, however, had painted themselves into a corner by a premature defence of their CEO, who was feted just months ago as one of India’s top female bankers and a role model. The board didn’t see any conflict of interest in Kochhar not recusing herself from the credit committee that had cleared the Videocon loan. Their hand was forced when a retired judge compelled them to open an inquiry.</p>\n<p>\n\tSo the board saved face on Monday when it said Kochhar would be going on leave pending the inquiry. A change of guard required to instil confidence in the fairness of the probe is also occurring. N.S. Kannan, the bank’s chief financial officer under Kochhar, is being airlifted to the group’s life-insurance venture whose CEO is being parachuted into the mothership to help steady it.</p>\n<p>\n\t<strong>It’s a welcome swap.</strong></p>\n<p>\n\tSandeep Bakhshi, the 57-year-old insurance boss who has been named chief operating officer of ICICI, is seen as a veteran insider who respects risk – a quality that has been found lacking in several of the company’s top bankers and alumni. The number of runs on the bank, otherwise an innovative and strong franchise, underscores an inherent shakiness that should have been fixable with good governance. Kochhar’s own stinking pile of corporate bad loans offers evidence that ICICI’s board has been a failure.</p>\n<p>\n\tNow the problem has acquired political overtones. Aggressive consortium loans, often initiated by non-state-owned <a class=\"storyTags\" href=\"https://www.business-standard.com/category/finance-news-banks-1030101.htm\" target=\"_blank\">banks </a>like ICICI and Standard Chartered Plc, have drawn undercapitalized state-run peers with poor underwriting standards into a $210 billion slaughterhouse of stressed debt. Indian taxpayers are naturally angry.</p>\n<p>\n\tPrime Minister Narendra Modi already has to contend with a beer baron and a high-profile jeweller who have left the country with billions of dollars in unpaid dues. He can’t afford to let the ICICI crisis fester. By a quirk of history, the Indian government has an ICICI board seat. The opposition parties’ insinuation that Modi’s party is doing nothing to stop crony capitalists and pliant bankers won’t help win next year’s election.</p>\n<p>\n\tBesides, guilty or not, which employee gets such a long runway from her employer after it becomes clear her exit will be a value-unlocking opportunity for shareholders?</p>\n<p>\n\tThe ideal outcome for investors would no doubt have been for Bakhshi to be named CEO. But then, the board has to think about its own interests. Removing Kochhar barely months after going out on a limb in her defence would make directors vulnerable to legal attacks from the bank’s American depositary receipt holders. The official version of events is that Kochhar has herself decided to go on leave. Whatever the truth, investors will be happy with the fact that in her absence, Bakhshi will be reporting to a board whose chairman is also retiring at the end of the month – not a day too soon.</p>\n<p>\n\tIt’s a fresh beginning at ICICI. The new COO has been inducted into the board and should feel no compulsion to play along with the fiction that he’s going to go back to being an obedient No. 2 once Kochhar returns.</p>\n<p>\n\tBut why should she? Kochhar’s current term ends in March, and the directors can’t possibly be waiting for the judge to finish up fast so they can reward her with another stint.</p>\n<p>\n\tMake no mistake. Kochhar’s gone, and the almost-5 per cent gain in the bank’s ADRs after the announcement suggests that unlike Elvis, she won’t be missed.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "no",
        "boss",
        "won",
        "missed",
        "ideal",
        "own"
    ],
    "verbs": [
        "Bank",
        "boss",
        "doubt",
        "board",
        "think",
        "own"
    ]
}