{
    "creator": "Mithun Dasgupta",
    "title": "UltraTech: Dalmia Bharat delaying Binani resolution",
    "link": "https://www.financialexpress.com/industry/ultratech-dalmia-bharat-delaying-binani-resolution/1211343/",
    "pubDate": "Tue, 19 Jun 2018 04:42:09 +05:30",
    "dc:creator": "Mithun Dasgupta",
    "content": "With Dalmia Bharat-controlled Rajputana Properties (RPPL) sticking to its demand for getting a copy of UltraTech Cement’s revised resolution plan, the Aditya Birla Group-owned cement major on Monday alleged that its rival bidder is unnecessarily slowing down the pace of the insolvency resolution process for the bankrupt Binani Cement.",
    "contentSnippet": "With Dalmia Bharat-controlled Rajputana Properties (RPPL) sticking to its demand for getting a copy of UltraTech Cement’s revised resolution plan, the Aditya Birla Group-owned cement major on Monday alleged that its rival bidder is unnecessarily slowing down the pace of the insolvency resolution process for the bankrupt Binani Cement.",
    "guid": "https://www.financialexpress.com/?p=1211343",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-18T23:12:09.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.3333333333333333,
        "tokens": [
            "ultratech",
            "dalmia",
            "bharat",
            "delaying",
            "binani",
            "resolution"
        ],
        "words": [
            "resolution"
        ],
        "positive": [
            "resolution"
        ],
        "negative": []
    },
    "article": {
        "title": "UltraTech: Dalmia Bharat delaying Binani resolution",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1211348\" src=\"https://images.financialexpress.com/2018/06/binani-3-1.jpg\" alt=\"UltraTech cement,&nbsp;Dalmia Bharat, binani cement,&nbsp;Aditya Birla Group\" srcset=\"https://images.financialexpress.com/2018/06/binani-3-1.jpg 660w, https://images.financialexpress.com/2018/06/binani-3-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/binani-3-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/binani-3-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> With Dalmia Bharat-controlled Rajputana Properties (RPPL) sticking to its demand for getting a copy of UltraTech Cement’s revised resolution plan, the Aditya Birla Group-owned cement major on Monday alleged that its rival bidder is unnecessarily slowing down the pace of the insolvency resolution process for the bankrupt Binani Cement.</figure>\n\t\t\t</section></div><span>\n</span><p>With Dalmia Bharat-controlled Rajputana Properties (RPPL) sticking to its demand for getting a copy of UltraTech Cement’s revised resolution plan, the Aditya Birla Group-owned cement major on Monday alleged that its rival bidder is unnecessarily slowing down the pace of the insolvency resolution process for the bankrupt Binani Cement. “Rajputana Properties is now filing unnecessary applications to delay the resolution process, knowing that every day we are incurring a cost of Rs 1.4 crore towards interest payment to the financial creditors of Binani Cement as per our resolution plan, which was approved by the committee of creditors,” Siddhartha Mitra, counsel for UltraTech, said in his submission before the Kolkata bench of the National Company Law Tribunal (NCLT).</p><span>\n</span><p>The committee of creditors (CoC) on May 28 had voted in absolute majority in favour of the revised resolution plan submitted by UltraTech Cement that has offered to pay Rs 7,960 crore for the bankrupt firm. “According to this plan, during the resolution process, the company will keep on paying interest to the financial creditors,” Mitra said. UltraTech’s revised resolution plan is now awaiting approval of the tribunal. Earlier on Monday, SK Kapoor and A Kathpalia, the counsels for Rajputana Properties, filed an application before the tribunal, asking for a copy of UltraTech’s resolution plan as it was being challenged by the former. “We are opposing the CoC’s decision that UltraTech is eligible to bid under section 29A of the IBC,” Kapoor had said in his submission before the NCLT on June 4.</p><span>\n</span><p>In his reply, the resolution professional’s counsel Joy Saha had said the RP could not serve UltraTech’s resolution plan to Rajputana Properties because the firm was not entitled to see the plan. After the hearing the counsels on June 4, the bench had asked the RP, Vijaykumar V Iyer, to serve a copy, pertaining to the details on the reasons for approving UltraTech’s revised resolution plan by the CoC, to Rajputana, without sharing the plan. Notably, passing an order on May 15, the NCLAT had asked the CoC to furnish reasons for “approve one or the other resolution plan,” to be submitted before NCLT. On Monday, Rajputana Properties also filed an application before the tribunal for bringing on record the Supreme Court proceedings on this case. On June 4, the SC had restrained finalisation of the sale of assets of the bankrupt company without its prior approval.</p><span>\n</span><p>However, it had allowed the resolution process to go on. The top court had also said that further proceedings will be subject to its orders. The Kolkata bench of the NCLT listed the matter for further hearing on July 9. Notably, the SC hearing is scheduled on July 2, while NCLAT will hear the case on July 10. Binani Cement, a subsidiary of Binani Industries, has a manufacturing capacity of 11.25 million tonnes of cement per year with integrated plants in India and China, and grinding units in Dubai. In FY17, the cement maker had posted a net loss of `348 crore on revenues of Rs 1,527 crore, according to data from Capitaline.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "controlled",
        "sticking",
        "revised",
        "owned",
        "major",
        "alleged",
        "down",
        "bankrupt"
    ],
    "nouns": [
        "resolution",
        "process",
        "Bharat",
        "demand",
        "getting",
        "Cement",
        "cement",
        "copy",
        "plan",
        "Aditya",
        "Group",
        "major",
        "Monday",
        "bidder",
        "slowing",
        "down",
        "insolvency",
        "bankrupt",
        "rival",
        "pace"
    ],
    "verbs": [
        "process",
        "demand",
        "copy",
        "Cement",
        "cement",
        "plan",
        "Group",
        "major",
        "rival",
        "down",
        "pace",
        "bankrupt"
    ]
}