{
    "creator": "FE Online",
    "title": "What is Bharat 22 ETF? Key things you must know",
    "link": "https://www.financialexpress.com/market/what-is-bharat-22-etf-key-things-you-must-know/1212187/",
    "pubDate": "Tue, 19 Jun 2018 17:20:50 +05:30",
    "dc:creator": "FE Online",
    "content": "With an aim to raise Rs 6,000 crore from the markets, the government on Tuesday launched the second trance of Bharat-22 exchange-traded fund (ETF) for a fresh subscription. ",
    "contentSnippet": "With an aim to raise Rs 6,000 crore from the markets, the government on Tuesday launched the second trance of Bharat-22 exchange-traded fund (ETF) for a fresh subscription.",
    "guid": "https://www.financialexpress.com/?p=1212187",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-19T11:50:50.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "what",
            "is",
            "bharat",
            "22",
            "etf?",
            "key",
            "things",
            "you",
            "must",
            "know"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "What is Bharat 22 ETF? Key things you must know",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><p><img class=\"alignnone size-full wp-image-1192444\" src=\"https://images.financialexpress.com/2018/06/Rupee-Reuters-5.jpg\" alt=\"\" width=\"660\" height=\"440\" srcset=\"https://images.financialexpress.com/2018/06/Rupee-Reuters-5.jpg 660w, https://images.financialexpress.com/2018/06/Rupee-Reuters-5-300x200.jpg 300w, https://images.financialexpress.com/2018/06/Rupee-Reuters-5-620x413.jpg 620w, https://images.financialexpress.com/2018/06/Rupee-Reuters-5-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"></p><span>\n</span><p>With an aim to raise Rs 6,000 crore from the markets, the government on Tuesday launched the second trance of Bharat-22 exchange traded fund (ETF) for fresh subscription. The government has also kept a green-shoe option to retain another Rs 2,400 crore from the follow on offer. In November last year, the government had launched Bharat-22 ETF comprising shares of 22 companies, including public sector undertakings (PSUs), public sector banks, ITC, Axis Bank and L&amp;T. Bids of nearly Rs 32,000 crore were garnered last time.</p><span>\n</span><p><b>About the offer</b></p><span>\n</span><p>Today, the further fund offering (FFO) has opened for anchor investors. The offer will open for other institutional and retail investors tomorrow. The ETF follow on offer will remain open till June 22. The investors would get a 2.5 per cent discount over the issue price.</p><span>\n</span><p><b>Bharat-22 Index</b></p><span>\n</span><p>A special index S&amp;P BSE BHARAT-22 Index was created on BSE. The index is a blend of shares of key CPSEs, public sector banks (PSBs) and government-owned shares in bluechip private companies like L&amp;T (L&amp;T), Axis Bank and ITC.</p><span>\n</span><p>The state-owned companies or PSUs that are part of the new Bharat ETF-22 include ONGC, IOC, SBI, BPCL, Coal India and Nalco. The other central public sector enterprises on the list are Bharat Electronics, Engineers India, NBCC, NTPC, NHPC, SJVNL, GAIL, PGCIL and NLC India. Only three public sector banks — SBI, Indian Bank and Bank of Baroda — figure in the Bharat-22 index.</p><span>\n</span><p><b>Should you invest?</b></p><span>\n</span><p>“The ETF has underperformed the markets. While the Nifty is up 3.5% from the day of the ETF’s listing, the ETF is down 2% from the issue price,” said V K Sharma, Head Private Client Group &amp; Capital Market Strategy, HDFC Securities. “With the government in the last year of its tenure, the chances of it beating the index are bleak,” Sharma said to FE Online, adding, “Investors will be better placed to choose individual stocks from the ETF than participate in the ETF.”</p><span>\n</span><p>Not only this, the Bharat-22 ETF Index currently trades at a discount of around 1% from its issue price. However, on the other hand, the fund has done relatively well as compared to the performance of Nifty PSE, which has lost 11% during the same period, said V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services. Even so, he does not recommend buying Bharat-22 ETF at this point with an objective to earn short-term gains.</p><span>\n</span><p>“The market is unlikely to perform very well in the coming months. The foggy emerging political environment, worsening macros and the selling by FIIs are likely to cap the upside to the market. In this environment, Bharat-22 ETF is not likely to perform very well,” Vijayakumar told FE Online.</p><span>\n</span><p>“Also, the investor response to the coming issue is not likely to be as great as it was for the first tranche since the investors have not made money. However, long-term investors can invest in the fund,” Vijayakumar said, adding that long-term investors with a three-year time horizon can expect good returns. “For long-term investors we would advice investing in the fund since there are attractive features such as upfront discount of 2.5%, very low charge of 1 bp, highly diversified portfolio of stocks and blue chips like ITC, L&amp;T, Axis Bank etc in the portfolio,” he said.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "22",
        "Key",
        "second",
        "fresh"
    ],
    "verbs": [
        "Key",
        "know",
        "aim",
        "raise",
        "second",
        "trance",
        "exchange",
        "fund"
    ]
}