{
    "title": "SCO summit 2018: How India protected its interests in China's Qingdao",
    "link": "https://www.business-standard.com/article/current-affairs/sco-summit-2018-how-india-protected-its-interests-in-china-s-qingdao-118061200763_1.html",
    "pubDate": "Tue, 12 Jun 2018 23:56:00 +0530",
    "content": "India has not extended support to President Xi's flagship initiative as a key project under it, the China-Pakistan Economic Corridor (CPEC), passes through Pakistan-occupied Kashmir",
    "contentSnippet": "India has not extended support to President Xi's flagship initiative as a key project under it, the China-Pakistan Economic Corridor (CPEC), passes through Pakistan-occupied Kashmir",
    "guid": "https://www.business-standard.com/article/current-affairs/sco-summit-2018-how-india-protected-its-interests-in-china-s-qingdao-118061200763_1.html",
    "isoDate": "2018-06-12T18:26:00.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.18181818181818182,
        "tokens": [
            "sco",
            "summit",
            "2018",
            "how",
            "india",
            "protected",
            "its",
            "interests",
            "in",
            "china's",
            "qingdao"
        ],
        "words": [
            "interests",
            "protected"
        ],
        "positive": [
            "interests",
            "protected"
        ],
        "negative": []
    },
    "article": {
        "title": "SCO summit 2018: How India protected its interests in China's Qingdao",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tIn keeping out of China's Belt and Road Initiative (BRI) and signing an agreement on sharing of hydrological data on the Brahmaputra river and another on exporting rice following a bilateral meeting between Prime Minister <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/narendra-modi\" target=\"_blank\">Narendra Modi </a>and Chinese President Xi Jinping, India kept its interests safe in this year's <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/shanghai-cooperation-organisation\" target=\"_blank\">Shanghai Cooperation Organisation </a>(SCO) Summit, experts said.</p>\n<p>\n\tIndia has not extended support to President Xi's flagship initiative as a key project under it, the China-Pakistan Economic Corridor (CPEC), passes through Pakistan-occupied Kashmir (PoK).\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tModi reiterated India's position that international connectivity projects should respect other countries' sovereignty and territorial integrity. Stating that connectivity with neighbours and within the SCO area is a priority for India, Modi, during his intervention at the Summit in Qingdao, China, on Sunday said: \"We welcome new connectivity projects that are inclusive, sustainable and transparent, and respect countries' sovereignty and territorial integrity.\"</p>\n\n<p>\n\tThe SCO is a Eurasian inter-governmental organisation, the creation of which was announced in 2001 in Shanghai by Kazakhstan, China, Kyrgyzstan, Russia, Tajikistan and Uzbekistan. It was preceded by the Shanghai Five mechanism. India and Pakistan were granted full membership of the bloc in June last year. In the final <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=qingdao+declaration\" target=\"_blank\">Qingdao Declaration </a>issued after the Summit, India's name is conspicuously missing in the part about the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=bri\" target=\"_blank\">BRI.</a></p>\n<p>\n\tAccording to Anil Wadhwa, Senior Fellow in the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=vivekananda+international+foundation\" target=\"_blank\">Vivekananda International Foundation </a>think tank and former Secretary (East) in the External Affairs Ministry, the meeting between Modi and Xi was a forward movement from the informal meeting between the two leaders in Wuhan in April with decisions being taken to set up a special representatives-level meeting mechanism and to boost cultural relations between India and China.</p>\n<p>\n\tAs for India not extending support to the BRI, Wadhwa told IANS that nobody expected India to endorse Xi's pet initiative.</p>\n<p>\n\t\"I don't think it will affect India diplomatically as there is an understanding between both sides (India and China),\" he said.</p>\n<p>\n\t\"If they look at the Northeast in the future from the BBIN (Bangladesh-Bhutan-India-Nepal) rubric, that is a different matter.\"</p>\n<p>\n\tHowever, Wadhwa sounded sceptical about the two agreements signed between India and China - a memorandum of understanding on the Chinese side providing hydrological data on the Brahmaputra river in flood season from May 15 to October 15 every year and an amendment to a 2006 protocol for exporting rice from India to China to include the export of non-Basmati varieties of rice from India.</p>\n\n<p>\n\t\"With China already having built three dams on their side of the Brahmaputra, I don't know how useful the data will be,\" he said.</p>\n<p>\n\tAs for exporting non-Basmati varieties of rice, he said that such a market does not currently exist in China and this has to be created.</p>\n<p>\n\tHowever, Sujit Dutta, a domain expert on China who is also Professor in the Nelson Mandela Centre for Peace and Conflict Resolution in Jamia Milia Islamia here, was positive about the two agreements.</p>\n<p>\n\t\"India kept its interests safe. While the agreement on sharing Brahmaputra will benefit India, the one on rice exports will help our farmers,\" Dutta said.</p>\n<p>\n\tAs for the BRI, he said that India has always made it clear that it would not support the Chinese initiative.</p>\n<p>\n\t\"How can India support something that threatens its sovereignty with the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/cpec\" target=\"_blank\">CPEC </a>going through PoK?\" he said.</p>\n\n<p>\n\tModi said in Qingdao that India's commitment to connectivity is visible nevertheless in the International North-South Transport Corridor, the development of the Chabahar Port in Iran, to which India, Iran and Afghanistan are signatories, and participation in specific projects like the Ashgabat Agreement, a multimodal transport agreement between India, Iran, Kazakhstan, Oman, Turkmenistan and Uzbekistan.</p>\n<p>\n\tAnother reason for India not taking part in the BRI, Dutta said, is that Chinese loans for projects under this have high interest rates and terms and conditions are not transparent.</p>\n<p>\n\tGiving Hambantota port in Sri Lanka as an example, he said that the port has been given to a Chinese company on a 99-year lease and Colombo will find it difficult to repay the loan.</p>\n<p>\n\tHe said that same is the case with Gwadar port in Pakistan and Islamabad might well come under Chinese influence after finding it difficult to repay loans.</p>\n<p>\n\t\"We (India) can't become vulnerable to Chinese pressure and take loans which we can't repay,\" Dutta said.</p>\n<p>\n\tAccording to C. Uday Bhaskar, strategic analyst and Director of the Society for Policy Studies think tank, the key takeaway from the SCO Summit \"is the manner in which India conveyed to its SCO peers that it can remain resolute when it comes to core <a class=\"storyTags\" href=\"https://www.business-standard.com/category/current-affairs-news-national-1150106.htm\" target=\"_blank\">national </a>interests, for example, sovereignty\".</p>\n\n<p>\n\t\"But it will also engage with the others in principles, yet pragmatic manner,\" Bhaskar said.</p>\n<p>\n\tHe said that the Indian stand on the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=bri\" target=\"_blank\">BRI </a>will be watched very closely not just by China, but all the other nations who have signed up.</p>\n<p>\n\t\"Hopefully, the Wuhan spirit will prevail with respect to the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=bri\" target=\"_blank\">BRI </a>and make the issue less intractable when President Xi visits India in 2019,\" Bhaskar stated.</p><p id=\"auto_disclaimer\">(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "protected",
        "Economic",
        "initiative",
        "extended",
        "Xi",
        "key",
        "occupied"
    ],
    "verbs": [
        "project",
        "support",
        "summit",
        "key"
    ],
    "nouns": [
        "India",
        "project",
        "support",
        "China",
        "President",
        "initiative",
        "flagship",
        "summit",
        "key",
        "Pakistan",
        "Corridor",
        "Kashmir",
        "Xi"
    ]
}