{
    "creator": "Abhijeet Singh",
    "title": "Bulls ahead! Sensex to hit 44,000 by June 2019, says Morgan Stanley; 3 hot sectors for your portfolio",
    "link": "https://www.financialexpress.com/market/bulls-ahead-sensex-to-hit-44000-by-june-2019-says-morgan-stanley-3-hot-sectors-for-your-portfolio/1211869/",
    "pubDate": "Tue, 19 Jun 2018 14:50:32 +05:30",
    "dc:creator": "Abhijeet Singh",
    "content": "The global research and brokerage firm Morgan Stanley has forecasted a bull case target for benchmark Sensex at 44,000 by June 2019. Going ahead, improving growth, reasonable large-cap valuations and a low beta are seen as upside triggers for India's share market.",
    "contentSnippet": "The global research and brokerage firm Morgan Stanley has forecasted a bull case target for benchmark Sensex at 44,000 by June 2019. Going ahead, improving growth, reasonable large-cap valuations and a low beta are seen as upside triggers for India's share market.",
    "guid": "https://www.financialexpress.com/?p=1211869",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-19T09:20:32.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "bulls",
            "ahead",
            "sensex",
            "to",
            "hit",
            "44000",
            "by",
            "june",
            "2019",
            "says",
            "morgan",
            "stanley",
            "3",
            "hot",
            "sectors",
            "for",
            "your",
            "portfolio"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Bulls ahead! Sensex to hit 44,000 by June 2019, says Morgan Stanley; 3 hot sectors for your portfolio",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"wp-image-1211978 size-full\" src=\"https://images.financialexpress.com/2018/06/Bull-Market-Reuters-2.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/Bull-Market-Reuters-2.jpg 660w, https://images.financialexpress.com/2018/06/Bull-Market-Reuters-2-300x200.jpg 300w, https://images.financialexpress.com/2018/06/Bull-Market-Reuters-2-620x413.jpg 620w, https://images.financialexpress.com/2018/06/Bull-Market-Reuters-2-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Morgan Stanley has forecasted a Sensex target of 44,000 in a bull case scenario following better-than-expected outcomes on the back of policy and global factors and markets believing on strong election results. (Image: Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>Indian equities have remained extremely volatile in the current year 2018 with the benchmark indices Sensex and Nifty falling to a 4-month low level in late-March after hitting respective all-time highs in January. The global investment bank Morgan Stanley has fixed a bull case Sensex target of 44,000 by June 2019, this implies an upside of nearly 24% from the current level of 35,548.26. “India is a likely outperformer even as absolute returns are capped by a tepid global equity market outlook. Improving growth, reasonable large-cap valuations and a low beta are up against an election year, rising oil prices and higher yields,” Ridham Desai, Managing Director, and Sheela Rathi, Equity Strategist at Morgan Stanley India Company Pvt Ltd said in a research report.</p><span>\n</span><p>On our June 2019 target of 36,000, the <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/bse-sensex/\">BSE Sensex</a> would trade at just under 16x one-year forward P/E, which below its historical average, Morgan Stanley report said. For the base case scenario, the 30-share barometer Sensex is seen at 36,000 with keeping all outcomes at a&nbsp;moderate level and slow growth acceleration. Notably, global conditions deteriorate and<br>the market starts pricing in a poor election outcome then Sensex may steer back to a level of 26,500 (bear case), Morgan Stanley report said. The respective probability of Sensex hitting the aforementioned targets in base and bear case is 50% and 20%.</p><span>\n</span><p>While, on the other hand, Morgan Stanley has forecasted a Sensex target of 44,000 in a bull case scenario following better-than-expected outcomes on the back of policy and global factors and markets believing on strong election results.</p><span>\n</span><p>According to Ridham Desai and Sheela Rathi of Morgan Stanley, the preferable sectors to invest are private banks, consumer discretionary and industrial materials. A strong consumer loan growth and rising real income will be an upside trigger with respect to consumer discretionary whereas a likely turn in private capex (capital expenditure) and public capex&nbsp;remaining strong is seen favourable for industrials.</p><span>\n</span><p>As far as the private bank space is concerned, Morgan Stanley said that credit costs are likely to decline, led by M&amp;A activity and a recovery in economic growth. “Recapitalisation will also help the Corporate banks. Loan growth prospects are looking up as the economy gathers pace. The bankruptcy processes are gaining pace, in our view. Non-banks may face margin<br>pressure as rates rise,” Morgan Stanley report added.</p><span>\n</span><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "ahead",
        "44",
        "hot",
        "global",
        "firm",
        "Going",
        "improving",
        "reasonable",
        "large",
        "low",
        "beta"
    ],
    "nouns": [
        "June",
        "bull",
        "Morgan",
        "hit",
        "Stanley",
        "portfolio",
        "research",
        "firm",
        "brokerage",
        "case",
        "target",
        "benchmark",
        "Going",
        "growth",
        "large",
        "low",
        "cap",
        "beta",
        "India",
        "upside",
        "share",
        "market"
    ],
    "verbs": [
        "bull",
        "hit",
        "research",
        "firm",
        "case",
        "target",
        "cap",
        "low",
        "share",
        "market"
    ]
}