{
    "creator": "Reuters",
    "title": "China’s market skid to near 2-year low as Trump escalates trade fight; Shanghai Composite falls below 3,000",
    "link": "https://www.financialexpress.com/market/chinas-market-skid-to-near-2-year-low-as-trump-escalates-trade-fight-shanghai-composite-falls-below-3000/1211571/",
    "pubDate": "Tue, 19 Jun 2018 10:56:48 +05:30",
    "dc:creator": "Reuters",
    "content": "Chinese investors dumped stocks across the board on Tuesday as U.S. President Donald Trump threatened China with more tariffs, knocking the Shanghai benchmark to a near two-year low despite government efforts to assuage the panic.",
    "contentSnippet": "Chinese investors dumped stocks across the board on Tuesday as U.S. President Donald Trump threatened China with more tariffs, knocking the Shanghai benchmark to a near two-year low despite government efforts to assuage the panic.",
    "guid": "https://www.financialexpress.com/?p=1211571",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-19T05:26:48.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.058823529411764705,
        "tokens": [
            "china’s",
            "market",
            "skid",
            "to",
            "near",
            "2-year",
            "low",
            "as",
            "trump",
            "escalates",
            "trade",
            "fight",
            "shanghai",
            "composite",
            "falls",
            "below",
            "3000"
        ],
        "words": [
            "fight"
        ],
        "positive": [],
        "negative": [
            "fight"
        ]
    },
    "article": {
        "title": "China’s market skid to near 2-year low as Trump escalates trade fight; Shanghai Composite falls below 3,000",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"wp-image-1211599 size-full\" src=\"https://images.financialexpress.com/2018/06/Stock-crash-1.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/Stock-crash-1.jpg 660w, https://images.financialexpress.com/2018/06/Stock-crash-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/Stock-crash-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/Stock-crash-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The Shanghai Composite Index opened sharply lower and slumped 3 per cent by midday, to 2,932.08 points, falling past the psychologically key 3,000-point level. (Image: Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>Chinese investors dumped stocks across the board on Tuesday as U.S. President Donald Trump threatened China with more tariffs, knocking the Shanghai benchmark to a near two-year low despite government efforts to assuage the panic. The slump risks triggering fresh margin calls in a highly-leveraged stock market, potentially causing a downward spiral that could derail Beijing’s plan to lure the listings of high-tech giants. “The market is so fragile. You don’t know where the bottom is,” said David Dai, general manager of Shanghai Wisdom Investment Co Ltd. “It’s more rewarding watching the World Cup.”</p><span>\n</span><p>Mainland investors had their first chance on Tuesday to react to rapidly escalating trade tensions between Washington and Beijing after returning from a long weekend. Markets were closed Monday for the Dragon Boat Festival. The Shanghai Composite Index opened sharply lower and slumped 3 percent by midday, to 2,932.08 points, falling past the psychologically key 3,000-point level. The blue chip CSI300 index dropped 2.9 percent, to 3,646.35.</p><span>\n</span><p>Small-caps were hit harder, with the start-up board ChiNext, and Shenzhen’s SME board tumbling roughly 4 percent. Investors panicked over the prospects of a full-blown trade war between Washington and Beijing. On Tuesday, China’s commerce ministry said the country would take “qualitative” and “quantitative” measures, and “fight back firmly” against additional tariff measures by the U.S. government.</p><span>\n</span><p>The statement came after President Trump threatened on Monday to impose a 10 percent tariff on $200 billion of Chinese goods, raising the stakes in a tit-for-tat trade war with Beijing. He said the move was in retaliation for China’s decision to raise tariffs on $50 billion in U.S. goods.</p><span>\n</span><p>Highlighting concerns over liquidity and potential economic drag from a trade war with the United States, China’s central bank on Tuesday lent 200 billion yuan ($31 billion) to financial institutions via its medium-term lending facility (MLF). In another surprise move, Chinese smartphone marker <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/xiaomi/\">Xiaomi</a> said before the market open on Tuesday that it would postpone its application for a mainland share offering until after it completes a separate listing in Hong Kong.</p><span>\n</span><p>“The rising risk of a disruptive trade conflict makes a bad situation tentatively worse” for an economy already clouded by a sharp slowdown in investment growth due to the government’s deleveraging drive, a mounting debt burden and rising credit defaults, Nomura said in a note on Tuesday. “With this potential double whammy, we believe Beijing will very likely introduce further easing measures in the months ahead.”</p><span>\n</span><p>In Hong Kong, stocks also fell sharply with the benchmark Hang Seng index dropping 2.2 percent to 29,650.05 points, and the Hong Kong China Enterprises Index losing 2.6 percent, to 11,556.62. Underscoring the impact on Chinese companies from worsening Sino-U.S. relations, shares of ZTE Corp , the technology firm caught in the cross-fire of a trade spat between the two countries, slumped further on Tuesday. Its Hong Kong-listed shares tumbled 25 percent to a two-year-low in morning trade, while its Shenzhen shares fell by their daily limit of 10 percent for a fourth consecutive session.</p><span>\n</span><p>U.S. tariffs on Chinese products including steel, aluminum, and those that benefit from China’s industrial development subsidy programmes including the “Made in China 2025″ technology upgrade plan, could hurt a broad number of China-listed companies, said Shanghai Wisdom Investment’s Dai. Further market falls could also trigger a vicious cycle of selling, as a large proportion of shares in the stock market are pledged against loans, and could potentially face margin calls, he said.</p><span>\n</span><p>According to the official China Securities Journal, the value of pledged stocks total 5.5 trillion yuan, and an estimated 900 billion yuan of such shares have fallen below precaution levels or triggered margin calls. Market weakness also threatens Beijing’s drive to lure tech giants back home.”If the government doesn’t take stabilisation measures, the stock market could&nbsp; lose its function to raise capital for companies. But fresh stimulus could make its deleveraging campaign abortive,” Dai said. “It’s a difficult situation.”</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "Chinese",
        "near",
        "low",
        "Composite",
        "U",
        "threatened",
        "two"
    ],
    "nouns": [
        "China",
        "Chinese",
        "market",
        "skid",
        "year",
        "low",
        "Trump",
        "trade",
        "Shanghai",
        "Composite",
        "falls",
        "stocks",
        "Tuesday",
        "U",
        "S",
        "board",
        "President",
        "benchmark",
        "two",
        "fight",
        "government",
        "panic",
        "despite",
        "knocking"
    ]
}