{
    "creator": "Bloomberg",
    "title": "From cabbages to oil, what really impacts inflation in different Asian countries",
    "link": "https://www.financialexpress.com/economy/from-cabbages-to-oil-what-really-impacts-inflation-in-different-asian-countries/1196110/",
    "pubDate": "Wed, 06 Jun 2018 19:03:42 +05:30",
    "dc:creator": "Bloomberg",
    "content": "Goldman Sachs Group Inc. analyzed which Asian economy is threatened by exactly what facet of inflation. Some of its findings border on the obvious: Oil shocks make imported goods costlier across the region. Others are counterintuitive.",
    "contentSnippet": "Goldman Sachs Group Inc. analyzed which Asian economy is threatened by exactly what facet of inflation. Some of its findings border on the obvious: Oil shocks make imported goods costlier across the region. Others are counterintuitive.",
    "guid": "https://www.financialexpress.com/?p=1196110",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-06T13:33:42.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "from",
            "cabbages",
            "to",
            "oil",
            "what",
            "really",
            "impacts",
            "inflation",
            "in",
            "different",
            "asian",
            "countries"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "From cabbages to oil, what really impacts inflation in different Asian countries",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1196116\" src=\"https://images.financialexpress.com/2018/06/inflation-1-2.jpg\" alt=\"From cabbages to oil, what really impacts inflation in different Asian countries\" srcset=\"https://images.financialexpress.com/2018/06/inflation-1-2.jpg 620w, https://images.financialexpress.com/2018/06/inflation-1-2-300x200.jpg 300w, https://images.financialexpress.com/2018/06/inflation-1-2-401x267.jpg 401w\" sizes=\"(max-width: 620px) 100vw, 620px\"> Asian economy is threatened by exactly what facet of inflation. (Image: Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>In the words of economist Milton Friedman, inflation is “always and everywhere” a monetary phenomenon. But if you asked a brokerage analyst in Singapore why prices were soaring in 2007, the response might well have been, “Ah, bus fares went up.”</p><span>\n</span><p>That was then. When the general price level is not a problem (like now), there’s little interest in studying food or fuel costs, exchange rates or even the more expensive haircuts and meals that people associate with dearness in a tight labor market. But peacetime is when central banks have to prepare for the coming war, lest they be caught on the wrong foot, and Friedman’s critique returns to haunt them.</p><span>\n</span><p>Goldman Sachs Group Inc. analyzed which Asian economy is threatened by exactly what facet of inflation. Some of its findings border on the obvious: Oil shocks make imported goods costlier across the region. Others are counterintuitive: It’s only in Taiwan and Thailand that fuel prices also drive headline inflation.</p><span>\n</span><p>For India, Indonesia and the Philippines, it’s exchange-rate depreciation that really matters in the aggregate. However, since the rupee, rupiah and peso tend to weaken as oil shoots higher, energy gives the impression of being the main culprit.</p><span>\n</span><p>Singapore, Hong Kong and Japan behave like typical rich countries, with inflation determined solely by “output gap,” a measure of whether production is above or below potential.</p><span>\n</span><p>China is different. Overheating doesn’t seem to move the price needle in industries ranging from construction and catering to education and retail. Since these goods and services, which economists call non-tradables, account for 34 percent of the Chinese consumption basket (versus 16 percent for India and 21 percent for Indonesia), headline inflation can be low even with the economy growing gangbusters.</p><span>\n</span><p>In six out of 11 countries in the region, including China and South Korea, the exchange rate has a strong bearing on inflation. By relative importance, only food comes close. Cabbage prices in South Korea and pork in China aren’t a sideshow.</p><span>\n</span><p>Goldman’s analysis helps explain why Asian central banks are so touchy about currency depreciation even in the absence of large dollar debt. Indonesia’s new central bank governor has already acted preemptively and raised interest rates to ward off the kind of inflationary collapse of the rupiah that has happened time and again. The Philippines acted in May. Both have said they’re prepared to do more.</p><span>\n</span><p>India is up next. Ahead of Wednesday’s monetary policy meeting, expectations of an interest-rate increase are gaining ground, and not because the economy is growing strongly. A hot topic of debate is what to do about the slumping rupee. JPMorgan Chase &amp; Co. is calling for higher rates – not so much to shore up the currency as to cushion its fall. Bank of America Merrill Lynch’s advice is to leave rates alone at 6 percent now – maybe even prune them further later – and raise dollar funding from non-resident Indians.</p><span>\n</span><p>Whatever the ultimate decision, at least one economist has called for an end to the prevailing fiction that policymakers don’t target the value of the rupee. With even administratively controlled prices (such as electricity charges) being affected by the exchange rate according to Goldman’s analysis, it’s naive to ignore this important variable.</p><span>\n</span><p>If Goldman is right about the exchange rate’s outsize role in driving Asian inflation, then bond investors will be keenly watching the reaction of the Indian, Indonesian and Philippine central banks over the coming months. That’s because the rupee, the rupiah and the peso are the three worst-performing regional currencies over the past six months.</p><span>\n</span><p>Where the dollar goes, and where it takes Asian exchange rates – especially if Brent crude climbs much higher than $75 a barrel – is the most important question. The time to worry about haircuts, school fees and bus fares will come later.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "imported",
        "different",
        "Asian",
        "counterintuitive",
        "analyzed",
        "threatened",
        "Some",
        "obvious"
    ],
    "nouns": [
        "Goldman",
        "oil",
        "Oil",
        "inflation",
        "Asian",
        "Group",
        "economy",
        "Inc",
        "facet",
        "findings",
        "border",
        "region"
    ],
    "verbs": [
        "oil",
        "Oil",
        "Group",
        "border"
    ]
}