{
    "title": "Rupee slumps 16 paise to near 1-week low amid fears of Fed rate hike",
    "link": "https://www.business-standard.com/article/economy-policy/rupee-slumps-16-paise-to-near-1-week-low-amid-fears-of-fed-rate-hike-118061301054_1.html",
    "pubDate": "Wed, 13 Jun 2018 20:30:00 +0530",
    "content": "On the energy front, crude prices dropped, hit by rising supplies in the US and expectations that producer group OPEC could relax voluntary output cuts",
    "contentSnippet": "On the energy front, crude prices dropped, hit by rising supplies in the US and expectations that producer group OPEC could relax voluntary output cuts",
    "guid": "https://www.business-standard.com/article/economy-policy/rupee-slumps-16-paise-to-near-1-week-low-amid-fears-of-fed-rate-hike-118061301054_1.html",
    "isoDate": "2018-06-13T15:00:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "rupee",
            "slumps",
            "16",
            "paise",
            "to",
            "near",
            "1-week",
            "low",
            "amid",
            "fears",
            "of",
            "fed",
            "rate",
            "hike"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Rupee slumps 16 paise to near 1-week low amid fears of Fed rate hike",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tThe rupee today slid further by 16 paise to close at near one-week low of 67.65 against the US currency on sustained <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=dollar+demand\" target=\"_blank\">dollar demand </a>ahead of the key US Federal Reserve's decision on rate hike.</p>\n<p>\n\tThe domestic currency opened weak at 67.62 per dollar and oscillated between 67.55 and 67.71 during the day amid suspected dollar selling by the central bank.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe rupee had dropped by 7 paise to 67.49 per dollar on Tuesday.</p>\n<p>\n\tRobust demand for the US currency from private sector lenders, probably at the behest of their corporate clients largely kept the home unit under immense pressure, a forex dealer said.</p>\n<p>\n\tForeign portfolio investors (FPIs) sold shares worth Rs 12.38 billion on a net basis in past two sessions, provisional data showed.</p>\n<p>\n\tInvestors were cautious ahead of the US Federal Reserve's June monetary policy decision due late on Wednesday as the FOMC meeting was widely expected to increase rates for the second time this year. Robust US economic news-flow along with inflation reading, the highest in six years, bolstered the rate hike fears.</p>\n\n<p>\n\tInvestors were awaiting the announcement to look for cues if the Fed looks to tighten policy four times in 2018 or three times, as it indicated earlier this year.</p>\n<p>\n\tThe greenback traded broadly higher against its major counterparts in <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=asia+pacific+trade\" target=\"_blank\">Asia Pacific trade.</a> The dollar edged up against the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/euro\" target=\"_blank\">euro </a>and hit a three-week high versus the yen on Wednesday. The dollar index was down at 93.70 after initial gains of up to 0.12 per cent.</p>\n<p>\n\tOn the energy front, crude prices dropped, hit by rising supplies in the US and expectations that producer group OPEC could relax voluntary output cuts. Saudi Arabia said it has raised its production above 10 mn barrels a day.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/brent-crude\" target=\"_blank\">Brent crude </a>futures, an international benchmark, was trading down at $75.64 a barrel, in early Asian trade.</p>\n<p>\n\tMeanwhile, domestic bourses extended with modest gains on the back of good follow-up buying in software exporters and healthcare stocks.</p>\n<p>\n\tAsian markets were mostly lower.</p>\n\n<p>\n\tBond markets, however, staged a sharp rebound after two-straight selloffs and the 10-year benchmark bond yield ended sharply lower at 7.93 per cent from 7.97 per cent.</p>\n<p>\n\tThe rupee opened sharply lower at 67.62 from the previous close of 67.49 at the interbank foreign exchange (forex) market due to sustained <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=dollar+demand\" target=\"_blank\">dollar demand.</a></p>\n<p>\n\tIt kept descending, weighed down by firm dollar overseas to hit an intra-day low of 67.71 before ending at 67.65, showing a loss of 16 paise, 0.24 per cent.</p>\n<p>\n\tThe RBI, meanwhile, fixed the reference rate for the dollar at 67.6251 and for the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/euro\" target=\"_blank\">euro </a>at 79.3919.</p>\n<p>\n\tIn the cross-currency trade, the rupee drifted further against the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/euro\" target=\"_blank\">euro </a>to settle at 79.50 from 79.47 on Tuesday.</p>\n<p>\n\tThe home unit, however, recovered against the pound sterling to finish at 90.16 per pound from 90.31. It edged higher against the Japanese yen to close at 61.19 per 100 yens as compared to 61.22 earlier.</p>\n<p>\n\tIn the forward market on Wednesday, a premium for dollar declined owing to mild receiving from exporters.</p>\n<p>\n\tThe benchmark six-month forward premium payable in October moved down to 107.75-109.75 paise from 109.25-111.25 paise and the far-forward April 2019 contract edged lower to 251.50-253.50 paise from 253-255 paise.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "rising",
        "low",
        "crude",
        "front",
        "voluntary",
        "near",
        "16",
        "On"
    ],
    "verbs": [
        "rate",
        "hike",
        "output",
        "group",
        "low",
        "front",
        "hit",
        "relax",
        "near"
    ],
    "nouns": [
        "rate",
        "hike",
        "week",
        "output",
        "producer",
        "group",
        "rising",
        "low",
        "crude",
        "Rupee",
        "US",
        "OPEC",
        "front",
        "hit",
        "voluntary",
        "energy",
        "16",
        "Fed"
    ]
}