{
    "creator": "Rajesh Ravi",
    "title": "Global palm oil output likely to drop after 2022, says Report",
    "link": "https://www.financialexpress.com/economy/global-palm-oil-output-likely-to-drop-after-2022-says-report/1212657/",
    "pubDate": "Wed, 20 Jun 2018 01:08:31 +05:30",
    "dc:creator": "Rajesh Ravi",
    "content": "Global palm oil production is likely to drop after 2022 due to declining yield from old plantations and insufficient replanting activities in both Indonesia and Malaysia, according to a report by Rabobank. ",
    "contentSnippet": "Global palm oil production is likely to drop after 2022 due to declining yield from old plantations and insufficient replanting activities in both Indonesia and Malaysia, according to a report by Rabobank.",
    "guid": "https://www.financialexpress.com/?p=1212657",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-19T19:38:31.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.09090909090909091,
        "tokens": [
            "global",
            "palm",
            "oil",
            "output",
            "likely",
            "to",
            "drop",
            "after",
            "2022",
            "says",
            "report"
        ],
        "words": [
            "drop"
        ],
        "positive": [],
        "negative": [
            "drop"
        ]
    },
    "article": {
        "title": "Global palm oil output likely to drop after 2022, says Report",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1212666\" src=\"https://images.financialexpress.com/2018/06/palm.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/palm.jpg 660w, https://images.financialexpress.com/2018/06/palm-300x200.jpg 300w, https://images.financialexpress.com/2018/06/palm-620x413.jpg 620w, https://images.financialexpress.com/2018/06/palm-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Global palm oil output likely to drop after 2022</figure>\n\t\t\t</section></div><span>\n</span><p>Global palm oil production is likely to drop after 2022 due to declining yield from old plantations and insufficient replanting activities in both Indonesia and Malaysia, according to a report by Rabobank. The production is expected to increase again from 2025 when trees planted during 2018-23 start yielding, it said. India is the world’s biggest vegetable oil importer and buys palm oil primarily from Indonesia and Malaysia. More than 70% of India’s edible oil demand is met through imports.</p><span>\n</span><p>Rabobank expects the global palm oil consumption to grow at a compound annual growth rate (CAGR) of 2.8%, while production will climb at a CAGR of 1.4%. Malaysia and Indonesia are the largest global producers of palm oil products, with a global market share of more than 85%.<br>Palm trees produce four to 10 times more oil than other vegetable oil crops per unit of cultivated land.</p><span>\n</span><p>Rabobank estimates the production to decline due to falling fresh fruit bunch (FFB) yield of ageing palm plantations, limited available land for expansion, and insufficient replanting activities in both countries. The report by Rabobank titled “A Palm Storm Is Brewing” says that during 2016-17, the absolute growth of oil palm plantation areas in Indonesia and Malaysia were 29% and 51% lower respectively, compared with the past ten-year average as a result of limited land availability for expansion coupled with a relatively low palm oil price environment. As land availability becomes limited, Rabobank said old oil palm tree replanting programmes are important to increase palm oil production in Indonesia and Malaysia.</p><span>\n</span><p>Malaysia is currently nearing the limits of agricultural land availability for oil palm conversion and expansion.<br>In Indonesia, a combination of existing and expected new moratorium will limit land availability from the total approved concession areas in the country to only three to four million hectare. The report points out that a combination of large expenditure, needed for replanting, and a relatively low palm oil price environment has slowed down the much-needed replanting programme in both countries.<br>Eventually, both countries are expected to face the risk of a slowing palm production from 2022, when palm oil supplies will reflect the scaled-back investments in replanting activities and expansion.</p><span>\n</span><p>India’s edible oil demand is estimated this year (till October 18) at around 23 million tonne and palm oil imports are again estimated at 9.8 million tonne. India imports soyoil from Argentina and Brazil. It also buys small volumes of sunflower oil from Ukraine and canola oil from Canada.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "Global",
        "likely",
        "due",
        "old",
        "insufficient",
        "according"
    ],
    "verbs": [
        "output",
        "yield",
        "Report",
        "report",
        "palm",
        "oil",
        "drop"
    ],
    "nouns": [
        "production",
        "output",
        "yield",
        "Indonesia",
        "Report",
        "report",
        "oil",
        "drop",
        "due",
        "old",
        "palm",
        "Malaysia"
    ]
}