{
    "title": "US-China spat singes global markets, Sensex falls 261 pts",
    "link": "https://www.business-standard.com/article/markets/us-china-spat-singes-global-markets-sensex-falls-261-pts-118062000020_1.html",
    "pubDate": "Wed, 20 Jun 2018 00:52:00 +0530",
    "content": "Asian markets nosedived after US President Donald Trump threatened to impose additional tariffs on Chinese goods",
    "contentSnippet": "Asian markets nosedived after US President Donald Trump threatened to impose additional tariffs on Chinese goods",
    "guid": "https://www.business-standard.com/article/markets/us-china-spat-singes-global-markets-sensex-falls-261-pts-118062000020_1.html",
    "isoDate": "2018-06-19T19:22:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "us-china",
            "spat",
            "singes",
            "global",
            "markets",
            "sensex",
            "falls",
            "261",
            "pts"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "US-China spat singes global markets, Sensex falls 261 pts",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\tStocks remained subdued for the second straight day on Tuesday, owing to a sell-off across <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/global-markets\" target=\"_blank\">global </a><a class=\"storyTags\" href=\"https://www.business-standard.com/markets\" target=\"_blank\">markets </a>after the US and China reignited their trade dispute.</p>\n<p>\n\tThe BSE Sensex plunged around 261 points to end at a two-week low of 35,286.74, while the broader Nifty dropped 89 points to 10,710.45.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/asian-markets\" target=\"_blank\">Asian </a><a class=\"storyTags\" href=\"https://www.business-standard.com/markets\" target=\"_blank\">markets </a>nosedived after US President <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/donald-trump\" target=\"_blank\">Donald Trump </a>threatened to impose additional tariffs on Chinese goods, and Beijing vowed to retaliate, fanning fears of a full-blown trade war between the world's two largest economies.<br></p><p>\n\t\t<img align=\"left\" alt=\"chart\" class=\"imgCont\" height=\"233\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/20/full/1529435955-6188.jpg\" title=\"chart\" width=\"348\"></p>\n<p>\n\tUnabated selling by foreign funds and a weak rupee added to the gloom, brokers said.</p>\n<p>\n\tThe 30-share Sensex barometer opened positive, but soon fell on across-the-board selling. It finally settled at 35,286.74, down 261.52 points, or 0.74 per cent. This is its lowest closing since June 6, when it had ended at 35,178.88.</p>\n<p>\n\tThe NSE Nifty ended 89.40 points, or 0.83 per cent lower at 10,710.45.</p>\n<p>\n\tForeign portfolio investors (FPIs) sold shares worth a net Rs 7.54 billion, while domestic institutional investors (DIIs) picked up equities worth Rs 8.24 billion on Monday, according to provisional data. \"Escalating trade disputes between the US and China is impacting the global market and the ripple effect dented the domestic market sentiment.</p>\n<p>\n\t\"Lack of fresh triggers and weakening rupee may lead the market to consolidate further. Consolidation in oil price in expectation of gradual increase in output ahead of OPEC meet may provide some support to INR,\" said Vinod Nair, head of research at Geojit Financial Services.<br></p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t<img align=\"left\" alt=\"chart\" class=\"imgCont\" height=\"387\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/20/full/1529436063-9458.jpg\" title=\"chart\" width=\"235\">\n\t\t</p><p>\n\t\t\tCompiled by BS Research Bureau | Source: Bloomberg</p>\n\n<p>\n\tVedanta was the biggest loser in the Sensex pack, sinking 3.55 per cent, followed by Adani Ports that fell 2 per cent. Only ITC, HDFC Bank, HDFC and ONGC managed to close in the green. All sectoral indices finished with losses. Metal fell 1.69 per cent, followed by realty (1.33 per cent), oil and gas (1.22 per cent), IT (1.21 per cent), teck (1.08 per cent), PSU (1.07 per cent).</p>\n<p>\n\tSelling pressure also gathered momentum in broader markets, with the BSE small-cap index falling 1.29 per cent and the mid-cap index losing 0.98 per cent.</p>\n<p>\n\tIn Asia, Hong Kong's Hang Seng tanked 2.94 per cent, Japan's Nikkei declined 1.73 per cent and China's Shanghai Composite Index slumped 3.82 per cent. Taiwan and Singapore also closed with losses.</p>\n<p>\n\tEuropean markets, too, were down in their early session. Frankfurt was trading lower by 1.58 per cent, while Paris CAC 40 fell 1.16 per cent. London's FTSE was down 0.74 per cent.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Chinese",
        "Asian",
        "global",
        "threatened",
        "additional"
    ],
    "nouns": [
        "US",
        "China",
        "Chinese",
        "Trump",
        "President",
        "Asian",
        "falls",
        "spat"
    ],
    "verbs": [
        "impose",
        "Trump",
        "spat"
    ]
}