{
    "title": "Government bond yields poised to rise as market reacts to RBI's rule change",
    "link": "https://www.business-standard.com/article/markets/government-bond-yields-poised-to-rise-as-market-reacts-to-rbi-s-rule-change-118061300295_1.html",
    "pubDate": "Wed, 13 Jun 2018 11:50:00 +0530",
    "content": "The prevailing environment of rising bond yields, in part due to RBI's hawkish policy bias, has made banks unwilling to hold government bonds in excess of their liquidity requirements",
    "contentSnippet": "The prevailing environment of rising bond yields, in part due to RBI's hawkish policy bias, has made banks unwilling to hold government bonds in excess of their liquidity requirements",
    "guid": "https://www.business-standard.com/article/markets/government-bond-yields-poised-to-rise-as-market-reacts-to-rbi-s-rule-change-118061300295_1.html",
    "isoDate": "2018-06-13T06:20:00.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.07692307692307693,
        "tokens": [
            "government",
            "bond",
            "yields",
            "poised",
            "to",
            "rise",
            "as",
            "market",
            "reacts",
            "to",
            "rbi's",
            "rule",
            "change"
        ],
        "words": [
            "rise",
            "poised"
        ],
        "positive": [
            "rise"
        ],
        "negative": [
            "poised"
        ]
    },
    "article": {
        "title": "Government bond yields poised to rise as market reacts to RBI's rule change",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/reserve-bank-of-india\" target=\"_blank\">Reserve Bank of India </a>(RBI) announced an important regulatory change in Wednesday’s monetary policy review, which reduces banks’ demand for government bonds by around 2% of aggregate deposits. We estimate that is equal to roughly Rs 2.3 trillion. While the market was expecting a move along these lines, government <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bond-yields\" target=\"_blank\">bond yields </a>are likely to rise as the market reacts to the change over time, in our view.</p>\n<p>\n\tAt face value, the RBI eased the regulatory requirement for banks pertaining to liquidity. Digging deeper into the rules, the move is likely to accentuate concerns of oversupply and banks’ unwillingness to hold government bonds in excess of the requirement. To understand this, we need to go through the technical details of the regulatory landscape of banks’ demand for government bonds.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/indian-banks\" target=\"_blank\">Indian banks </a>demand government bonds to meet two kinds of regulatory requirements:</p>\n<ul>\n\t<li>\n\t\tThe statutory liquidity requirement, which is prescribed at 19.5% of net demand and time liabilities, or, roughly, aggregate deposits.</li>\n</ul>\n<ul>\n\t<li>\n\t\tThe liquidity coverage ratio under Basel III norms, which is defined in terms of high-quality liquid assets. This is equal about 19% - 20% of aggregate deposits, based on channel checks with banks.</li>\n</ul>\n<p>\n\tBanks mostly meet these liquidity requirements by holding government bonds. As part of existing regulations, banks were allowed an overlap equal to 11% of aggregate deposits to meet both these requirements. The policy change relaxes that to 13%, effectively reducing banks’ regulatory demand for government bonds by 2% of aggregate deposits.</p>\n<p>\n\t<strong><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bond-yields\" target=\"_blank\">Bond yields </a>rise as market prices in regulatory change</strong><br></p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t<img align=\"left\" alt=\".\" class=\"imgCont\" height=\"530\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/13/full/1528869811-9219.jpg\" title=\".\" width=\"620\">\n\t\t</p>\n<p>\n\tShouldn’t the central bank freeing up Rs 2.3 trillion of additional liquidity be seen as a positive for banks? We argue not. The reason: negative sentiment in the bond market created by the RBI’s hawkishness over the past few years. For instance, the RBI waited for inflation to drop below 2% last year to deliver a rate cut, but hiked rates when inflation rose to 4.2% in April this year (adjusted for the direct impact from higher housing rent allowance that the RBI says should be looked through). The RBI’s mandate is to target inflation of 4% +/- 2 percentage points.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/finance/rbi-policy-extra-haircut-on-rated-bonds-to-put-poorly-run-states-in-a-spot-118060800047_1.html\" target=\"_blank\">RBI policy: Extra haircut on rated bonds to put poorly run states in a spot</a></strong></p>\n<p>\n\tThe prevailing environment of rising bond yields, in part due to RBI’s hawkish policy bias, has made banks unwilling to hold government bonds in excess of their liquidity requirements. This is because banks fear capital losses, which now need to be marked to market. Previously, banks were not required to mark to market a part of their excess holdings of government bonds, and public-sector banks typically held this excess to support <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bond-yields\" target=\"_blank\">bond yields.</a></p>\n<p>\n\tGiven that public sector banks are already reeling under stress from a cleanup of bad loans in the banking system, their appetite for booking treasury losses has aptly disappeared. The fact that the RBI has allowed banks to spread their capital losses on bond holdings over the next four quarters is unlikely to help much.</p>\n<p>\n\t<strong>Banks’ holding of statutory liquidity reserves</strong><br></p><p>\n\t\t<img align=\"left\" alt=\".\" class=\"imgCont\" height=\"530\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/13/full/1528869898-0221.jpg\" title=\".\" width=\"620\">\n\t\t</p>\n<p>\n\tWe estimate that as of May 11, statutory liquidity reserves of banks were equal to 29.7% of aggregate deposits. That means banks’ excess holding of government bonds totalled -1.7% of aggregate deposits [29.7% actual SLR holding - (19.5% SLR requirement + 17% LCR requirement - 11% overlap)], which after the policy change will increase to 1.2% of aggregate deposits, or roughly Rs 1.4 trillion.</p>\n<p>\n\tOver the past few months, the excess statutory liquidity reserves of banks declined to 29.7% from 31% (see chart above).</p>\n<p>\n\tThis resulted in some banks needing to issue certificates of deposit to meet their LCR requirement, and caused short-term yields to spike. The regulatory easing helps banks meet their liquidity coverage ratio and eases stress at the short end of the yield curve. But the pressure will now shift to longer-tenor government bonds and the corporate bond market, which uses government bonds as a benchmark. An easier solution would be for the RBI to simply give up its hawkish bias on monetary policy.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/rbi-policy-why-a-hike-in-rates-to-tame-the-oil-shock-would-be-a-mistake-118052800150_1.html\" target=\"_blank\">RBI policy: Why a hike in rates to tame the oil shock would be a mistake</a> </strong></p>\n<p>\n\tThe only other way out is rapid economic growth that generates a strong rise in aggregate deposits and, in turn, leads to organic bank demand for government bonds. But once again, Wednesday’s RBI rate hike and such regulatory changes that are likely to further pressure corporate bond yields higher are not conducive to a growth recovery. \n\t</p><hr>\n\n<p>\n\t<strong><em>Abhishek Gupta is an economist at Bloomberg India</em></strong></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "rising",
        "poised",
        "prevailing",
        "due",
        "hawkish",
        "bias",
        "made",
        "excess",
        "unwilling"
    ],
    "nouns": [
        "market",
        "Government",
        "government",
        "rise",
        "rising",
        "bond",
        "RBI",
        "change",
        "rule",
        "part",
        "environment",
        "policy",
        "due",
        "bias",
        "banks",
        "hold",
        "excess",
        "liquidity"
    ],
    "verbs": [
        "market",
        "rise",
        "bond",
        "rule",
        "change",
        "part",
        "bias",
        "hold"
    ]
}