{
    "creator": "Chirag Madia",
    "title": "Hospitals ask government to review rates for treatment packages under NHPS",
    "link": "https://www.financialexpress.com/market/hospitals-ask-government-to-review-rates-for-treatment-packages-under-nhps/1194985/",
    "pubDate": "Wed, 06 Jun 2018 02:21:41 +05:30",
    "dc:creator": "Chirag Madia",
    "content": "Recently government has finalized the rates for 1,354 packages which will be covered under NHPS and the cost of rates for several diseases is lower than prevailing market rates. ",
    "contentSnippet": "Recently government has finalized the rates for 1,354 packages which will be covered under NHPS and the cost of rates for several diseases is lower than prevailing market rates.",
    "guid": "https://www.financialexpress.com/?p=1194985",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-05T20:51:41.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "hospitals",
            "ask",
            "government",
            "to",
            "review",
            "rates",
            "for",
            "treatment",
            "packages",
            "under",
            "nhps"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Hospitals ask government to review rates for treatment packages under NHPS",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1194987\" src=\"https://images.financialexpress.com/2018/06/health-5-1-2.jpg\" alt=\"NHPS, hospitals ask govt to review rates, treatment packages,&nbsp;National Health Protection Scheme&nbsp;\" srcset=\"https://images.financialexpress.com/2018/06/health-5-1-2.jpg 660w, https://images.financialexpress.com/2018/06/health-5-1-2-300x200.jpg 300w, https://images.financialexpress.com/2018/06/health-5-1-2-620x413.jpg 620w, https://images.financialexpress.com/2018/06/health-5-1-2-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> At least a dozen top hospitals in the country have asked the government to review the rates for the various treatment packages for the National Health Protection Scheme (NHPS), saying these were too low and not workable. (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>At least a dozen top hospitals in the country have asked the government to review the rates for the various treatment packages for the National Health Protection Scheme (NHPS), saying these were too low and not workable. The scheme is scheduled to be launched on August 15 and insurance companies are awaiting clarity on the insurance premiums and whether the bidding process would be state wise or district wise. The premium is likely to be around Rs 1,086 to provide an insurance cover of around Rs 5 lakh to 10 crore families.</p><span>\n</span><p>Recently government has finalized the rates for 1,354 packages which will be covered under NHPS and the cost of rates for several diseases is lower than prevailing market rates. “Government came up with the packages and around 15 private hospitals have gone back to government saying that these rates are not good enough for quality healthcare. They have asked government to review the prices, so that they can participate in the scheme,” said a senior official from a leading insurance company.</p><span>\n</span><p>In a meeting with the government officials in May, insurers had spoken strongly against reverse bidding process. Even representative from Insurance Regulatory &amp; Development Authority of India (IRDA) also strongly supported the views of insurance companies on this and they confirmed that IRDA does not permit reverse bidding in other lines of businesses.</p><span>\n</span><p>However, government believes that reverse bidding will create competition among the insurers to get the most optimum price. In the reverse bidding process, government will ask insurance companies to bid on the ceiling of the premium and at the end whichever insurance companies have quoted lower will win the contract.</p><span>\n</span><p>“I think there will be bidding process, but we are yet to get clarity whether it will be state wise or district wise-as in the crop insurance scheme. If the bidding will be for the entire state than it will be difficult for many small insurers to participate in the scheme. However if it’s done district or cluster wise, all the insurance players can take part in the scheme,”said another senior official.</p><span>\n</span><p>Finance Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/arun-jaitley/\">Arun Jaitley</a> had announced world’s largest government funded health care programme titled NHPS to cover over 10 crore poor and vulnerable families (approximately 50 crore beneficiaries) providing coverage upto&nbsp;Rs 5 lakh per family per year for secondary and tertiary care hospitalisation.</p><span>\n</span><p>Insurers also feel that, with this scheme directly under the control of the central and the state governments there will be no problems in terms of servicing from the insurance companies.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "covered",
        "several",
        "prevailing"
    ],
    "nouns": [
        "market",
        "government",
        "will",
        "lower",
        "rates",
        "review",
        "treatment",
        "cost"
    ],
    "verbs": [
        "market",
        "ask",
        "will",
        "lower",
        "review",
        "cost"
    ]
}