{
    "title": "Influencers getting $105,000 per tweet for promoting cryptocurrency",
    "link": "https://www.business-standard.com/article/markets/influencers-getting-105-000-per-tweet-for-promoting-cryptocurrency-118062700949_1.html",
    "pubDate": "Wed, 27 Jun 2018 18:48:00 +0530",
    "content": "About 18 percent of cryptocurrency-related posts on Reddit, Twitter and online forum Bitcointalk.org now originate from bounty campaigns",
    "contentSnippet": "About 18 percent of cryptocurrency-related posts on Reddit, Twitter and online forum Bitcointalk.org now originate from bounty campaigns",
    "guid": "https://www.business-standard.com/article/markets/influencers-getting-105-000-per-tweet-for-promoting-cryptocurrency-118062700949_1.html",
    "isoDate": "2018-06-27T13:18:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.125,
        "tokens": [
            "influencers",
            "getting",
            "105000",
            "per",
            "tweet",
            "for",
            "promoting",
            "cryptocurrency"
        ],
        "words": [
            "promoting"
        ],
        "positive": [
            "promoting"
        ],
        "negative": []
    },
    "article": {
        "title": "Influencers getting $105,000 per tweet for promoting cryptocurrency",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tBy day, Paul Angus is an engineer. But by night, he’s Cryptonomatron: a producer of hot takes on the latest initial coin offerings who has more than 8,000 subscribers on <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/youtube\" target=\"_blank\">YouTube.</a> The 43-year-old Scot’s online alter-ego is mostly a labor of love, yet it sometimes comes with an added perk: payment in digital tokens.</p>\n<p>\n\tThat’s thanks to the thriving but murky world of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/cryptocurrency\" target=\"_blank\">cryptocurrency </a>“bounty campaigns,” where <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/social-media\" target=\"_blank\">social media </a>influencers get paid to promote ICOs by the entrepreneurs (and in some cases scammers) behind the offerings. The practice isn’t new -- crypto celebrity <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=john+mcafee\" target=\"_blank\">John McAfee </a>has long been a promoter-for-hire, saying in March that he charged $105,000 per tweet. But the endorsements are playing an ever-bigger role in ICO marketing after Internet giants including Google, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/facebook\" target=\"_blank\">Facebook </a>and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/twitter\" target=\"_blank\">Twitter </a>moved to ban <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/cryptocurrency\" target=\"_blank\">cryptocurrency </a>advertisements this year.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe proliferation of bounty campaigns is one reason why ICOs are raising money at a record pace, despite the ad bans and this year’s 57 per cent tumble in Bitcoin. While defenders of the campaigns say they’re an inexpensive way to build a brand, critics see a breeding ground for hype and misinformation. In jurisdictions where ICOs are considered securities, promoters -- also known as “bounty hunters” -- may even risk running afoul of authorities by acting as unregistered broker-dealers.</p>\n<p>\n\t“Once it becomes clear that financial outcomes can be manipulated not just by trading but creating perceptions through social media, regulators will take a very hard stance,” said Lex Sokolin, global director of fintech strategy at Autonomous Research in London.</p>\n<p>\n\tSome promoters are already feeling the heat. McAfee, the anti-virus software pioneer whose checkered past includes run-ins with police in Belize and a failed bid to become the U.S. Libertarian Party presidential candidate in 2016, said in a tweet to his more than 820,000 followers on June 19 that he’s no longer working with ICOs or recommending them after receiving unspecified “threats” from the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/securities-and-exchange-commission\" target=\"_blank\">Securities and Exchange Commission.</a></p>\n<p>\n\tThe SEC fired a salvo against celebrity endorsers of ICOs in November, warning that such promoters often lack the expertise to ensure that investments are appropriate. SEC Chairman Jay Clayton has said that ICOs are improperly skirting registration requirements and that the market is probably full of fraud.</p>\n\n<p>\n\tThe Commodity Futures Trading Commission, another U.S. markets regulator, has also urged customers to avoid buying tokens based on tips shared on <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/social-media\" target=\"_blank\">social media.</a> The SEC, CFTC, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/google\" target=\"_blank\">Google </a>and Reddit didn’t respond to requests for comment, while <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/twitter\" target=\"_blank\">Twitter </a>referred to its policy banning ICO ads. <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/facebook\" target=\"_blank\">Facebook </a>loosened its crypto ad ban on Tuesday, saying some content will be allowed on the social network after going through a vetting process. The company will continue to prohibit ads for ICOs.</p>\n<p>\n\tBased on the specifics of the offering, an ICO may be considered a security by the SEC, according to a primer posted on the regulator’s website. Anyone who promotes such an offering in exchange for compensation tied to the sale may be breaking the law if they don’t first register with the regulator, according to Richard Levin, Denver-based chair of fintech and regulation practice at law firm Polsinelli PC.</p>\n<p>\n\tMcAfee notwithstanding, the legal risks have done little to slow bounty campaigns or the ICO boom. The offerings have raised more than $11.6 billion for blockchain-related startups so far this year, roughly triple last year’s record, according to CoinSchedule. About 18 per cent of cryptocurrency-related posts on Reddit, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/twitter\" target=\"_blank\">Twitter </a>and online forum Bitcointalk.org now originate from bounty campaigns, according to Solume, which monitors social-media posts on digital tokens. That compares with about 6 per cent in January.</p>\n<p>\n\tWhile the coins earned by bounty hunters are often worth little initially, the hope is that they’ll become much more valuable if the offering is a success. McAfee’s hefty per-tweet fee is an indication of how lucrative the gig can be for celebrities and other influential endorsers. About 1 per cent to 2 per cent of the money raised by ICOs is allocated to bounties, Autonomous Research’s Sokolin estimated.</p>\n<p>\n\tThe payouts are in some ways like stock options, giving promoters a stake in the issuer’s success, said Saransh Sharma, president of 4New, a startup with an ongoing bounty campaign. 4New, which wants to generate electricity from waste, restarted its campaign in April after the ad bans halted its marketing momentum.</p>\n<p>\n\t“It’s really a very cost-effective mechanism for developing a brand,” Sharma said by phone. “Before you know it, there’s a snowball effect.” 4New has raised about $43 million, mostly from accredited investors.</p>\n<p>\n\tBut even for fans of bounty campaigns like Sharma, quality can be an issue. Many bounty hunters do little more than retweet the ICO issuer, and reviews often simply regurgitate material from the ICO’s website. Bots, fake followers, and stolen identities are commonplace.</p>\n<p>\n\tAngus, or Cryptonomatron, comes across as analytical by the standards of the crypto world, breaking down the pros and cons of each ICO in his videos. He said he’s received bounties worth about $4,000 to $5,000, based on the tokens’ initial values, and that the money doesn’t sway his reviews.</p>\n<p>\n\tHe also urged viewers to do their own due diligence.</p>\n<p>\n\t“There might be people that go in solely based on watching my video -- I hope that’s not the case,” he said. “You shouldn’t listen to YouTubers.”</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "related",
        "105",
        "About",
        "18",
        "online"
    ],
    "verbs": [
        "tweet",
        "Twitter",
        "originate"
    ]
}