{
    "title": "Odisha asks district authorities to initiate action against errant miners",
    "link": "https://www.business-standard.com/article/economy-policy/odisha-asks-district-authorities-to-initiate-action-against-errant-miners-118061300979_1.html",
    "pubDate": "Wed, 13 Jun 2018 18:09:00 +0530",
    "content": "State govt seeks status report on steps taken against miners who failed to pay Supreme Court-mandated compensation",
    "contentSnippet": "State govt seeks status report on steps taken against miners who failed to pay Supreme Court-mandated compensation",
    "guid": "https://www.business-standard.com/article/economy-policy/odisha-asks-district-authorities-to-initiate-action-against-errant-miners-118061300979_1.html",
    "isoDate": "2018-06-13T12:39:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "odisha",
            "asks",
            "district",
            "authorities",
            "to",
            "initiate",
            "action",
            "against",
            "errant",
            "miners"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Odisha asks district authorities to initiate action against errant miners",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tMiners in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/odisha\" target=\"_blank\">Odisha </a>who failed to pay the Supreme Court-mandated compensation are headed for trouble. The state steel &amp; mines department has asked collectors of two iron ore rich districts, <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=keonjhar\" target=\"_blank\">Keonjhar </a>and Sundargarh, to submit status reports on action initiated against the defaulters.</p>\n<p>\n\tIn a letter to the two district authorities, R K Sharma, principal secretary (steel &amp; mines), <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/odisha\" target=\"_blank\">Odisha </a>government, has sought the status report on action taken with respect to identification of properties to initiate certificate cases. Much to the dismay of the department, the district collectors were yet to apprise it on the details of meetings of the District Level Task Forces and action initiated against the defaulting lessees.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tAfter the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/supreme-court\" target=\"_blank\">Supreme Court </a>order in a case of rampant illegal mining in Odisha, the state government had slapped notices on 131 iron and manganese ore miners to recover Rs 175.76 billion. The penalty was to be forked out for violating environment clearance (EC) limits while extracting ore. The figure was calculated by the apex court appointed panel, the central empowered committee (CEC). The court order of August 2, 2017 was in response to a petition filed by the NGO Common Cause. The court had stipulated December 31, 2017 as the deadline for payments.</p>\n<p>\n\tNot all miners complied with this deadline. The non-payment of compensation had led to the temporary shutdown of seven working iron ore mines in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/odisha\" target=\"_blank\">Odisha </a>with an annual capacity to mine 23 million tonnes.</p>\n<p>\n\tLater, the top court condoned delay in payments by the miners who were directed to pay the arrears with 12 per cent interest. State run mining entity <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=industrial+development+corporation\" target=\"_blank\">Industrial Development Corporation </a>(Idcol), Serajuddin &amp; Company and Aditya Birla owned Essel Mining &amp; Industries were amongst the miners making payments beyond the deadline. After the delayed payments, the state government issued orders to facilitate resumption of mines by Idcol, Essel Mining &amp; Serajuddin &amp; Company.</p>\n<p>\n\tFor leaseholders who failed to shell out the compensation, the state level task force decided to initiate coercive action to recover dues. The purview of action against the 56 errant lessees meant identification of their assets and properties for confiscation and freezing of bank accounts.</p>\n<p>\n\tThe state government managed to collect Rs 120 billion from the iron ore and manganese mines owners. Proceeds of the fund would go to the Odisha Mineral Bearing Area Development Corporation, the special purpose vehicle formed for periphery development of areas impacted by mining operations.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Supreme",
        "taken",
        "errant"
    ],
    "verbs": [
        "report",
        "State",
        "action",
        "initiate",
        "district",
        "Court",
        "pay"
    ]
}