{
    "title": "Allahabad Bank likely to recover Rs 55 billion in FY19: N K Sahoo",
    "link": "https://www.business-standard.com/article/finance/allahabad-bank-likely-to-recover-rs-55-billion-in-fy19-n-k-sahoo-118062700515_1.html",
    "pubDate": "Wed, 27 Jun 2018 16:18:00 +0530",
    "content": "The Bank is hopeful of raising close to Rs 5 billion from sale of non-core assets",
    "contentSnippet": "The Bank is hopeful of raising close to Rs 5 billion from sale of non-core assets",
    "guid": "https://www.business-standard.com/article/finance/allahabad-bank-likely-to-recover-rs-55-billion-in-fy19-n-k-sahoo-118062700515_1.html",
    "isoDate": "2018-06-27T10:48:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "allahabad",
            "bank",
            "likely",
            "to",
            "recover",
            "rs",
            "55",
            "billion",
            "in",
            "fy19",
            "n",
            "k",
            "sahoo"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Allahabad Bank likely to recover Rs 55 billion in FY19: N K Sahoo",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tState-run lender <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/allahabad-bank\" target=\"_blank\">Allahabad Bank </a>is looking at a recovery of around Rs 55 billion in the current fiscal, an official said on Wednesday.</p>\n<p>\n\tThe bank has submitted a roadmap to the Centre and if everything goes \"well and smooth\" as per its projections, it was likely to come out of prompt corrective action (PCA), imposed by the Reserve <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bank-of-india\" target=\"_blank\">Bank of India </a>(RBI), by March 2020, the official said.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\t\"We are expecting Rs 30 billion recovery through resolution in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nclt\" target=\"_blank\">NCLT </a>(National Company Law Tribunal) in the entire financial year, another Rs 20 billion through normal recovery process and Rs 4-5 billion through asset sales,\" <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/allahabad-bank\" target=\"_blank\">Allahabad Bank </a>Executive Director <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=n+k+sahoo\" target=\"_blank\">N.K. Sahoo </a>said.</p>\n<p>\n\t\"We have recently recovered around Rs 13 billion from the resolution of Bhusan Steel and Electrosteel Steels,\" he added.</p>\n<p>\n\tThe bank has an outstanding exposure of Rs 40 billion in several accounts referred to <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nclt\" target=\"_blank\">NCLT </a>including Uttam Galva, Alok Industries, Essar Steel, he said, adding that it was hopeful of recovering from these accounts in the current fiscal.</p>\n<p>\n\tThe bank may have to take a hair-cut upto 50-60 per cent in these accounts, he added.<br></p>\n\n<p>\n\t\"We have created a <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nclt\" target=\"_blank\">NCLT </a>cell to effectively monitor the NCLT accounts. We have almost 94 (stressed) accounts referred by us as well as by other lenders amounting around Rs 120 billion.</p>\n<p>\n\t\"Almost 45 per cent of our gross NPA is in the NCLT,\" Sahoo told shareholders here at the 16th Annual General Meeting of the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/allahabad-bank\" target=\"_blank\">Allahabad Bank.</a></p>\n<p>\n\tCapital requirement for the lender during the current fiscal would be close to Rs 90 billion, Sahoo said on the sidelines of the meeting.</p>\n<p>\n\t\"The bank would require close to Rs 90 billion worth capital this fiscal,\" he said.</p>\n<p>\n\tOf the total capital requirement, the bank requested the government to pump in Rs 70 billion and was looking to raise close to Rs 19 billion through different modes this fiscal.</p>\n<p>\n\tThis apart, it is hopeful of raising close to Rs 5 billion from sale of non-core assets.<br></p>\n\n<p>\n\t\"A roadmap has been submitted to the (Finance) Ministry. If everything goes well as per the bank's projection, we are expecting to come out of PCA by March 2020,\" he said.</p>\n<p>\n\tAt the end of the 2017-18, gross NPA (non performing assets) of the bank stood at Rs 265.6276 billion as compared to Rs 206.8783 billion in FY 17 (2016-17) and Net NPA remained at Rs 122.2913 billion as on March 31, 2018 as against Rs 134.3351 billion in FY 17.</p>\n<p>\n\tOwing to high non-performing assets (NPA) and negative return on assets (RoA) for two consecutive years, the bank was brought under prompt corrective action framework by the RBI on January 2, Sahoo told shareholders.</p>\n<p>\n\tIn fact, subsequently, the RBI had imposed additional restrictions on Allahabad Bank under prompt corrective action (PCA) framework.</p>\n<p>\n\tIt was asked to restrict expansion of risk-weighted assets (RWA), reduce exposure to high-risk loans and restrict accessing or renewing wholesale deposits.</p>\n<p>\n\tThe bank had posted a net loss of Rs 35.0963 billion in the March quarter of 2017-18.</p>\n\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "likely",
        "55",
        "billion",
        "K",
        "hopeful",
        "raising",
        "close"
    ],
    "verbs": [
        "Bank",
        "recover",
        "close",
        "core"
    ]
}