{
    "title": "How this Trump move may favour Indians",
    "link": "https://timesofindia.indiatimes.com/business/india-business/trump-favours-people-coming-to-us-through-merit-based-system/articleshow/64757957.cms",
    "pubDate": "Wed, 27 Jun 2018 04:14:52 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/trump-favours-people-coming-to-us-through-merit-based-system/articleshow/64757957.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64757957.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/trump-favours-people-coming-to-us-through-merit-based-system/articleshow/64757957.cms",
    "isoDate": "2018-06-27T04:14:52.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.2857142857142857,
        "tokens": [
            "how",
            "this",
            "trump",
            "move",
            "may",
            "favour",
            "indians"
        ],
        "words": [
            "favour"
        ],
        "positive": [
            "favour"
        ],
        "negative": []
    },
    "article": {
        "title": "Trump favours people coming to US through merit-based system",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>WASHINGTON: President </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Donald-Trump\">Donald Trump</a><p> on Wednesday said he wants foreign workers to come in the US through a merit-based immigration system so as to meet the demands of companies that are moving into America in greater numbers.\n\n</p><span>Indian-Americans, most of whom are highly skilled and came to the US mainly on H-1B work visas, are the worst sufferers of the current immigration system which imposes a seven per cent per </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/country-quota\">country quota</a><p> on allotment of green cards or permanent legal residency.\n</p><p>\"I want people to come into our country because our country is doing so well. We have companies moving into our country at numbers that nobody has seen in a long time. We need workers. So, I want people to come in. They have to come in through the merit system though,\" Trump told reporters at the White House during a luncheon with members of the Congress.\n</p><p>\"They have to come in so that they can help our country and these companies,\" Trump said responding to a question on immigration after the US Supreme Court upheld his travel ban against people coming from eight Muslim-majority countries.\n</p><p>The US president said he is not against people coming into the country but made it clear he wants them to come legally through a merit-based system, a move which experts believe would help qualified people from countries like India.\n</p><span>In Wisconsin, he said </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Foxconn\">Foxconn</a><p>, one of the great companies of the world, is setting up a manufacturing base.\n</p><p>\"They make the laptop for Apple, and iPhones, a lot of it. And they're building a tremendous plant right now in Wisconsin. They need workers. I have to let people come in. But they have to come in through a merit. They have to be people that can love our country and help our country,\" Trump said.\n</p><p>Trump said that the current immigration policy makes the least sense.\n</p><p>It is a hodgepodge of laws that have been put together over years and this needs to be changed, he asserted.\n</p><span>\"It's so simple. It's called, \"I'm sorry, you can't come in. You have to go in through a legal process. You don't have to see a judge where the judge is going to take three years before you can come back. In the meantime, you never come back because you're already in the country. You're someplace in the country. And that would be bad, but it's really bad when it's a criminal,\" he said.\n</span><br><span>\n</span><br><span>There are plenty of those criminals who are into the country this way. They use young children for their own benefit. We have to change the whole immigration picture. We will be able to do it. We need the border wall. We need the border. We need border security and we need modern equipment. We will get it done, I have no doubt,\" he said.\n</span><br><span>\n</span><br><span>Trump said there needs to be a system wherein the country does not need thousands of judges to handle the cases of illegal immigrants.\n</span><br><span>\n</span><br><span>\"We have to find a system where you don't need thousands of judges sitting at a border. Other countries look at us and they think we're crazy. They say, what kind of a thing is that? They have countries where they have no problem with people pouring in. And you have countries where people do want to go in,\" he said.\n</span><br><span>\n</span><br><span>\"If you look at the </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/European-Union\">European Union</a><p>, they're meeting right now to toughen up their immigration policies because they've been overrun. They have been overrun. Frankly, a lot of those countries are not the same places anymore. I'm sad to say it, and I said that at the G7: They are not the same places,\" he said.\n</p><span>\n</span></div></div>"
    },
    "adjectives": [
        "coming",
        "10",
        "left",
        "top",
        "right",
        "based"
    ],
    "nouns": [
        "india",
        "coming",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo",
        "us",
        "may",
        "Trump",
        "trump",
        "move",
        "favour",
        "people",
        "merit",
        "system"
    ],
    "verbs": [
        "border",
        "align",
        "style",
        "top",
        "right",
        "Trump",
        "trump",
        "move",
        "favour",
        "people",
        "merit"
    ]
}