{
    "title": "Dow Jones slides as Donald Trump ratchets up trade war with China",
    "link": "https://www.business-standard.com/article/markets/dow-jones-slides-as-donald-trump-ratchets-up-trade-war-with-china-118062000010_1.html",
    "pubDate": "Wed, 20 Jun 2018 02:18:00 +0530",
    "content": "Trump ordered up identification of $200 bn in Chinese imports for additional tariffs of 10%, with another $200 bn after that if Beijing retaliates",
    "contentSnippet": "Trump ordered up identification of $200 bn in Chinese imports for additional tariffs of 10%, with another $200 bn after that if Beijing retaliates",
    "guid": "https://www.business-standard.com/article/markets/dow-jones-slides-as-donald-trump-ratchets-up-trade-war-with-china-118062000010_1.html",
    "isoDate": "2018-06-19T20:48:00.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.16666666666666666,
        "tokens": [
            "dow",
            "jones",
            "slides",
            "as",
            "donald",
            "trump",
            "ratchets",
            "up",
            "trade",
            "war",
            "with",
            "china"
        ],
        "words": [
            "war"
        ],
        "positive": [],
        "negative": [
            "war"
        ]
    },
    "article": {
        "title": "Dow Jones slides as Donald Trump ratchets up trade war with China",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tAlarm bells rang across global <a class=\"storyTags\" href=\"https://www.business-standard.com/markets\" target=\"_blank\">markets </a>as trade tensions between the United States and China escalated further.</p>\n<p>\n\tThe yuan also hit a five-month low overnight after <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/us\" target=\"_blank\">US </a>President <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/donald-trump\" target=\"_blank\">Donald Trump </a>threatened to impose a 10 per cent tariff on another $200 billion of Chinese goods. Beijing in turn warned about $50 billion of retaliatory penalties on <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/us\" target=\"_blank\">US </a>goods.</p>\n<p>\n\t\"If the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/us\" target=\"_blank\">US </a>loses its senses and publishes such a list, China will have to take comprehensive quantitative and qualitative measures,\" according to a statement from the Ministry of Commerce. It labelled the move \"extreme pressure and blackmail,\" and said it would retaliate with counter measures.</p>\n<p>\n\tTrump ordered up identification of $200 billion in Chinese <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/imports\" target=\"_blank\">imports </a>for additional tariffs of 10 per cent, with another $200 billion after that if Beijing retaliates. While the $50 billion in tariffs already announced on Friday were mainly on industrial goods, the broader move would push up prices for toys, tools, t-shirts and a lot more for US shoppers.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/international/china-vows-strong-counter-measures-after-trump-s-fresh-threat-on-tariffs-118061900114_1.html\" target=\"_blank\">China vows strong counter-measures after Trump's fresh threat on tariffs</a></strong></p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/us-stocks\" target=\"_blank\">US stocks </a>slumped on Tuesday, with the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/dow-jones\" target=\"_blank\">Dow Jones </a>Industrial Average erasing its gains for the year. The Dow fell 300.90 points, or 1.20 per cent, to 24,709 intra-day.</p>\n<p>\n\t\t<img align=\"left\" alt=\"graph\" class=\"imgCont\" height=\"485\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/20/full/1529434238-1083.jpg\" title=\"graph\" width=\"321\"></p>\n\tAsian stocks also wilted to a four-month low and Australia's dollar, South Africa's rand and the euro were among a diverse group of currencies caught in the crossfire on Tuesday. Overnight the Shanghai Composite Index slumped nearly 5 per cent at one point to its lowest level since mid-2016, as more than 1,000 stocks slumped by their 10 per cent daily limit. Hong Kong's Hang Seng also shed as much 3 per cent and MSCI's Asia-Pacific index fell 1.9 per cent to its lowest since early December.\n<p>\n\tEurope's main equity benchmarks sank 1 to 1.5 per cent and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/wall-street\" target=\"_blank\">Wall Street </a>futures were pointing to similar declines, while government bonds and the Japanese yen rallied as investors sought protection.<br></p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/international/in-trade-spat-trump-seeks-tariffs-on-extra-200-bn-of-chinese-goods-118061900096_1.html\" target=\"_blank\">In trade spat, Trump seeks tariffs on extra $200 bn of Chinese goods</a></strong></p>\n<p>\n\t“The collateral damage from an escalating US-China <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/trade-war\" target=\"_blank\">trade war </a>will be widespread, hitting many Asian countries that are part of China’s manufacturing supply chain in sectors such as electrical and electronic products,” said Rajiv Biswas, Asia Pacific chief economist at IHS Markit in Singapore. The trade frictions have unnerved financial markets, with investors and businesses increasingly worried that a full-blown trade battle could derail global growth.</p>\n<p>\n\t“Its psychological effects, its effects in increasing uncertainty, could be very serious and we’re certainly getting later in a cycle of escalation,” former US Treasury Secretary Lawrence Summers said in an interview on Bloomberg Television.</p>\n<p>\n\t“The rising risk of a disruptive trade conflict makes a bad situation tentatively worse,” economists at Nomura wrote.</p>\n<p>\n\t“In a global trade war, no matter how you spin tariffs, retailers and the American families that we serve are the losers,” said Hun Quach, vice-president, international trade, for the Retail Industry Leaders Association.</p>\n<p>\n\tMost other currencies lost against the dollar, though. The US currency gained 0.6 per cent on the euro to a near 11-month high at $1.1554. The skid by China's yuan to a five-month low was its biggest fall in a year and a half. The Australian dollar, often considered a proxy for China-related trades, brushed a one-year low of $0.7381 too.</p>\n<p>\n\t“In the global environment — and due in particular to this trade issue - the risks are more on the downward side and a little bit worrying,” European Central Bank policymaker Jan Smets said in a CNBC interview. “Basically it is not good <a class=\"storyTags\" href=\"https://www.business-standard.com/category/markets-news-1060101.htm\" target=\"_blank\">news.</a>” Industrial metals also buckled with copper tumbling 1.9 per cent in its ninth fall in the last 10 sessions and nickel down 2.1 per cent. Brent crude futures eased 60 cents, or 0.8 per cent, to $74.74 a barrel.<br></p><p>\n\t\t<img align=\"left\" alt=\"graph\" class=\"imgCont\" height=\"326\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/20/full/1529434213-5816.jpg\" title=\"graph\" width=\"620\"></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Chinese",
        "10",
        "200",
        "additional",
        "ordered"
    ],
    "verbs": [
        "trade",
        "Trump",
        "war"
    ]
}