{
    "title": "PSBs to focus on credit needs of 'genuine' companies, says Piyush Goyal",
    "link": "https://www.business-standard.com/article/economy-policy/psbs-to-focus-on-credit-needs-of-genuine-companies-says-piyush-goyal-118062000039_1.html",
    "pubDate": "Wed, 20 Jun 2018 02:22:00 +0530",
    "content": "PSBs promise to boost credit; 4,500 companies to be assessed; banks to work on two-stage process",
    "contentSnippet": "PSBs promise to boost credit; 4,500 companies to be assessed; banks to work on two-stage process",
    "guid": "https://www.business-standard.com/article/economy-policy/psbs-to-focus-on-credit-needs-of-genuine-companies-says-piyush-goyal-118062000039_1.html",
    "isoDate": "2018-06-19T20:52:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "psbs",
            "to",
            "focus",
            "on",
            "credit",
            "needs",
            "of",
            "'genuine'",
            "companies",
            "says",
            "piyush",
            "goyal"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "PSBs to focus on credit needs of 'genuine' companies, says Piyush Goyal",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/public-sector-banks\" target=\"_blank\">Public sector banks </a>(PSBs), in a meeting with <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=finance+minister+piyush+goyal\" target=\"_blank\">Finance Minister </a><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/piyush-goyal\" target=\"_blank\">Piyush Goyal </a>on Tuesday, have decided to chalk out a road map for supporting the credit needs of “genuine” companies.</p><p>\nThe banks would take up the credit needs of “genuine, deserving, well-performing and good companies” in two stages, Goyal said.</p><p>\nIn the first stage, the PSBs will conduct a focused study on the credit needs of around 4,500 companies, with borrowings in the range of Rs 2 billion to Rs 20 billion. In the second stage, the credit needs of companies with borrowings of up to Rs 2 billion — mostly micro, small and medium enterprises (MSMEs) — will be covered.</p>\n <br>“One of the thoughts before the PSBs is to support <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/msmes\" target=\"_blank\">MSMEs </a>along with genuine and good companies that need working capital finance or loans on investments in fixed assets and have faced difficulties in the past. Banks will work as a team to arrive at a decision to support business,” Goyal said.\n <br>The finance minister held a meeting with the top executives of 18 PSBs, including chief executives and non-executive chairpersons, Department of Financial Services Secretary <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rajiv-kumar\" target=\"_blank\">Rajiv Kumar </a>and other officials. The meeting deliberated on the issue of merging PSBs.<p>\nThe PSBs also decided to take steps to smoothen the process of sanctioning loans through a consortium and multiple banking arrangements. In one such move, a decision taken by 66 per cent of the banks within a consortium will be binding on all the lenders. This is in line with the recent amendments carried out in the Insolvency and Bankruptcy Code through an Ordinance.</p>\n <br>\n<!-- INPAGE_BANNER -->\nThe voting percentage was reduced from 75 per cent to 66 per cent for the committee of creditors to approve special plans, such as those relating to insolvency resolution.<p>\nA model inter-creditor agreement will soon be formulated to lay down ground rules, which will have to be followed by all the banks within a consortium.</p><p>\nThis will be done following consultations with the Indian Banks’ Association and the boards of respective banks.</p><p>\n“The idea is to improve the working of consortiums and multiple banking arrangements through formal agreements between banks, so that there are certain ground rules. This element is missing at present. Most PSBs will sign this agreement and do everything to support each other,” SBI Chairman Rajnish Kumar said.</p>\n <br>Kumar highlighted some of the operational issues and “practical difficulties” faced by banks while lending to corporates in a consortium or through multiple banking arrangements. “It has been experienced that bankers participating in a consortium feel they do not have enough powers. Even if 80-90 per cent of banks agree on a certain proposal and some other bank feels otherwise, the process is scuttled,” he said.<p>\nOn mergers, Kumar said there was a consensus that banks were “too fragmented” at present and needed scaling up. “The pitfalls and advantages of mergers were discussed. Individual banks will now have to decide based on opportunity,” he said. However, the SBI chairman ruled out further plans for merger due to regulatory reasons. “We are too big. When a bank has a market share of 23 per cent, it becomes an important bank and bigger banks are not advisable from the system’s perspective,” he added.</p><div><span>\n\t</span><img align=\"left\" alt=\"PSBs to focus on credit needs of 'genuine' companies, says Piyush Goyal\" class=\"imgCont\" height=\"432\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/20/full/1529439249-6825.jpg\" title=\"PSBs to focus on credit needs of 'genuine' companies, says Piyush Goyal\" width=\"558\"></div>\n<br>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "genuine",
        "500",
        "two"
    ],
    "nouns": [
        "banks",
        "stage",
        "credit",
        "focus",
        "promise",
        "process",
        "boost",
        "500",
        "work",
        "two"
    ],
    "verbs": [
        "credit",
        "stage",
        "focus",
        "promise",
        "process",
        "boost",
        "work"
    ]
}