{
    "title": "Just around 25% of India's workforce is female, says McKinsey report",
    "link": "https://www.business-standard.com/article/economy-policy/just-around-25-of-india-s-workforce-is-female-says-mckinsey-report-118062000034_1.html",
    "pubDate": "Wed, 20 Jun 2018 01:27:00 +0530",
    "content": "The report suggests India in the longer term needs to create far more jobs in the formal organised sector -- 97 per cent of all female worker activity is in the informal sector",
    "contentSnippet": "The report suggests India in the longer term needs to create far more jobs in the formal organised sector -- 97 per cent of all female worker activity is in the informal sector",
    "guid": "https://www.business-standard.com/article/economy-policy/just-around-25-of-india-s-workforce-is-female-says-mckinsey-report-118062000034_1.html",
    "isoDate": "2018-06-19T19:57:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "just",
            "around",
            "25",
            "of",
            "india's",
            "workforce",
            "is",
            "female",
            "says",
            "mckinsey",
            "report"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Just around 25% of India's workforce is female, says McKinsey report",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tJust around 25 per cent of India’s workforce is female, according to a recent report by consultants McKinsey &amp; Company on the advancing of women’s equality in the Asia-Pacific region.</p>\n<p>\n\tA 10 per cent increase to that, it says, could add $770 billion to the country’s Gross Domestic Product in the next seven years.</p>\n<p>\n\tPrimary factors driving the male-female gap include gender inequality at work and in society. Physical security and autonomy, legal protection, political voice and women’s role in essential services are all areas where India’s statistics lag in comparison.</p>\n<p>\n\tFor instance, says the report, violence against women in India is six times higher than the global best scores, on a weighted index based on female populations. Maternal mortality per 100,000 births is close to double that of the average in the Asia-Pacific as a whole. <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/child-marriage\" target=\"_blank\">Child marriage </a>is higher than any other groups compared.</p>\n<p>\n\tIt also lists the many states and Union Territories with no female members of Parliament. Anu Madgavkar, partner with the India office at McKinsey, says “the fix has to be a combination of both government effort and the private sector stepping up together”.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/current-affairs/do-12-mn-indians-join-workforce-annually-data-peg-number-at-less-than-half-118052100105_1.html\" target=\"_blank\">Do 12 mn Indians join workforce annually? Data peg number at less than half</a></strong></p>\n\n<p>\n\tShe points to digital inclusion as an example. She cites how Google and the Tata Trusts joined hands in 2015 for a programme called Internet Saathi, which enrolled women’s groups for training on basic internet usage. Female entrepreneurs ride bicycles with smartphones and tablets, and  visit villages, where they share their knowledge with women there. At the end of last year, 33,000 ‘digital bikers’ had reached 125,000 villages and are estimated to have trained at least 13 million women. “The object is to reach 30,000 villages,” says Madgavkar.<br></p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t<img align=\"left\" alt=\"chart\" class=\"imgCont\" height=\"321\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/20/full/1529438114-8497.jpg\" title=\"chart\" width=\"492\"></p>\n<p>\n\tThe report suggests India in the longer term needs to create far more jobs in the formal organised sector -- 97 per cent of all female worker activity is in the informal sector. That includes low-paying jobs such as domestic household work, cleaning streets and picking up waste.</p>\n<p>\n\tIt is, however, more than a simple provisioning of “jobs for women” that will address the deeper maladies that come with gender inequality. “The entire mindset has to change,” says Madgavkar.</p>\n<p>\n\tThe report details how households with budget constraints give men priority access for technology.  A Delhi survey says three of every five men agreed they had priority over women in accessing the internet access. One village’s government body in Rajasthan mandated that girls couldn’t use social media or mobiles; another in Uttar Pradesh fined girls Rs 2,100 for using a mobile phone outside their homes. “If we are to avoid suffering a huge economic drain that we can’t afford as a growing economy, that has to change,” she adds.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "far",
        "formal",
        "informal",
        "Just",
        "25",
        "female",
        "organised",
        "97"
    ],
    "nouns": [
        "India",
        "cent",
        "sector",
        "workforce",
        "worker",
        "far",
        "longer",
        "term",
        "formal",
        "25",
        "report",
        "female",
        "activity"
    ],
    "verbs": [
        "create",
        "term",
        "report"
    ]
}