{
    "title": "Why investors, not banks may play crucial role in next financial crisis",
    "link": "https://www.business-standard.com/article/economy-policy/why-investors-not-banks-may-play-crucial-role-in-next-financial-crisis-118062700154_1.html",
    "pubDate": "Wed, 27 Jun 2018 21:10:00 +0530",
    "content": "Valued for their simplicity, exchange-traded funds pose worrying risks",
    "contentSnippet": "Valued for their simplicity, exchange-traded funds pose worrying risks",
    "guid": "https://www.business-standard.com/article/economy-policy/why-investors-not-banks-may-play-crucial-role-in-next-financial-crisis-118062700154_1.html",
    "isoDate": "2018-06-27T15:40:00.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.25,
        "tokens": [
            "why",
            "investors",
            "not",
            "banks",
            "may",
            "play",
            "crucial",
            "role",
            "in",
            "next",
            "financial",
            "crisis"
        ],
        "words": [
            "crisis"
        ],
        "positive": [],
        "negative": [
            "crisis"
        ]
    },
    "article": {
        "title": "Why investors, not banks may play crucial role in next financial crisis",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tBanks must bear much of the blame for previous financial crises. In the next one, ordinary investors could play a more central role.</p>\n<p>\n\tIronically, they’ll do so through vehicles created with them in mind – exchange-traded funds, or ETFs. These listed funds are passive by nature, designed to track the performance of an index of stocks, bonds, currencies or commodities rather than to pick and choose among individual companies.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe popularity of ETFs has soared in the past decade. The proportion of U.S. equity-fund assets that are passively managed has nearly doubled in that time to nearly 40 percent. Vanguard alone owns positions greater than 5 percent in 491 of the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/stocks\" target=\"_blank\">stocks </a>on the S&amp;P 500, adding up to nearly 7 percent of the index’s total market cap. In Japan, where the central bank owns big stakes in ETFs, passive investors hold over half of all equity assets.</p>\n<p>\n\tIt’s easy to see why such funds have thrived. ETFs, invested in indices that are theoretically diversified, have consistently outperformed active managers. Their simplicity is appealing to lay investors, who can focus on broad asset-allocation strategies rather than guessing at individual winners and losers. Costs are low, with fees typically running between 0.05 percent and 0.50 percent. That’s become even more important as returns broadly have declined.</p>\n<p>\n\tETFs, however, are riskier than many investors appreciate. With cap-weighted indices, for instance, funds have no choice but to load up on <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/stocks\" target=\"_blank\">stocks </a>that are already overweight (and often pricey) and neglect those already underweight. As prices have risen, investors may become overexposed to a few large securities, such as the big tech companies which now dominate major U.S. indices. That’s the opposite of “buy low, sell high.”</p>\n<p>\n\tETFs can replicate indices in complicated ways. Rather than purchasing all the assets consistent with index weights, some funds use a sub-set, thus exposing investors to tracking error. Others use derivatives, creating credit exposure to the counterparty. Some ETFs use leverage to enhance returns. Like other funds, ETFs can lend out the fund’s securities to short-sellers, which creates exposure to the return of the borrowed assets. ETFs must be fully invested and therefore hold minimal cash, which could limit flexibility in a downturn. The rules governing indices can be changed, sometimes arbitrarily.</p>\n<p>\n\tWorse, the ways in which ETFs – by their <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/design\" target=\"_blank\">design </a>and their sheer size – are warping <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/markets\" target=\"_blank\">markets </a>aren’t well-understood. ETFs encourage concentration in a few, liquid, large-cap stocks, creating homogenous and momentum-following <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/markets\" target=\"_blank\">markets.</a> The focus on driving down costs requires ETFs to emphasize scale, further exacerbating concentration. <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/markets\" target=\"_blank\">Markets </a>become susceptible to flows from a few, large, passive products.</p>\n<p>\n\tArtificial factors, such as inclusion or exclusion from an index, forces buying and selling; this can lead to misallocations of capital. In the current equity cycle, for instance, over-weighted, liquid, large-cap <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/stocks\" target=\"_blank\">stocks </a>have benefited disproportionately from forced buying. This increases the risk of bubbles, as in 2000.</p>\n<p>\n\tETFs may even distort valuations outright. For one thing, they don’t analyze prices, meaning that they don’t contribute to price discovery. They arguably weaken corporate activism, as passive owners have little interest in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/corporate-governance\" target=\"_blank\">corporate governance.</a></p>\n<p>\n\tFinally, ETFs increase volatility and shrink liquidity. Passive funds exhibit significantly higher intraday and daily volatility, driven by arbitrage activity between ETFs and the underlying stocks. With ETFs increasingly important as the marginal buyers and sellers of securities, this may increase volatility in periods of instability.</p>\n<p>\n\tAt the same time, passive funds lock up a large percentage of stocks that can only be traded on changes in market capitalization or other index metrics. Thus, the actual number of shares available to trade -- or “true float” -- may be a lot smaller than investors realize. Especially when dealing with small-cap shares, certain <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bonds\" target=\"_blank\">bonds </a>and commodities, many ETFs are predicated on greater liquidity than is actually available in the underlying assets.</p>\n<p>\n\tIf a crisis does arise, this is likely to exacerbate the downturn. ETFs will have to sell quickly what they’ve disproportionately bought; passive indexers may become panic sellers. Where ETFs have been the primary buyers, they may have trouble finding anyone willing to purchase the holdings they’re trying to liquidate.</p>\n<p>\n\tImagine that one big investor in an <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/etf\" target=\"_blank\">ETF </a>with, say, a 10 percent stake is forced to sell a large part its holding in a single day. There might not be ready buyers for such a large holding, causing the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/etf\" target=\"_blank\">ETF </a>to fall to a price below the value of the assets it owns. This price impact may be exaggerated, as <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/etf\" target=\"_blank\">ETF </a>activity intensifies both upswings and downswings. Crashes, when they happen, may be bigger.</p>\n<p>\n\tThe good times, driven by a confluence of policies favoring passive strategies, have been very good to ETFs. What investors should be worrying about now is how resilient they’ll be when conditions change. In every crisis, untested structures have revealed hidden weaknesses which have threatened wealth and financial stability. There’s no reason to think next time will be any different.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "worrying",
        "financial",
        "crucial",
        "next",
        "Valued"
    ],
    "verbs": [
        "pose",
        "exchange",
        "play"
    ],
    "nouns": [
        "pose",
        "banks",
        "worrying",
        "crisis",
        "exchange",
        "role",
        "play",
        "simplicity",
        "Why",
        "may",
        "funds"
    ]
}