{
    "creator": "FE Bureau",
    "title": "Fixing Cane Arrears: Centre readying Rs 8,000-cr sugar package, says Food Minister Ram Vilas Paswan",
    "link": "https://www.financialexpress.com/industry/fixing-cane-arrears-centre-readying-rs-8000-cr-sugar-package-says-food-minister-ram-vilas-paswan/1195096/",
    "pubDate": "Wed, 06 Jun 2018 05:50:12 +05:30",
    "dc:creator": "FE Bureau",
    "content": "Moreover, a two-year moratorium on repayment on the loans for increasing ethanol production could be provided to sugar mills.",
    "contentSnippet": "Moreover, a two-year moratorium on repayment on the loans for increasing ethanol production could be provided to sugar mills.",
    "guid": "https://www.financialexpress.com/?p=1195096",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-06T00:20:12.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "fixing",
            "cane",
            "arrears",
            "centre",
            "readying",
            "rs",
            "8000-cr",
            "sugar",
            "package",
            "says",
            "food",
            "minister",
            "ram",
            "vilas",
            "paswan"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Fixing Cane Arrears: Centre readying Rs 8,000-cr sugar package, says Food Minister Ram Vilas Paswan",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1195101\" src=\"https://images.financialexpress.com/2018/06/cats-323.jpg\" alt=\"cane arrears, centre, rs 8000 crore sugar package, food ministry, ram vilas paswan\" srcset=\"https://images.financialexpress.com/2018/06/cats-323.jpg 660w, https://images.financialexpress.com/2018/06/cats-323-300x200.jpg 300w, https://images.financialexpress.com/2018/06/cats-323-620x413.jpg 620w, https://images.financialexpress.com/2018/06/cats-323-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Facing farmers’ ire over staggering sugarcane arrears of more than Rs 22,000 crore, the Centre will soon announce a bailout package of Rs 8,000 crore to enable sugar mills clear the dues, according to food minister Ram Vilas Paswan.</figure>\n\t\t\t</section></div><span>\n</span><p>Facing farmers’ ire over staggering sugarcane arrears of more than Rs 22,000 crore, the Centre will soon announce a bailout package of Rs 8,000 crore to enable sugar mills clear the dues, according to food minister Ram Vilas Paswan. The cabinet is expected to take up the proposals on Wednesday. “A proposal of Rs 8,000 crore has been sent to the Cabinet and it will take the decision soon,” Paswan told reporters while highlighting his ministry’s achievements in the last four years.</p><span>\n</span><p>While the Centre has been helping the sugar industry clear cane dues in recent years through loans and interest subsidy, the steps haven’t prevented arrears from piling up at regular intervals when sugar prices drop, thanks to generous and unreasonable hikes in cane prices by both the Centre and states like Uttar Pradesh.</p><span>\n</span><p>Official sources said the package includes the Rs 5.5-per-quintal production-linked subsidy already announced in May, apart from the cost of setting up a buffer stock of 3 million tonnes of sugar and interest subvention on facilitating credit to sugar mills to boost their ethanol-making capacity. The government has to bear a carrying cost of around Rs 1,200 crore a year for the creation of the buffer stock. Moreover, a two-year moratorium on repayment on the loans for increasing ethanol production could be provided to sugar mills. The government will pay a part of the total interest burden over five years, which is expected to be in excess of Rs 4,400 crore.</p><span>\n</span><p>The bailout package has been worked out by the food ministry and the Centre wants to launch it at the earliest, so that cane arrears are cleared much before the crucial 2019 general polls, analysts said. Already, the <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/bharatiya-janata-party/\">BJP</a> witnessed a setback in Lok Sabha by-poll in Kairana in sugarcane-growing western Uttar Pradesh. Paswan, however, refuted suggestions that the package is linked to the recent poll results.</p><span>\n</span><p><img class=\"alignnone size-full wp-image-1195104\" src=\"https://images.financialexpress.com/2018/06/cane.jpg\" alt=\"\" width=\"181\" height=\"369\" srcset=\"https://images.financialexpress.com/2018/06/cane.jpg 181w, https://images.financialexpress.com/2018/06/cane-98x200.jpg 98w, https://images.financialexpress.com/2018/06/cane-131x267.jpg 131w\" sizes=\"(max-width: 181px) 100vw, 181px\"></p><span>\n</span><p>In June 2015, the Centre had offered a loan package worth Rs 6,000 crore with a 10% interest subsidy on it for one year. In December 2013, it had announced a loan package of Rs 6,600 crore, with a 12% interest subsidy for five years. However, as has been pointed out repeatedly, unless the basic issue of cane pricing is resolved by the central and state governments, massive arrears will keep surfacing in future as well.</p><span>\n</span><p>Sugar mills have already threatened to stop operations in the next marketing year starting October, ahead of the crucial 2019 general elections, expressing inability to cope with huge losses. According to the Indian Sugar Mills Association, sugar prices have crashed by 25-30% in the current marketing year that started in October 2017, inflating cane costs — based on the fair and remunerative price set by the Centre — to as much as 90-100% of mills’ sugar sales revenue. Cane costs linked to the state advised price fixed by Uttar Pradesh are even higher.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "two",
        "increasing"
    ],
    "verbs": [
        "sugar",
        "package",
        "Minister",
        "Cane",
        "Ram",
        "Centre"
    ]
}