{
    "title": "Benchmark yield ends at 7.83%; traders cautious ahead of RBI decision",
    "link": "https://www.financialexpress.com/market/benchmark-yield-ends-at-7-83-traders-cautious-ahead-of-rbi-decision/1194995/",
    "pubDate": "Wed, 06 Jun 2018 02:41:37 +05:30",
    "content": "The rupee touched an intra-day low of 67.23 and a high of 67.06, a 16 paisa fluctuation during the same day’s trading session.",
    "contentSnippet": "The rupee touched an intra-day low of 67.23 and a high of 67.06, a 16 paisa fluctuation during the same day’s trading session.",
    "guid": "https://www.financialexpress.com/?p=1194995",
    "categories": [
        "Market"
    ],
    "isoDate": "2018-06-05T21:11:37.000Z",
    "sentiment": {
        "score": -1,
        "comparative": -0.09090909090909091,
        "tokens": [
            "benchmark",
            "yield",
            "ends",
            "at",
            "783",
            "traders",
            "cautious",
            "ahead",
            "of",
            "rbi",
            "decision"
        ],
        "words": [
            "cautious"
        ],
        "positive": [],
        "negative": [
            "cautious"
        ]
    },
    "article": {
        "title": "Benchmark yield ends at 7.83%; traders cautious ahead of RBI decision",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1194999\" src=\"https://images.financialexpress.com/2018/06/RBI-re-660-2.jpg\" alt=\"RBI, bond market, bond market dealers, repo rate\" srcset=\"https://images.financialexpress.com/2018/06/RBI-re-660-2.jpg 660w, https://images.financialexpress.com/2018/06/RBI-re-660-2-300x200.jpg 300w, https://images.financialexpress.com/2018/06/RBI-re-660-2-620x413.jpg 620w, https://images.financialexpress.com/2018/06/RBI-re-660-2-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Ahead of the Reserve Bank of India’s (RBI) monetary policy announcement on Wednesday, bond market dealers are expectedly cautious, though most of them expect the central bank to hike the repo rates by at least 25 basis points. (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>Ahead of the Reserve Bank of India’s (<a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a>) monetary policy announcement on Wednesday, bond market dealers are expectedly cautious, though most of them expect the central bank to hike the repo rates by at least 25 basis points. The repo rate is currently at 6% after the RBI cut the rate by 25 basis points in August, 2017. At the time yield was at 6.43%, 140 bps lower than it is now. The benchmark yield closed at 7.83% on Tuesday, four basis points lower than Monday’s closing.</p><span>\n</span><p>The rupee touched an intra-day low of 67.23 and a high of 67.06, a 16 paisa fluctuation during the same day’s trading session. It closed at 67.15 against the dollar on Tuesday. The anxiety is understandable. Crude oil prices are now ruling at $74.55 per barrel and have risen 47% since June 2017. Food prices could rise, if the government follows through with a generous support scheme for farmers to compensate them for any difference between the MSP and the market price.</p><span>\n</span><p>If the RBI hikes the repo rate on Wednesday, it will be the first hike in almost four and a half years. The last hike was when the repo rate was increased from 7.75 in December, 2013 to 8% in January, 2014.<br>Ananth Narayan, professor, SPJIMR, said, there are sufficient reasons for the MPC to opt for a 25 bps rate hike right away, followed by another in August.</p><span>\n</span><p>“For one, the MPC’s primary focus is on inflation, and core inflation has been steadily increasing. Second, emerging markets like Turkey, Indonesia, Argentina have been in the headlines, and while our situation is not at all comparable, we cannot afford to be seen to be behind the curve. Third, our external sector is looking weak, with rising CAD from higher oil prices, gold and electronics imports, and tepid export performance.</p><span>\n</span><p>Lastly, the quality of our fiscal deficit has deteriorated, with higher revenue deficits and lower capital spending in FY18. This fiscal trend could continue into this election year as well. Given this overall financial stability context, I believe the MPC will choose to act now,” Narayan said.</p><span>\n</span><p>While talking about the increasing rates, he added: “Yields across government bonds, corporate bonds, CDs, and CPs have already risen quite sharply over the past nine months or so. A rate hike by itself should not be a surprise to the markets, but the language from the MPC statement will be watched carefully.”</p><span>\n</span><p>Lakshmi Iyer, chief investment officer, Debt and head-products , Kotak AMC, said: “If there has to be a rate hike tomorrow, it is already discounted in the market yields. Future rate action will be very data-driven based on the impact of the monsoon and other factors like crude oil prices, US rate stance etc . In case they decide to remain status quo, there is likelihood of MPC preparing markets for a future rate action outcome .”</p><span>\n</span><p>Iyer believes a rate hike is unlikely on Wednesday since it will depend on a lot of factors. “For example, from the previous policy to now, crude has been up around 10%. So, until and unless the factors do not point in that direction, two continuous rate hikes are unlikely,” she observed.</p><span>\n</span><p><img class=\"alignnone size-full wp-image-1195001\" src=\"https://images.financialexpress.com/2018/06/rbi-4.jpg\" alt=\"\" width=\"259\" height=\"250\" srcset=\"https://images.financialexpress.com/2018/06/rbi-4.jpg 259w, https://images.financialexpress.com/2018/06/rbi-4-207x200.jpg 207w, https://images.financialexpress.com/2018/06/rbi-4-32x32.jpg 32w\" sizes=\"(max-width: 259px) 100vw, 259px\"></p><span>\n</span><p>She also said the bond markets have discounted a rate hike which has caused the yields to reach the 7.85% level on Tuesday. “A significant sell off therefore looks unlikely, unless guidance and action both are hawkish,” she explained. A few bond dealers said it is too early for the RBI to increase the rates and there are more factors that have to be considered before they can increase the rates.</p><span>\n</span><p>“I do not see the Reserve Bank of India (RBI) hiking the rates tomorrow, they will factor in a lot more data points and then take a concrete stand. The impact of monsoon and other information, all will be considered and then there will be a hike in their August meeting after narrowing down on their priority.<br>“They will however concentrate on the liquidity aspect and take corrective measures to increase the liquidity in the market, but definitely not a rate hike tomorrow,” said Ashish Jalan, AVP, SPA Securities.</p><span>\n</span><p>By:&nbsp;Tushar Goenka</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "touched",
        "low",
        "83",
        "cautious",
        "ahead",
        "67",
        "23",
        "high",
        "16"
    ],
    "verbs": [
        "low",
        "yield"
    ]
}