{
    "title": "Can Modi govt run risk of Air India sale turning political before polls?",
    "link": "https://www.business-standard.com/article/economy-policy/can-modi-govt-run-risk-of-air-india-sale-turning-political-before-polls-118061300569_1.html",
    "pubDate": "Wed, 13 Jun 2018 15:32:00 +0530",
    "content": "Even if the terms of sale of Air India are made easier, the deal cannot be closed in the next six months, given that there are at least three crucial state elections and the Lok Sabha elections coming",
    "contentSnippet": "Even if the terms of sale of Air India are made easier, the deal cannot be closed in the next six months, given that there are at least three crucial state elections and the Lok Sabha elections coming",
    "guid": "https://www.business-standard.com/article/economy-policy/can-modi-govt-run-risk-of-air-india-sale-turning-political-before-polls-118061300569_1.html",
    "isoDate": "2018-06-13T10:02:00.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.15384615384615385,
        "tokens": [
            "can",
            "modi",
            "govt",
            "run",
            "risk",
            "of",
            "air",
            "india",
            "sale",
            "turning",
            "political",
            "before",
            "polls?"
        ],
        "words": [
            "risk"
        ],
        "positive": [],
        "negative": [
            "risk"
        ]
    },
    "article": {
        "title": "Can Modi govt run risk of Air India sale turning political before polls?",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>The <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/narendra-modi\" target=\"_blank\">Narendra Modi </a>government appears to be trying hard to sweeten its offer for sale of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/air-india\" target=\"_blank\">Air India.</a></p><p>\nHowever, irrespective of whatever the government does now, the short window of opportunity that the Modi government had for privatising the state-owned airline is now virtually shut, at least for the next year or so.</p><p>\nConsider this: Even if the terms of sale of<strong> Air India</strong> are made easier, the deal cannot be closed in the next six months. There are at least three crucial state Assembly elections scheduled to be held before the end of January 2019. Assembly elections for Chhattisgarh, Madhya Pradesh and Rajasthan have to be completed before January 5, 7 and 20, respectively. And then, there are the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=general+elections\" target=\"_blank\">general elections </a>to be held in May 2019.</p><p>\nThe stakes for the Modi government in these elections will be very high. The Bharatiya Janata Party (BJP) will be fighting the Assembly polls as an incumbent in all the three states. And for the Lok Sabha, Modi will be fighting what now looks like a combined Opposition.</p><p>\n<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/current-affairs/after-a-failed-attempt-government-now-open-to-sell-100-shares-in-air-india-118061300427_1.html\" target=\"_blank\">Air India unplugged: Modi govt's final attempt and the story so far</a></strong> <br>Can the Modi government run the risk of the sale of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/air-india\" target=\"_blank\">Air India </a>becoming a political issue in the run-up to these elections?<br></p>\n<!-- INPAGE_BANNER -->\n <br>Remember that the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/atal-bihari-vajpayee\" target=\"_blank\">Atal Bihari Vajpayee </a>government faced a major flak from the Opposition political parties in the 2004 elections on the question of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/privatisation\" target=\"_blank\">privatisation.</a> It was accused of having sold the family silver, as the Vajpayee government sold several high-profile public-sector undertakings like the IPCL, VSNL, Hindustan Zinc and even Maruti Udyog. In the campaigning prior to the 2004 elections, the BJP did face many uncomfortable questions from Opposition parties and voters over its <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/privatisation\" target=\"_blank\">privatisation </a>policy.<p>\nIn contrast, the Modi government was initially ambivalent about <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/privatisation\" target=\"_blank\">privatisation.</a> It did include the provision of strategic sale of government equity in public-sector undertakings (another name for privatisation) in its annual Budgets. But its track record on such sales was poor, even though it substantially increased its proceeds from disinvestment of minority stakes in PSUs.</p><p>\nIn its Budget for 2016-17, the <strong>Modi government </strong>had announced its decision to privatise state-owned IDBI Bank. But more than two years later, the government is still exploring various ways to sell its majority stake in the beleaguered bank.</p><p>\nSimilarly, the announcement of privatising <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/air-india\" target=\"_blank\">Air India </a>was announced in the Budget for 2017-18. But more than a year later, the government is still struggling to zero in on the manner in which it can privatise the airline. Its earlier proposal to sell only 76 per cent of government equity found no takers. And now the government is exploring options to sweeten the terms by proposing either the sale of the entire 100 per cent government stake in the airline or by adding some real estate of the company as part of the deal.</p><p>\nThe political challenges have got more complicated after the chief of the Rashtriya Swayamsevak Sangh, Mohan Bhagwat, announced that allowing foreign airlines to run Air India was not a good idea. Bhagwat questioned the need for a foreign airline owning Air India.</p><p>\nNow, with three major state Assembly elections before January and the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=general+elections\" target=\"_blank\">general elections </a>in May, the Modi government might become more wary of the political fallout of privatising Air India. The announcement of the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/air-india-sale\" target=\"_blank\">Air India sale </a>was made in February 2017. If the deal had been closed before the end of 2017, its political fallout could still have been managed. But selling Air India now can be politically risky. Expect, therefore, Air India to operate on the skies and bleed the exchequer for at least a couple of years more.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     <p>\n\t\t\t\t\t\t\t\t<em>Disclaimer: Views expressed are personal. They do not reflect the view/s of Business Standard.</em></p>\n\t\t\t\t\t\t</span>"
    },
    "adjectives": [
        "crucial",
        "closed",
        "given",
        "political",
        "coming",
        "three",
        "Even",
        "least",
        "made",
        "next",
        "six"
    ],
    "verbs": [
        "state",
        "risk",
        "deal",
        "Even",
        "Can",
        "run",
        "Air"
    ],
    "nouns": [
        "India",
        "state",
        "risk",
        "turning",
        "deal",
        "polls",
        "given",
        "coming",
        "three",
        "Even",
        "sale",
        "terms",
        "least",
        "run",
        "Air",
        "six",
        "Can"
    ]
}