{
    "title": "Retail lending up 25%, number of accounts 32% in FY18: Cibil data",
    "link": "https://www.business-standard.com/article/finance/retail-lending-up-25-number-of-accounts-32-in-fy18-cibil-data-118062700621_1.html",
    "pubDate": "Wed, 27 Jun 2018 17:01:00 +0530",
    "content": "The report found robust growth in all consumption lending products consumer durable loans, credit cards and personal loans - during the period under review",
    "contentSnippet": "The report found robust growth in all consumption lending products consumer durable loans, credit cards and personal loans - during the period under review",
    "guid": "https://www.business-standard.com/article/finance/retail-lending-up-25-number-of-accounts-32-in-fy18-cibil-data-118062700621_1.html",
    "isoDate": "2018-06-27T11:31:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "retail",
            "lending",
            "up",
            "25",
            "number",
            "of",
            "accounts",
            "32",
            "in",
            "fy18",
            "cibil",
            "data"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Retail lending up 25%, number of accounts 32% in FY18: Cibil data",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/retail-lending\" target=\"_blank\">Retail lending </a>saw rapid growth in FY18, with the loan book rising by 25 per cent and the number of outstanding accounts by over 32 per cent, along with an increase in asset quality, due to high demand for consumer durable and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/personal-loans\" target=\"_blank\">personal loans </a>and credit cards, said a report.</p>\n<p>\n\tSignificantly, the delinquency rates 90 or more days past due (DPD) for major <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=retail+lending+products\" target=\"_blank\"></a><a class=\"storyTags\" href=\"https://www.business-standard.com/topic/retail-lending\" target=\"_blank\">retail lending </a>products declined or remained relatively stable during FY18, credit information firm TransUnion <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/cibil\" target=\"_blank\">Cibil </a>said in its report.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\t\"The <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/retail-lending\" target=\"_blank\">retail lending </a>market in the country grew significantly over the year ended March 2018, with balances increasing by 25 per cent from Q1 2017 to Q1 2018 and the number of outstanding accounts increasing by more than 32 per cent over the same period,\" <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/cibil\" target=\"_blank\">Cibil </a>said.</p>\n<p>\n\tThe report found robust growth in all consumption lending products consumer durable loans, credit cards and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/personal-loans\" target=\"_blank\">personal loans </a>- during the period under review.</p>\n<p>\n\tThe number of active consumer durable loans increased by 83 per cent over the past year to reach 19.5 million at the end of March this year, led by a 69 per cent increase in the live borrower count to 13.9 million.</p>\n<p>\n\t\"Much of the growth in this product has been driven by issuing higher volumes of smaller ticket loans,\" the report said.</p>\n<p>\n\tConsequently, the average balance per consumer fell by 5.7 per cent to Rs 10,382.</p>\n<p>\n\tIn terms of credit cards, the number of live accounts rose over 28 per cent to 32.6 million, while outstanding balances increased by 43 per cent to Rs 75,100 crore.</p>\n<p>\n\t\"Over the past two years, and particularly following the demonetisation event in November 2016, the number of credit card accounts has increased nearly 50 per cent, while the number of consumers with a card account has expanded as well,\" the report said.</p>\n<p>\n\tConsumer usage of credit cards has also increased, with the average credit card balance per borrower rising 12 per cent to Rs 35,495.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/cibil\" target=\"_blank\">Cibil </a>anticipated that the trend of increasing adoption of digital transaction channels should continue to act as a tailwind for future card growth.</p>\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/personal-loans\" target=\"_blank\">Personal loans </a>saw similar growth dynamics, with the number of live consumers increasing by 25 per cent to 12.1 million, while aggregate balances rising by 49 per cent to Rs 2.72 trillion.</p>\n<p>\n\tThe report found that despite the significant growth in retail lending in recent years, consumers continue to do a good job of managing their debts, with the delinquency rates for consumption lending products remaining at low level.</p>\n<p>\n\tThe 90+ DPD balance delinquency rate for consumer durable loans declined by 43 basis points year-over-year to reach 0.89 per cent by March-end.</p>\n<p>\n\tThe delinquency rate for personal loans dropped 19 basis points over the year to 0.52 per cent.</p>\n<p>\n\tThe credit card 90+ DPD balance delinquency rate increased modestly by nine basis points to 1.70 per cent in Q1 2018, but remained essentially unchanged from the level two years prior in Q1 2016.</p>\n<p>\n\t\"These positive performance trends indicate that significant growth potential remains for the retail lending market,\" said Yogendra Singh, vice-president (research and consulting), Cibil.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "personal",
        "durable",
        "25",
        "32",
        "found",
        "robust"
    ],
    "verbs": [
        "report",
        "credit",
        "Retail",
        "number",
        "found",
        "review"
    ]
}