{
    "creator": "PTI",
    "title": "Retaliatory tariffs on US exports without justification under international rules, says the Trump administration",
    "link": "https://www.financialexpress.com/economy/retaliatory-tariffs-on-us-exports-without-justification-under-international-rules-says-the-trump-administration/1221775/",
    "pubDate": "Wed, 27 Jun 2018 08:32:29 +05:30",
    "dc:creator": "PTI",
    "content": "The retaliatory tariffs imposed by the European Union, China, India, Turkey, and other countries on US exports are \"completely without justification\" under international norms, the Trump administration said today. ",
    "contentSnippet": "The retaliatory tariffs imposed by the European Union, China, India, Turkey, and other countries on US exports are \"completely without justification\" under international norms, the Trump administration said today.",
    "guid": "https://www.financialexpress.com/?p=1221775",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-27T03:02:29.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "retaliatory",
            "tariffs",
            "on",
            "us",
            "exports",
            "without",
            "justification",
            "under",
            "international",
            "rules",
            "says",
            "the",
            "trump",
            "administration"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Retaliatory tariffs on US exports without justification under international rules, says the Trump administration",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1221778\" src=\"https://images.financialexpress.com/2018/06/exports-2.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/exports-2.jpg 660w, https://images.financialexpress.com/2018/06/exports-2-300x200.jpg 300w, https://images.financialexpress.com/2018/06/exports-2-620x413.jpg 620w, https://images.financialexpress.com/2018/06/exports-2-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Retaliatory tariffs on US exports without justification under international rules, says US (Representative Image: Reuters</figure>\n\t\t\t</section></div><span>\n</span><p>The retaliatory tariffs imposed by the European Union, China, India, Turkey, and other countries on US exports are “completely without justification” under international norms, the Trump administration said today. The US has adopted a confrontational path with some of its major trading partners including India as it threatens to take all necessary steps to protect US interests.</p><span>\n</span><p>After US President Donald Trump announced 25 and 15 per cent import tariffs respectively on steel and aluminium, retaliatory duties on US imports have been imposed by China (April 2), Mexico (June 5), Turkey (June 21), and the European Union (June 22). Canada has indicated that it may impose retaliatory duties on US imports. India, Japan, and Russia have notified the WTO of their proposed suspension of commitments under the Agreement on Safeguards.</p><span>\n</span><p>“President Trump has taken actions on trade in steel and aluminium to protect our national security interests. These actions are wholly legitimate and fully justified, both as a matter of US law and WTO rules,” US Trade Representative Robert Lighthizer said. “By contrast, the EU has concocted a groundless legal theory to justify immediate tariffs on US exports. Other WTO Members, including China, have adopted a similar approach,” Lighthizer said after the EU, China and India announced new tariffs against the US.</p><span>\n</span><p>“These retaliatory tariffs underscore the complete hypocrisy that governs so much of the global trading system. For months, the EU, China, and others have criticised the trade policy of the US, while claiming to champion the WTO. But their recent tariffs prove that they simply ignore WTO rules whenever doing so is convenient,” Lighthizer said. He cited Article XXI of the General Agreement on Tariffs and Trade, which, he said, gives broad authority to WTO Members to take action necessary to protect essential security interests.</p><span>\n</span><p>For decades, the US has consistently held the position that actions taken pursuant to Article XXI are not justiciable by any panel of the WTO, he noted. “In other words, each sovereign country must have the power to decide, for itself, what actions are essential to its security. Any other reading of the Article would represent an unacceptable constraint on the freedom and independence of all WTO Members,” he asserted.</p><span>\n</span><p>Lighthizer said Trump’s actions regarding steel and aluminium plainly fall within the legitimate scope of Article XXI. The USTR sought to justify the measures taken by America, saying they were implemented only after “long and careful” analysis.</p><span>\n</span><p>While the US has acted responsibly here, the European Union and its followers have not, Lighthizer alleged. Rather than working with the US, they have retaliated with tariffs designed to punish US companies and workers, he charged. “In an effort to give cover to this blatant disregard for WTO rules, they claim to be acting in reliance on a narrow exception that applies only in response to a safeguard measure. That exception does not apply here, however, because the US has not taken a safeguard measure,” Lighthizer said. He said when the EU and others “falsely” assert the US steel and aluminium duties are safeguard measures, and impose retaliatory duties under this pretence, they do “great damage” to the multilateral trading system.</p><span>\n</span><p>“Indeed, they show that they are willing to distort WTO rules to mean whatever they want, whenever they want. Faced with these unjustified tariffs, the US will take all necessary actions under both US law and international rules to protect its interests,” Lighthizer said. The tariffs became effective for some WTO members on March 23, and they became effective for others on June 1. Excess capacity, driven by China’s non-market economic policies, has made it impossible for US producers to make a decent return and the investments necessary to ensure their long-term viability, the USTR said in a statement.</p><span>\n</span><p>Since 1947, the US Government has held the consistent view that any country can invoke Article XXI of the GATT (General Agreement on Tariffs and Trade) to take the action it considers necessary to protect its essential security interests, it noted. The US duties, it said, were imposed by the President pursuant to Section 232 of the Trade Expansion Act of 1962, entitled “Safeguarding National Security”.</p><span>\n</span><p>“This is a national security action, plain and simple,” the USTR said, asserting that the US is not invoking Article XIX of the GATT, permitting emergency safeguard actions, to justify its duties. So any assertion that others’ retaliatory duties are a justified response to a US “safeguard action” is, on its face, “ridiculous,” he said.</p><span>\n</span><p>China, Russia, the EU, India, and Turkey requested consultations with the US under the WTO Agreement on safeguards. In response, the US explained that the duties imposed on imports of steel and aluminium are not safeguards action under GATT Article XIX, but rather duties imposed for reasons of national security under GATT Article XXI, the USTR said.</p><span>\n</span><p>“Because the US has not invoked and does not seek to benefit from the right to take emergency safeguard action under Article XIX or the WTO Agreement on Safeguards, no WTO member has a right to retaliate with duties under an Agreement that does not even apply,” he said. “Accordingly, the duties that have been announced on US exports are completely without justification under international rules,” Lighthizer said.</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "imposed",
        "Retaliatory",
        "retaliatory",
        "international",
        "European",
        "Union"
    ],
    "nouns": [
        "India",
        "US",
        "justification",
        "international",
        "Trump",
        "administration",
        "European",
        "Union",
        "China",
        "Turkey",
        "today"
    ],
    "verbs": [
        "Trump"
    ]
}