{
    "title": "Industry wants govt to move fast on draft defence infrastructure policy",
    "link": "https://www.business-standard.com/article/economy-policy/industry-wants-govt-to-move-fast-on-draft-defence-infrastructure-policy-118061300015_1.html",
    "pubDate": "Wed, 13 Jun 2018 07:00:00 +0530",
    "content": "The ministry, which promulgated the draft policy last month, had sought feedback by June 8",
    "contentSnippet": "The ministry, which promulgated the draft policy last month, had sought feedback by June 8",
    "guid": "https://www.business-standard.com/article/economy-policy/industry-wants-govt-to-move-fast-on-draft-defence-infrastructure-policy-118061300015_1.html",
    "isoDate": "2018-06-13T01:30:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "industry",
            "wants",
            "govt",
            "to",
            "move",
            "fast",
            "on",
            "draft",
            "defence",
            "infrastructure",
            "policy"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Industry wants govt to move fast on draft defence infrastructure policy",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p> Aerospace and defence manufacturers in the country have responded to the Union government’s draft policy on establishing <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=defence+testing+infrastructure\" target=\"_blank\">defence testing infrastructure </a>(DTI).</p> <p> The ministry, which promulgated the draft policy last month, had sought feedback by June 8.\n\n\n</p>\n<!-- INPAGE_BANNER --> <p> The new policy draft notes that <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=defence+testing+infrastructure\" target=\"_blank\">defence testing infrastructure </a>is often capital intensive, requiring continuous upgradation and it is not economically viable for individual defence industrial units to set up in-house testing facilities.</p> <p> It proposes DTI as a government-funded platform, especially in two “defence industrial corridors” already planned in Tamil Nadu and Uttar Pradesh.</p> <p> The scheme envisages six-to-eight DTI clusters to be set up with a grant of Rs 4 billion. The defence ministry will fund 75 per cent of the project cost of each DTI unit.</p> <p> The private sector has welcomed the DTI scheme, given that even large defence firms can’t afford to set up testing infrastructure needed for validating their products. <span></span> <span></span> </p><p> <strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/current-affairs/meghalaya-police-dg-quits-over-appointment-of-bjp-linked-security-advisor-118061100533_1.html\" target=\"_blank\">Meghalaya police DG quits over appointment of BJP-linked 'security advisor'</a></strong></p> <p> DTI includes properly instrumented firing ranges for missiles, artillery and small arms and facilities to test “ruggedisation” of military equipment.</p> <p> It also includes laboratories for testing electro-magnetic interference/compatibility (EMI/EMC) of radar and telecommunications equipment, and facilities for testing unmanned aerial vehicles (UAVs) along with forming specialised test-driving tracks.</p> <p> Tata Power (strategic engineering division) spent over Rs 1.5 billion to create its own EMI/EMC laboratory to validate its telecommunications equipment. But many other firms can’t afford this, given the lack of assured orders from the services.</p> <p> The defence ministry has proposed implementing the DTI scheme either directly or through a special purpose vehicle (SPV) that will operate and maintain testing infrastructure and collect user charges from the industry.</p> <p> The draft policy proposes that at least seven firms, which are potential users of the proposed DTI, must be part of each SPV.</p> <p> “The industry units benefiting from the SPV should hold at least 51 per cent equity and no single unit can hold more than 25 per cent of the share capital of the SPV,” stated the draft policy.</p> <p> However, large private defence firms have proposed an alternative to the SPV route. They said that, with at least seven industries participating, and the participation restricted to 25 per cent, there would be too many decision-makers, resulting in poor execution.<span></span> <span></span> </p><p> <strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/weaponry-development-subsidy-scrapped-indian-firms-won-t-make-anymore-118060501411_1.html\" target=\"_blank\">Weaponry development subsidy scrapped: Indian firms won't 'Make' anymore</a></strong></p> <p> “It would be better if major industries, whether public or private, located in the proximity of the DTI, act as ‘anchor units’, responsible for operations and maintenance. These ‘anchor units’, with tier-ised eco-systems built around them, can allow other firms, including micro, small and medium enterprises (MSMEs) to use the DTI,”, said Jayant Patil, head of L&amp;T’s defence and heavy engineering verticals.</p> <p> “Funding for the DTI can be from the central/state government to the extent of 75 per cent, as the draft policy states. </p><p>With capital costs funding, industry can avail the facility for a nominal fee,” said Patil.</p> <p> L&amp;T proposes that the “user charges” collected by the anchor units be displayed on a government website. The anchor unit would submit a quarterly statement to the government on the testing carried out and the recoveries made.</p> <p> However, MSMEs like Alpha Design Technologies said that the government-funded DTI should be created “primarily for use by MSMEs and start-ups.”</p> <p> “Only nominal charges should be levied for use of the testing infrastructure,” said Colonel (Retd) H S Shankar, who heads Alpha.</p> <p> The private sector, in its feedback to the defence ministry, pointed out that tens of EMI/EMC laboratories are needed in India, given the proliferation of electro-magnetic emitters in defence equipment. One company said that German communications giant Rhode &amp; Schwarz has cheaply built dozens of such facilities for China’s defence industry, under pressure from Beijing.</p> <p> Rahul Chaudhry, chairman of Defence Innovators and Industry Association, pointed out that creating DTI is not enough. The defence ministry would simultaneously also have to set up standards and compliance infrastructure essential for using it optimally.</p> <p> Puneet Kaura, who heads Samtel Defence Systems, called the DTI scheme a “good step”, but added, “The defence ministry needs to speed up implementation so that industry can reap its benefits quickly.”<span></span> <span></span> <img align=\"left\" alt=\"Some of the facilities at the defence testing infrastructure includes properly instrumented firing ranges for missiles, artillery and small arms\" class=\"imgCont\" height=\"465\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/13/full/1528830545-122.jpg\" title=\"Some of the facilities at the defence testing infrastructure includes properly instrumented firing ranges for missiles, artillery and small arms\" width=\"620\"> Separately, the MoD intends to promote the creation of DTI through an amendment to its offsets policy, a draft of which was released for public comments in May. The draft amendment proposes permitting vendors to claim offset credits for setting up new DTI for Indian defence industry.</p> <p> Multipliers between two-to-three have been proposed for DTI, with higher multipliers allocated to test infrastructure in the recently-announced defence industry corridors in Tamil Nadu or Uttar Pradesh. A multiplier of three means an investment of $100 million would gain offset credits of $300 million.</p> <p> Some of the facilities at the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=defence+testing+infrastructure\" target=\"_blank\">defence testing infrastructure </a>includes properly instrumented firing ranges for missiles, artillery and small arms</p> <span></span>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "promulgated",
        "last",
        "fast",
        "sought"
    ],
    "nouns": [
        "ministry",
        "Industry",
        "infrastructure",
        "month",
        "draft",
        "June",
        "policy",
        "feedback",
        "last",
        "move",
        "fast",
        "defence"
    ],
    "verbs": [
        "draft",
        "last",
        "move",
        "fast"
    ]
}