{
    "creator": "PTI",
    "title": "Bank of Maharashtra’s MD and CEO Ravindra Marathe gets bail in DSKDL cheating case",
    "link": "https://www.financialexpress.com/industry/banking-finance/bank-of-maharashtras-md-and-ceo-ravindra-marathe-gets-bail-in-dskdl-cheating-case/1222770/",
    "pubDate": "Wed, 27 Jun 2018 20:50:15 +05:30",
    "dc:creator": "PTI",
    "content": "A special Pune court today granted bail to Bank of Maharashtra's Managing Director and CEO Ravindra Marathe in a cheating case involving city-based real estate developer D S Kulkarni and his wife, among others. ",
    "contentSnippet": "A special Pune court today granted bail to Bank of Maharashtra's Managing Director and CEO Ravindra Marathe in a cheating case involving city-based real estate developer D S Kulkarni and his wife, among others.",
    "guid": "https://www.financialexpress.com/?p=1222770",
    "categories": [
        "Banking & Finance",
        "Industry"
    ],
    "isoDate": "2018-06-27T15:20:15.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.21428571428571427,
        "tokens": [
            "bank",
            "of",
            "maharashtra’s",
            "md",
            "and",
            "ceo",
            "ravindra",
            "marathe",
            "gets",
            "bail",
            "in",
            "dskdl",
            "cheating",
            "case"
        ],
        "words": [
            "cheating"
        ],
        "positive": [],
        "negative": [
            "cheating"
        ]
    },
    "article": {
        "title": "Bank of Maharashtra’s MD and CEO Ravindra Marathe gets bail in DSKDL cheating case",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img src=\"https://images.financialexpress.com/2018/06/bom-3.jpg\" alt=\"BoM, BoM MD, Marathe, DSK, fraud, Bank of Maharashtra, BoM CEO\" class=\"size-full wp-image-1222775\" srcset=\"https://images.financialexpress.com/2018/06/bom-3.jpg 660w, https://images.financialexpress.com/2018/06/bom-3-300x200.jpg 300w, https://images.financialexpress.com/2018/06/bom-3-620x413.jpg 620w, https://images.financialexpress.com/2018/06/bom-3-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> While granting the relief, the barred him from leaving the country without its permission and ordered him to cooperate with police, he said, adding it also warned Marathe against trying to tamper with the evidence or influence witnesses.</figure>\n\t\t\t</section></div><span>\n</span><p>A special Pune court today granted bail to Bank of Maharashtra’s Managing Director and CEO Ravindra Marathe in a cheating case involving city-based real estate developer D S Kulkarni and his wife, among others. Judge S N Sardesai of the special court set up under the Maharashtra Protection Of Interest Of Depositors (MPID) Act granted the relief to Marathe on a surety bond of Rs 50,000. While granting bail to Marathe, the court remanded other persons arrested in the case in judicial custody for 14 days.</p><span>\n</span><p>The other accused arrested in the case included the bank’s Executive Director Rajendra Gupta, Zonal Manager Nityanand Deshpande, former CMD Sushil Muhnot, besides D S Kulkarni Developers Ltd’s (DSKDL’s) chartered accountant Sunil Ghatpande and DSKDL’s engineering section’s vice president Rajeev Newaskar. “Marathe has been granted bail on surety bond of Rs 50,000,” said defence counsel for Harshad Nimbalkar and other bank officials.</p><span>\n</span><p>While granting the relief, the barred him from leaving the country without its permission and ordered him to cooperate with police, he said, adding it also warned Marathe against trying to tamper with the evidence or influence witnesses. Nimbalkar said the argument on the bail applications of the remaining five accused will be heard tomorrow. The Economic Offences Wing of Pune Police had last week arrested Marathe and other top officials of the bank on charges of misusing their official positions for sanctioning and disbursing loan to D S Kulkarni’s firm DSKDL.</p><span>\n</span><p>Marathe, through his lawyer, had contended in his bail plea that his arrest was illegal because the police had failed to take prior permission of the <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/rbi/\">RBI</a> for his arrest and prosecution, which, he said was necessary as he “holds the rank of a secretary” by virtue of his position as MD and CEO. The court granted bail after the prosecution said that further custodial interrogation of Marathe was not required as the necessary documents have already been seized.</p><span>\n</span><p>According to the police, the bank officials had colluded with DSKDL by misusing their powers and authority with a “dishonest and fraudulent intention” to sanction and disburse the amount under the garb of a loan. In May, the city police had filed a 37,000-page chargesheet against DSK and his wife in the case.</p><span>\n</span><p>As per the chargesheet, the total “scam” is worth Rs 2,043.18 crore, wherein the accused floated nine different firms to siphon off funds collected from 33,000 investors and fixed-deposit (FD) holders, who were promised good returns on their FDs.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "cheating",
        "special",
        "granted",
        "based",
        "real",
        "D"
    ],
    "nouns": [
        "Bank",
        "Maharashtra",
        "MD",
        "CEO",
        "bail",
        "cheating",
        "case",
        "A",
        "special",
        "court",
        "today",
        "Director",
        "city",
        "real",
        "estate",
        "developer",
        "S",
        "wife",
        "D"
    ],
    "verbs": [
        "Bank",
        "bail",
        "case",
        "court"
    ]
}