{
    "creator": "PTI",
    "title": "India needs to lower trade barriers: US diplomat",
    "link": "https://www.financialexpress.com/economy/india-needs-to-lower-trade-barriers-us-diplomat/1222298/",
    "pubDate": "Wed, 27 Jun 2018 15:16:29 +05:30",
    "dc:creator": "PTI",
    "content": "US Consul General in Hyderabad Katherine Hadda has said there are high tariffs in India with over 13 per cent as compared to America's average tariff rate of 3.4 per cent.",
    "contentSnippet": "US Consul General in Hyderabad Katherine Hadda has said there are high tariffs in India with over 13 per cent as compared to America's average tariff rate of 3.4 per cent.",
    "guid": "https://www.financialexpress.com/?p=1222298",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-27T09:46:29.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "india",
            "needs",
            "to",
            "lower",
            "trade",
            "barriers",
            "us",
            "diplomat"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "India needs to lower trade barriers: US diplomat",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1222307\" src=\"https://images.financialexpress.com/2018/06/katherine-hadda.jpg\" alt=\"trade barriers, tariff, tariff cuts, tariff rates, us consul general, katherine hadda, indo&nbsp;us partnership, india us trade\" srcset=\"https://images.financialexpress.com/2018/06/katherine-hadda.jpg 660w, https://images.financialexpress.com/2018/06/katherine-hadda-300x200.jpg 300w, https://images.financialexpress.com/2018/06/katherine-hadda-620x413.jpg 620w, https://images.financialexpress.com/2018/06/katherine-hadda-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The United States has one of the lowest tariff rates in the world, says US Consul General Katherine Hadda. (Source: Twitter)</figure>\n\t\t\t</section></div><span>\n</span><p>Stressing the need for India to lower trade barriers and cut tariffs, US Consul General in Hyderabad Katherine Hadda has said there are high tariffs in India with over 13 per cent as compared to America’s average tariff rate of 3.4 per cent. “The United States has one of the lowest tariff rates in the world. We have applied tariff rates of 3.4 per cent and India’s is 13.4 per cent. Over one-half of tariff line items imported into our country are duty-free whereas less than 3 per cent of the goods coming into India qualify for duty-free status,” she said. “So, we wish for reciprocity with India just as we do with all trading partners… and as an economist I have to say that helps both economies,” Hadda said.</p><span>\n</span><p>Speaking at the 242nd American Independence Day celebrations organised by Indo-American Chamber of Commerce (Andhra Pradesh and Telangana Chapter) here last night, Hadda said, “we know we can count on the support of chambers such as this to help us.” “You have an important advocacy role to play in encouraging the government of India to lower its trade barriers as well as to continue to improve its protection and enforcement of Intellectual Property Rights (IPR),” she said.</p><span>\n</span><p>Over the past decade both India and the US have made substantial progress in improving partnership, she said adding “our (bilateral) trade ties in goods and services, reached more than USD 126 billion last year and that’s a three-fold increase since 12 years ago.” “The sheer size and diversity of our two economies demand that we do even more to realise the potential of our commercial partnership,” she said. “Another growing area of our cooperation is defence and our strategic defence partnership is stronger than ever,” she noted.</p><span>\n</span><p>The consul general further said, on July 6, the United States and India will hold its inaugural 2+2 dialogue in Washington, where the US Secretaries of State and Defence and the Indian External Affairs and Defence Ministers will meet to discuss how both the countries can continue to strengthen “our strategic and security ties.” “Businesses need a strong enabling framework to thrive and I think you have that environment here in Hyderabad and Telangana,” she said. “I think, our two countries are changing each other in small but important ways and just like any two countries we don’t agree on everything. But, where we don’t we are building up the mechanisms, the relationships and trusts necessary to solve difficult problems,” Hadda added.</p><span>\n</span><p>The Indian diaspora, and especially the Telugu-speaking community, have long played a major role in bringing our societies closer together, Hadda she said. Telugu is the third most widely spoken Indian language and the 20th most spoken language in the United States, she added. Telangana Chief Secretary S K Joshi was among those who spoke.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "General",
        "high",
        "13",
        "average"
    ],
    "nouns": [
        "India",
        "Consul",
        "tariff",
        "trade",
        "America",
        "US",
        "lower",
        "diplomat",
        "General",
        "Hyderabad",
        "high",
        "13",
        "cent",
        "average",
        "rate"
    ],
    "verbs": [
        "tariff",
        "trade",
        "lower",
        "General",
        "average",
        "rate"
    ]
}