{
    "title": "Bypoll shocker: Yogi Adityanath hints at failure to 'market' good work",
    "link": "https://www.business-standard.com/article/economy-policy/bypoll-shocker-yogi-adityanath-hints-at-failure-to-market-good-work-118061300568_1.html",
    "pubDate": "Wed, 13 Jun 2018 15:30:00 +0530",
    "content": "UP to unleash digital media for publicising schemes",
    "contentSnippet": "UP to unleash digital media for publicising schemes",
    "guid": "https://www.business-standard.com/article/economy-policy/bypoll-shocker-yogi-adityanath-hints-at-failure-to-market-good-work-118061300568_1.html",
    "isoDate": "2018-06-13T10:00:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.09090909090909091,
        "tokens": [
            "bypoll",
            "shocker",
            "yogi",
            "adityanath",
            "hints",
            "at",
            "failure",
            "to",
            "'market'",
            "good",
            "work"
        ],
        "words": [
            "good",
            "failure"
        ],
        "positive": [
            "good"
        ],
        "negative": [
            "failure"
        ]
    },
    "article": {
        "title": "Bypoll shocker: Yogi Adityanath hints at failure to 'market' good work",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tClose on the heels of recent bypoll defeats at the hands of opposition, Uttar Pradesh chief minister Yogi Adityanath has said that the government machinery had failed to publicise the various development works undertaken by his regime.</p>\n<p>\n\tWithout explicitly referring to the bypoll shocker, he conceded there was a gaping disconnect between the government schemes and the targetted beneficiaries and as such there was need to determine those factors for remedial actions.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tAdityanath was addressing a congregation of social media teams of various government departments here last night after inaugurating the state social media hub, which would facilitate two way communication between the government's online squads handling the official Twitter, Facebook etc profiles and public at large.</p>\n<p>\n\tAlthough, the CM said the social media teams were going good job, yet there was an urgent need for faster dissemination of information. The CM recalled several incidents, when he had personally discovered the sheer lack of information about the government schemes, especially in the rural areas and less privileged sections of society.</p>\n<p>\n\t\"During a function to provide 'pucca' dwelling units in a village, I asked a beneficiary as to who was facilitating them the houses and he said it must be the gram pradhan or the block level officers. I was surprised at the lack of awareness among people,” he lamented.</p>\n<p>\n\tThe CM advised the smart phone penetration should be harnessed by the social media teams to provide correct and timely information to people about schemes and development projects. “Social media is an important tool to reach out to people, although it is a double edged sword, since any misinformation can backfire. Therefore, the need is to cross check every information before it is put on the social platforms.’</p>\n<p>\n\tIn his sprightly and lengthy talk, Adityanath listed the various achievements of his government in different sectors, including agriculture, energy, housing, sanitation, highways etc, however, he reiterated that all these facts have to be told to the targetted sections.</p>\n<p>\n\tThe lack of information would only give a chance to the ‘unemployed opposition’ party leaders to launch misinformation campaign against the government, which he said the state could deal with an iron hand, yet his dispensation favoured giving absolute freedom of speech to everyone.</p>\n<p>\n\tOver last one year, the UP CM’s official Twitter and Facebook accounts had witnessed manifold increase in the number of followers, likes and updates.</p>\n<p>\n\tThe CM also called upon the departments to connect with the non government organisations (NGOs) and self help groups (SHGs) for community schemes for greater penetration and identification of beneficiaries.</p>\n<p>\n\tMeanwhile, former UP CM Akhilesh Yadav today took a potshot at Adityanath saying the government would spend liberally on gaining publicity on social media, while neglecting more important tasks of governance and providing succour to common man.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "nouns": [
        "market",
        "good",
        "work",
        "shocker",
        "failure",
        "Yogi"
    ],
    "verbs": [
        "market",
        "work",
        "UP",
        "unleash"
    ],
    "adjectives": [
        "good",
        "UP",
        "digital"
    ]
}