{
    "title": "RBI nominee on PSB boards may be withdrawn after banks are strengthened",
    "link": "https://www.business-standard.com/article/economy-policy/rbi-nominee-on-psb-boards-may-be-withdrawn-after-banks-are-strengthened-118061300262_1.html",
    "pubDate": "Wed, 13 Jun 2018 11:29:00 +0530",
    "content": "Urjit Patel had on Tuesday told the Parliamentary Standing Committee on Finance that no central bank nominee should be on the boards of public sector banks",
    "contentSnippet": "Urjit Patel had on Tuesday told the Parliamentary Standing Committee on Finance that no central bank nominee should be on the boards of public sector banks",
    "guid": "https://www.business-standard.com/article/economy-policy/rbi-nominee-on-psb-boards-may-be-withdrawn-after-banks-are-strengthened-118061300262_1.html",
    "isoDate": "2018-06-13T05:59:00.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.16666666666666666,
        "tokens": [
            "rbi",
            "nominee",
            "on",
            "psb",
            "boards",
            "may",
            "be",
            "withdrawn",
            "after",
            "banks",
            "are",
            "strengthened"
        ],
        "words": [
            "strengthened"
        ],
        "positive": [
            "strengthened"
        ],
        "negative": []
    },
    "article": {
        "title": "RBI nominee on PSB boards may be withdrawn after banks are strengthened",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tReserve Bank of India Governor Urjit Patel’s plea to withdraw its nominees on the board of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/banks\" target=\"_blank\">banks </a>was also advocated by his predecessor <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/raghuram-rajan\" target=\"_blank\">Raghuram Rajan.</a></p>\n<p>\n\tHowever, a committee under veteran banker P J Nayak, which had submitted a report in 2014 to review the governance of banks, was not in favour of the move, unless the boards were empowered.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tPatel had on Tuesday told the Parliamentary Standing Committee on Finance that no central bank nominee should be on the boards of public sector <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/banks\" target=\"_blank\">banks </a>(PSBs) to avoid \"any conflict of interest\" and the regulator is in discussions with the government.</p>\n<p>\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rbi\" target=\"_blank\">RBI </a>nominates a director to each bank, and where <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/banks\" target=\"_blank\">banks </a>are troubled or raise special concerns, the regulator can nominate more than one member on the board. The <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rbi\" target=\"_blank\">RBI </a>can nominate either a serving or a retired executive.</p>\n<p>\n\t\"The principle that <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rbi\" target=\"_blank\">RBI </a>as the regulator and supervisor of banks should not be on bank boards (and therefore not be party to bank management decisions) is unexceptional. RBI has written to the government seeking permission to withdraw its nominee from bank boards, except when there are special concerns,” the Nayak committee report had noted.</p>\n<p>\n\tThe panel was of the view that the public sector bank boards do not function cohesively at present and noted the “widespread view that RBI nominee directors carry weight with non-official directors and that their views act as a stabilising advocacy.”</p>\n<p>\n\tThe Nayak committee had recommended a three-phased reform in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/psbs\" target=\"_blank\">PSBs.</a> The first stage would be formation of a banks board bureau, which will be taken over by a holding company of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/psbs\" target=\"_blank\">PSBs </a>in the second phase and then it will be followed up by empowering and strengthening the boards in the third phase.</p>\n<p>\n\t“RBI directors should step down from bank boards during Phase 3 of the transition process unless a bank is troubled or raises special concerns,” the Nayak committee recommended.</p>\n<p>\n\tIn phase three of the PSB reforms, the panel had envisaged giving the powers of appointing independent directors and whole-time directors, including the chief executive officer, to the board of banks. At present, the government nominates such officials after consultations with the banks’ board bureau and the RBI.</p>\n<p>\n\t“While such a deferral to phase 3 compromises the principle that regulators should not be on bank boards till then, it seeks to pragmatically recognise their present beneficial impact in the context of imperfectly constituted boards,” the panel further said.</p>\n<p>\n\t“RBI nominee directors should be distanced from management committee of the board (which takes credit decisions), to avoid any conflict of interest and the RBI nominee should not be on the boards of the PSBs,\" Patel had told the Standing Committee on Finance on Tuesday.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "public",
        "Standing",
        "strengthened",
        "central",
        "withdrawn",
        "no",
        "Parliamentary"
    ],
    "nouns": [
        "banks",
        "bank",
        "public",
        "sector",
        "Standing",
        "RBI",
        "central",
        "Finance",
        "Committee",
        "Tuesday",
        "may",
        "no",
        "boards",
        "nominee"
    ],
    "verbs": [
        "bank",
        "Finance"
    ]
}