{
    "title": "New maternity law may cost 1.8 million Indian women their jobs: Report",
    "link": "https://www.business-standard.com/article/economy-policy/new-maternity-law-may-cost-1-8-million-indian-women-their-jobs-report-118062700323_1.html",
    "pubDate": "Wed, 27 Jun 2018 12:12:00 +0530",
    "content": "McKinsey estimates more than $700 billion could be added to the country's gross domestic product by 2025 if more women were in jobs",
    "contentSnippet": "McKinsey estimates more than $700 billion could be added to the country's gross domestic product by 2025 if more women were in jobs",
    "guid": "https://www.business-standard.com/article/economy-policy/new-maternity-law-may-cost-1-8-million-indian-women-their-jobs-report-118062700323_1.html",
    "isoDate": "2018-06-27T06:42:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "new",
            "maternity",
            "law",
            "may",
            "cost",
            "18",
            "million",
            "indian",
            "women",
            "their",
            "jobs",
            "report"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "New maternity law may cost 1.8 million Indian women their jobs: Report",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\t A new <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=law\" target=\"_blank\">law </a>to improve maternity benefits for women in India’s workforce and encourage them to further their careers is likely to have the opposite effect, a survey showed.</p>\n<p>\n\tThe law, which makes India the most progressive country after Canada and Norway in enabling women to stay on in the workforce, will probably lead to job losses and discourage smaller businesses and start-ups from hiring women, the survey by <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/teamlease-services\" target=\"_blank\">TeamLease Services </a>Ltd. said on Tuesday. An estimated 1.1 million to 1.8 million women will lose their jobs across 10 sectors in the financial year to March 2019 because of the law, the survey showed.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tIf this estimate is computed across all the sectors, the job loss number would be an estimated 10-12 million across all sectors, according to the survey by the staffing and human resources company.</p>\n<p>\n\tThat is bad <a class=\"storyTags\" href=\"https://www.business-standard.com/category/economy-policy-news-1020101.htm\" target=\"_blank\">news </a>for a country where the share of women in the workforce has shrunk to around 24 per cent in the fiscal year ended 2016 from 36 per cent a decade earlier. <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/mckinsey\" target=\"_blank\">McKinsey </a>and Co. estimates more than $700 billion could be added to the country’s gross domestic product by 2025 if more women were in jobs.<br></p>\n<p>\n\t\"India probably cannot be compared to most other countries simply because we have one of the lowest workforce participation rates in the world,\" said Rituparna Chakraborty, co-founder of TeamLease Services, adding financial incentives were needed to attract more women.</p>\n<p>\n\t\"One could take a leaf from the UK mechanism where women employees have the option of taking up to 52 weeks of maternity benefit. However the burden of paying the employee for 52 weeks doesn’t rest entirely on the employing organisation.\"</p>\n<p>\n\tThe survey was conducted among 300 employers across sectors like aviation, information technology and IT-enabled services, real estate, education, e-commerce, manufacturing, banking and financial services, as well as retail and tourism. It showed that while large and professionally managed companies will back the reform measure, which is fully funded by the employer, small and medium sized companies would resist hiring women as they find the costs prohibitive.</p>\n<p>\n\t<strong>Shrinking Workforce</strong></p>\n<p>\n\tIn socially conservative India, women are often discouraged from pursuing a career.</p>\n<p>\n\tBetter-educated women from wealthier families aren’t encouraged to work and it’s usually when a man’s salary falls short that a woman seeks a job. Many drop out to take care of older family members or children. In the eight years since 2004, about 20 million women -- the size of the combined populations of New York, London and Paris -- vanished from India’s workforce, the World Bank estimates.</p>\n<p>\n\tTo stem this, Prime Minister Narendra Modi’s government introduced the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=law\" target=\"_blank\">law </a>that entitles women working in the organized sector to 26 weeks paid maternity leave, up from 12 weeks.</p>\n<p>\n\t<strong>The costs riled many businesses</strong></p>\n<p>\n\tPost-maternity retention could cost 80 per cent to 90 per cent of the annual salary for white collar employees, and up to 135 per cent of annual salary for blue-collar employees, the survey said.</p>\n<p>\n\t“These kind of reforms are essentially supported by proactive governments across the world with complementing tax concessions, which are missing in India,” said K. Sudarshan, managing partner for India at executive search firm EMA Partners International. “Small and medium-sized companies generally operate with less staff. If two of five women employees opt for maternity leave, that can cripple the firm itself.”</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Indian",
        "gross",
        "billion",
        "New",
        "million",
        "domestic"
    ],
    "nouns": [
        "Indian",
        "product",
        "Report",
        "may",
        "maternity",
        "gross",
        "billion",
        "law",
        "cost",
        "million",
        "country",
        "domestic"
    ],
    "verbs": [
        "Report",
        "gross",
        "cost"
    ]
}