{
    "creator": "FE Bureau",
    "title": "Kharif sowing down by 74.16% in Gujarat",
    "link": "https://www.financialexpress.com/economy/kharif-sowing-down-by-74-16-in-gujarat/1212670/",
    "pubDate": "Wed, 20 Jun 2018 01:17:32 +05:30",
    "dc:creator": "FE Bureau",
    "content": "As per the latest data of the state agriculture department, kharif sowing has reached 2,25,231 hectare as on June 18, which is 74.16% down from 8,71,700 hectare in corresponding period of 2017. ",
    "contentSnippet": "As per the latest data of the state agriculture department, kharif sowing has reached 2,25,231 hectare as on June 18, which is 74.16% down from 8,71,700 hectare in corresponding period of 2017.",
    "guid": "https://www.financialexpress.com/?p=1212670",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-19T19:47:32.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "kharif",
            "sowing",
            "down",
            "by",
            "7416",
            "in",
            "gujarat"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Kharif sowing down by 74.16% in Gujarat",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1212674\" src=\"https://images.financialexpress.com/2018/06/kharif.jpg\" alt=\"\" srcset=\"https://images.financialexpress.com/2018/06/kharif.jpg 780w, https://images.financialexpress.com/2018/06/kharif-300x200.jpg 300w, https://images.financialexpress.com/2018/06/kharif-768x512.jpg 768w, https://images.financialexpress.com/2018/06/kharif-620x413.jpg 620w, https://images.financialexpress.com/2018/06/kharif-401x267.jpg 401w\" sizes=\"(max-width: 780px) 100vw, 780px\"> Kharif sowing down 74.16% in Gujarat (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>Gujarat has witnessed a huge fall in sowing in kharif season this year due to delay in monsoon and water scarcity. As per the latest data of the state agriculture department, kharif sowing has reached 2,25,231 hectare as on June 18, which is 74.16% down from 8,71,700 hectare in corresponding period of 2017. “Sowing of kharif crops is slow this year on account of delay in monsoon. Once rain comes, farmers will gear up the sowing. We are hoping for good progress in sowing area in July,” said an official of agriculture department of Gujarat.</p><span>\n</span><p>Data suggests that overall just 3% of the season’s total sowing has been done in the state thus far. Last three years’ average total sowing of Gujarat is 8.56 million hectare. Main kharif crops like groundnut and cotton witnessed fall in coverage area by 85% and 72%, respectively. As on date, groundnut has covered 37,788 hectare this year as against 2,49,100 hectare in corresponding period last year. Similarly, area under cotton crop has registered 1,39,740 hectare so far as against 4,96,400 hectare in the said period.</p><span>\n</span><p>According to agriculture experts, as the water availability is lesser this year, pre-monsoon sowing has not been done in many areas. Moreover, agriculture universities have also been advised for late sowing to protect cotton and groundnut from any disease.&nbsp;A R Pathak, vice chancellor of Junagadh Agriculture University (JAU) said, “We have observed that farmers have not begun pre-monsoon sowing because of water scarcity in many parts of Gujarat, mainly in Saurashtra region which usually start sowing cotton and groundnut in first week of June. On the other side, monsoon has been delayed by almost two weeks. These are the reasons for lower coverage of kharif crops this year.”</p><span>\n</span><p>JAU has advised cotton farmers to sow late as possibility of rain is negligible and early sowing may damage the cotton seed which may result into loss for farmers.&nbsp; Pathak said, “We have advised farmers to wait till one suitable showering for cotton sowing. At this stage, it may damage the cotton seed in farm.”</p><span>\n</span><p>As per the agriculture department’s data, areas of crops such as sesame, tur, mung, corn, jowar and bajara have drastically fallen. Mung has been sown on just 26 hectare as on June 18 this year which was 900 hectare in 2017 at the same time. Area under urad has reached 93 hectare as against 2,000 hectare and sowing of tur has been done on 3,641 hectare as against 7,500 hectare in the corresponding period. As against 1,900 hectare, sowing of sesame has reached 10 hectare only this year. Shockingly, sowing of math has not begun this year. Last year it was 100 hectare. Bajara has covered 93 hectares so far which was last year stood at 1,800 hectares.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "down",
        "74",
        "16",
        "latest",
        "25",
        "18",
        "71",
        "corresponding"
    ],
    "nouns": [
        "16",
        "As",
        "period",
        "latest",
        "data",
        "state",
        "agriculture",
        "department",
        "25",
        "hectare",
        "June",
        "18",
        "down",
        "Gujarat"
    ],
    "verbs": [
        "state",
        "down"
    ]
}