{
    "title": "India, US agree to hold comprehensive talks over trade, economic issues",
    "link": "https://www.business-standard.com/article/economy-policy/india-us-agree-to-hold-comprehensive-talks-over-trade-economic-issues-118061300248_1.html",
    "pubDate": "Wed, 13 Jun 2018 12:06:00 +0530",
    "content": "India will send an official team to work out the details and initiate a comprehensive negotiation on all issues",
    "contentSnippet": "India will send an official team to work out the details and initiate a comprehensive negotiation on all issues",
    "guid": "https://www.business-standard.com/article/economy-policy/india-us-agree-to-hold-comprehensive-talks-over-trade-economic-issues-118061300248_1.html",
    "isoDate": "2018-06-13T06:36:00.000Z",
    "sentiment": {
        "score": 3,
        "comparative": 0.2727272727272727,
        "tokens": [
            "india",
            "us",
            "agree",
            "to",
            "hold",
            "comprehensive",
            "talks",
            "over",
            "trade",
            "economic",
            "issues"
        ],
        "words": [
            "comprehensive",
            "agree"
        ],
        "positive": [
            "comprehensive",
            "agree"
        ],
        "negative": []
    },
    "article": {
        "title": "India, US agree to hold comprehensive talks over trade, economic issues",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tIndia and the US have agreed to hold official-level comprehensive talks to address trade and economic issues, days after President Donald Trump accused New Delhi of charging 100 per cent tariff on some of the US' goods.</p>\n<p>\n\tThe decision in this regard was taken during a series of meetings visiting Commerce and Industry Minister <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/suresh-prabhu\" target=\"_blank\">Suresh Prabhu </a>had with US Commerce Secretary <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=wilbur+ross\" target=\"_blank\">Wilbur Ross </a>and US Trade Representative <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/robert-lighthizer\" target=\"_blank\">Robert Lighthizer.</a></p>\n<p>\n\t\"We will now work together to expand (bilateral) trade, Prabhu told a group of Indian reporters here yesterday at the conclusion of his two-day trip to the US.</p>\n\n<p>\n\tIndia will send an official team to work out the details and initiate a comprehensive negotiation on all issues concerning trade and economic relationship between the two countries. \"The team will come within the next few days,\" Prabhu said.</p>\n<p>\n\tAcknowledging that both sides have trade and tariff issues with each other, the minister said officials would hold talks on all of them.</p>\n\n<p>\n\tPresident Trump, in a press conference in Canada's Quebec City where he attended the G7 summit, took a swipe at India along with the world's other top economies and accused New Delhi of charging 100 per cent tariff on some of the US' goods, as he threatened to cut trade ties with countries who are robbing America.<br><strong class=\"read_more\">ALSO READ:&nbsp;<a href=\"https://www.business-standard.com/article/economy-policy/india-to-bring-together-8-10-wto-countries-to-work-on-future-trade-agenda-118061000131_1.html\" target=\"_blank\">India to bring together 8-10 WTO countries to work on future trade agenda</a></strong></p>\n<p>\n\tIndian Ambassador to the US Navtej Singh Sarna said New Delhi has written to the US on <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=steel+and+aluminium+tariff\" target=\"_blank\">steel and aluminium tariff.</a></p>\n<p>\n\tA full-fledged case has been made by India for waiver of steel and aluminum tariffs, he added. \"It has been a very positive engagement.\"<br></p>\n<!-- INPAGE_BANNER -->\n\t<br>In addition to Ross and Lighthizer, Prabhu held talks with Agriculture Secretary Sonny Perdue. He also met two powerful Senators John Cornyn and Mark Warner - the two co-chairs of the Senate India caucus.\n<p>\n\t\"The meetings were held in a friendly and cordial atmosphere, with appreciation for each other's points of view. Discussions centered around bilateral trade and commercial relations between the two countries and focused on finding the way forward to address concerns of both sides,\" the Indian Embassy said in a readout of the meetings.</p>\n<p>\n\t\"In this context, it was agreed that Indian and US officials would meet at a senior level at an early date to discuss various issues of interest to both sides and carry forward the discussions in a positive, constructive and result oriented manner,\" it said.</p>\n<p>\n\tDuring his two-day visit to Washington DC, Prabhu addressed business and industry leaders in meetings organised by US-India Business Council (USIBC) and US-India Strategic Partnership Forum (USISPF) and held meetings with other stakeholders.</p>\n<p>\n\t\"It's a great time to join hands with each other. And that's the realisation within the (Trump) administration as well. Therefore, we have really decided to move on. As you know, we always hear the trade disputes between US and India, but when I had meeting with the USTR, with the Commerce Secretary, with Agriculture Secretary, with Senators, it is very clear that we must move on, keep the issues behind, Prabhu told industry leaders at a reception hosted by USIBC in association with the FICCI and Manhattan Chamber of Commerce.</p>\n<p>\n\tIn his interaction with industry leaders at an event organised by the USISPF, Prabhu spoke about the improvements that have been made in the trade relationship, including trade deficit reduction.</p>\n<p>\n\tEvery great partnership has areas of agreement and disagreement. I'm hopeful that the US investment corridor is only going to grow, and I'm confident that we will be able to bridge our gaps, Prabhu noted.</p>\n<p>\n\tThe industry interaction included senior officials from leading US companies such as: Boston Scientific, FedEx, Walmart, Abbott, UTC, Honeywell, PhRMA, MoneyGram International, Lockheed Martin, Koch Industries, Amway, Uber, 21st Century Fox, and Medtronic.</p>\n<p>\n\tNoting that India and the US have an important strategic relationship and shared goals, USIBC president Nisha Desai Biswal said the council is a constructive partner in achieving the full potential of the US-India commercial opportunity.</p>\n<p>\n\tThe USIBC roundtable organised in association with the CII comprised of US and Indian industry giants from the energy, aerospace, ICT, life sciences and defence sectors who reiterated India's position as a critical market while also raising issues facing their companies such as data localization and price controls, as well as public procurement and operational hurdles.</p>\n<p>\n\tIn engaging with critical stakeholders, Prabhu highlighted the ongoing policy reforms being pursued by India to improve its business climate and remove bureaucratic hurdles.</p>\n<p>\n\tPrabhu noted that India will soon release its new Industrial Policy, aimed at transforming India into a modern, flourishing, economic powerhouse.</p>\n<p>\n\tDuring the interaction, he emphasized the importance of a dispute redressal mechanism, and resolving such issues together in a way that does not derail but rather strengthens bilateral ties.</p>\n<p>\n\tUnder Trump, trade dispute between India and the US has increased, with his administration asking New Delhi to lower its trade barriers and open up its market.</p>\n<p>\n\tTrump has repeatedly raked up the issue of India imposing high import duty on the iconic Harley-Davidson motorcycles and threatened to increase the import tariff on \"thousands and thousands\" of Indian motorcycles to the US.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "comprehensive",
        "official",
        "economic"
    ],
    "nouns": [
        "US",
        "will",
        "trade",
        "work",
        "comprehensive",
        "India",
        "details",
        "official",
        "negotiation",
        "hold",
        "talks",
        "team",
        "initiate"
    ],
    "verbs": [
        "will",
        "trade",
        "work",
        "send",
        "agree",
        "hold",
        "team",
        "initiate"
    ]
}