{
    "title": "This Chinese reform is going to light up many homes in India; find out how",
    "link": "https://www.business-standard.com/article/economy-policy/this-chinese-reform-is-going-to-light-up-many-homes-in-india-find-out-how-118060600156_1.html",
    "pubDate": "Wed, 06 Jun 2018 09:04:00 +0530",
    "content": "ndia's maximum annual solar-cell manufacturing capacity is about 3 gigawatts while average yearly demand is 20 gigawatts",
    "contentSnippet": "ndia's maximum annual solar-cell manufacturing capacity is about 3 gigawatts while average yearly demand is 20 gigawatts",
    "guid": "https://www.business-standard.com/article/economy-policy/this-chinese-reform-is-going-to-light-up-many-homes-in-india-find-out-how-118060600156_1.html",
    "isoDate": "2018-06-06T03:34:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "this",
            "chinese",
            "reform",
            "is",
            "going",
            "to",
            "light",
            "up",
            "many",
            "homes",
            "in",
            "india",
            "find",
            "out",
            "how"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "This Chinese reform is going to light up many homes in India; find out how",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tIndia may be the biggest beneficiary of solar <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=industry+reforms+in+china\" target=\"_blank\">industry reforms in China </a>that are poised to reduce prices for photovoltaic panels.</p>\n<p>\n\tChina announced last week it was halting approvals of some new solar projects this year and cutting subsidies to developers to ease its pace of expansion. That’s expected to slow demand in the world’s biggest market, weakening prices, and force the country’s manufacturers to ship more panels overseas.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tTariffs in India’s next solar auction scheduled for mid-June may fall below the Rs 2.44 per kilowatt hour record set May 17 last year, said Sanjay Sharma, general manager at Solar Energy Corp. of India, the agency responsible for implementing India’s renewable targets.</p>\n<p>\n\t“India will be a big beneficiary of a fall in module prices,” said Vinay Rustagi, managing director at solar research firm Bridge to India. “If China’s demand weakens as expected, module prices should come down dramatically in the second half of the year and into the next.”</p>\n<p>\n\tIndia is seeking to boost its clean energy generation as Prime Minister <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=narendra+modi\" target=\"_blank\">Narendra Modi </a>has pledged to double India’s renewable power capacity to 175 gigawatts by 2022, a target second only to China, as part of his plan to spearhead global efforts to combat climate change.</p>\n<p>\n\tIndia’s maximum annual solar-cell manufacturing capacity is about 3 gigawatts while average yearly demand is 20 gigawatts, meaning the remainder needs to be procured on the international market, according to a December statement from India’s Ministry of New &amp; Renewable Energy.</p>\n<p>\n\tThe price of modules imported from China is expected to fall at least 10 percent from current levels of $0.31 per watt, according to Sunil Jain, chief executive officer at International Finance Corp.-backed renewable developer Hero Future Energies Ltd.</p>\n<p>\n\t“Cheaper prices may boost installations in countries that see grid parity, like India,” Sebastian Liu, director of investor relations at JinkoSolar Holding Co., the world’s biggest solar panel maker.\n\t</p><hr>\n\n<p>\n\t<em>©2018 Bloomberg L.P.</em></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "yearly",
        "Chinese",
        "going",
        "light",
        "maximum",
        "annual",
        "solar",
        "average",
        "20"
    ],
    "verbs": [
        "find",
        "reform",
        "light",
        "average",
        "demand"
    ]
}