{
    "creator": "Sudhir Chowdhary",
    "title": "FreshMenu: Anyone who innovates constantly and fast stays ahead of others",
    "link": "https://www.financialexpress.com/industry/freshmenu-anyone-who-innovates-constantly-and-fast-stays-ahead-of-others/1194953/",
    "pubDate": "Wed, 06 Jun 2018 00:37:34 +05:30",
    "dc:creator": "Sudhir Chowdhary",
    "content": "Our business model has always been ensuring that our consumer is less than 5km away from a kitchen, ensuring fresh food that can be delivered as fast as possible, says Rashmi Daga.",
    "contentSnippet": "Our business model has always been ensuring that our consumer is less than 5km away from a kitchen, ensuring fresh food that can be delivered as fast as possible, says Rashmi Daga.",
    "guid": "https://www.financialexpress.com/?p=1194953",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-05T19:07:34.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.09090909090909091,
        "tokens": [
            "freshmenu",
            "anyone",
            "who",
            "innovates",
            "constantly",
            "and",
            "fast",
            "stays",
            "ahead",
            "of",
            "others"
        ],
        "words": [
            "innovates"
        ],
        "positive": [
            "innovates"
        ],
        "negative": []
    },
    "article": {
        "title": "FreshMenu: Anyone who innovates constantly and fast stays ahead of others",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1194957\" src=\"https://images.financialexpress.com/2018/06/food-2.jpg\" alt=\"FreshMenu, food tech startup, food tech industry\" srcset=\"https://images.financialexpress.com/2018/06/food-2.jpg 660w, https://images.financialexpress.com/2018/06/food-2-300x200.jpg 300w, https://images.financialexpress.com/2018/06/food-2-620x413.jpg 620w, https://images.financialexpress.com/2018/06/food-2-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Rashmi Daga laid the foundation of food -tech start-up FreshMenu in September 2014.</figure>\n\t\t\t</section></div><span>\n</span><p>Rashmi Daga laid the foundation of food -tech start-up FreshMenu in September 2014. Aimed at rescuing food-seekers from mundane meals, FreshMenu is on a constant quest to whip up interesting food options in the kitchens spread out across the city that deliver freshly cooked food to the doorsteps of its customers. Recently, the FreshMenu founder spoke to Sudhir Chowdhary on the company’s business model and plans for expansion. Excerpts:</p><span>\n</span><p><strong>Is it a good time to be in the food-tech industry?</strong></p><span>\n</span><p>People are constantly looking for something new and exciting. For a food-based brand like us, catering to that need becomes the crux of our business. Anyone who innovates constantly and fast is always ahead of everyone else in the game. It’s a $50 billion industry, growing at 20% CAGR, it’s definitely a good time to be in this industry.</p><span>\n</span><p><strong>Why is innovation such an important thing for FreshMenu?</strong></p><span>\n</span><p>Our business model has always been ensuring that our consumer is less than 5km away from a kitchen, ensuring fresh food that can be delivered as fast as possible. We cook our own food and deliver it, ensuring we are in control of the whole process thereby ensuring quality.We want to go deeper into our existing kitchens and ensure our food preparation and delivery is exemplary.</p><span>\n</span><p>There really isn’t ever going to be a situation where we cannot better ourselves and that is our focus for now. By the end of 2018, we hope to enter three new cities in India. Innovation is our core and only one out of four dishes we innovate, make it to the menu. Innovation also includes packaging and presentation of the dish. Considering the business, we are in, we have no choice but to innovate and we enjoy doing it.</p><span>\n</span><p><strong>Tell us something about the FreshCLUB Membership and expectations from the same?</strong></p><span>\n</span><p>FreshCLUB was a loyalty programme and it is doing really well. The focus has been on ensuring that subscribers get to taste our new dishes before anyone else and get to avail special discounts and free delivery. The expectation has been to build mutual benefits. The programme will help us build a community of foodies—we will show them love through these exclusive offers and they show us love by being our brand ambassadors.</p><span>\n</span><p><strong>How does FreshMenu stand out in a highly competitive food-tech industry?</strong></p><span>\n</span><p>Competition is always intensive in this industry. We choose to tackle it by upping our own game. We are always aware of global trends in the market and keep abreast of new ideas that are creating niches within the market. From new ways of sourcing, to new foods to newer trends in food; we ensure good food, a contantly evolving menu, on-time delivery and friendly packaging and stick to our promise of great global food at great prices.</p><span>\n</span><p><strong>Any future plans to raise funding?</strong></p><span>\n</span><p>We have received Series B funding in January 2016 of $16.5 million led by Zodius and Lightspeed. We had also raised $5 million in Series A round of funding in 2014 from Lightspeed.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "ahead",
        "fresh",
        "away",
        "less",
        "model",
        "possible",
        "fast"
    ],
    "verbs": [
        "model",
        "fast"
    ]
}