{
    "creator": "FE Online",
    "title": "Kairana impact? Narendra Modi Cabinet woos Sugarcane farmers with Rs 7000 crore package; details here",
    "link": "https://www.financialexpress.com/economy/kairana-impact-narendra-modi-cabinet-woos-sugarcane-farmers-with-rs-7000-crore-package-details-here/1195839/",
    "pubDate": "Wed, 06 Jun 2018 16:18:06 +05:30",
    "dc:creator": "FE Online",
    "content": "Days after an unexpected loss in Kairana Lok Sabha by-election, Prime Minister Narendra Modi-led Union Cabinet on Wednesday took several decisions to reverse its growing unpopularity among cane cultivators.",
    "contentSnippet": "Days after an unexpected loss in Kairana Lok Sabha by-election, Prime Minister Narendra Modi-led Union Cabinet on Wednesday took several decisions to reverse its growing unpopularity among cane cultivators.",
    "guid": "https://www.financialexpress.com/?p=1195839",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-06T10:48:06.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "kairana",
            "impact?",
            "narendra",
            "modi",
            "cabinet",
            "woos",
            "sugarcane",
            "farmers",
            "with",
            "rs",
            "7000",
            "crore",
            "package",
            "details",
            "here"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Kairana impact? Narendra Modi Cabinet woos Sugarcane farmers with Rs 7000 crore package; details here",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1195864\" src=\"https://images.financialexpress.com/2018/06/modi-cabinet-full.jpg\" alt=\"narendra modi cabinet\" srcset=\"https://images.financialexpress.com/2018/06/modi-cabinet-full.jpg 660w, https://images.financialexpress.com/2018/06/modi-cabinet-full-300x200.jpg 300w, https://images.financialexpress.com/2018/06/modi-cabinet-full-620x413.jpg 620w, https://images.financialexpress.com/2018/06/modi-cabinet-full-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> New Delhi: Prime Minister Narendra Modi addresses the opening session of the 49th Governors Conference, at Rashtrapati Bhavan, in New Delhi on June 04, 2018. (PTI Photo/PIB)</figure>\n\t\t\t</section></div><span>\n</span><p>Days after an unexpected loss in Kairana Lok Sabha by-election, primarily because of visible anger of sugarcane farmers of the region against <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/bharatiya-janata-party/\">BJP</a> government, Prime Minister <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/narendra-modi/\">Narendra Modi</a>-led Union Cabinet on Wednesday took several decisions to reverse its growing unpopularity among cane cultivators.</p><span>\n</span><p>BJP defeat in Kairana came as shock to saffron party workers as it had dominated western Uttar Pradesh in both 2014 General Elections and 2017 Assembly polls.</p><span>\n</span><p>Sugarcane farmers have been suffering because of non-payment of their dues by mills for long. Despite BJP-led Yogi Adityanath government’s promise to end woes of cane farmers, not much has been done since the former came to power last year. The Union Cabinet’s decisions will expectedly help sort out the issue, well in time before 2019 Lok Sabha elections.</p><span>\n</span><p>A Cabinet Committee on Economic Affairs (CCEA) release today said that Modi government has approved several measures worth Rs 7000 crore to “improve the problem of liquidity of sugar mills resulting in accumulation of huge cane price arrears of farmers.” The CCEA press release explains all measures:</p><span>\n</span><p>– <em>Creation of buffer stock of 30 LMT of sugar for one year and to incur an estimated expenditure of Rs 1175 crore for this purpose. However, based on the market price and availability of sugar, this may be reviewed by Department of Food and Public Distribution (DFPD) any time. The reimbursement under the scheme would be made on a quarterly basis which would be directly credited into farmers’ account on behalf of mills against their cane price dues.</em></p><span>\n</span><p><em>– To notify Sugar Price (Control) Order, 2018 under Essential Commodities Act, 1955 to fix minimum selling price of white/refined sugar at the mill gate below which no white/refined sugar can be sold and delivered by a sugar mill in the domestic market. Fixation of the minimum selling price of white sugar would be based on Fair Remunerative Price (FRP) of cane and minimum conversion cost of white/refined sugar.</em></p><span>\n</span><p><em>The minimum selling price of white/refined sugar shall be initially fixed at Rs.29/kg that can be revised by DFPD subsequently based on a revision of FRP etc. This will not affect the availability of sugar to consumers at reasonable price and Government will put in place a mechanism to ensure that the retail prices of sugar are kept fully under control. At present, this would be done along with the imposition of stock holding limits on sugar mills. The stock limit on mills will be initially imposed for the current sugar season (up to September 2018), which may be reviewed by DFPD at any time.</em></p><span>\n</span><p><em>– To augment capacity through up-gradation of existing distilleries attached to sugar mills by installing incineration boilers and setting up new distilleries in sugar mills. The government will bear interest subvention of maximum Rs 1332 crore over a period of five years including moratorium period of one year on estimated bank loan amounting to Rs.4440 crore to be sanctioned to the sugar mills by the banks over a period of three years for which DFPD would formulate a detailed scheme in this regard. This would help diversion of sugar during surplus phase to reduce excess inventories.</em></p><span>\n</span><p>The liquidity position of sugar mills has been adversely affected because of depressed market sentiments and crash in sugar prices, leading to accumulation of cane price dues to an alarming level of over Rs 22,000 crore, according to CCEA. The market price of sugar has been continuously depressing because of excess cane production in the current season and expectation of higher production in following season.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "several",
        "Prime",
        "unexpected",
        "growing",
        "Union",
        "reverse"
    ],
    "nouns": [
        "impact",
        "Cabinet",
        "Sugarcane",
        "crore",
        "package",
        "details",
        "Days",
        "Prime",
        "Minister",
        "loss",
        "led",
        "election",
        "Union",
        "Wednesday",
        "reverse",
        "unpopularity",
        "growing",
        "cane"
    ]
}