{
    "title": "Kharif sowing down by 75% in Gujarat due to chronic water shortage",
    "link": "https://www.business-standard.com/article/economy-policy/kharif-sowing-down-by-75-in-gujarat-due-to-chronic-water-shortage-118061900679_1.html",
    "pubDate": "Wed, 20 Jun 2018 00:32:00 +0530",
    "content": "The acute water shortage in Gujarat has taken a toll on kharif sowing this year.  Water scarcity has meant that kharif sowing in Gujarat across all crops put together is down by a whopping 75 per cent for till June 19 from the start of the sowing season.  As against an overall kharif sowing in an area of 871,700 hectares till June 19 last year, this year the same period has seen overall sowing in 225,231 hectares, which is only 25 per cent of last year's record.Experts and state government officials have advised farmers to defer sowing as much as possible in the hope of timely monsoon rains at a time when Gujarat is facing acute water shortage.\"Usually, monsoon arrives in Gujarat by June 10 to June 15. However, there is still no indication of monsoon arrival yet. Apart from delayed monsoon, a depleted pre-monsoon water table has also led to such a decline in kharif sowing. However, this may not affect crop prices as the monsoon arrival is expected anytime soon and should ease the ...",
    "contentSnippet": "The acute water shortage in Gujarat has taken a toll on kharif sowing this year.  Water scarcity has meant that kharif sowing in Gujarat across all crops put together is down by a whopping 75 per cent for till June 19 from the start of the sowing season.  As against an overall kharif sowing in an area of 871,700 hectares till June 19 last year, this year the same period has seen overall sowing in 225,231 hectares, which is only 25 per cent of last year's record.Experts and state government officials have advised farmers to defer sowing as much as possible in the hope of timely monsoon rains at a time when Gujarat is facing acute water shortage.\"Usually, monsoon arrives in Gujarat by June 10 to June 15. However, there is still no indication of monsoon arrival yet. Apart from delayed monsoon, a depleted pre-monsoon water table has also led to such a decline in kharif sowing. However, this may not affect crop prices as the monsoon arrival is expected anytime soon and should ease the ...",
    "guid": "https://www.business-standard.com/article/economy-policy/kharif-sowing-down-by-75-in-gujarat-due-to-chronic-water-shortage-118061900679_1.html",
    "isoDate": "2018-06-19T19:02:00.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.16666666666666666,
        "tokens": [
            "kharif",
            "sowing",
            "down",
            "by",
            "75",
            "in",
            "gujarat",
            "due",
            "to",
            "chronic",
            "water",
            "shortage"
        ],
        "words": [
            "shortage"
        ],
        "positive": [],
        "negative": [
            "shortage"
        ]
    },
    "article": {
        "title": "Kharif sowing down by 75% in Gujarat due to chronic water shortage",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>The acute water shortage in Gujarat has taken a toll on <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/kharif-sowing\" target=\"_blank\">Kharif sowing </a>this year. Water scarcity has meant that <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/kharif-sowing\" target=\"_blank\">Kharif sowing </a>in Gujarat across all crops put together is down by a whopping 75 per cent for till June 19 from the start of the sowing season.</p><p>\nAs against an overall <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/kharif-sowing\" target=\"_blank\">Kharif sowing </a>in an area of 871,700 hectares till June 19 last year, this year the same period has seen overall sowing in 225,231 hectares, which is only 25 per cent of last year's record.\n\n\n</p>\n<!-- INPAGE_BANNER --><p>\nExperts and state government officials have advised farmers to defer sowing as much as possible in the hope of timely monsoon rains at a time when Gujarat is facing acute water shortage.</p><p>\n\"Usually, monsoon arrives in Gujarat by June 10 to June 15. However, there is still no indication of monsoon arrival yet. Apart from delayed monsoon, a depleted pre-monsoon water table has also led to such a decline in Kharif sowing. However, this may not affect crop prices as the monsoon arrival is expected anytime soon and should ease the pressure,\" said A R Pathak, vice chancellor of Junagadh Agricultural University.</p>\n<br>Among the different types of crops, while sowing of grains reached barely 2.95 per cent of last year, pulses were sown in 36 per cent of last year's area till June 19. Last year till June 19, sowing of grains had touched 55,300 hectares as against 1632 hectares this year, while pulses were sown across 10,600 hectares last year as compared to 3,840 hectares this year.<p>\nFurther, oilseeds saw Kharif sowing in only 14.98 per cent of last year's sowing till June 19, while other crops including cotton, tobacco, guar seeds, and vegetables saw a sowing in 33.01 per cent of last year's area for the said period.</p><p>\nCrops with the highest share of sowing till mid-June compared to last year included paddy, tur or pigeon peas, cotton, and groundnut in Gujarat.</p>\n<br>As per the state agricultural department data, paddy was sowed in nearly 40 per cent of the area as last year, apart from pigeon peas at 48.54 per cent, groundnut at 15.16 per cent, and cotton at 28.15 per cent, respectively.<p>\nAs against 256,700 hectares of sowing last year till mid-June, oilseeds sowing took place across 38,473 hectares this year. On the other hand, other crops including cotton and tobacco, in all saw sowing over 181,286 hectares of the area till June 19, as compared to 549,100 hectares last year.</p><p>\nNormal Kharif sowing as an average of last three years in Gujarat stands at 8.57 million hectares, against which Gujarat has so far seen only 2.63 per cent of sowing across 225,231 hectares of area</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "timely",
        "depleted",
        "down",
        "expected",
        "due",
        "last",
        "possible",
        "10",
        "19",
        "no",
        "75",
        "chronic",
        "acute",
        "taken",
        "together",
        "whopping",
        "overall",
        "25",
        "advised",
        "15",
        "Apart",
        "delayed"
    ],
    "nouns": [
        "may",
        "indication",
        "period",
        "cent",
        "time",
        "decline",
        "government",
        "affect",
        "till",
        "June",
        "down",
        "monsoon",
        "year",
        "record",
        "led",
        "arrival",
        "due",
        "shortage",
        "last",
        "possible",
        "start",
        "state",
        "10",
        "19",
        "no",
        "Gujarat",
        "water",
        "Water",
        "acute",
        "toll",
        "scarcity",
        "crop",
        "put",
        "season",
        "As",
        "overall",
        "25",
        "hope",
        "facing",
        "15",
        "table",
        "ease",
        "area"
    ],
    "verbs": [
        "time",
        "decline",
        "affect",
        "till",
        "down",
        "record",
        "defer",
        "last",
        "start",
        "state",
        "water",
        "Water",
        "toll",
        "crop",
        "put",
        "season",
        "hope",
        "table",
        "ease"
    ]
}