{
    "title": "JSW Steel plows $1 bn into US, more will follow",
    "link": "https://timesofindia.indiatimes.com/business/india-business/jsw-steel-plows-1-billion-into-us-and-more-will-follow/articleshow/64759433.cms",
    "pubDate": "Wed, 27 Jun 2018 06:17:38 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/jsw-steel-plows-1-billion-into-us-and-more-will-follow/articleshow/64759433.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64759433.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/jsw-steel-plows-1-billion-into-us-and-more-will-follow/articleshow/64759433.cms",
    "isoDate": "2018-06-27T06:17:38.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "jsw",
            "steel",
            "plows",
            "1",
            "bn",
            "into",
            "us",
            "more",
            "will",
            "follow"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "JSW Steel plows $1 billion Into US and more will follow",
        "content": "<div class=\"Normal\"><span>NEW DELHI: India’s top steelmaker JSW </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Steel\">Steel</a><p> says it’s scouting for more deals in the US and Europe to expand its global footprint, betting that vibrant growth will underpin demand in overseas markets and complement a boom at home that’s seen the mill ramp up local output.\n\n</p><p>“What is driving us is that, inherently, we find it is an interesting opportunity because the US economy is doing well” and the investment cycle looks positive, Joint Managing Director Seshagiri Rao said in an interview. After meeting half its target for 10 million tons of capacity overseas, the steelmaker is now looking to buy more facilities, Rao said in Mumbai.\n</p><span>While the global industry has been roiled this year by tariffs imposed by US President </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Donald-Trump\">Donald Trump</a><p> on some flows of steel into the world’s top economy, mills are still enjoying benign conditions. Worldwide production hit a record in May as capacity utilization climbed, according to the World Steel Association. Against that backdrop, Mumbai-based JSW has been busy: after announcing a move to triple output at its Texas plant, it snapped up another US facility in Ohio, taking total planned investment in the country to $1 billion.\n</p><p>For Rao, the commercial lure isn’t dependent on the trade moves, which he said are transitory. “The US economy -- notwithstanding the trade remedial measures which the US government has taken -- is quite buoyant, demand is picking up,” he said on Tuesday. “It is not because tariffs were introduced in the US or somewhere else, that is why we wanted to invest.”\n</p><p>JSW Steel shares have soared more than 60 per cent over the past year, aided by record output and profit. To meet local demand, the company plans a $6 billion capacity expansion in India. In May, it made an acquisition in Italy, and it has another purchase awaiting approval from India’s company law tribunal.\n</p><span>As part of its trade agenda, Trump imposed a tariff of 25 per cent on imported steel aiming to restrict a flood of cheap foreign supplies. While that’s helped to trigger some plant restarts, it’s alienated trading partners, and may spur tit-for-tat moves, with Canada now said to be is preparing its own measures.\n</span><br><span>\n</span><br><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/US-steel\">US steel</a><span> output has been picking up. Production in March topped 7.3 million tons, the highest monthly total since late 2014, according to World Steel Association data. The economy is about to enter the 10th year of expansion, and growth may reach 4 per cent this quarter, the fastest since 2014.\n</span><br><span>\n</span><br><span>In Europe, </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/ArcelorMittal\">ArcelorMittal</a><span> is selling assets in Italy, Belgium, the Czech Republic, Luxembourg, Romania and Macedonia to meet regulatory requirements enabling the world’s top producer to take over Italy’s Ilva SpA, for which a JSW-led consortium had also bid. Rao denied reports the company may make an offer for Arcelor’s Galati plant in Romania, while declining to comment on the others.\n</span><br><span>\n</span><br><span>JSW Steel produced 15.8 million tons of crude steel in the year to March 31, up 26 per cent from a year ago. The company has said it plans to boost capacity by more than a third to about 25 million tons a year by March 2020.\n</span><br><span>\n</span><p>“If someone is spending a billion dollars for a million ton, we spend only $500 million,” Rao said. “On capital-allocation side, if we are cautious -- whether I invest in US or Europe -- then my returns always remain accretive not withstanding the cycles,” he said.\n</p><span>\n</span></div>"
    },
    "adjectives": [
        "top",
        "10",
        "left",
        "right",
        "billion"
    ],
    "nouns": [
        "india",
        "margin",
        "top",
        "Steel",
        "steel",
        "photo",
        "border",
        "10",
        "left",
        "style",
        "right",
        "business",
        "billion",
        "US",
        "us",
        "will"
    ],
    "verbs": [
        "top",
        "Steel",
        "steel",
        "follow",
        "border",
        "align",
        "style",
        "right",
        "will"
    ]
}