{
    "title": "Farmfolks Agro: This start-up aims to remove ambiguities in the agricultural supply chain",
    "link": "https://www.financialexpress.com/industry/farmfolks-agro-this-start-up-aims-to-remove-ambiguities-in-the-agricultural-supply-chain/1194942/",
    "pubDate": "Wed, 06 Jun 2018 00:29:56 +05:30",
    "content": "FarmFolks started out with 50 farmers in 2015 and now has over 800 farmers across South India cultivating for it.",
    "contentSnippet": "FarmFolks started out with 50 farmers in 2015 and now has over 800 farmers across South India cultivating for it.",
    "guid": "https://www.financialexpress.com/?p=1194942",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-05T18:59:56.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "farmfolks",
            "agro",
            "this",
            "start-up",
            "aims",
            "to",
            "remove",
            "ambiguities",
            "in",
            "the",
            "agricultural",
            "supply",
            "chain"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Farmfolks Agro: This start-up aims to remove ambiguities in the agricultural supply chain",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1194954\" src=\"https://images.financialexpress.com/2018/06/farmfolks.jpg\" alt=\"Farmfolks Agro,&nbsp;Farmfolks Agro bengaluru, fruit vegetable start up,&nbsp; Lakshmipriyan VG\" srcset=\"https://images.financialexpress.com/2018/06/farmfolks.jpg 660w, https://images.financialexpress.com/2018/06/farmfolks-300x200.jpg 300w, https://images.financialexpress.com/2018/06/farmfolks-620x413.jpg 620w, https://images.financialexpress.com/2018/06/farmfolks-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> While a crash in food prices can put the very survival of the marginal farmer in jeopardy, unsatisfactory quality of produce frustrates consumers leading to alienation. (Website)</figure>\n\t\t\t</section></div><span>\n</span><p>While a crash in food prices can put the very survival of the marginal farmer in jeopardy, unsatisfactory quality of produce frustrates consumers leading to alienation. This is what prompted Lakshmipriyan VG to start FarmFolks, a Bengaluru-based fruits and vegetables procurement and supply start-up. The start-up, launched in 2015, supplies fruits and vegetables to organised retail chains such as BigBasket, Namdhari’s Fresh, More and Star Bazaar besides online retailers <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/amazon/\">Amazon</a> and Grofers.</p><span>\n</span><p>It is also Godrej Nature Basket’s exclusive back-end supply partner for fruits and vegetables in the Bengaluru area. Handling the supply chain for bananas, carrots, pineapples and exotic vegetables, the agro-tech firm focuses on two things: Quality of produce sold to the customer and a consistent and healthy profit for the farmer. FarmFolks operates in a unique way to fulfill these goals. “We keep our farmers updated with the latest agronomic practices and global benchmarks to ensure their produce is cultivated without using excessive chemicals thus keeping residue levels minimal,” says Lakshmipriyan, founder, FarmFolks.</p><span>\n</span><p>“We keep absolute quality control over the produce because we know all our farmers and we advise them on farming practices which help in optimising the use of inputs.” The focus is on educating the farmers as to the right practices which will automatically translate to better quality produce and increased revenues for the farmers. FarmFolks started out with 50 farmers in 2015 and now has over 800 farmers across South India cultivating for it. Lakshmipriyan says it plans to have 10,000 farmers under its umbrella by 2023. “Farmers face a lot of challenges such as complications in mandis (wholesale markets) and difficulty in handling logistics. Many don’t have the competence to dictate terms to traders in the market, so we come in and tell them to focus only on the crops and we’ll handle the rest,” explains Lakshmipriyan.</p><span>\n</span><p>While the produce sold by FarmFolks comes at a higher price, Lakshmipriyan says the emphasis on quality will enable it to establish itself in the market. And the results have started showing. He says that banana farmers under FarmFolks make around 30% more revenue than other banana farmers. Lakshmipriyan says that the role of intermediaries in the agricultural sector will be reduced through companies like his and is confident of the sustanability of his business model in the long term.</p><span>\n</span><p>FarmFolks recently raised an undisclosed amount in seed funding from Menterra Venture Advisors which invests in for-profit enterprises in agriculture, healthcare and education sectors. AB Chakravarthy, principal, Menterra Venture Advisors expressed confidence in the investment, saying, “About 30-35 years ago, before the Green Revolution, there was a unique flavour in fruits and vegetables which is now absent because of indiscriminate use of chemicals. FarmFolks places importance on quality which benefits both consumers and farmers.” He also says the way the firm operates ensures transparency to the customers as it removes the information asymmetry between the farmer and the consumer.</p><span>\n</span><p>FarmFolks also has a partnership deal with ITC to procure potatoes from it and sell in the Bengaluru market. The products of FarmFolks are also sold on the agricultural commodity exchange, NCDEX. “We want to intervene in items where we know we can make a difference. We are currently looking to expand into grapes and organges,” he said.</p><span>\n</span><p>By: Aniruddha Ghosh</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "agricultural",
        "50",
        "South"
    ],
    "verbs": [
        "start",
        "remove",
        "supply",
        "chain"
    ]
}