{
    "title": "Emerging markets can't blame Fed for their problems. Here's why",
    "link": "https://www.business-standard.com/article/markets/emerging-markets-can-t-blame-fed-for-their-problems-here-s-why-118061300146_1.html",
    "pubDate": "Wed, 13 Jun 2018 09:03:00 +0530",
    "content": "Central banks in developing countries have had to adjust domestic policies in response to these external pressures",
    "contentSnippet": "Central banks in developing countries have had to adjust domestic policies in response to these external pressures",
    "guid": "https://www.business-standard.com/article/markets/emerging-markets-can-t-blame-fed-for-their-problems-here-s-why-118061300146_1.html",
    "isoDate": "2018-06-13T03:33:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "emerging",
            "markets",
            "can't",
            "blame",
            "fed",
            "for",
            "their",
            "problems",
            "here's",
            "why"
        ],
        "words": [
            "problems",
            "blame"
        ],
        "positive": [
            "blame"
        ],
        "negative": [
            "problems"
        ]
    },
    "article": {
        "title": "Emerging markets can't blame Fed for their problems. Here's why",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/emerging-markets\" target=\"_blank\">Emerging </a><a class=\"storyTags\" href=\"https://www.business-standard.com/markets\" target=\"_blank\">markets </a>have taken a hit from the prospect of even higher US interest rates and a stronger dollar, which increase the cost of servicing external debt. The pressure can be seen in the depreciation of their currencies, with the MSCI <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/emerging-markets\" target=\"_blank\">Emerging </a><a class=\"storyTags\" href=\"https://www.business-standard.com/markets\" target=\"_blank\">Markets </a>Currency Index dropping 3.54 per cent from its high this year in early April.</p>\n<p>\n\tCountries that feasted on the cheap money that resulted from the quantitative easing and near-zero interest rates initiated by the Federal Reserve almost a decade ago are now suffering from a withdrawal of global liquidity. The correction in emerging-market currencies, debt and equities has further to go with the Fed poised to raise interest rates on Wednesday for the seventh time since December 2015, and as global trade tensions boost investor demand for currencies such as the dollar that are considered havens.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\t<strong>Diverging Paths</strong></p>\n<p>\n\tEmerging-market currencies stumble as the US dollar strengthens</p>\n<p>\n\tCentral banks in developing countries have had to adjust domestic policies in response to these external pressures. The Reserve Bank of India boosted a key interest rate by 25 basis points to 6.25 percent on June 7, its first increase since January 2014. Perry Warjiyo, the new governor of the Bank of Indonesia, complained last week that the Fed was considering only domestic U.S. objectives in setting policy rather than the impact of its measures on foreign economies.</p>\n<p>\n\tThe current complaints are a stark contrast to earlier this decade. Back then, officials in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/emerging-markets\" target=\"_blank\">emerging </a><a class=\"storyTags\" href=\"https://www.business-standard.com/markets\" target=\"_blank\">markets </a>complained that the Fed’s decision to cut rates near zero and pump liquidity into the global markets through its quantitative easing program was intended to weaken the dollar and help the U.S. gain a competitive advantage in international trade. In September 2012, Brazil’s then-finance minister Guido Mantega famously labeled the moves nothing less than a “currency war” with emerging markets getting the short end of the stick.</p>\n<p>\n\tA quintupling of the Fed’s balance-sheet assets from about $900 billion in September 2008 to a peak of $4.52 trillion in 2015 helped spark a surge of capital into emerging markets to take advantage of higher rates. Emerging-market governments and companies borrowed at yields that averaged a mere 2.42 percentage points more than U.S. Treasuries in April 2010, down from 8.90 percentage points in October 2008. Spreads remained narrow for the next four years.</p>\n<p>\n\t<strong>Tight Spreads</strong></p>\n<p>\n\tEmerging-market bonds offer little extra in the way of yield premiums over Treasuries</p>\n<p>\n\tBut emerging-markets officials can't have it both ways by complaining about a weak dollar, as Mantega did in 2012, and seek relief from a strong dollar, as Warjiyo did recently. The fortunes of the dollar will wax and wane over economic cycles, so medium-term global investors should look to two sovereign risk indicators to provide some guidance.</p>\n<p>\n\tThose indicators are the deficit in the current account of the balance of payments, and annual inflows of foreign direct investments. The current account measures the balance on merchandise trade (exports less imports) as well as services. A deficit would have to be financed by capital inflows from abroad or by running down foreign-exchange holdings by that particular emerging nation’s central bank. The smaller the shortfall, the less the country would need to depend on debt or equity inflows.</p>\n<p>\n\tBy that measure, Turkey is in a deeper hole than Mexico. Foreign investors have to reckon that with a current-account deficit equivalent to 6 per cent of gross domestic product, Turkey may need to maintain higher interest rates for longer, despite the negative impact on economic growth and its equity markets.</p>\n<p>\n\t<strong>Deficits Matter</strong></p>\n<p>\n\tTurkey's trade deficit means it relies more on foreign capital than Mexico</p>\n<p>\n\tThe second indicator, inflows of foreign direct investments, refers to capital inflows that go to building plant and equipment, rather than to portfolio investments. FDI flows are unlikely to reverse in a hurry, unlike speculative investments in short-term debt instruments or in the equity market. They provide confidence to new investors that there would be stability in a country’s capital structure to support their own investments.</p>\n<p>\n\tBrazil does well on this basis while South Africa performs poorly. Even though both countries had net FDI inflows equivalent to about 2 percent of GDP in 2010, the figure has since more than doubled in Brazil while it is less than half that level for South Africa. This may reflect the judgment of foreign investors on the stability of the countries’ economic policies.</p>\n<p>\n\t<strong>Pulling Ahead</strong></p>\n<p>\n\tNet foreign direct inflows put Brazil in better shape than South Africa</p>\n<p>\n\tThe correction in emerging markets is not a reason to avoid them. Rather, in following selected sovereign risk criteria, investors could profit over the longer term by making intelligent country allocations at attractive valuations.\n\t</p><hr>\n\n<p>\n\t<em>Bloomberg</em></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "Emerging",
        "Central",
        "blame",
        "Here",
        "domestic",
        "developing",
        "external"
    ],
    "nouns": [
        "Here",
        "Central",
        "blame",
        "Fed",
        "banks",
        "why",
        "developing",
        "domestic",
        "response",
        "external"
    ]
}