{
    "creator": "AFP",
    "title": "Record US exports shrink April trade gap as China imports fall",
    "link": "https://www.financialexpress.com/economy/record-us-exports-shrink-april-trade-gap-as-china-imports-fall/1196287/",
    "pubDate": "Wed, 06 Jun 2018 22:24:27 +05:30",
    "dc:creator": "AFP",
    "content": "Record exports sent the US trade deficit to its lowest level in seven months in April while Americans imported fewer goods from China, government data showed today.",
    "contentSnippet": "Record exports sent the US trade deficit to its lowest level in seven months in April while Americans imported fewer goods from China, government data showed today.",
    "guid": "https://www.financialexpress.com/?p=1196287",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-06T16:54:27.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "record",
            "us",
            "exports",
            "shrink",
            "april",
            "trade",
            "gap",
            "as",
            "china",
            "imports",
            "fall"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Record US exports shrink April trade gap as China imports fall",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1196291\" src=\"https://images.financialexpress.com/2018/06/us.jpg\" alt=\"us, us flag, trade, economy, us economy\" srcset=\"https://images.financialexpress.com/2018/06/us.jpg 660w, https://images.financialexpress.com/2018/06/us-300x200.jpg 300w, https://images.financialexpress.com/2018/06/us-620x413.jpg 620w, https://images.financialexpress.com/2018/06/us-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The total US trade deficit fell 2.1 per cent for the month to USD 46.2 billion after a downward revision for March. (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>Record exports sent the US trade deficit to its lowest level in seven months in April while Americans imported fewer goods from China, government data showed today.</p><span>\n</span><p>The falling trade gap comes as the major world economies gird for all-out trade war after President Donald Trump last week imposed punishing tariffs on US imports of steel and aluminum.</p><span>\n</span><p>His trade battles with China, Europe, Mexico and others are an effort to make those countries buy more US goods and force down the deficit, which Trump sees as a job killer and threat to the American industrial base.</p><span>\n</span><p>So he might see the latest data as vindication his policies are working even though the figures can vary month to month. Markets and major corporations, however, see the trade conflict as a threat to expanding cross-border trade and GDP growth.</p><span>\n</span><p>The all-time high amount of US exports in April was driven upwards by growing orders for American corn and soybeans, a product that China has threatened with retaliatory tariffs, as well as fuel oil and other petroleum products.</p><span>\n</span><p>The total US trade deficit fell 2.1 per cent for the month to USD 46.2 billion after a downward revision for March. The result was better than analysts expected, since a consensus forecast called for a 3.4 per cent increase.</p><span>\n</span><p>Despite the April dip, the trade deficit is still on track to reach a 10-year high in 2018. Exports of goods and services rose 0.3 per cent to USD 211.2 billion, the highest on record. Exports of goods (USD 141.2 billion) and services (USD 70 billion) each were at all-time highs. Meanwhile, imports fell 0.2 per cent to USD 257.4 billion.</p><span>\n</span><p>The deficit with China in goods only, the principal driver of the overall US trade gap, fell 9.8 per cent for the month as US imports from the industrial giant fell USD 4.7 billion to USD 41.9 billion.</p><span>\n</span><p>Year-to-date, however, the US trade gap with China was still up 10.4 per cent, matching a the general trend of the last nine years Deficits also narrowed with Canada and Mexico in the latest month.</p><span>\n</span><p>The drop in the total trade gap suggested trade could be less of a drag than expected on GDP growth in the second quarter. But despite the declines in March and April, the deficit for the first four months of 2018 was still nearly 12 per cent higher than the same period last year.</p><span>\n</span><p>Americans imported fewer mobile telephones and consumer goods as well as passenger cars. Trump’s multi-front trade confrontation was due to spill over into this week’s Group of Seven summit in Quebec, Canada.</p><span>\n</span><p>Other members of the G7 leading industrialised nations have unanimously denounced Trump’s protectionist trade policies and vowed to retaliate against the tariffs.</p><span>\n</span><p>The European Union today said a package of counter-measures on US goods would be ready by July. RDQ Economics said the trade gap is likely to continue rising as US consumers run out of American-made goods to buy.</p><span>\n</span><p>“We firmly believe that the growth in aggregate demand in the US is outstripping supply and expect the trade gap to widen later in the year but for now we appear on track for trade to add to second-quarter growth, which would push real GDP growth in the quarter above four percent,” the said in a research note.</p><span>\n</span><p>“We fail to understand the strategy of risking a trade war with Europe, Canada and Mexico particularly at a time when the US appears to be expanding strongly in these markets.”</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "imported",
        "sent",
        "lowest",
        "level",
        "seven",
        "fewer"
    ],
    "nouns": [
        "US",
        "April",
        "Record",
        "trade",
        "gap",
        "shrink",
        "China",
        "sent",
        "fall",
        "deficit",
        "level",
        "seven",
        "data",
        "government",
        "today"
    ]
}