{
    "title": "New telecom policy likely to be in place by July, says Manoj Sinha",
    "link": "https://www.business-standard.com/article/economy-policy/new-telecom-policy-likely-to-be-in-place-by-july-says-manoj-sinha-118061200913_1.html",
    "pubDate": "Wed, 13 Jun 2018 00:56:00 +0530",
    "content": "Sinha said that till date no work of such scale has taken place in the country for to expand connectivity in the country",
    "contentSnippet": "Sinha said that till date no work of such scale has taken place in the country for to expand connectivity in the country",
    "guid": "https://www.business-standard.com/article/economy-policy/new-telecom-policy-likely-to-be-in-place-by-july-says-manoj-sinha-118061200913_1.html",
    "isoDate": "2018-06-12T19:26:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "new",
            "telecom",
            "policy",
            "likely",
            "to",
            "be",
            "in",
            "place",
            "by",
            "july",
            "says",
            "manoj",
            "sinha"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "New telecom policy likely to be in place by July, says Manoj Sinha",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/new-telecom-policy\" target=\"_blank\">new telecom policy </a>is expected to be cleared by the Union Cabinet by the end of next month, Communications Minister <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/manoj-sinha\" target=\"_blank\">Manoj Sinha </a>said today.</p>\n<p>\n\t\"I am hopeful of getting <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=cabinet+approval\" target=\"_blank\">Cabinet approval </a>on NDCP by end of July,\" he said while talking about the achievement of the government in the last 4 years.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tThe government has recently issued draft of the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=national+digital+communications+policy\" target=\"_blank\">National Digital Communications Policy </a>(NDCP) 2018 which aims to provide access to every household with download speed of 50 Mbps, attract investment of around Rs 6.5 lakh crore in the sector and create 4 million new job opportunities with a few years.</p>\n<p>\n\tTelecom Secretary Aruna Sundararajan said that the draft of the policy will be placed before the Telecom Commission -- the apex decision making body at the Department of Telecom -- in its meeting scheduled for June 29.</p>\n<p>\n\tThe commission is also likely to discuss net-neutrality and framework for roll-out of new technology machine-to-machine communications.</p>\n<p>\n\t\"When this government came to power, the biggest challenge in telecom was that the whole sector was a victim of trust deficit, there was turmoil. In last four years we have restored confidence, brought transparency and established good governance,\" Sinha said.</p>\n<p>\n\tHe cited the government's efforts in ease of doing business, broadband for all and progress on the BharatNet project to connect all gram panchayats to underscore the achievements of his ministry.</p>\n<p>\n\tDoT special secretary N Sivasailam said that there has been increase in public spending by six times, from Rs 9,000 crore in 2009-14 to Rs 60,000 crore in 2014-19, which includes both actual and planned expenditure.</p>\n<p>\n\tIn last three years investment in the sector has crossed Rs 3 lakh crore, from both government and private firms, which is one-third of Rs 9 lakh crore spend on the sector till date, he said.</p>\n<p>\n\tSivasailam said work is on to roll out 4,072 mobile towers with an outlay of Rs 7,330 crore by 2020, setting up of over 10 lakh wifi hotspots in rural areas over and above 25,000 wifi hotspots of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/bsnl\" target=\"_blank\">BSNL </a>and 7000 e-choupal with outlay of Rs 10,000 crore.</p>\n<p>\n\tThe government is also working on Rs 2,250 crore submarine and mobile network connectivity in Andaman and Nicobar Islands and Lakshadweep Islands and Rs 10,834 crore project for connectivity in the north eastern states.</p>\n<p>\n\tThe DoT also said that it has completed 90 per cent of optical fibre roll out for about Rs 24,000 crore dedicated communication network for Defence forces.</p>\n<p>\n\tSinha said that till date no work of such scale has taken place in the country for to expand connectivity in the country.</p>\n<p>\n\t\"I expect IFC (in-flight connectity) service should be in place in a year,\" he said.</p>\n<p>\n\tHe said that proactive policies of the government over the last four years have led to a sharp fall in mobile tariffs and a \"marked improvement\" in the call drop situation, while stressing that the Centre will not hesitate from taking tough decisions to maintain the \"success story\" of the telecom sector.</p>\n<p>\n\tSinha also sought to allay apprehensions around job losses in the sector, saying that new opportunities in telecom have spawned new jobs, and termed consolidation in the sector as a global phenomenon.</p>\n<p>\n\tThe minister was also quick to rise to the defence of telecom PSUs Bharat Sanchar Nigam Ltd (BSNL) and Mahanagar Telephone Nigam Ltd (MTNL) saying that the two companies are making all-out efforts to improve service quality, despite the \"handicap\" of not having 4G spectrum in an intensely competitive market.</p>\n<p>\n\tThe minister said that everything with respect to hiving off land from Tata Communications, erstwhile VSNL, has been approved and in 2-4 month the entire process will be complete.</p>\n<p>\n\tA telecom ministry official, on the sidelines of the event, hinted that the government may not auction spectrum in E and V bands -- which can transmit data with speed of over 1000 mbps and is used for backhaul.</p>\n<p>\n\tThe official pointed out that globally such spectrum is not auctioned, and Trai too had recommended allocation of the 'backhaul' spectrum bands without auction.</p>\n<p>\n\tOn the Department of Posts (DoP), he said that it is waiting for approval of Reserve Bank of India to start 650 branches of India Post payments Bank which will be connected with all 1.5 lakh post office branches gradually and create India's largest banking network.</p>\n<p>\n\tHe said his ministry is working to create a separate insurance company under DoP.</p><p id=\"auto_disclaimer\">(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "taken",
        "New",
        "no",
        "likely"
    ],
    "verbs": [
        "work",
        "expand",
        "place",
        "date",
        "till",
        "scale"
    ],
    "nouns": [
        "work",
        "policy",
        "connectivity",
        "place",
        "date",
        "till",
        "telecom",
        "no",
        "July",
        "country",
        "scale"
    ]
}