{
    "creator": "Bloomberg",
    "title": "Trade war heats up; while iconic brands feel tariff pain, corporate America braces for more",
    "link": "https://www.financialexpress.com/economy/trade-war-heats-up-while-iconic-brands-feel-tariff-pain-corporate-america-braces-for-more/1222288/",
    "pubDate": "Wed, 27 Jun 2018 15:00:47 +05:30",
    "dc:creator": "Bloomberg",
    "content": "With the US-versus-the-world trade war threat heating up, Harley-Davidson Inc. and Jack Daniel’s maker Brown-Forman Corp. may just be the canaries in the coal mine.",
    "contentSnippet": "With the US-versus-the-world trade war threat heating up, Harley-Davidson Inc. and Jack Daniel’s maker Brown-Forman Corp. may just be the canaries in the coal mine.",
    "guid": "https://www.financialexpress.com/?p=1222288",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-27T09:30:47.000Z",
    "sentiment": {
        "score": -4,
        "comparative": -0.26666666666666666,
        "tokens": [
            "trade",
            "war",
            "heats",
            "up",
            "while",
            "iconic",
            "brands",
            "feel",
            "tariff",
            "pain",
            "corporate",
            "america",
            "braces",
            "for",
            "more"
        ],
        "words": [
            "pain",
            "war"
        ],
        "positive": [],
        "negative": [
            "pain",
            "war"
        ]
    },
    "article": {
        "title": "Trade war heats up; while iconic brands feel tariff pain, corporate America braces for more",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1222295\" src=\"https://images.financialexpress.com/2018/06/trump-reuters-2.jpg\" alt=\"trade war, tariff war, donald trump, Harley Davidson, Jack Daniels, Wall Street \" srcset=\"https://images.financialexpress.com/2018/06/trump-reuters-2.jpg 660w, https://images.financialexpress.com/2018/06/trump-reuters-2-300x200.jpg 300w, https://images.financialexpress.com/2018/06/trump-reuters-2-620x413.jpg 620w, https://images.financialexpress.com/2018/06/trump-reuters-2-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Harley-Davidson said it is shifting production of motorcycles destined for the EU market out of the U.S. to avoid 31 percent tariffs — a move that prompted a backlash from Trump on Twitter. (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>With the US-versus-the-world trade war threat heating up, Harley-Davidson Inc. and Jack Daniel’s maker Brown-Forman Corp. may just be the canaries in the coal mine.</p><span>\n</span><p>Both iconic American brands — singled out for tariffs in part to inflict maximum pain on U.S. districts that voted for President Donald Trump or his allies — have warned investors that retaliatory measures will have tangible effects on their businesses. Wall Street should expect more companies to disclose pain ahead when they report second-quarter results in coming weeks as the list of goods in the crosshairs of major trading partners like the European Union, China and Mexico grows.</p><span>\n</span><p>“We don’t know where it’s going to hit hardest, but it will hit companies like suppliers, transportation, retailers — a lot of different people,” said Bob Phibbs, head of the Retail Doctor, a consulting firm for retailers. “It will take months to assess what that means for the supply chain and just how it will escalate. There is no safe harbor.”</p><span>\n</span><p>In addition to American motorcycles and bourbon, the EU is also targeting a variety of products from tobacco and fruit juice to apparel and playing cards. The potential impact from these duties spans the corporate landscape, from packaged-food and soft-drink companies such as Hormel Foods Corp. and Coca-Cola Co. to consumer-goods conglomerates like Newell Brands Inc. and closely held jeans maker Levi Strauss &amp; Co.</p><span>\n</span><p><strong>60 Percent</strong></p><span>\n</span><p>Companies must also contend with Mexican tariffs on items including U.S. pork, steel and whiskey, while Canada has honed in on steel, food, home appliances and household goods. China is primarily slapping duties on agricultural products and cars, and India has raised levies on items such as chickpeas, walnuts and some hot-rolled steel.</p><span>\n</span><p>Taken together, the EU, China, Mexico, India and Canada are the destination for more than 60 percent of U.S. exports. Currently, only a small portion of this flow is the target of duties. But the rapid escalation of trade tensions follows a prolonged period of relative stability in the global movement of goods, and companies are now scrambling to get ahead of the new supply chain challenges that loom.</p><span>\n</span><p>“The current rhetoric around trade is worrying,” Coke spokesman Scott Leith said in an email. “If strict tariff policies implemented in one country are mirrored in others, the world will become more insular, goods and services will be less affordable for consumers and that would have a negative impact on global economic prosperity.”</p><span>\n</span><p>Only a few companies have disclosed those risks publicly so far. Harley-Davidson said it is shifting production of motorcycles destined for the EU market out of the U.S. to avoid 31 percent tariffs — a move that prompted a backlash from Trump on Twitter. Brown-Forman, which produces Jack Daniel’s, Woodford Reserve and other spirits, will have to hike whiskey prices in the EU by about 10 percent and has stockpiled supplies there ahead of the tariffs going into effect.</p><span>\n</span><p><strong>Commodities Impact</strong></p><span>\n</span><p>In the commodities market, China and Mexico make up two of the largest export destinations for U.S. farm products, so tariffs have left agricultural goods mired in a slump. Soybeans fell to a two-year low last week and prices for many grain, meat, cotton and dairy products have also declined.</p><span>\n</span><p>That’s tough news for farmers, who rely on foreign demand to offset domestic surpluses. Plus, favorable growing weather in the U.S. Midwest for this season’s crops means supply may remain ample ahead.</p><span>\n</span><p>Meat producer Tyson Foods Inc. is facing “day-to-day uncertainty” amid the trade volatility, the company said last week. Earlier this month, a Cargill Inc. executive warned that trade has become “ villainized” and misunderstood.</p><span>\n</span><p>“The president’s actions on trade are causing whiplash for America’s retailers, farmers and manufacturers,” Hun Quach, Retail Industry Leaders Association’s vice president of trade, said in an email. “No question, tariffs will hurt U.S. workers and companies in every sector of our economy.”</p><span>\n</span><p><strong>Economic Impact</strong></p><span>\n</span><p>Even as specific companies gear up for potential pain, the U.S. as a whole isn’t sweating the tariffs, with Bloomberg Economics only predicting a total GDP impact of just one-tenth of a percentage point in a year that the economy is already growing at the fastest rate of the current cycle.</p><span>\n</span><p>“In terms of motorcycle exports or whiskey or bourbons, these are not substantial shares of U.S. exports so this doesn’t move the needle economically,” said Bloomberg Economics’ Chief U.S. Economist Carl Riccadonna. “Everyone keeps wanting to call it a trade war, when really we’re talking about something that’s a rounding error in the GDP account. But that doesn’t mean we couldn’t get there.”</p><span>\n</span><p>Economists are watching the data carefully for any sign of an impact, with next Friday’s jobs report in particular a place where corporate fears could potentially start showing up in the form of lower hiring.</p><span>\n</span><p>“Capitalism hates economic uncertainty,” Riccadonna said. “We’ve been banging the drum on trade. That anxiety could start to create a negative feedback loop” that starts to impact companies’ behavior, he said.</p><span>\n</span><p><strong>Domino Effect</strong></p><span>\n</span><p>For some companies, the tariffs have created a complex domino effect. This was illustrated on a recent conference call with executives from La-Z-Boy Inc., the makers of the ubiquitous reclining chairs. When asked last week about the company’s outlook, Chief Executive Officer Kurt Darrow first cited a 10 percent tariff from Canada on U.S.-made furniture before referring to a potential U.S. duty on Chinese actuators, a machine component used in its products.</p><span>\n</span><p>“And then there’s the announcement of a plan for more tariffs coming, so it is an uncertain time as far as our cost inputs,” he said as the company reported fourth-quarter results.</p><span>\n</span><p>Darrow said that when it comes to tariffs and input costs, the Monroe, Michigan-based company will just have to see what happens.</p><span>\n</span><p>“You really can’t get ahead of it,” he said. “You have to wait until you deal with the raw materials and then decide how much you pass on and how much you keep.”</p><span>\n\t\t\t\t</span></div>"
    },
    "adjectives": [
        "corporate",
        "iconic",
        "world",
        "Brown",
        "just"
    ],
    "nouns": [
        "Inc",
        "threat",
        "tariff",
        "Trade",
        "trade",
        "war",
        "heating",
        "braces",
        "pain",
        "feel",
        "Corp",
        "America",
        "US",
        "world",
        "Jack",
        "Daniel",
        "Brown",
        "maker",
        "may",
        "coal",
        "canaries",
        "mine"
    ],
    "verbs": [
        "tariff",
        "Trade",
        "trade",
        "war",
        "feel",
        "pain",
        "Jack",
        "Brown",
        "coal",
        "mine"
    ]
}