{
    "title": "Monetary policy: RBI rate hike will impact India Inc's capex, says CII",
    "link": "https://www.business-standard.com/article/finance/monetary-policy-rbi-rate-hike-will-impact-india-inc-s-capex-says-cii-118061300008_1.html",
    "pubDate": "Wed, 13 Jun 2018 00:25:00 +0530",
    "content": "Many lenders had increased their lending rates prior to the policy review and after that, indicating a broader direction in which the rates are headed",
    "contentSnippet": "Many lenders had increased their lending rates prior to the policy review and after that, indicating a broader direction in which the rates are headed",
    "guid": "https://www.business-standard.com/article/finance/monetary-policy-rbi-rate-hike-will-impact-india-inc-s-capex-says-cii-118061300008_1.html",
    "isoDate": "2018-06-12T18:55:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "monetary",
            "policy",
            "rbi",
            "rate",
            "hike",
            "will",
            "impact",
            "india",
            "inc's",
            "capex",
            "says",
            "cii"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Monetary policy: RBI rate hike will impact India Inc's capex, says CII",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tRate hike by the Reserve Bank of India will increase the cost of doing business and impact capital expenditure by India Inc, industry body Confederation of Indian Industry (CII) warned on Tuesday.</p>\n<p>\n\t“The cost of doing business goes up because of the hike and it will impact capex (capital expenditure) by the industry,” <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/cii\" target=\"_blank\">CII </a>president and vice-chairman of <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=bharti+enterprises+rakesh+bharti+mittal\" target=\"_blank\">Bharti Enterprises Rakesh Bharti Mittal </a>told reporters here.</p>\n<p>\n\tHe was, however, quick to add that the normal monsoon and supply side measures will have a cooling effect on inflation and help restrict the rate hikes to just the one taken earlier this month.</p>\n<p>\n\tThe industry has also promised a capex of Rs 500 billion in the recent months, he said, adding that an uptick in capacity utilisation levels to 80 per cent can prod more industries to join the club.</p>\n<p>\n\tThe RBI may also look at cutting the recently implemented hike and returning to the “benign” rate environment once it sees comfort on the inflation front, he said.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/finance/rbi-monetary-policy-finance-ministry-says-mtm-losses-for-banks-will-rise-118060800023_1.html\" target=\"_blank\">RBI monetary policy: Finance Ministry says MTM losses for banks will rise</a></strong></p>\n\n<p>\n\tWith a focus on its core objective of keeping inflation in a targeted range in the medium term, the central bank had hiked repo rate, or the rate at which it lends to the banks, by 0.25 per cent this month.</p>\n<p>\n\tMany lenders had increased their lending rates prior to the policy review and after that, indicating a broader direction in which the rates are headed. <br></p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/finance/rbi-monetary-policy-new-norms-on-npa-little-help-for-small-units-118060800016_1.html\" target=\"_blank\">RBI monetary policy: New norms on NPA little help for small units</a></strong></p>\n\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/kotak-mahindra\" target=\"_blank\">Kotak Mahindra </a>Bank’s Managing Director and Chief Executive, Uday Kotak, who is also the president-designate for CII, said the RBI was responding to the risks that it is anticipating by keeping in mind its inflation targeting objective. He was quick to add that the apex bank had done a “balancing act” by keeping the stance of the policy at neutral which allows for any reversals in rates.</p>\n<p>\n\tMittal flagged availability of credit as a worry, stating that smaller businesses, which will get affected, are the ones that need attention at present.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/finance/rbi-monetary-policy-review-states-may-need-to-get-their-loans-rated-118060700037_1.html\" target=\"_blank\">RBI monetary policy review: States may need to get their loans rated</a></strong></p>\n\n<p>\n\tHe said 11 <a class=\"storyTags\" href=\"https://www.business-standard.com/category/finance-news-banks-1030101.htm\" target=\"_blank\">banks </a>under the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/prompt-corrective-action\" target=\"_blank\">prompt corrective action </a>(PCA) framework, which puts restrictions on normal lending activities, reduces their ability to support the needs of growth.</p>\n<p>\n\tWhen asked about the difference between 2014, when the Narendra Modi regime kicked-off with a clear majority, and now, Kotak said the “macros” were working for the benefit of the country like lower oil prices, but the “micros” within the country were tough.</p>\n<p>\n\t\"The situation has reversed now, where the macros are getting tougher through surge in oil prices, rising protectionist tendencies in the world and hardening interest rates globally but the micros are better,\" the banker said.</p>\n<p>\n\tMittal also termed the rising crude prices, which have led to analysts cutting their growth forecasts marginally, and protectionism as areas of concern for the economy.</p>\n<p>\n\tWhile expressing optimism on the jobs outlook, he said the introduction of GST and demonetisation by the government led to the loss of 1.5 million jobs, but was quick to add that there has been high job creation in the informal sector which is not being counted.</p>\n<p>\n\tMittal said the economic growth trajectory which the country is headed towards is unlikely to change even if the current Opposition forms government in 2019, pointing to the experience since 1991 where the economic policies have been maintained by the governments of various hues.</p>\n<p>\n\tCII, which made a pitch for transparency, also supported the recent changes in electoral funding norms as a \"positive\".</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "increased",
        "prior",
        "Many",
        "headed",
        "Monetary"
    ],
    "nouns": [
        "RBI",
        "Inc",
        "prior",
        "India",
        "policy",
        "rate",
        "rates",
        "hike",
        "will",
        "impact",
        "lending",
        "review",
        "direction"
    ],
    "verbs": [
        "rate",
        "hike",
        "will",
        "impact",
        "review"
    ]
}