{
    "title": "ICICI Bank: Brokerages give mixed reactions to Bakhshi's appointment as COO",
    "link": "https://www.business-standard.com/article/markets/icici-bank-brokerages-give-thumbs-up-to-bakhshi-s-appointment-as-coo-118061900256_1.html",
    "pubDate": "Wed, 20 Jun 2018 00:14:00 +0530",
    "content": "Most analysts remain bullish on the stock from a year's perspective, they see limited gains at the counter over the short to medium term",
    "contentSnippet": "Most analysts remain bullish on the stock from a year's perspective, they see limited gains at the counter over the short to medium term",
    "guid": "https://www.business-standard.com/article/markets/icici-bank-brokerages-give-thumbs-up-to-bakhshi-s-appointment-as-coo-118061900256_1.html",
    "isoDate": "2018-06-19T18:44:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "icici",
            "bank",
            "brokerages",
            "give",
            "mixed",
            "reactions",
            "to",
            "bakhshi's",
            "appointment",
            "as",
            "coo"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "ICICI Bank: Brokerages give mixed reactions to Bakhshi's appointment as COO",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tThe appointment of Sandeep Bakhshi as chief operating officer (COO) at <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/icici-bank\" target=\"_blank\">ICICI Bank </a>has evoked mixed reactions from market participants.</p>\n<p>\n\tWhile most brokerages have given a thumbs-up to the development and retained a buy call on the stock from a 12-month perspective, the domestic asset management industry isn’t enthused.</p>\n<p>\n\tSeveral domestic fund managers who spoke to Business Standard on condition of anonymity said Bakhshi could have been appointed interim chief executive officer (CEO) instead of COO. Further, the bank should provide a timeline for completing the internal probe, to be conducted by former Supreme Court judge B N Srikrishna. <br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/markets/icici-bank-icici-pru-life-trade-flat-after-top-management-reshuffle-118061900160_1.html\" target=\"_blank\">ICICI Bank, ICICI Pru Life trade flat after top management reshuffle</a></strong></p>\n<p>\n\t“These kinds of probes sometime take a lot of time. An absence of a timeline will remain an overhang on the stock,” said a chief investment officer (CIO) of a large-sized fund house, with an exposure to the stock. Fund managers add the board should also evaluate the possibility of appointing an external candidate to bring in fresh culture at the bank.</p>\n<p>\n\tG Chokkalingam, founder and managing director at Equinomics Research, agrees. “The appointment of a new COO is a positive step. However, it is still unclear whether a change of leadership is a temporary one or permanent, as there is a lot of ground that the investigation still has to cover before we reach any conclusion,” he says.</p>\n<p>\n\tThough most analysts remain bullish on the stock from a year’s perspective, they see limited gains at the counter over the short to medium term. On Tuesday, <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/icici-bank\" target=\"_blank\">ICICI Bank </a>ended with a marginal loss of 0.2 per cent on the BSE at Rs 292 levels, as compared to the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=s+p+bse+sensex\" target=\"_blank\">S&amp;P BSE Sensex </a>and S&amp;P BSE Bankex, which lost 0.7 per cent and 0.6 per cent, respectively.<br></p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/finance/low-profits-high-npas-task-cut-out-for-sandeep-bakhshi-as-icici-bank-coo-118061900030_1.html\" target=\"_blank\">Low profits, high NPAs: Task cut out for Sandeep Bakhshi as ICICI Bank COO</a></strong></p>\n<p>\n\tOver the next one year, Chokkalingam expects <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/icici-bank\" target=\"_blank\">ICICI Bank </a>to move up around 15 per cent if market conditions remain favourable. “The bank is unlocking value from selling stake in subsidiaries and other investments. Investors can buy in case the stock falls 5-10 per cent from the current levels,” he says.</p>\n<p>\n\tOver the past five years, ICICI Bank has moved up 47 per cent, underperforming the Bank Nifty, which has gained 119 per cent during this period. Even Axis Bank, which had a significant corporate loan book, has rallied 105 per cent during the same time.</p>\n<p>\n\tAnalysts at <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/jefferies\" target=\"_blank\">Jefferies </a>say the board has found safe middle ground though they feel creating a COO role is unnecessary in the long term. However, they maintain a buy rating on the stock with a price target of Rs 380, given the gradual improvement in the operating environment, coupled with the arrest of fresh NPL (non-performing loan) formation.</p>\n<p>\n\t“We value ICICI Bank at Rs 380 – value core banking at 1.6x book, and the rest at Rs 24 per share and a holding company discount of 20 per cent. Key risks include poor non-performing loans (NPL) trend and weak earnings trajectory,” write Nilanjan Karfa and Harshit Toshniwal of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/jefferies\" target=\"_blank\">Jefferies </a>in a co-authored report.</p>\n<p>\n\tAnalysts at Macquarie, too, remain positive on the stock. “The bank has managed to monetize its subsidiaries. There will be further value unlocking in terms of stake sale in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/icici-securities\" target=\"_blank\">ICICI Securities </a>and ICICI Prudential Asset Management, and listing of ICICI Home Finance over the next couple of years, all of which should be very positive for the ICICI Bank stock,” their analysts said in a recent report.</p>\n<p>\n\t\t<img align=\"left\" alt=\"ICICI Bank: Brokerages give mixed reactions to Bakhshi's appointment as COO\" class=\"imgCont\" height=\"321\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/20/full/1529445267-6573.jpg\" title=\"ICICI Bank: Brokerages give mixed reactions to Bakhshi's appointment as COO\" width=\"555\"></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "counter",
        "stock",
        "mixed",
        "Most",
        "bullish",
        "limited",
        "short",
        "medium"
    ],
    "nouns": [
        "Bank",
        "year",
        "perspective",
        "counter",
        "stock",
        "give",
        "appointment",
        "COO",
        "limited",
        "short",
        "medium",
        "term"
    ],
    "verbs": [
        "Bank",
        "counter",
        "stock",
        "give",
        "COO",
        "remain",
        "short",
        "term"
    ]
}