{
    "creator": "PTI",
    "title": "SBI is in the process of closing down another nine branches as part of rationalisation of overseas operations",
    "link": "https://www.financialexpress.com/industry/banking-finance/sbi-is-in-the-process-of-closing-down-another-nine-branches-as-part-of-rationalisation-of-overseas-operations/1222720/",
    "pubDate": "Wed, 27 Jun 2018 20:06:08 +05:30",
    "dc:creator": "PTI",
    "content": "State Bank of India (SBI) has closed six foreign branches and is in the process of closing down another nine branches as part of rationalisation of overseas operations, said Managing Director (Retail &#038; Digital Banking) Praveen Kumar Gupta.",
    "contentSnippet": "State Bank of India (SBI) has closed six foreign branches and is in the process of closing down another nine branches as part of rationalisation of overseas operations, said Managing Director (Retail & Digital Banking) Praveen Kumar Gupta.",
    "guid": "https://www.financialexpress.com/?p=1222720",
    "categories": [
        "Banking & Finance",
        "Industry"
    ],
    "isoDate": "2018-06-27T14:36:08.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "sbi",
            "is",
            "in",
            "the",
            "process",
            "of",
            "closing",
            "down",
            "another",
            "nine",
            "branches",
            "as",
            "part",
            "of",
            "rationalisation",
            "of",
            "overseas",
            "operations"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "SBI is in the process of closing down another nine branches as part of rationalisation of overseas operations",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img src=\"https://images.financialexpress.com/2018/06/sbi-4.jpg\" alt=\"SBI, state bank of india, SBI foreign branches, sbi branch,\" class=\"size-full wp-image-1222724\" srcset=\"https://images.financialexpress.com/2018/06/sbi-4.jpg 660w, https://images.financialexpress.com/2018/06/sbi-4-300x200.jpg 300w, https://images.financialexpress.com/2018/06/sbi-4-620x413.jpg 620w, https://images.financialexpress.com/2018/06/sbi-4-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> In terms of employees’ merger and posting them at right places, Gupta said it took a little bit of SBI’s time, but due to retirement of a lot of personnel as well as voluntary retirement scheme (VRS), there are currently 16,000 less employees than a year ago. (Reuters)</figure>\n\t\t\t</section></div><span>\n</span><p>State Bank of India (SBI) has closed six foreign branches and is in the process of closing down another nine branches as part of rationalisation of overseas operations, said Managing Director (Retail &amp; Digital Banking) Praveen Kumar Gupta. SBI, country’s largest lender, has operations in about 36 countries with nearly 190 branches. “Capital is generally a constraint for most of the bank sites. Obviously, you want to use your capital at the place where it is best utilised. So, as a part of our foreign branch rationalisation, we have closed about six branches already in the last two years. There are nine more branches under the process to be closed down,” Gupta told PTI in an interview.</p><span>\n</span><p>Not all the branches in the foreign locations are full-fledged offices, he said, adding that in countries like Bangladesh and South Africa there are some small branches as well as some retail branches and there is need to rationalise them. Even as the public sector banks have been mandated by the Department of Financial Services to wind-up businesses at unviable locations, SBI itself was looking to rationalise the foreign offices before the order came, Gupta said.</p><span>\n</span><p>As per the banking sector agenda approved at the PSB Manthan in November last year, public sector banks (PSBs) were asked to examine all of 216 overseas operations. “Branch rationalisation is an ongoing process. I think every branch has to justify its existence. So unless it is commercially viable, it doesn’t make sense for us to be operating particularly in foreign locations,” he added. When asked if closing down branches overseas also means having no operations in those locations, Gupta said SBI will not be exiting such countries. However, it will be closing down small branches or will be merging two-three branches into one.</p><span>\n</span><p>Besides, given the evolving regulatory environment back home, Gupta said the need to open lot many foreign offices at this point of time is not viable. “If you see globally, we are already present in the major centres. I don’t think there is any major global centre where we are not present. So the need to go to too many new countries at this point of time is not really felt.” By March this year, state-owned banks had closed down 35 overseas branches and representative offices as part of the clean and responsible banking initiative.</p><span>\n</span><p>Wherein, Bank of India, Andhra Bank, IDBI Bank and Indian Overseas Bank closed down Dubai operations, Punjab National Bank, Canara Bank and Union Bank of India shut their Shanghai offices. Bank of India also closed down operations in Yangoon and Bostwana, while Bank of Baroda and Indian Overseas Bank shut the Hong Kong branch. In addition, PSBs have also closed down various representative offices.</p><span>\n</span><p>With relation to rationalisation of domestic branches post merger of its six associate banks and the Bharatiya Mahila Bank with itself with effect from April 1, 2017, the SBI Managing Director said that as many as 1,800 branches have been rationalised during the whole year. Besides, 250 offices were also closed down that led to huge cost savings. “In terms of these 1,800 branches and 250 offices, we have seen about Rs 1,000 crore of savings only in the rental income and other expenses. Over the long run, our expectation is that this merger will definitely be beneficial for the bank,” Gupta said.</p><span>\n</span><p>In terms of employees’ merger and posting them at right places, Gupta said it took a little bit of SBI’s time, but due to retirement of a lot of personnel as well as voluntary retirement scheme (VRS), there are currently 16,000 less employees than a year ago. “We are also beginning to see all the savings which could not happen earlier due to duplication,” he added. On being asked about bank’s plans to open more branches domestically, he said there are plans to open about 300-350 branches in the current fiscal, of which almost half are to be opened in rural areas. </p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "closing",
        "closed",
        "down",
        "nine",
        "overseas",
        "six",
        "foreign",
        "Digital"
    ],
    "verbs": [
        "process",
        "down",
        "part",
        "State",
        "Bank",
        "Retail"
    ],
    "nouns": [
        "process",
        "closing",
        "down",
        "nine",
        "part",
        "rationalisation",
        "operations",
        "State",
        "Bank",
        "Banking",
        "India",
        "six",
        "Director",
        "Retail"
    ]
}