{
    "title": "India to focus on services trade at RCEP ministers meet in Tokyo",
    "link": "https://www.business-standard.com/article/economy-policy/india-to-focus-on-services-trade-at-rcep-ministers-meet-in-tokyo-118062700436_1.html",
    "pubDate": "Wed, 27 Jun 2018 13:34:00 +0530",
    "content": "Nations have increasingly got entrenched in their positions over reduction in tariffs and opening of market access",
    "contentSnippet": "Nations have increasingly got entrenched in their positions over reduction in tariffs and opening of market access",
    "guid": "https://www.business-standard.com/article/economy-policy/india-to-focus-on-services-trade-at-rcep-ministers-meet-in-tokyo-118062700436_1.html",
    "isoDate": "2018-06-27T08:04:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "india",
            "to",
            "focus",
            "on",
            "services",
            "trade",
            "at",
            "rcep",
            "ministers",
            "meet",
            "in",
            "tokyo"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "India to focus on services trade at RCEP ministers meet in Tokyo",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tIndia will be focusing on securing a strong commitment on services trade liberalization from member countries at the latest round of negotiations on the proposed Regional Comprehensive Economic Partnership (RCEP) which will see trade ministers meet on July 1.</p>\n<p>\n\tThe <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rcep\" target=\"_blank\">RCEP </a>is a proposed free-trade agreement (FTA) between the 10 Asean economies and six others with which the grouping currently has FTAs — Australia, China, India, Japan, South Korea, and New Zealand. So far, 22 rounds of negotiations have concluded apart from five minister-level meets. Commerce and Industry minister Suresh Prabhu, who is currently on a bilateral visit to Australia, is set to fly onwards to <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/tokyo\" target=\"_blank\">Tokyo </a>for the ministerial dialogue that is expected to hammer out the basic tenets of the deal.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tIndia will be looking to secure a commitment on market access in services trade from other nations, given that discussions on goods trade had deteriorated over the past two rounds, a senior Commerce Department official said before leaving for working committee level talks set to happen till Friday. India has large numbers of trained services professionals such as nurses, chartered accountants, information technology professionals and has pushed hard on easing norms for cross-border migration of professionals.</p>\n<p>\n\tAfter missing the deadline last year, members of the Asean bloc are pushing hard to create the basic framework by the end of the year but a lot of issues are yet to be finalised including the number of products over which duties will be eliminated. Negotiations, which formally began at the end of 2012, will be continued in <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/tokyo\" target=\"_blank\">Tokyo </a>through 16 categories that include conventional items such as tariff reductions and market access but also newer items such as intellectual property rights and e-commerce.</p>\n<p>\n\t<strong>Fight</strong><strong> continues on tariff reduction, market access</strong></p>\n<p>\n\tOver the past last year, India has stuck to its position of on offering differential rates for tariff reduction. \"We are willing to offer reduction on up to 86 per cent of all tariff lines with a six per cent deviation for nations with which we don't have an FTA.\" the offical mentioned above said. Under this scenario, India may offer to reduce its tariffs by 74-86 per cent of all goods, taking into account the gamut of trade with them.</p>\n<p>\n\tHowever, other nations led by New Zealand and Australia have stood their ground over a demand for reducing tariffs on up to 92 per cent of all goods. Supported by the Asean bloc, they have also stressed that the deviation proposed by India for various nations should be only one-two per cent.</p>\n<p>\n\tAlso, India had suggested a separate rate of reduction for China, which has not been taken lightly by Beijing which has continued to demand higher reductions. Last month, Chinese officials reached New Delhi for bilateral discussions on the issue that fell flat. While Beijing demanded that India reduce tariffs on 90 per cent of all goods trade if it wanted non-reciprocal market access, India refused to provide concessions on more than 75 per cent of items.</p>\n<p>\n\tIndia has been pummeled by demands to open its mega consumer market to foreign products and reduce non tariff barriers. While the government has held out on market access for agricultural items like wheat and dairy, farmers groups have already protested against any the proposal.</p>\n<p>\n\t<strong>Pushback from domestic industry</strong></p>\n<p>\n\tThere has been significant pushback against the proposed deal from domestic manufacturing and exporting sectors who point out that India's existing free trade agreements with nations such as Malaysia, Japan and South Korea have remained grossly unfavorable to India.</p>\n<p>\n\t\"With all these nations also being part of the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rcep\" target=\"_blank\">RCEP </a>which aims for further easing of import barriers and market access restrictions, there has been certain concerns from a couple of industry bodies which have asked the government to exempt specific commodities from the list of items that are currently being discussed.\" a senior official said. This includes the Aluminium Association of India, among others.</p>\n<p>\n\tOverall, India's trade deficit rose in 2017-18 for seven countries in the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/rcep\" target=\"_blank\">RCEP </a>grouping, according to a recent report by PTI.</p>\n<p>\n\tFor India, RCEP presents a decisive platform to influence its strategic and economic status in the Asia-Pacific region. Expected to be the largest regional trading bloc in the world, accounting for nearly 45 per cent of the global population with a combined gross domestic product of $21.3 trillion, it may bring the biggest economies of the region into a trading arrangement for the first time.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "meet",
        "opening",
        "entrenched"
    ],
    "nouns": [
        "trade",
        "India",
        "access",
        "market",
        "meet",
        "focus",
        "Tokyo",
        "opening",
        "reduction",
        "services"
    ],
    "verbs": [
        "trade",
        "access",
        "market",
        "meet",
        "focus"
    ]
}