{
    "creator": "Saurabh Kumar",
    "title": "Cairn’s Barmer PSC: Govt to challenge Delhi High Court verdict",
    "link": "https://www.financialexpress.com/industry/cairns-barmer-psc-govt-to-challenge-delhi-high-court-verdict/1195086/",
    "pubDate": "Wed, 06 Jun 2018 05:34:50 +05:30",
    "dc:creator": "Saurabh Kumar",
    "content": "Cairn's Barmer block was among the 10 that were granted extension under a new policy last year.",
    "contentSnippet": "Cairn's Barmer block was among the 10 that were granted extension under a new policy last year.",
    "guid": "https://www.financialexpress.com/?p=1195086",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-06T00:04:50.000Z",
    "sentiment": {
        "score": -2,
        "comparative": -0.2,
        "tokens": [
            "cairn’s",
            "barmer",
            "psc",
            "govt",
            "to",
            "challenge",
            "delhi",
            "high",
            "court",
            "verdict"
        ],
        "words": [
            "verdict",
            "challenge"
        ],
        "positive": [],
        "negative": [
            "verdict",
            "challenge"
        ]
    },
    "article": {
        "title": "Cairn’s Barmer PSC: Govt to challenge Delhi High Court verdict",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1195091\" src=\"https://images.financialexpress.com/2018/06/delhi-hc-1-6.jpg\" alt=\"Cairn's Barmer PSC, cairn, delhi hc, government, vedanta cairn\" srcset=\"https://images.financialexpress.com/2018/06/delhi-hc-1-6.jpg 660w, https://images.financialexpress.com/2018/06/delhi-hc-1-6-300x200.jpg 300w, https://images.financialexpress.com/2018/06/delhi-hc-1-6-620x413.jpg 620w, https://images.financialexpress.com/2018/06/delhi-hc-1-6-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> The order implied that the company won’t have to shell out an extra 10 percentage points as government’s share of “profit petroleum” during the extended term of the PSC between 2020 and 2030. (PTI)</figure>\n\t\t\t</section></div><span>\n</span><p>The government is likely to appeal against the <a target=\"_blank\" href=\"http://www.financialexpress.com/tag/delhi-high-court/\">Delhi High Court</a> order in favour of Cairn, an arm of Vedanta, that mandated that the initial terms must continue for the company’s extended production-sharing contract (PSC) with the government for its prolific Barmer block (RJ-ON-90/1) in Rajasthan. The order implied that the company won’t have to shell out an extra 10 percentage points as government’s share of “profit petroleum” during the extended term of the PSC between 2020 and 2030.</p><span>\n</span><p>Since the order was passed by a single-judge bench, the government may file the appeal before larger bench of the same court or go to the apex court. According to a source, the government believes that the policy it made last year supersedes the initial contract. “Whatever was the initial contract, there was a policy made thereafter and the policy is uniform for all,” said the source, asking not to be quoted.</p><span>\n</span><p>“If a policy is made, it is applicable for everyone,” said the source. The source added that all the PSCs are being extended as per the modified policy. The Delhi High Court while giving the judgment last week had directed the government of India “to formally communicate its decision extending the Rajasthan Block PSC within two weeks”.</p><span>\n</span><p>A 10-year extension of the PSC — which was due to expire on May 14, 2020 — was granted by the government in March 2017 under a modified policy, which did away with the practice of automatic extension of such contracts. However, the government added the rider of extra profit share to itself, against which the firm later moved the court.</p><span>\n</span><p>Cairn’s Barmer block was among the 10 that were granted extension under a new policy last year. The other explorers who were granted PSC extensions included GSPC, Essar, ONGC, Focus and HOEC. The Barmer block’s reserves are estimated to be 318.31 million tonnes of oil and oil equivalent of gas.<br>Vedanta, which was of the view that the PSC should be automatically extended, had sought extension for the block back in 2009 and ONGC later also concurred, considering the substantial reserves in the block.</p><span>\n</span><p>The ministry of petroleum and natural gas in the modified policy dated April 7, 2017, said, “The government share of profit petroleum during the extended period of contract shall be 10% higher for these blocks, than the share as calculated using the normal PSC provisions in any year during the extended period and hence will vary from year to year based on investment multiple (IM)/post tax rate of return (PTRR).”</p><span>\n</span><p><img class=\"alignnone size-full wp-image-1195093\" src=\"https://images.financialexpress.com/2018/06/cairn.jpg\" alt=\"\" width=\"393\" height=\"244\" srcset=\"https://images.financialexpress.com/2018/06/cairn.jpg 393w, https://images.financialexpress.com/2018/06/cairn-300x186.jpg 300w, https://images.financialexpress.com/2018/06/cairn-85x54.jpg 85w\" sizes=\"(max-width: 393px) 100vw, 393px\"></p><span>\n</span><p>The policy for the grant of extension to the production sharing contracts signed by the government of India awarding pre-New Exploration Licensing Policy exploration blocks’ was approved by the Cabinet.<br>A committee including representatives from the ministry of petroleum and natural gas, ministry of finance and NITI Aayog had made the policy. It was of the view that since by the time of PSC extension, a contractor would have already recovered cost and work would be already done as the contract period is over, and so it should be the time to share higher profit. A high-level committee formed had later ratified the decision.</p><span>\n</span><p>“Earlier, it used to be the case that extensions were done on mutually agreed terms. However, this was open to various issues given all contracts are signed for different periods with different clauses, and that is why the government decided to bring in a uniform policy,” added the source.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "High",
        "10",
        "granted",
        "new",
        "last"
    ],
    "nouns": [
        "Cairn",
        "challenge",
        "Delhi",
        "High",
        "Court",
        "verdict",
        "block",
        "10",
        "extension",
        "policy",
        "last",
        "year"
    ],
    "verbs": [
        "challenge",
        "Court",
        "block",
        "last"
    ]
}