{
    "title": "Airtel Payments Bank can’t get new customers",
    "link": "https://timesofindia.indiatimes.com/business/india-business/airtel-payments-bank-cant-get-new-customers/articleshow/64755752.cms",
    "pubDate": "Wed, 27 Jun 2018 00:08:28 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/airtel-payments-bank-cant-get-new-customers/articleshow/64755752.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64755752.cms\" /></a>Airtel’s Payments Bank been asked to stop registrations of new customers by the RBI, which has initiated an investigation into the company’s affairs, after it was caught signing up subscribers without their consent.",
    "contentSnippet": "Airtel’s Payments Bank been asked to stop registrations of new customers by the RBI, which has initiated an investigation into the company’s affairs, after it was caught signing up subscribers without their consent.",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/airtel-payments-bank-cant-get-new-customers/articleshow/64755752.cms",
    "isoDate": "2018-06-27T00:08:28.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "airtel",
            "payments",
            "bank",
            "can’t",
            "get",
            "new",
            "customers"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Airtel Payments Bank can’t get new customers",
        "content": "<div class=\"section1\"><div class=\"Normal\"><span>NEW DELHI: Airtel’s Payments </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Bank\">Bank</a><p> been asked to stop registrations of new customers by the RBI, which has initiated an investigation into the company’s affairs, after it was caught signing up subscribers without their consent. The action follows a Rs 5-crore penalty that the regulator had slapped on the company in March for violating operating guidelines and Know Your Customer (KYC) norms.\n\n</p><p>The action by the RBI signals mounting regulatory pressure for the telecom operator, which in December last year was also barred from using e-KYC (e-verification) by Aadhaar body UIDAI for surreptitiously on-boarding customers to its bank, while carrying out Aadhaar verification.\n</p><span>The ban on carrying out eKYC — a faster way to register customers — still stays even after the company had paid a penalty of Rs 2.5 crore to UIDAI and apologised for the “unfortunate episode”. “Airtel has been asked not to accept new customers as the RBI investigates the matter. The central bank has taken a serious view of the lapse,” a top source told TOI.\n</span><br><span>\n</span><br><span>When contacted, an </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Airtel\">Airtel</a><span> spokesperson said, “The queries raised by you are old matters that are already in the public domain. Airtel Payment Bank has not been on boarding new customers as per RBI directive since January 5, 2018. We have already shared all the details relating to our compliance with the authorities and are hopeful of a resolution at the earliest.”\n</span><br><span>\n</span><br><span>The RBI had slapped the fine after scrutinising Airtel Payments Bank’s documents relating to opening of accounts, and concluded that it had contravened “the operating guidelines for payments banks and directions issued by RBI on KYC norms.”\n</span><br><span>\n</span><br><span>The issue of unsolicited accounts had surfaced last year after government’s LPG subsidy worth nearly Rs 200 crore landed in </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Airtel-Payments-Bank\">Airtel Payments Bank</a><span> accounts of beneficiaries instead of their regular bank accounts. TOI was the first to report on the UIDAI investigation in its edition dated November 30 last year.\n</span><br><span>\n</span><p>Around 30 lakh customers were impacted by the move, with many complaining that they had not signed up for Airtel Payments Bank, but had only initiated verification of their number with Aadhaar.\n</p><span>\n</span></div></div>"
    },
    "adjectives": [
        "10",
        "left",
        "top",
        "right",
        "new"
    ],
    "nouns": [
        "consent",
        "india",
        "company",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo",
        "investigation",
        "cant",
        "stop",
        "Bank",
        "bank",
        "RBI",
        "signing",
        "affairs"
    ],
    "verbs": [
        "consent",
        "company",
        "border",
        "align",
        "style",
        "top",
        "right",
        "cant",
        "stop",
        "Bank",
        "bank"
    ]
}