{
    "creator": "PTI",
    "title": "TRAI in final stage of slapping penalty on operators who have not met call drop norms in March quarter",
    "link": "https://www.financialexpress.com/industry/trai-in-final-stage-of-slapping-penalty-on-operators-who-have-not-met-call-drop-norms-in-march-quarter/1222639/",
    "pubDate": "Wed, 27 Jun 2018 18:39:18 +05:30",
    "dc:creator": "PTI",
    "content": "Telecom regulator Trai is in the final stage of slapping penalty on operators who have not met call drop norms for the March quarter, its chairman R S Sharma said.",
    "contentSnippet": "Telecom regulator Trai is in the final stage of slapping penalty on operators who have not met call drop norms for the March quarter, its chairman R S Sharma said.",
    "guid": "https://www.financialexpress.com/?p=1222639",
    "categories": [
        "Industry"
    ],
    "isoDate": "2018-06-27T13:09:18.000Z",
    "sentiment": {
        "score": -3,
        "comparative": -0.15789473684210525,
        "tokens": [
            "trai",
            "in",
            "final",
            "stage",
            "of",
            "slapping",
            "penalty",
            "on",
            "operators",
            "who",
            "have",
            "not",
            "met",
            "call",
            "drop",
            "norms",
            "in",
            "march",
            "quarter"
        ],
        "words": [
            "drop",
            "penalty"
        ],
        "positive": [],
        "negative": [
            "drop",
            "penalty"
        ]
    },
    "article": {
        "title": "TRAI in final stage of slapping penalty on operators who have not met call drop norms in March quarter",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img src=\"https://images.financialexpress.com/2018/06/trai-1.jpg\" alt=\"TRAI, trai call drop, call drop, call drop issue, Telecom Regulatory Authority of India\" class=\"size-full wp-image-1222644\" srcset=\"https://images.financialexpress.com/2018/06/trai-1.jpg 660w, https://images.financialexpress.com/2018/06/trai-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/trai-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/trai-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Trai had tightened the rules and asked players to abide by its new quality of service benchmarks from October 1, 2017. </figure>\n\t\t\t</section></div><span>\n</span><p>Telecom regulator Trai is in the final stage of slapping penalty on operators who have not met call drop norms for the March quarter, its chairman R S Sharma said. Maintaining its watch on service quality in the sector, the Telecom Regulatory Authority of India (Trai) had tightened the rules and asked players to abide by its new quality of service benchmarks from October 1, 2017. </p><span>\n</span><p>Two quarters of assessment has been completed since the new norms came into force. “For the quarter of January to March, we are in the final stage of issuing the penalty,” Sharma told PTI. He said that showcause notices have already been issued to erring operators and 21 days have been given for submitting their responses. He. however, did not identify the operators, saying Trai did not want to name and shame any player.</p><span>\n</span><p>The assessment is based on network performance of operators between January and March, measured against the Trai’s new service quality benchmarks. The “financial disincentive” has already been levied for December 2017 quarter, Sharma added. Under new rules, call drops are measured at mobile tower level instead of telecom circle level. Trai was of the view that average calculated at circle level may hide many issues.</p><span>\n</span><p>Trai proposed financial disincentive in the range of Rs 1-5 lakh in a graded penalty system depending on the performance of a network, with stringent fines for repeat violations under the new Quality of Service (QoS) rules. However, there is cap of Rs 10 lakh on financial disincentive.</p><span>\n</span><p>Also, earlier rules did not address temporary issues in telecom network like non-functioning of mobile towers or geographical issues like network quality in an underserved town. Many other parameters too were tightened, and the regulator also fixed benchmark for radio-link time out technology (RLT) — purportedly used by operators for masking call drops. </p><span>\n</span><p>When contacted, industry body COAI’s director-general, Rajan Mathews said new QoS rules are among the most stringent globally, and that telecom operators in India have make required investments to ensure compliance with the norms.</p><span>\n</span><p>“In the December quarter, many operators were marginally non-compliant in some circles…We believe that major players are compliant with the new norms now,” Mathews said.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "final"
    ],
    "nouns": [
        "final",
        "stage",
        "penalty",
        "call",
        "drop",
        "March",
        "quarter",
        "regulator",
        "chairman",
        "R",
        "Telecom",
        "S"
    ],
    "verbs": [
        "stage",
        "call",
        "drop",
        "March",
        "quarter",
        "chairman"
    ]
}