{
    "title": "What exactly would be the kharif MSP of 2018-19 remains a big question",
    "link": "https://www.business-standard.com/article/economy-policy/what-exactly-would-be-the-kharif-msp-of-2018-19-remains-a-big-question-118062700614_1.html",
    "pubDate": "Wed, 27 Jun 2018 23:48:00 +0530",
    "content": "The provision of consultation with the states has further created confusion on MSP",
    "contentSnippet": "The provision of consultation with the states has further created confusion on MSP",
    "guid": "https://www.business-standard.com/article/economy-policy/what-exactly-would-be-the-kharif-msp-of-2018-19-remains-a-big-question-118062700614_1.html",
    "isoDate": "2018-06-27T18:18:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.07692307692307693,
        "tokens": [
            "what",
            "exactly",
            "would",
            "be",
            "the",
            "kharif",
            "msp",
            "of",
            "2018-19",
            "remains",
            "a",
            "big",
            "question"
        ],
        "words": [
            "big"
        ],
        "positive": [
            "big"
        ],
        "negative": []
    },
    "article": {
        "title": "What exactly would be the kharif MSP of 2018-19 remains a big question",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\tIt’s almost the end of June and the central government is yet to announce the minimum support prices (MSPs) for kharif crops for the 2018-19 marketing season starting next month. Sources said the bone of contention is prices fixed for a few crops and their impact on inflation.</p>\n<p>\n\tThough there is no obligation on the part of the government to announce them by any date, MSPs have acquired added significance this year with the Centre promising the prices 50 per cent over the cost of production from this season.</p>\n<p>\n\tIn reply to a question in Parliament a few years ago, the central government accepted that though the kharif sowing season starts around May, sometimes there is a delay in the announcement of MSPs due to inter-ministerial consultation and soliciting replies from state governments on the Commission for Agriculture Costs and Prices’s (CACP’s) MSP recommendations.</p>\n<p>\n\tThe explanation seems logical as there are lots of other ancillary issues attached with the MSP. These include procurement and incidental expenditure for wheat and rice, export market scenario and inter-crop price parity, and therefore, a broader consultation between various inter-related ministries, be it commerce, finance and others, is done before the final proposal is sent to the Cabinet for approval.<br></p><p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/new-msp-at-rs-29-kg-for-sugar-mills-still-not-enough-for-cane-arrears-118060701569_1.html\" target=\"_blank\">New MSP at RS 29/kg for sugar mills still not enough for cane arrears</a></strong></p>\n<p>\n\tState governments, too, are taken on board for their views on MSPs recommended by the CACP. Practically, of the 23 notified crops for which MSPs are declared, actual procurement by the government had taken place in just two-three crops in a limited area.</p>\n<p>\n\t\t<img align=\"left\" alt=\"What exactly would be the kharif MSP of 2018-19 remains a big question\" class=\"imgCont\" height=\"571\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/28/full/1530124834-5082.jpg\" title=\".\" width=\"350\"></p>\n\tThe provision of consultation with the states has further created confusion on the MSP. Some state officials said they received a list of kharif MSP, which showed a Rs 80 per quintal increase in the case of common grade paddy and a similar hike in the case of Grade ‘A’ paddy.\n<p>\n\tIn pulses, the MSP for toor is proposed to be increased by Rs 400 a quintal to Rs 5,850 a quintal in 2018-19, that of moong by Rs 350 a quintal to Rs 5,925 a quintal, and that of urad by Rs 400 a quintal to Rs 5,800 a quintal. In the case of long staple cotton, the MSP is proposed to be raised by Rs 160 a quintal to Rs 4,180, while in case of medium staple cotton it is proposed to be raised to Rs 4,480 a quintal.</p>\n<p>\n\tHowever, experts said if these are the final MSPs for the 2018-19 kharif season, then it remains to be seen what happens to the promise of providing a MSP which is 1.5 times the cost of production.<br></p>\n<!-- INPAGE_BANNER -->\n\t<p>\n\t\t<strong class=\"read_more\">ALSO READ: <a href=\"https://www.business-standard.com/article/economy-policy/kharif-sowing-11-lower-as-monsoon-delayed-over-central-north-india-118062200734_1.html\" target=\"_blank\">Kharif sowing 9.7% lower as monsoon delayed over Central, North India</a></strong></p>\n<p>\n\tFood policy expert Vijay Sardhana recently showed that if the Centre honestly calculates MSPs of kharif crops in 2018-19 season to fix them at 50 per cent over the cost of production, then for common paddy the kharif MSP should be not less than Rs 1,759 a quintal, for bajra it should be not less than Rs 1,459 a quintal, and for arhar it should be somewhere around Rs 5,226 a quintal. These MSPs of 50 per cent over cost of production have been calculated by factoring in a CPI inflation of 5 per cent over A2+FL cost of 2017-18.</p>\n<p>\n\tNow, what exactly would be the kharif MSP of 2018-19 remains a big question.</p>\n<p>\n\tNot only farmers but bond and money market players are also eagerly awaiting the Centre’s MSP announcement, as any sharp hike in MSPs could push up food inflation, leading to more hike in interest rates by the RBI in its next policy meeting in August.</p>\n<p>\n\t“Modi’s move (on MSPs) will be key to the central bank’s next rate decision,” JPMorgan Chase &amp; Co said in a note.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "19",
        "big",
        "further"
    ],
    "nouns": [
        "provision",
        "consultation",
        "confusion",
        "19",
        "remains",
        "question"
    ],
    "verbs": [
        "provision",
        "question",
        "further"
    ]
}