{
    "creator": "Sarthak Ray",
    "title": "AI on the future: Artificial Intelligence add ~$1 billion to India’s GVA by 2035, says NITI Aayog",
    "link": "https://www.financialexpress.com/economy/ai-on-the-future-artificial-intelligence-add-1-billion-to-indias-gva-by-2035-says-niti-aayog/1195078/",
    "pubDate": "Wed, 06 Jun 2018 05:20:49 +05:30",
    "dc:creator": "Sarthak Ray",
    "content": "Against such a backdrop, the NITI Aayog’s recently published working paper, National Strategy for Artificial Intelligence #AIforAll, presents a comprehensive AI vision for India. ",
    "contentSnippet": "Against such a backdrop, the NITI Aayog’s recently published working paper, National Strategy for Artificial Intelligence #AIforAll, presents a comprehensive AI vision for India.",
    "guid": "https://www.financialexpress.com/?p=1195078",
    "categories": [
        "Economy"
    ],
    "isoDate": "2018-06-05T23:50:49.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "ai",
            "on",
            "the",
            "future",
            "artificial",
            "intelligence",
            "add",
            "1",
            "billion",
            "to",
            "india’s",
            "gva",
            "by",
            "2035",
            "says",
            "niti",
            "aayog"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "AI on the future: Artificial Intelligence add ~$1 billion to India’s GVA by 2035, says NITI Aayog",
        "content": "<div class=\"main-story-content\" itemprop=\"articleBody\"><span>\n\t\t\t\t\t</span><div class=\"custom-caption\"><section class=\"imgsection alignnone\"><figure><img class=\"size-full wp-image-1195083\" src=\"https://images.financialexpress.com/2018/06/artificial-intelligence-1.jpg\" alt=\"Artificial Intelligence, AI, India's GVA 2035, NITI Aayog, AI adoption\" srcset=\"https://images.financialexpress.com/2018/06/artificial-intelligence-1.jpg 660w, https://images.financialexpress.com/2018/06/artificial-intelligence-1-300x200.jpg 300w, https://images.financialexpress.com/2018/06/artificial-intelligence-1-620x413.jpg 620w, https://images.financialexpress.com/2018/06/artificial-intelligence-1-401x267.jpg 401w\" sizes=\"(max-width: 660px) 100vw, 660px\"> Most major economies are either spelling out ambitious policies on artificial intelligence (AI)-led growth or, absent a vision statement, are letting their investment in AI do the talking.</figure>\n\t\t\t</section></div><span>\n</span><p>Most major economies are either spelling out ambitious policies on artificial intelligence (AI)-led growth or, absent a vision statement, are letting their investment in AI do the talking. For instance, China, which has the most comprehensive national plan, is pumping in $7 billion through 2030, with a $150-billion AI industry in mind by that year; the US, which has no specific AI policy, is funding AI research through the Defense Advanced Research Projects Agency and Intelligence Advanced Research Projects Activity while its academia and private sector are pushing the frontiers of AI research.</p><span>\n</span><p>Against such a backdrop, the NITI Aayog’s recently published working paper, National Strategy for Artificial Intelligence #AIforAll, presents a comprehensive AI vision for India. AI adoption, NITI Aayog says citing Accenture data, could add $957 billion to the $6,397 billion gross value added projected for 2035—a 15% boost. The NITI Aayog paper identifies five focus areas where the gains could drive not just growth but greater inclusion — healthcare, agriculture, education, urban-/smart-city infrastructure, and transportation and mobility.</p><span>\n</span><p>For instance, while Andhra Pradesh is already using AI to predict incidence of school dropouts — this can help district education authorities draw up and execute necessary intervention — the NITI paper talks about how algorithms could pick from detailed datasets of annotated images of oncopathology slides to improve cancer care through early detection even though India has just about 500 expert oncopathologists, that too concentrated in the large cities.</p><span>\n</span><p>At present, however, India’s capacity for driving AI research to fulfil the NITI vision is limited. The country produced some 2.7 million STEM graduates in 2016, but, in terms of citable AI research produced in 2010-16, it was a distant fifth, behind China, the US, Japan and the UK and just ahead of Germany and France — all these countries, except China, have smaller STEM populations than India.</p><span>\n</span><p>The NITI paper notes that private sector tech companies, too, have not been able to develop significant research competence. While interdisciplinary competence is needed to realise AI gains, India is sorely lacking here. The crunch will worsen over the next few years — even as India’s demand for AI and machine learning specialists will likely rise by 60% rise just this year, the country could face a demand-supply gap of 2 lakh data analytics professionals by 2020.</p><span>\n</span><p>AI efficacy is contingent upon large amounts of high-quality data — thus, AI adoption will have to address data security/privacy and ethical data-use concerns as also remove biases that exist within human generated datasets, NITI has warned.</p><span>\n</span><p>The paper proposes a two-tiered framework for promoting AI research, involving the creation of COREs or Centres of Research Excellence in AI and International Centres for Transformational Artificial Intelligence will provide the ecosystem for application based technology development and deployment. This is to be industry-led, since it will focus on commercialisation of research output and developing India as an AI solutions hub for developing countries.</p><span>\n\t\t\t\t</span></div><div class=\"common-bottom-text\"><p>Get live <a href=\"https://www.financialexpress.com/market/stock-market/\" target=\"_blank\">Stock Prices</a> from BSE and NSE and latest NAV, portfolio of <a href=\"https://www.financialexpress.com/mutual-funds-india/\" target=\"_blank\">Mutual Funds</a>, calculate your tax by <a href=\"https://www.financialexpress.com/income-tax-calculator/\" target=\"_blank\">Income Tax Calculator</a>, know market’s <a href=\"https://www.financialexpress.com/market/stock-market/nse-top-gainers/\" target=\"_blank\">Top Gainers</a>, <a href=\"http://www.financialexpress.com/market/stock-market/nse-top-losers/\" target=\"_blank\">Top Losers</a> &amp; <a href=\"https://www.financialexpress.com/mutual-funds-india/equity-funds/\" target=\"_blank\">Best Equity Funds</a>. Like us on <a href=\"https://www.facebook.com/thefinancialexpress\" target=\"_blank\">Facebook</a> and follow us on <a href=\"https://twitter.com/FinancialXpress\" target=\"_blank\">Twitter</a>.</p></div>"
    },
    "adjectives": [
        "comprehensive",
        "billion",
        "future",
        "Artificial",
        "published",
        "working",
        "National"
    ],
    "nouns": [
        "India",
        "comprehensive",
        "billion",
        "Strategy",
        "AI",
        "future",
        "add",
        "Intelligence",
        "backdrop",
        "working",
        "paper",
        "National",
        "vision"
    ],
    "verbs": [
        "add",
        "paper"
    ]
}