{
    "title": "US Fed likely to hike rates by 25 bps on Wednesday, say analysts",
    "link": "https://www.business-standard.com/article/markets/us-fed-likely-to-hike-rates-by-25-bps-this-week-say-analysts-118061300104_1.html",
    "pubDate": "Wed, 13 Jun 2018 06:40:00 +0530",
    "content": "Most analysts expect the US central bank to hike rates at least twice this year - in June and in September.",
    "contentSnippet": "Most analysts expect the US central bank to hike rates at least twice this year - in June and in September.",
    "guid": "https://www.business-standard.com/article/markets/us-fed-likely-to-hike-rates-by-25-bps-this-week-say-analysts-118061300104_1.html",
    "isoDate": "2018-06-13T01:10:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "us",
            "fed",
            "likely",
            "to",
            "hike",
            "rates",
            "by",
            "25",
            "bps",
            "on",
            "wednesday",
            "say",
            "analysts"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "US Fed likely to hike rates by 25 bps on Wednesday, say analysts",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\t\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/us-federal-reserve\" target=\"_blank\">US Federal Reserve </a>(US Fed) is likely to stay on course and hike interest rates by 25 basis points (bps) in its upcoming meeting on June 12 &amp; 13. The possible hike in interest rates comes in the backdrop of elevated crude oil prices, global trade war fears and a firm dollar.</p>\n<p>\n\tMost analysts expect the <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=us+central+bank\" target=\"_blank\">US central bank </a>to hike rates at least twice this year – in June and in September, and follow it up with a couple of more hikes in calendar year 2019 (CY19). The Federal Reserve raised its policy interest rate last in march 2018, and noted economic growth was strengthening.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tHere is a quick compilation of what leading global market experts expect from the <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/us-fed\" target=\"_blank\">US Fed </a>this week:</p>\n<p>\n\t<strong>Chris Wood, managing director, equity strategist at CLSA</strong></p>\n<p>\n\tThe latest US employment data will not have caused Fed Chairman Jerome Powell to move off his gradual tightening agenda. The double whammy of monetary tightening and Fed balance sheet contraction remains the main risk for US equities, and therefore for global equities, and it should not be forgotten that quanto tightening accelerates as time progresses. Still monetary tightening is not the only risk. The past week and more has seen renewed negative focus on the “trade war” front.</p>\n<p>\n\tWith the dollar still strong, the message sent out by Fed chairman Jerome Powell at the next FOMC meeting in mid-June will be more important than usual. GREED &amp; fear’s base case is that Powell will maintain a tougher line than his predecessors in the face of recent market “volatility”, in terms of a continuing commitment to gradual tightening. Such an outcome means that the best way to hedge long equity positions globally remains to be short credit.</p>\n<p>\n\t<strong>Philip Marey, Senior US Strategist, Rabobank International</strong></p>\n<p>\n\tThe key question for the <a class=\"storyTags\" href=\"https://www.business-standard.com/markets\" target=\"_blank\">markets </a>is whether the dot plot still implies three hikes for this year or an upward shift to four hikes. Our current Fed call is three hikes this year (March, June and September) and an upward shift in the dot plot would in itself not change our call. As long as the Phillips curve refuses to materialize, we continue to have our doubts about the Fed’s hiking plans.</p>\n<p>\n\tChanges in the FOMC statement could reflect the Committee’s assessment of the economy and inflation and the Fed’s new dilemmas now that the policy rate is rapidly approaching restrictive territory. It might be soon appropriate to revise the forward guidance about the fed funds rate remaining, for some time, below levels that are expected to prevail in the longer run or to modify the language about the accommodative nature of the stance of monetary policy.</p>\n<p>\n\tThe intended June hike of 25 bps may be accompanied by a 20 bps increase in the interest on excess reserves (IOER) because of technical reasons. However, this likely means that the effective fed funds rate will rise by 20 bps as well, instead of 25 bps. So June’s hike could be a ‘hike light’.</p>\n<p>\n\t<strong>Geoff Lewis, senior strategist for Asia at Manulife Asset Management</strong></p>\n<p>\n\tThe Fed remains committed to a gradual path of tightening. We expect them to hold closely to this, as GDP growth is expected to strengthen in coming quarters while unemployment at sub-4% remains below the Fed's estimate of the full-employment level. The Fed will not wish to be seen to be over-relaxed at this point.  We thus expect two more rate hikes this year in June and September followed by another two in 2019.</p>\n<p>\n\tWe think there is quite a high bar to a more aggressive tightening schedule than this, unless core inflation accelerates sharply, which is not our view. A growing number of Fed officials are now saying that a flattening yield curve does in fact matter. With so many US investors focused on yield curve inversion as a recession signal, the Fed will not wish to tempt fate by testing their belief. The flatness of the Treasury yield curve may act as a constraint against a more aggressive Fed tightening schedule, given the 2-10 year spread is once more close to 40bps.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "likely",
        "25",
        "Most",
        "central",
        "least"
    ],
    "nouns": [
        "June",
        "US",
        "Fed",
        "Wednesday",
        "bank",
        "hike",
        "rates",
        "25",
        "bps",
        "say",
        "central",
        "least",
        "year",
        "September"
    ],
    "verbs": [
        "bank",
        "hike",
        "say",
        "expect"
    ]
}