{
    "title": "Singaporean FM asks NSE, SGX to resolve differences, serve investors",
    "link": "https://www.business-standard.com/article/markets/singaporean-fm-asks-nse-sgx-to-resolve-differences-serve-investors-118062700679_1.html",
    "pubDate": "Wed, 27 Jun 2018 16:51:00 +0530",
    "content": "Early June, the SGX responded by launching an alternative that led NSE to move the Bombay High Court",
    "contentSnippet": "Early June, the SGX responded by launching an alternative that led NSE to move the Bombay High Court",
    "guid": "https://www.business-standard.com/article/markets/singaporean-fm-asks-nse-sgx-to-resolve-differences-serve-investors-118062700679_1.html",
    "isoDate": "2018-06-27T11:21:00.000Z",
    "sentiment": {
        "score": 2,
        "comparative": 0.2,
        "tokens": [
            "singaporean",
            "fm",
            "asks",
            "nse",
            "sgx",
            "to",
            "resolve",
            "differences",
            "serve",
            "investors"
        ],
        "words": [
            "resolve"
        ],
        "positive": [
            "resolve"
        ],
        "negative": []
    },
    "article": {
        "title": "Singaporean FM asks NSE, SGX to resolve differences, serve investors",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\tSingaporean finance minister Heng Swee Keat on Wednesday asked the sparring NSE and <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/singapore-exchange\" target=\"_blank\">Singapore Exchange </a>to resolve their differences over derivatives trading to help widen and deepen investor interest in both the <a class=\"storyTags\" href=\"https://www.business-standard.com/markets\" target=\"_blank\">markets.</a></p>\n<p>\n\t\"I think we should see how we can widen and deepen that investor interest...I look forward to closer cooperation between both sides, to resolve whatever differences of views they may have,\" Keat told reporters here.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tIt can be noted that the NSE and SGX have been in a tussle since early this year after the largest domestic bourse and others decided to stop licensing their indices to foreign bourses from this August.</p>\n<p>\n\tEarly June, the SGX responded by launching an alternative that led NSE to move the Bombay High Court.</p>\n<p>\n\tEarlier this month, a court-appointed arbitrator had asked NSE to continue trading the SGX Nifty contracts beyond August.</p>\n<p>\n\t\"The subject is being discussed very closely by parties on both the sides, and I am optimistic that some solutions can be found so that each side's concerns are addressed,\" Keat said, adding the interest in the Indian stock market should be looked at as a \"positive sign\".</p>\n<p>\n\t\"The way in which finance can be channelled to productive use by properly managing risks is very important to drive economic growth,\" he said.</p>\n<p>\n\tKeat also made a pitch for regulatory certainty, especially when it comes to long-term infra projects saying ensuring it can also lower the cost of capital.</p>\n<p>\n\t\"I think government plays a very important role in setting up a set of rules and regulations that provide for certainty. Since infra projects have very long gestation periods, it is important that there is stable rules and regulations in place to govern them,\" Keat said.</p>\n<p>\n\tAsked about the regulatory troubles faced by Indian financial entities operating in Singapore, Keat said looking at risk management is an important job of the regulators and it is essential that all entities, including bank branches, adhere to the rules issued by its Monetary Authority.</p>\n<p>\n\t\"We want to make sure that the bank is profitable and at the same time stays safe too,\" he said.</p>\n<p>\n\tKeat held a closed door meeting with the captains of industry, who included HDFC's Deepak Parekh, top corporate lawyer Zia Mody, TCS chief financial officer V Ramakrishnan and former bureaucrat Vinod Rai, among others.</p>\n<p>\n\tDuring the meeting, Keat expressed hope that the third round of the Comprehensive Economic Cooperation Agreement review negotiations will not take as long as the earlier reviews that took seven years.</p>\n<p>\n\tAmid the rising protectionist tendencies, he pitched strongly against closing borders and advocated addressing of concerns through social,educational, distributional policies.</p>\n<p>\n\tKeat also stressed a lot on increasing bilateral engagements and offered help especially for startups and fintechs players.</p>\n<p>\n\tHe said his country is setting up innovation corridors between startup hotspots in the two countries and said the first such hotspot was opened in Andhra earlier this year.</p>\n<p>\n\tIt will be organising meetings between startups from India and Singapore in Bengaluru and New Delhi for co- innovation under the Singapore-India Incubation Programme, Keat said.</p>\n<p>\n\tThe city-state is also interested in collaborating with India on smart city solutions, he said.<br></p><p id=\"auto_disclaimer\">(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "High",
        "Early",
        "Singaporean",
        "alternative"
    ],
    "nouns": [
        "resolve",
        "Court",
        "Bombay",
        "High",
        "move",
        "launching",
        "serve",
        "Singaporean",
        "FM",
        "June",
        "alternative",
        "led"
    ],
    "verbs": [
        "resolve",
        "Court",
        "move",
        "serve"
    ]
}