{
    "title": "Infra, realty firms face refinancing test of Rs 3-4 trillion: Ind-Ra",
    "link": "https://www.business-standard.com/article/companies/infra-realty-firms-face-refinancing-test-of-rs-3-4-trillion-ind-ra-118061901078_1.html",
    "pubDate": "Wed, 20 Jun 2018 01:12:00 +0530",
    "content": "According to the India Ratings and Research, companies rated 'BBB' and below will have a total refinancing, and working capital renewal need of Rs 1.4 trillion to Rs 1.7 trillion in the current fiscal",
    "contentSnippet": "According to the India Ratings and Research, companies rated 'BBB' and below will have a total refinancing, and working capital renewal need of Rs 1.4 trillion to Rs 1.7 trillion in the current fiscal",
    "guid": "https://www.business-standard.com/article/companies/infra-realty-firms-face-refinancing-test-of-rs-3-4-trillion-ind-ra-118061901078_1.html",
    "isoDate": "2018-06-19T19:42:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "infra",
            "realty",
            "firms",
            "face",
            "refinancing",
            "test",
            "of",
            "rs",
            "3-4",
            "trillion",
            "ind-ra"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "Infra, realty firms face refinancing test of Rs 3-4 trillion: Ind-Ra",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>A number of <a class=\"storyTags\" href=\"https://www.business-standard.com/companies\" target=\"_blank\">companies </a>in infrastructure and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=real+estate+sectors\" target=\"_blank\">real estate sectors </a>run the highest risk of not getting refinancing on their working capital and other loans, according to <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/india-ratings-and-research\" target=\"_blank\">India Ratings and Research </a>(Ind-Ra).</p><p>\nThese <a class=\"storyTags\" href=\"https://www.business-standard.com/companies\" target=\"_blank\">companies </a>are lower in the investment grade ratings, whereas their debt on books is also relatively high. Entities rated ‘BBB’ and below historically have faced challenges in raising funds.</p><p>\nAccording to the agency, <a class=\"storyTags\" href=\"https://www.business-standard.com/companies\" target=\"_blank\">companies </a>rated ‘BBB’ and below will have a total refinancing, and <a class=\"storyTags\" href=\"https://www.business-standard.com/search?type=news&amp;q=working+capital+renewal\" target=\"_blank\">working capital renewal </a>need of Rs 1.4 trillion to Rs 1.7 trillion in the current fiscal. Overall, refinancing pressure could be felt for loans amounting to Rs 3-4 trillion as liquidity tightens in the system, Ind-Ra said in a report. However, “given the modest asset covers available, access to incremental debt is likely to remain constrained,” Ind-Ra said.</p><div><span>\n\t</span><img align=\"left\" alt=\"chart\" class=\"imgCont\" height=\"329\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2018-06/20/full/1529437238-5332.jpg\" title=\"chart\" width=\"498\"></div>\n<br>It is not only that lower rated companies are feeling the squeeze. Relatively higher rated companies are not better off either. According to the rating agency, “the rising risk aversion in the market indicates that sourcing credit for issuers who are rated below ‘A’ category is increasingly becoming difficult.”<br>\n<!-- INPAGE_BANNER -->\n<br>\n <br>The agency’s recent analysis of the top 500 corporate borrowers, comprising 78 per cent of the overall banking system’s corporate exposure, indicated that around Rs 7.60 trillion debt is on the books of the non-public sector entities rated in ‘BBB’ category and below (sample set) or have no rating outstanding. Out of this, cash flow stress would be high for exposures of about Rs 4.71 trillion.<p>\n“In the absence of favourable liquidity/market conditions, refinance pressure (working capital renewals and replenishing run down of existing debt) could impact Rs 3-4 trillion exposures. These corporates would remain reliant on banks for refinancing, given that in most of these cases, free cash flows would be inadequate for debt repayments,” the rating agency said.</p><p>\nIt is going to be a difficult period for the companies as “dependence on market-based financing is not free from headwinds, given the inadequate depth and skewed preference for investments.”<br>“Against the backdrop of a sectoral cap for mutual fund investments, crowding out by large borrowers would reduce investor appetite for funding medium to small borrowers,” it said.</p><p>\nThe benefits of the Insolvency and Bankruptcy Code and the ability of issuers rated below ‘A’ category to easily access capital markets will take time, as the system deepens and bond holders are in a better position to assess the information asymmetry and factor the potential recoveries under the new code, it said. While non-banking finance companies (NBFCs) are emerging as an important source for funding to the corporates, they themselves are dependent on bank funding. Here also, funding is getting squeezed.</p><p>\nAccording to the rating agency, 50-60 per cent of ‘AA’ category of <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nbfcs\" target=\"_blank\">NBFCs </a>raises its resources from banks. Lower rated <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nbfcs\" target=\"_blank\">NBFCs </a>are even more reliant on bank funding.</p><p>\n“Some of the banks could approach sectoral limits on exposure towards <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/nbfcs\" target=\"_blank\">NBFCs.</a> Consequently, the extent to which NBFCs would capitalise on these opportunities and fill the credit gap would also be subject to scheduled commercial banks’ appetite for the overall credit and for the NBFC sector,” the rating agency said.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "working",
        "current",
        "fiscal",
        "According",
        "capital",
        "trillion",
        "total"
    ],
    "nouns": [
        "India",
        "will",
        "working",
        "current",
        "realty",
        "Research",
        "capital",
        "face",
        "renewal",
        "need",
        "test",
        "trillion",
        "Ra",
        "total"
    ],
    "verbs": [
        "will",
        "Research",
        "face",
        "need",
        "test",
        "total"
    ]
}