{
    "title": "HDFC Bank gets capital adequacy boost with Cabinet nod for Rs 240 bn FDI",
    "link": "https://www.business-standard.com/article/economy-policy/hdfc-bank-gets-capital-adequacy-boost-with-cabinet-nod-for-rs-240-bn-fdi-118061300978_1.html",
    "pubDate": "Wed, 13 Jun 2018 18:01:00 +0530",
    "content": "Even with this additional FDI, foreign equity in HDFC Bank would continue to remain within the mandatory cap of 74 per cent.",
    "contentSnippet": "Even with this additional FDI, foreign equity in HDFC Bank would continue to remain within the mandatory cap of 74 per cent.",
    "guid": "https://www.business-standard.com/article/economy-policy/hdfc-bank-gets-capital-adequacy-boost-with-cabinet-nod-for-rs-240-bn-fdi-118061300978_1.html",
    "isoDate": "2018-06-13T12:31:00.000Z",
    "sentiment": {
        "score": 1,
        "comparative": 0.07142857142857142,
        "tokens": [
            "hdfc",
            "bank",
            "gets",
            "capital",
            "adequacy",
            "boost",
            "with",
            "cabinet",
            "nod",
            "for",
            "rs",
            "240",
            "bn",
            "fdi"
        ],
        "words": [
            "boost"
        ],
        "positive": [
            "boost"
        ],
        "negative": []
    },
    "article": {
        "title": "HDFC Bank gets capital adequacy boost with Cabinet nod for Rs 240 bn FDI",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t<p>\n\tIn a move that is likely to make a marked improvement in HDFC Bank's capital adequacy ratio, the Union Cabinet on Wednesday approved a proposal for foreign direct investment (FDI) worth Rs 240 billion for the lender.</p>\n<p>\n\tThe Cabinet has also approved a law for safety of dams, and has okayed the setting up of a National Committee for the purpose. State level committees will also be set up to oversee laws on dam safety at the state level.\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\tBriefing reporters following a cabinet meeting, interim Finance Minister Piyush Goyal said with this additional FDI, foreign equity in HDFC Bank would continue to remain within the mandatory cap of 74 per cent.</p>\n<p>\n\t\"Even with this infusion, the foreign equity will remain capped below 74 per cent.. The current 72.62 per cent foreign equity holding is being raised to 74 per cent with this Rs 24,000 crore (Rs 240 billion) FDI,\" he said.</p>\n<p>\n\tGoyal also said the bank's capital adequacy ratio would be strengthened in this way, and it had also indicated its intent to expand both its physical branches network as well as its digital banking reach.</p>\n<p>\n\tOn the other hand, the profitability of state-run banks has been hit hard in recent times owing to the provisioning required to be made on account of their accumulated non-performing assets (NPAs), or bad loans.</p>\n<p>\n\tAnother key decision by the cabinet was the appointment of the Ministry of Home Affairs as ex officio chairperson of the North East Council.</p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "foreign",
        "capital",
        "mandatory",
        "Even",
        "additional",
        "74"
    ],
    "nouns": [
        "Bank",
        "capital",
        "cap",
        "mandatory",
        "cent",
        "nod",
        "Even",
        "equity",
        "adequacy",
        "boost",
        "Cabinet"
    ],
    "verbs": [
        "Bank",
        "cap",
        "remain",
        "nod",
        "Even",
        "continue",
        "boost"
    ]
}