{
    "title": "Gold prices hover near six-month low as dollar firms amid risk aversion",
    "link": "https://www.business-standard.com/article/markets/gold-prices-hover-near-six-month-low-as-dollar-firms-amid-risk-aversion-118062700116_1.html",
    "pubDate": "Wed, 27 Jun 2018 08:34:00 +0530",
    "content": "The dollar index was steady at 94.674 after gaining 0.4% overnight to snap a four-session losing run",
    "contentSnippet": "The dollar index was steady at 94.674 after gaining 0.4% overnight to snap a four-session losing run",
    "guid": "https://www.business-standard.com/article/markets/gold-prices-hover-near-six-month-low-as-dollar-firms-amid-risk-aversion-118062700116_1.html",
    "isoDate": "2018-06-27T03:04:00.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "gold",
            "prices",
            "hover",
            "near",
            "six-month",
            "low",
            "as",
            "dollar",
            "firms",
            "amid",
            "risk",
            "aversion"
        ],
        "words": [
            "risk",
            "gold"
        ],
        "positive": [
            "gold"
        ],
        "negative": [
            "risk"
        ]
    },
    "article": {
        "title": "Gold prices hover near six-month low as dollar firms amid risk aversion",
        "content": "<span class=\"p-content\">\n\t            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t    \t\t\t\t      <style>span.p-content div[id^=\"div-gpt\"]{line-height:0;font-size:0}</style>\n\t\t\t\t    \t\n<p>\n\t<a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gold\" target=\"_blank\">Gold </a>prices sat near a more than six-month high low hit in the previous session, as the dollar firmed amid easing risk aversion and expectations of further <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/interest-rate\" target=\"_blank\">interest rate </a>hikes by the US Federal Reserve.</p>\n<p>\n\t<strong>FUNDAMENTALS</strong>\n\n\n</p>\n<!-- INPAGE_BANNER -->\n<p>\n\t* Spot <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gold\" target=\"_blank\">gold </a><xau=> dipped 0.1 percent to $1,257.81 an ounce, as of 0045 GMT. It touched its lowest since mid-December at $1,254.16 in the prior session.</xau=></p>\n<p>\n\t* US <a class=\"storyTags\" href=\"https://www.business-standard.com/topic/gold\" target=\"_blank\">gold </a>futures for<gccv1> August delivery were nearly unchanged at $1,259.70 per ounce.</gccv1></p>\n<p>\n\t* The dollar index was steady at 94.674 after gaining 0.4 percent overnight to snap a four-session losing run.&nbsp;</p>\n<p>\n\t* The US House of Representatives overwhelmingly passed a bill on Tuesday to tighten foreign investment rules, spurred by bipartisan concerns about Chinese bids to acquire sophisticated US technology.</p>\n<p>\n\t* US President Donald Trump on Tuesday endorsed US Treasury Secretary Steven Mnuchin's measured approach to restricting Chinese investments in US technology companies, saying a strengthened merger security review committee could protect sensitive American technologies.</p>\n<p>\n\t* Trump said on Tuesday the government was completing a study about increasing import tariffs on cars from the European Union and suggested he would take action soon.</p>\n<p>\n\t* The recent imposition of import duties by the U.S. and counter-measures by other countries have come at a \"frustrating moment\" when policymakers should be working on longer term issues, the head of the International Monetary Fund said on Tuesday.</p>\n<p>\n\t* Dallas Fed Bank President Robert Kaplan said he believes the U.S. central bank's monetary policy is still accommodative and suggested the Fed could raise rates at least two more times before it stops being accommodative.</p>\n<p>\n\t* Intensifying trade tensions over the last week have raised the risks to the U.S. economy, Atlanta Fed bank president Raphael Bostic said, adding that he may rule out a fourth rate increase for the year if the developing trade war gets worse.</p>\n<p>\n\t* China's central bank issued draft guidelines on gold asset management products on Tuesday, in a bid to strengthen gold market supervision.</p>\n<p>\n\t* China's net gold imports via main conduit Hong Kong surged 50 percent in May from the previous month, data showed on Tuesday.</p>\n<p>\n\t* Holdings of SPDR Gold Trust <gld>, the world's largest gold-backed exchange-traded fund, said its holdings rose 0.54 percent to 824.63 tonnes on Tuesday.&nbsp;</gld></p>\n<p>\n\t* Russian gold and silver producer Polymetal <polyp.l> said on Tuesday it has launched its Kyzyl mine in Kazakhstan ahead of schedule and below budget.</polyp.l></p>\t\t\t\t\n\t\t\t\t    \t\t\t\t     \t            </span>"
    },
    "adjectives": [
        "low",
        "Gold",
        "near",
        "six",
        "steady",
        "94",
        "overnight",
        "four"
    ],
    "nouns": [
        "low",
        "index",
        "Gold",
        "six",
        "month",
        "dollar",
        "risk",
        "aversion",
        "steady",
        "four",
        "snap",
        "session",
        "run"
    ],
    "verbs": [
        "low",
        "index",
        "hover",
        "near",
        "risk",
        "steady",
        "snap",
        "run"
    ]
}