{
    "title": "US tells India, others to end oil imports from Iran by November 4",
    "link": "https://timesofindia.indiatimes.com/business/india-business/us-tells-india-others-to-end-oil-imports-from-iran-by-november-4/articleshow/64763748.cms",
    "pubDate": "Wed, 27 Jun 2018 10:54:42 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/us-tells-india-others-to-end-oil-imports-from-iran-by-november-4/articleshow/64763748.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64763748.cms\" /></a>",
    "contentSnippet": "",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/us-tells-india-others-to-end-oil-imports-from-iran-by-november-4/articleshow/64763748.cms",
    "isoDate": "2018-06-27T10:54:42.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "us",
            "tells",
            "india",
            "others",
            "to",
            "end",
            "oil",
            "imports",
            "from",
            "iran",
            "by",
            "november",
            "4"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "US tells India, others to end oil imports from Iran by November 4",
        "content": "<div class=\"Normal\"><p>WASHINGTON: The US has told India and other countries to cut oil imports from Iran to \"zero\" by November 4 or face sanctions, making it clear that there would be no waivers to anyone.\n\n</p><span>Iran is India's third-largest oil supplier behind Iraq and </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/saudi-arabia\">Saudi Arabia</a><span>. Iran supplied 18.4 million tonnes of </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/iran-india-gas-field-row\">crude oil</a><p> during April 2017 and January 2018 (first 10 months of 2017-18 fiscal).\n</p><span>Last month President </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Donald-Trump\">Donald Trump</a><p> withdrew the United States from the landmark Iran nuclear deal, re-imposing US sanctions that had been suspended in return for curbs on Tehran's nuclear programme.\n</p><p>At the time, the Trump administration gave foreign companies either 90 or 180 days to wind down their business with Iranian counterparts, depending on the type of commercial activity.\n</p><p>Now, Washington is stepping up pressure on all countries, including India and China, to completely stop buying oil from Iran.\n</p><p>\"On China and India, yes, certainly,\" a State Department official told reporters when asked if the US has told all countries, including India and China, to stop all their imports of Iranian oil by November 4.\n</p><p>The US official said Indian and Chinese companies would be subject to the same sanctions as those in other countries. Given the huge energy needs, India and China are major importers of Iranian oil.\n</p><p>\"Their (India and China) companies will be subject to the same sanctions that everybody else's are if they engage in those sectors of the economy that are sanctionable, where there were sanctions imposed prior to 2015.\n</p><p>\"We will certainly be requesting that their oil imports go to zero,\" the State Department official said on condition of anonymity.\n</p><p>\"We view this as one of our top national-security priorities,\" the official said.\n</p><p>Responding to questions, the official said all countries should start reducing the import of oil from Iran now and bring it to zero by November 4.\n</p><p>The official said this is part of the Trump administration's effort to isolate streams of Iranian funding and are looking to highlight the totality of Iran's \"malign behaviour\" across the region.\n</p><p>\"We remain engaged with the EU-3 throughout this process, and we are going to continue to branch out in new countries and reach new partners as the weeks go forward,\" the official said.\n</p><p>The EU three refers France, Germany, and the United Kingdom.\n</p><span>Iran's oil import could emerge as a major topic of discussion between India and the US during the first 2+2 dialogue next week. External Affairs Minister </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Sushma-Swaraj\">Sushma Swaraj</a><span> and Defence Minister Nirmala Sitharaman would be in the US next week for talks with their American counterparts Secretary of State </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Mike-Pompeo\">Mike Pompeo</a><span> and Defence Secretary </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/james-mattis\">James Mattis</a><p>.\n</p><p>The State Department asserted that there would be no waivers under the new sanctions regime.\n</p><p>\"I would be hesitant to say 'zero waivers ever'. I think the predisposition would be, 'No, we're not granting waivers',\" the official said. Noting that America's allies are aware of its concern, the official claimed these countries want to work with the US.\n</p><p>\"I don't want to get into the substance of each discussion I've had, but, for a vast majority of countries, they are willing to adhere and support our approach to this because they also view it as a threat. And it's gotten worse since 2015, not better, on their regional activity side,\" the official said.\n</p><span>In a recent report, the bipartisan Congressional Research Service (CRS) said as international sanctions on Iran increased in 2010-2013, India sought to preserve its longstanding ties with Iran while cooperating with the sanctions regime.\n</span><br><span>\n</span><br><span>In 2010, the Reserve Bank of India ceased using a Tehran-based regional body, the Asian Clearing Union, to handle transactions with Iran. In January 2012, Iran agreed to accept India's local currency, the rupee, to settle nearly half of its sales to India.\n</span><br><span>\n</span><br><span>\"During 2011-2015, India reduced its purchases of Iranian oil - at some cost to its own development - in order to receive from the US administration exemptions from sanctions.\n</span><br><span>\n</span><br><span>\"India has increased oil purchases from Iran to nearly pre-2012 levels after sanctions were lifted, and in May 2016 India agreed to transfer to Iran about USD 6.5 billion that it owed for Iranian oil shipments but which was held up for payment due to sanctions,\" the report said.\n</span><br><span>\n</span><p>\"India's position has generally been that it will only enforce sanctions authorised by UN Security Council resolutions, rendering it likely that India will resist US efforts to compel it to comply with reimposed US sanctions such as those that mandate cuts in oil purchases from Iran,\" said the CRS report.\n</p><span>\n</span></div>"
    },
    "adjectives": [
        "10",
        "left",
        "top",
        "right"
    ],
    "nouns": [
        "India",
        "india",
        "US",
        "us",
        "end",
        "oil",
        "Iran",
        "iran",
        "November",
        "november",
        "business",
        "border",
        "10",
        "left",
        "style",
        "margin",
        "top",
        "right",
        "photo"
    ],
    "verbs": [
        "end",
        "oil",
        "border",
        "align",
        "style",
        "top",
        "right"
    ]
}