{
    "title": "'Systemic lapses' found in inter-corporate borrowings: Fortis Healthcare",
    "link": "https://timesofindia.indiatimes.com/business/india-business/systemic-lapses-found-in-inter-corporate-borrowings-fortis-healthcare/articleshow/64759139.cms",
    "pubDate": "Wed, 27 Jun 2018 05:52:27 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/systemic-lapses-found-in-inter-corporate-borrowings-fortis-healthcare/articleshow/64759139.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64759139.cms\" /></a>The company, which had initiated an independent investigation through an external legal firm in February this year, also said it has made provisions totalling around Rs 580 crore in the fourth quarter of FY18 pertaining to the ICDs and other loans, among others, but the \"recoverability is doubtful\".",
    "contentSnippet": "The company, which had initiated an independent investigation through an external legal firm in February this year, also said it has made provisions totalling around Rs 580 crore in the fourth quarter of FY18 pertaining to the ICDs and other loans, among others, but the \"recoverability is doubtful\".",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/systemic-lapses-found-in-inter-corporate-borrowings-fortis-healthcare/articleshow/64759139.cms",
    "isoDate": "2018-06-27T05:52:27.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "'systemic",
            "lapses'",
            "found",
            "in",
            "inter-corporate",
            "borrowings",
            "fortis",
            "healthcare"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "'Systemic lapses' found in inter-corporate borrowings: Fortis Healthcare",
        "content": "<div class=\"Normal\"><span>NEW DELHI: </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Fortis-Healthcare\">Fortis Healthcare</a><p> on Wednesday said \"systemic lapses\" were found in certain inter-corporate deposits (ICDs) given by its arm Fortis Hospitals Ltd that were used by borrowers for granting or repaying loans to certain additional entities whose directors are connected to its erstwhile promoters, the Singh brothers. \n\n</p><p>The company, which had initiated an independent investigation through an external legal firm in February this year, also said it has made provisions totalling around Rs 580 crore in the fourth quarter of FY18 pertaining to the ICDs and other loans, among others, but the \"recoverability is doubtful\". \n</p><p>The findings of the investigations have been submitted to the Securities and Exchange Board of India (Sebi) and Serious Fraud Investigation Office (SFIO). The company has initiated legal action for recovery of these outstanding ICDs and other advances, Fortis Healthcare said in a statement. \n</p><p> The board of directors of the company discussed the investigation report during their two-day meeting, which ended early this morning. \n</p><p>The development comes at a time when the cash-strapped healthcare chain is in the process of finding a new investor, for which four parties -- Manipal-TPG, Munjals-Burmans combine, IHH Healthcare and KKR-backed Radiant Life Care -- are in the fray. \n</p><p> In February this year, Fortis Healthcare had stated that its wholly-owned arm Fortis Hospitals had deployed funds to the tune of Rs 473 crore as secured short-term investments to group firms of its promoters, billionaires Malvinder Singh and Shivinder Singh. \n</p><p>\"In respect of ICDs granted, the investigation report revealed that there were certain systemic lapses and override of controls including shortcomings in executing documents and creating a security charge while the company/FHsL (Fortis Hospitals Ltd) was under financial stress. The charge was later on created in February 2018,\" it said. \n</p><p> On the basis of documents, e-mails reviewed and interviews conducted, the company further said it was \"revealed that the ICDs were not given under the normal treasury operations of the company/FHsL, including under the treasury policy and the mandate of the treasury committee; and were not specifically authorised by the Board of FHsL.\" \n</p><p>While report did not conclude on utilisation of funds by the borrower companies, there are findings to suggest that ICDs were \"utilised by the borrower companies for granting/ repayment of loans to certain additional entities, including those whose current and/or past promoters/directors are known to/connected with the promoters of the company\", it added. \n</p><p> There was no direct relationship between borrower companies and Fortis Healthcare or its subsidiaries during December 2011 to December 14, 2017, but the report noted that the \"promoters were evaluating certain transactions concerning certain assets owned by them for the settlement of ICDs, thereby indirectly implying some sort of affiliation with the borrower companies\". \n</p><p> \"Given the substance, the investigation report has observed that the borrower companies could possibly qualify as related parties of the Company and/or FHsL,\" it said. \n</p><p>The investigation also found that objections on record indicated that \"management personnel and other persons involved were forced into undertaking the ICD transactions under the repeated assurance of due repayment and it could not be said that the management was in collusion with the promoters to give ICDs to the borrower companies\". \n</p><p> \"Relevant documents/information and interviews also indicate that the management's objections were overruled. However, the former Executive Chairman of the Company (Malvinder Singh), in his written responses, has denied any wrongdoing, including override of controls in connection with grant of the ICDs,\" the company said. \n</p><p>The investigation also found a roll-over mechanism was devised from the first quarter of financial year 2016-17, whereby \"it has been observed that ICDs were repaid by cheque by the borrower companies at the end of each quarter and fresh ICDs were released at the start of succeeding quarter under separately executed ICD agreements\". \n</p><span>\n</span><br><span> In respect of the roll-overs of ICDs placed on July 1, 2017 with the borrower companies, FHsL utilised the funds received from the company for the purposes of effecting roll-over, it said, adding \"all ICDs from December 2011 were repaid until March 31, 2016\". \n</span><br><span>\n</span><br><span> Fortis Healthcare said after considering all necessary facts and taken into account legal advice, it has decided to treat as 'non est' the Letter of Appointment dated September 27, 2016, as amended LoA issued to the erstwhile Executive Chairman Malvinder Singh in relation to his role as 'Lead: Strategic Initiatives' in the Strategy Function. \n</span><br><span>\n</span><br><span>\"The company is in the process of taking suitable legal measures to recover the payments made to him under the LoA as also to recover all company assets in his possession,\" it said. \n</span><br><span>\n</span><br><span>Commenting on the findings of the investigation, Fortis Healthcare Chairman Ravi Rajagopal said, \"As a result of the Investigation Report issued by Luthra &amp; Luthra, the company will appoint an external agency of repute to establish the highest level of governance and internal controls. \n</span><br><span> \"In addition, our key priority is to ensure that the current bidding process is fair and transparent and maximises value for shareholders.\"\n</span></div>"
    },
    "adjectives": [
        "independent",
        "10",
        "left",
        "top",
        "right",
        "Systemic",
        "systemic",
        "found",
        "fourth",
        "corporate",
        "external",
        "legal",
        "firm",
        "made",
        "doubtful"
    ],
    "nouns": [
        "margin",
        "independent",
        "india",
        "company",
        "business",
        "border",
        "10",
        "left",
        "style",
        "top",
        "right",
        "photo",
        "found",
        "fourth",
        "Healthcare",
        "healthcare",
        "investigation",
        "external",
        "firm",
        "February",
        "year",
        "provisions",
        "crore",
        "quarter"
    ],
    "verbs": [
        "company",
        "border",
        "align",
        "style",
        "top",
        "right",
        "found",
        "inter",
        "firm",
        "quarter"
    ]
}