{
    "title": "What might call for fewer GST slabs",
    "link": "https://timesofindia.indiatimes.com/business/india-business/stable-revenue-must-for-fewer-gst-slabs/articleshow/64755739.cms",
    "pubDate": "Wed, 27 Jun 2018 00:06:50 GMT",
    "content": "<a href=\"https://timesofindia.indiatimes.com/business/india-business/stable-revenue-must-for-fewer-gst-slabs/articleshow/64755739.cms\"><img border=\"0\" hspace=\"10\" align=\"left\" style=\"margin-top:3px;margin-right:5px;\" src=\"https://timesofindia.indiatimes.com/photo/64755739.cms\" /></a>Finance secretary Hasmukh Adhia is seen as a key driver of the rollout of GST. He spoke to TOI about the experience so far and the plan ahead. Excerpts:",
    "contentSnippet": "Finance secretary Hasmukh Adhia is seen as a key driver of the rollout of GST. He spoke to TOI about the experience so far and the plan ahead. Excerpts:",
    "guid": "https://timesofindia.indiatimes.com/business/india-business/stable-revenue-must-for-fewer-gst-slabs/articleshow/64755739.cms",
    "isoDate": "2018-06-27T00:06:50.000Z",
    "sentiment": {
        "score": 0,
        "comparative": 0,
        "tokens": [
            "what",
            "might",
            "call",
            "for",
            "fewer",
            "gst",
            "slabs"
        ],
        "words": [],
        "positive": [],
        "negative": []
    },
    "article": {
        "title": "‘Stable revenue must for fewer GST slabs’",
        "content": "<div class=\"Normal\"><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Finance\">Finance</a><span> secretary </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/Hasmukh-Adhia\">Hasmukh Adhia</a><span> is seen as a key driver of the rollout of </span><a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/business/gst\">GST</a><p>. He spoke to TOI about the experience so far and the plan ahead. Excerpts:\n\n</p><span>\n</span><strong>It’s been a year since GST was rolled out. How do you look at the last 12 months and are you satisfied with the outcome in terms of the revenue collection and checking leakages?<br></strong><p>This was a period full of activity and there has been an unprecedented amount of work that has been put in by the entire bureaucracy in implementing GST. If you look at the formalisation of the economy, having 45-50 lakh new taxpayers is a big achievement. In terms of tax collection, the chief economic adviser has estimated that on the whole, there has been 13% growth in the revenue base, which is quite satisfactory. We expect the base to grow further in the coming years and we can look forward to much higher buoyancy. Once new tax returns are in place, it will be very difficult to under-report turnover because we will be able to check the turnover from the purchase side. So, it will help deepen the base. Nearly 80-85% of the tax liability is discharged through input tax credit, only the remaining part is paid in cash. If we have a way to take a close look at these claims, then even a 5% reduction in tax credits will result in a significant increase in the cash collections.\n</p><span>\n</span><strong>Have non-matching of returns, suspension of reverse charge mechanism and later-than-planned rollout of e-way bills depressed collections?<br></strong><p>Not the first two, but e-way bills could have come earlier. E-way bills have stabilised now and going forward it will help increase buoyancy.\n</p><span>\n</span><strong>How do you plan to match information available through the GST Network with income tax returns, because that will help you widen and deepen the overall tax base?<br></strong><p>Unlike earlier, when VAT registration number was not linked to PAN, now GST numbers are linked to PAN, making it easy for authorities to check the turnover and with the income that is reported in the I-T return.\n</p><span>\n</span><strong>Last year, when GST was being introduced, there were statements from the government that over a period of time standard rates of 12% and 18% may converge into one. How far are we from that situation?<br></strong><p>Over a period of time, depending on the revenue collections and gains, we should work on the system and try to have fewer rates. But we need to wait for revenue to stabilise.\n</p><span>\n</span><strong>A major criticism is that GST was rolled out when the system was not ready in terms of the IT system and the forms...<br></strong><p>We were prepared. It is a different thing that we found that forms which were designed — GSTR 1, 2 and 3 — were difficult to cope with. So, we had to take some shortterm measures to ensure that tax flows are not affected, while ensuring that people are not harassed. Once we found that there is genuine difficulty, we changed it. There is nothing wrong in doing mid-course correction when you find that there is something wrong.\n</p><span>\n</span><strong>There is a lot of discussion around including <a class=\"key_underline\" href=\"https://timesofindia.indiatimes.com/topic/petroleum\">petroleum</a> products and real estate under GST. Is it the right time to do it?<br></strong><p>The central government wanted them (oil products) under GST from Day 1, but states were not comfortable. So, a via media was found under which they were part of the constitutional amendment but the date of implementation was left for the GST Council. Now it is for the Council to discuss and decide.\n</p><p>Over 90% of GST refunds cleared, says fin secretary\n</p><span>\n</span><strong>Given the oil price rise in recent weeks, there are suggestions that it should be brought under GST now…<br></strong><p>There is no connection. If you want to reduce the level of taxation, under GST or otherwise, revenue has to be sacrificed.\n</p><span>\n</span><br><span>\n</span><strong>What about real estate?<br></strong><span>\n</span><br><span>The issue is before the Council. It needs a detailed discussion and we need time for that.\n</span><br><span>\n</span><br><span>\n</span><strong>People are still experiencing this problem of kuchchapucca bills because shopkeepers are still prodding you to pay cash...<br></strong><span>\n</span><br><span>The earlier rates were much higher than the GST rates. Through e-way bills we will be able to trace them. If at one stage of movement, the transaction is caught, tax will be collected. It may happen that at the retail level the value addition is not captured, and the retailer will not get credit to avoid showing it in his income. It will be difficult for people to do mass-scale kuchcha-pucca business.\n</span><br><span>\n</span><br><span>\n</span><strong>Refunds are cited as a problem...<br></strong><span>\n</span><p>We have received refund applications for Rs 41,000 crore, of which Rs 38,000 crore have been sanctioned. So, more than 90% have been cleared.\n</p><span>\n</span></div>"
    },
    "adjectives": [
        "top",
        "stable",
        "far",
        "10",
        "left",
        "right",
        "key",
        "fewer",
        "ahead"
    ],
    "verbs": [
        "top",
        "stable",
        "border",
        "align",
        "style",
        "right",
        "Finance",
        "key",
        "call",
        "experience",
        "plan"
    ],
    "nouns": [
        "india",
        "margin",
        "top",
        "stable",
        "far",
        "secretary",
        "photo",
        "spoke",
        "driver",
        "border",
        "10",
        "left",
        "style",
        "right",
        "business",
        "Finance",
        "He",
        "so",
        "revenue",
        "key",
        "call",
        "experience",
        "plan"
    ]
}